{"raw_text": "Chelsea hold Arsenal\n \n A gripping game between Arsenal and Chelsea ended with the honours finishing even at Highbury.\n \n Thierry Henry produced a sublime strike to put Arsenal ahead but John Terry levelled with a powerful header. Henry's quickly-taken free-kick put Arsenal back in front but Eidur Gudjohnsen equalised with a header from William Gallas' knockback. Henry missed a golden chance when he blazed a shot high late on and Arsenal also had a penalty appeal rejected. Henry's opener had given Arsenal the perfect start and set up an enthralling affair. The French striker headed a long Cesc Faregas ball back to Jose Antonio Reyes from the edge of the Chelsea area and immediately saw it headed back into his path from the Spaniard. And, with his back to goal, Henry finished with aplomb when he took one touch, turned and struck an angled strike past the despairing dive of keeper Petr Cech. Henry epitomised a determination about the Arsenal side but Chelsea appeared unruffled and equalised after 16 minutes.\n \n Gunners keeper Manuel Almunia, who got the nod ahead of Jens Lehmann, did well to save a well-struck Frank Lampard shot. But he could not keep out Terry's powered header from the resultant corner as Arsenal's weakness at set-pieces was again exposed. Almost immediately, Henry went close and Chelsea gathered the loose ball before going straight up the other end where Gudjohnsen fluffed an effort. Gudjohnsen did not make the same error minutes later when he struck a sweet shot only for Almunia to be equal to the task and save. The homes side regained the lead in controversial fashion when Robert Pires won a dubious free-kick. And, given the option to take the 25-yard set-piece quickly, Henry curled in a shot with Cech still organising his wall.\n \n This time Arsenal did not allow Chelsea to level so soon as they went into the break ahead. Chelsea brought striker Didier Drogba on to partner Gudjohnsen up front after the interval and the move reaped immediate reward. Lampard swung in a cross which Gallas knocked back across goal and a deft header from Gudjohnsen levelled matters again. Chelsea's main threat was coming from crosses and Lampard missed a great opportunity as he headed wide when left unmarked at the far post. The second half failed to live up to the thrilling pace of the opening period but there were flashes of brilliance. One of them came from the enigmatic Robben when he jinked his way through two Arsenal defenders only to see his poked shot saved by Almunia.\n \n Arsenal ended the match the stronger and worked a excellent chance for Henry who put a left-foot shot high from eight yards. Subtitute Robin van Persie could also have nicked a win for the Highbury outfit but frustratingly sidefooted just wide. Matthieu Flamini had a late penal appeal waved away before the final whistle which maintained Chelsea five-point Premiership lead over Arsenal.\n \n Almunia, Lauren, Toure, Campbell, Cole, Pires, Flamini, Fabregas, Reyes (Clichy 82), Bergkamp (Van Persie 82), Henry. Subs Not Used: Senderos, Hoyte, Lehmann.\n \n Cole.\n \n Henry 2, 29.\n \n Cech, Paulo Ferreira, Ricardo Carvalho (Drogba 45), Terry, Gallas, Duff, Tiago (Bridge 45), Makelele, Lampard, Robben, Gudjohnsen (Parker 77). Subs Not Used: Kezman, Cudicini.\n \n Robben, Drogba, Lampard.\n \n Terry 17, Gudjohnsen 46.\n \n 38,153\n \n G Poll (Hertfordshire).\n", "llama3.2:1b": "Arsenal and Chelsea played to a draw at Highbury.\n\nThierry Henry scored for Arsenal in the first half with a shot from a free kick. John Terry tied it up for Chelsea with a header shortly after.\n\nThe game was level again when Eidur Gudjohnsen scored for Chelsea with a powerful header. Thierry Henry missed a penalty, but didn't take any shots on goal during the match.\n\nChelsea equalized after 16 minutes through Robert Pires' free kick and Didier Drogba's shot. However, Arsenal went into the break ahead again due to Didier Drogba being brought on in the second half.\n\nThe game remained level for most of the second half, with flashes of brilliance from Robben for Arsenal and crosses from Chelsea that were saved by Almunia.\n\nIn the end, neither team could find the winner, as Arsenal ended the match with a chance to win but it was thwarted.", "llama3.2:3b": "Arsenal drew 2-2 with Chelsea at Highbury. Thierry Henry scored two goals for Arsenal before Eidur Gudjohnsen equalised for Chelsea. The match was highly entertaining but Chelsea's set-piece threat led to the equaliser. Despite a late chance from Robin van Persie, the match ended in a draw, maintaining Chelsea's five-point lead over Arsenal in the Premiership.", "gemma2:2b": "Arsenal and Chelsea played a draw at Highbury. Thierry Henry scored two goals for Arsenal but John Terry equalized for Chelsea.  Gudjohnsen scored two goals for Chelsea, including one after a controversial free-kick awarded to Arsenal. The game was close until the end, with both teams having chances. \n", "qwen2.5:0.5b": "Chelsea won the game against Arsenal with a score of 2-0. Thierry Henry scored in the first half while John Terry added another goal to tie the score at halftime. In the second half, Arsenal took control with a powerful strike by Eidur Gudjohnsen and two header after free-kicks from William Gallas. The French striker managed to score a golden chance when he headed a long Cesc Faregas ball back into his path from the Spaniard. Arsenal's penalty was also rejected, but they still had a 2-1 lead with Didier Drogba on the pitch at the end of the game.", "qwen2.5:1.5b": "Arsenal beat Chelsea 2-2 at Highbury in a thriller. Thierry Henry scored for Arsenal but John Terry equalized after halftime. Chelsea won the game through Eidur Gudjohnsen's header and Pierre-Emerick Aubameyang scoring on a penalty appeal.", "qwen2.5:3b": "Chelsea held Arsenal in a tightly contested match at Highbury. Thierry Henry opened the scoring for Arsenal with a sublime strike, but John Terry equalized for Chelsea with a powerful header. Henry then put Arsenal back ahead with another free-kick goal, but Eidur Gudjohnsen levelled again with a header from William Gallas' knockback. Despite Henry's chances and Arsenal's penalty appeal, the game concluded 2-2. Chelsea improved after halftime, with Didier Drogba scoring to equalize and Robben nearly finding an opening for Chelsea. The final whistle came despite a late penalty appeal by Arsenal. Notable players included Henry (Arsenal), Cech (Chelsea), and Robben and Drogba (both teams).", "opencoder:1.5b": "The text summarizes a game between Arsenal and Chelsea, where Arsenal scored a goal with aheader from John Terry. Henry was able to score more goals than the other team due to his unique play in this game. However, he failed to meet the expectations of the game by making an error and leaving the other team without a lead.\n\nArsenal's win over Chelsea was a spectacular result, which highlights the strength and endurance of both teams during a difficult and explosive match. It's also important to note that Arsenal ended with more goals than expected due to a missed penalty in the game.\n", "smollm:1.7b": "The summary should be concise and to the point, preserving key ideas and details while omitting unnecessary information. Here's a possible summary:\n\n\"Chelsea held Arsenal in the final minutes of the match after a thrilling opening period. The French striker produced a sublime strike to put Arsenal ahead but John Terry levelled with a powerful header from his own side. Henry's quickly-taken free-kick put Arsenal back in front but Eidur Gudjohnsen equalised with a header from William Gallas' knockback. Henry missed a golden chance when he blasted a shot high late on and Arsenal also had a penalty appeal rejected. Henry's opener gave Arsenal the perfect start and set up an enthralling affair. The French striker headed a long Cesc Faregas ball back to Jose Antonio Reyes from the edge of the Chelsea area and immediately saw it headed back into his path from the Spaniard. Henry missed a golden chance when he curled in a shot with Cech still organizing his wall after the interval. Chelsea brought striker Didier Drogba on to partner Gudjohnsen up front after the interval and the move reaped immediate reward. Arsenal ended the match the stronger and worked a excellent chance for Henry who put a left-foot shot high from eight yards. Subs Not Used: Senderos, Hoyte, Lehmann.\"", "deepseek-r1:1.5b": "<think>\nAlright, so I need to help summarize this football match between Arsenal and Chelsea. The user provided a pretty detailed game summary, but they want just the key ideas and details in a concise way.\n\nFirst, I'll start by reading through the entire text to grasp the main points. It's a high-scoring game with both teams struggling at set-pieces. The goal was even at Highbury, which is a good sign for Arsenal. Thierry Henry seems to have shown determination, especially in his opener and some key shots.\n\nLooking at the highlights, Henry had several crucial moments: scoring after a few chances, hitting headers from Gallas, and another strike that went wide because Cech was organizing his wall. Chelsea's keeper Manuel Almunia did save a couple of good saves, but they also made mistakes against Terry's header.\n\nIn the second half, although Arsenal didn't score as quickly, Chelsea managed some more creative shots. Henry had an excellent chance, and Robben looked to make it in the final minutes with some good moves, especially from his own penalty spot. However, Almunia saved a crucial shot from him.\n\nThe final tally was Arsenal 2-1 Chelsea, with Henry staying strong throughout, but Chelsea having an extra man advantage. I should focus on the key points: who scored first, Henry's performance, Chelsea's response, and the overall outcome.\n\nI'll make sure to include how both teams struggled, the even goal at Highbury, Henry's important moments, Chelsea's saving moves, and the final result. This should give a clear and concise summary that preserves the essential details.\n</think>\n\nArsenal 2-1 Chelsea  \nThe game between Arsenal and Chelsea ended with an even score at Highbury in favor of Arsenal. Thierry Henry showed determination in his opener and key shots, while Chelsea failed to exploit their weak set-piece attempts. Manchester United keeper Manuel Almunia saved several crucial saves, but the home side held firm, securing a strong 2-1 victory. Henry delivered a decisive chance for Arsenal, but Chelsea capitalized early with saves from Didier Drogba and Gudjohnsen. Robben scored in the final moments with his own penalty spot, while Al munia saved a crucial goal.", "tinyllama:1.1b": "Another exciting game between Arsenal and Chelsea was played at Highbury Stadium in London. The score ended evenly with the honour of winning to both teams. Thierry Henry produced a sublime strike to put Arsenal ahead, but John Terry levelled the match with a powerful header. Arsenal's opening threat came from crosses and Lampard missed a great opportunity as he headed wide during a set-piece. In the second half, Chelsea's main threat was coming from crosses. A few excellent opportunities were created for them to score but they ultimately failed to do so. The match ended in a draw after a goal from Henry and a goal from Terry equalised the score. Arsenal held onto their five-point advantage over Chelsea in the Premier League table.", "tinydolphin:1.1b": " The final result saw Chelsea winning 2-1 against Arsenal in an entertaining and dramatic match at Highbury, with John Terry scoring the decisive penalty for Chelsea. Arsenal dominated possession but struggled to create any real clear-cut opportunities. Eidur Gudjohnsen was once again a standout player for Chelsea with two fantastic goals and a stunning free-kick, while Cesc Faregues also had an excellent display. Arsenal failed to capitalise on their dominance but will be confident of making the most of their weaknesses in the second half.", "phi:2.7b": " Chelsea and Arsenal had a thrilling game at Highbury that ended in a 1-1 draw, with both teams showing great skills and determination. Thierry Henry scored for the visitors with a sublime strike but John Terry equalized with a powerful header from a free-kick. The French striker also missed a golden chance when he blasted a shot high late on. Jose Antonio Reyes then headed in a long Cesc Faregas ball to give Arsenal the perfect start, which was followed by a goal from Henry after taking one touch and striking it into the bottom corner of the net from the edge of the Chelsea area. However, Chelsea quickly leveled things when Frank Lampard scored a powerful header from a free-kick. Gunners keeper Manuel Almunia saved well for Arsenal but could not stop Chelsea from scoring again when Didier Drogba headed in a cross from Gudjohnsen after an error by Almunia. The home team regained the lead just before halftime when Robert Pires won a dubious free-kick and scored with a shot after taking the set-piece quickly. However, Arsenal could not hold onto their advantage for long as Chelsea brought Didier Drogba on to partner Gudjohnsen up front in the second half. The move paid off as Lampard swung in a cross that Gallas knocked back across goal and Gudjohnsen scored with a header. Despite their best efforts, both teams failed to find the decisive goal and Arsenal were left disappointed.\n", "orca-mini:3b": " Chelsea and Arsenal played to a 2-all draw in the English Premier League match at Highbury. The game started with both teams having opportunities to score but it was not until the second half when both teams had their chances to win. Thierry Henry scored a goal for Arsenal, and John Terry levelled with a header for Chelsea. However, Arsenal's penalty appeal was denied, and Chelsea held on to their five-point lead over Arsenal.", "hermes3:3b": "Arsenal and Chelsea game ends in a draw, with Thiery Henry scoring two goals but also missing a golden chance.", "stablelm-zephyr:3b": "Arsenal and Chelsea played an exciting match at Highbury, ending in a 2-2 draw. Thierry Henry scored a sublime strike to put Arsenal ahead, but John Terry equalized with a powerful header. Henry's quick free-kick restored Arsenal's lead, only for Eidur Gudjohnsen to level the score with another header. Although Arsenal had a penalty appeal rejected and missed a chance to win the game, they ended stronger and maintained their position in the Premier League standings against Chelsea.", "chatgpt-4o-latest": "Arsenal and Chelsea played to a thrilling 2-2 draw at Highbury. Thierry Henry opened the scoring with a brilliant strike, but John Terry equalized with a powerful header. Henry restored Arsenal's lead with a quickly-taken free-kick, but Eidur Gudjohnsen leveled again with a header from William Gallas' knockback. Arsenal had chances to win, with Henry missing a late opportunity and a penalty appeal being denied. Chelsea remained five points ahead of Arsenal in the Premiership standings.", "stablelm2:1.6b": "Chelsea narrowly beat Arsenal in a thrilling game at Highbury with goals from Thierry Henry and John Terry equalising after an early Arsenal lead. Despite Arsenal's strong performance, Chelsea came out on top due to some crucial saves by goalkeeper Manuel Almunia and equalising goal from Gudjohnsen. The match saw impressive performances from Robben and Drogba, but ultimately it was a frustrating evening for Arsenal as they missed several chances and were denied a winning penalty appeal.", "granite3.1-dense:2b": "In a highly enthraling Arsenal vs. Chelsea match at Highbury, Thierry Henry's early goal (2) for Arsenal set the tone. Chelsea equalized through John Terry and Eidur Gudjohnsen. Despite numerous chances and a penalty appeal, Arsenal struggled to maintain their lead, with goals from Didier Drogba late in the game keeping Chelsea ahead. Manuel Almunia made crucial saves for Arsenal, while Petr Cech was less tested but prevented Arsenal's Henry from scoring a potential hat-trick. The match ended 2-2, extending Chelsea's Premiership lead over Arsenal to five points.", "reference": "Thierry Henry produced a sublime strike to put Arsenal ahead but John Terry levelled with a powerful header.Henry epitomised a determination about the Arsenal side but Chelsea appeared unruffled and equalised after 16 minutes.Henry's quickly-taken free-kick put Arsenal back in front but Eidur Gudjohnsen equalised with a header from William Gallas' knockback.Henry missed a golden chance when he blazed a shot high late on and Arsenal also had a penalty appeal rejected.Arsenal ended the match the stronger and worked a excellent chance for Henry who put a left-foot shot high from eight yards.Henry 2, 29.Almunia, Lauren, Toure, Campbell, Cole, Pires, Flamini, Fabregas, Reyes (Clichy 82), Bergkamp (Van Persie 82), Henry.Almost immediately, Henry went close and Chelsea gathered the loose ball before going straight up the other end where Gudjohnsen fluffed an effort.Lampard swung in a cross which Gallas knocked back across goal and a deft header from Gudjohnsen levelled matters again.Cech, Paulo Ferreira, Ricardo Carvalho (Drogba 45), Terry, Gallas, Duff, Tiago (Bridge 45), Makelele, Lampard, Robben, Gudjohnsen (Parker 77).This time Arsenal did not allow Chelsea to level so soon as they went into the break ahead.A gripping game between Arsenal and Chelsea ended with the honours finishing even at Highbury.One of them came from the enigmatic Robben when he jinked his way through two Arsenal defenders only to see his poked shot saved by Almunia."}