{"raw_text": "Bates seals takeover\n \n Ken Bates has completed his takeover of Leeds United.\n \n The 73-year-old former Chelsea chairman sealed the deal at 0227 GMT on Friday, and has bought a 50% stake in the club. He said: \"I'm delighted to be stepping up to the mantel at such a fantastic club. I recognise Leeds as a great club that has fallen on hard times. \"We have a lot of hard work ahead to get the club back where it belongs in the Premiership, and with the help of our fans we will do everything we can.\" Bates bought his stake under the guise of a Geneva-based company known as The Forward Sports Fund. He revealed that part of his plan is to buy back Leeds' Elland Road stadium and Thorp Arch training ground in due course.\n \n \"It's going to be a tough jon and the first task is to stabilise the cash flow and sort out the remaining creditors,\" Bates added. \"But there is light at the end of a very long tunnel. For the past year it has been a matter of firefighting - now we can start running the club again.\" Outgoing Leeds chairman Gerald Krasner said: \"This deal ensures the medium to long term survival of the club and I believe Mr Bates' proposals are totally for the benefit of the club. \"We are content that under Mr Bates, Leeds United will continue to consolidate and move forward. \"When we took over Leeds United in March 2004, the club had a debt of £103m, since that date, my board has succeeded in reducing the debt to under £25m. \"We worked tirelessly to solve all of the problems at Leeds United. \"Eighty percent of the problems have already been overcome and we came to this agreement with Mr Bates to secure its ongoing success.\" Krasner revealed that his consortium has been asked to remain in the background at the club for an undisclosed period to help ensure a smooth hand-over. He will stay on in an unpaid capacity while Peter Lorimer will continue in his role as director and point of contact for the fans and Peter McCormick will serve as a consultant to the incoming board. The other outgoing directors have agreed to leave their loans of £4.5m in the company for the next four years. On Leeds' new-look board it is understood that Lorimer will be joined by former Chelsea finance director Yvonne Todd and Bates' lawyer Mark Taylor.\n \n Krasner refused to give any details of the finances involved in the takeover. He told BBC Five Live: \"I am not going into the figures. If Ken wants to give them up that is up to him. I can not tell you what the money will be used for. \"This dea l is not about money for the current board. In the last four months I never saw any cheques until this week from one person. I am not stretching figures, we don't discuss internal arrangements.\" Bates stepped down as Chelsea chairman in March last year following Roman Abramovich's £140m takeover at Stamford Bridge. In May, he made a proposal to invest £10m in Sheffield Wednesday, but this was rejected by the club. Sebastien Sainsbury had been close to a takeover of Leeds but withdrew his £25m offer last week.\n \n His efforts failed after he revealed it would take £40m to stage a takeover, and that the club will also lose £10m over the next six months. The club was on the brink of administration - and the deduction of 10 points by the Football League - before Bates' arrival but his investment has spared them that prospect.\n", "llama3.2:1b": "Ken Bates has completed his takeover of Leeds United, buying a 50% stake in the club. He acquired the stake through the Forward Sports Fund, a Geneva-based company. The deal includes plans to buy back Elland Road stadium and Thorp Arch training ground, as well as stabilizing cash flow. \n\nThe outgoing chairman Gerald Krasner has expressed confidence in Bates' proposals, stating that the medium-term survival of Leeds United is ensured. The current board will remain in place for an undisclosed period while Lorimer stays on in his role.\n\nKrasner refused to disclose financial details, instead focusing on the lack of recent activity and the club's previous efforts. He also stated that the deal does not involve money from Bates for the current board.", "llama3.2:3b": "Ken Bates completes takeover of Leeds United, buying a 50% stake in the club through Geneva-based company The Forward Sports Fund. He plans to stabilize cash flow, buy back Elland Road stadium and Thorp Arch training ground, and restore the club's success under his leadership. Outgoing chairman Gerald Krasner praises Bates' proposals as beneficial to the club, while refusing to disclose takeover figures.", "gemma2:2b": "Ken Bates has completed a takeover of Leeds United, acquiring a 50% stake in the club. He plans to buy back the stadium and training ground. Bates aims to stabilize the club's financial situation and return it to Premier League status with fan support. Outgoing chairman Gerald Krasner will remain involved for an unspecified period to ensure a smooth transition, including continuing unpaid as a consultant. \n", "qwen2.5:0.5b": "Ken Bates bought a 50% stake in Leeds United, sealing its takeover. He said he's delighted to be stepping up at such a great club and recognized Leeds as \"a great club that has fallen on hard times.\" He's working with his consortium, which will buy back the stadium and training ground for Leeds. The transfer of control is expected to occur later this month.", "qwen2.5:1.5b": "Former Chelsea chairman Ken Bates completes takeover of Leeds United, securing a 50% stake in the club through a Swiss company and plans to stabilize finances and improve Elland Road stadium. Former Leeds chairman Gerald Krasner welcomes deal's medium-term survival benefits for the club but details on financials are not disclosed.", "qwen2.5:3b": "Ken Bates completed his takeover of Leeds United, securing a 50% stake under the guise of a Geneva-based company. He aims to stabilize cash flow, clear remaining creditors, and eventually buy back Elland Road stadium and Thorp Arch training ground. Former chairman Gerald Krasner praised Bates' plan for club survival, though he will remain in an unpaid capacity. Bates took over Chelsea's chairman role in 2015 after Abramovich bought the team. Initially interested in investing in Sheffield Wednesday but declined due to financial concerns, Bates' investment averted administration and points deduction at Leeds United.", "opencoder:1.5b": "The summary of the text can be as follows: \n\nKen Bates, a former Chelsea chairman who has taken over Leeds United, has bought back the club's Elland Road stadium and Thorp Arch training ground to stabilise their cash flow and sort out the remaining creditors. He has also agreed on a loan agreement with Krasner's team for an undisclosed period while Peter Lorimer and Peter McCormick will serve as point of contact for the fans. The other outgoing directors have agreed to leave their loans.\n", "smollm:1.7b": "The summary is concise and to the point, preserving key ideas and details while omitting unnecessary information. It provides a brief overview of the takeover deal, highlighting key aspects such as Bates' role, the purchase price, and the terms of the agreement. The text also mentions the sale of the Elland Road stadium and Thorp Arch training ground, but does not provide any further details about these transactions.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Ken Bates' takeover of Leeds United. Let me read through it carefully.\n\nSo, Ken Bates is taking over from Chelsea in October. He’s been around for a while and had a successful career there. The deal was announced at 0227 GMT on Friday, where he bought a 50% stake. I should note that the deal involved a Geneva-based company called The Forward Sports Fund.\n\nBates talked about how the club is doing tough times but has plans to stabilize cash flow and address remaining creditors. He plans to buy back stadium and training ground, which are big investments. He also mentions that for the past year it was all about firefighting, now they’re starting again with new hope.\n\nLeeds’ outgoing chairman, Gerald Krasner, said the deal is good for long-term survival and that Mr. Bates' proposals are for the benefit of the club. They’ve been working to solve problems, like debt going from £103m to under £25m, so they’re on the right path.\n\nKrasner also revealed financial details were kept secret, avoiding any mention of money figures. He’s staying with the club until some period passes and wants Peter Lorimer to continue in a unpaid role while others leave loans. Lorimer is joining, along with Yvonne Todd and Mark Taylor from Bates’ team.\n\nBates stepped down as Chelsea chairman last year after buying Roman Abramovich. His plan included investing in Sheffield Wednesday but that was rejected. Some internal info was kept secret until this week.\n\nThe deal wasn’t about big money; they saved the football league by cutting losses. The text is quite detailed, so I need to capture all key points without adding anything else.\n\nI think I've covered everything: the timing, who bought what, what he bought, the context of the club’s struggles, his plans, financial side not being disclosed, and the transition from Chelsea.\n</think>\n\nKen Bates has successfully taken over Leeds United as a 50% stake owner. He announced the deal at 0227 GMT on Friday, investing in The Forward Sports Fund for strategic purposes. His plan includes acquiring Elland Road stadium and Thorp Arch training ground. Barks stated that the club is struggling but aims to stabilize cash flow and address remaining creditors. This move aims to secure Leeds' ongoing success.\n\nLeeds’ outgoing chairman, Gerald Krasner, praised Mr. Bates' proposal for the club's long-term survival. He emphasized that while the deal involved financial details kept secret, they were focused on ensuring the club's future stability. Krasner is expected to remain in the club until a specified period passes and Peter Lorimer will continue in unpaid role, with others taking loans.\n\nBarks stepped down as Chelsea chairman last year after buying Roman Abramovich. His proposal for investing £10m in Sheffield Wednesday was rejected by the club. Internal info regarding financial details was kept secret before this week.\n\nThe deal didn’t involve significant money; Leeds saved 10 points due to reduced borrowing and avoided losing potential in the Football League. Barks has joined Leeds’ new-look board, with Lorimer joining instead of Peter Abramovich, while Yvonne Todd and Mark Taylor from The Forward Sports Fund are added to the incoming board.", "tinyllama:1.1b": "In a surprising move, Bates Seaels took over Leeands United, making an initial bid of £4.5 million for the struggling soccer club in March. The deal was completed on Friday, after Batess proposed to take control of the club and stabilize it financially. The consortium consisting of Krasners, Yvonne Todd as a new board member and Mark Taulot, the lawyer for Leeands United, have agreed to leave their loans with £4.5 million in four years. As part of his plan, Batess will serve as an unpaid director and point of contact for fans while Peter Lorimer will continue in his role as a director and Yvonne Todd will be joined by former Chelsea financer Mark Taulot on the new-look board. The club has been on the brink of administration, but Batess' investment saved it from losing 10 points.", "tinydolphin:1.1b": " Bates, the new owner of Leeds United, completed a £25m takeover at 2:27 GMT on Friday. His offer to buy a stake in the club included plans for a full restoration of the club's finances and the acquisition back of the iconic Elland Road stadium and Thorp Arch training ground. Bates has made his takeover proposal under a Swiss company known as The Forward Sports Fund, which he purchased for £20m in August 2018. He also revealed that part of his plan is to buy back Leeds' remaining creditor, Elland Road. This move would mark a significant step forward for the club and its fans.", "phi:2.7b": " Ken Bates has completed the takeover of Leeds United, with a 50% stake in the club. He plans to buy back their stadium and training ground in due course, while also stabilising the club's finances and moving it forward under his leadership. His consortium is asked to remain in the background for an undisclosed period to help ensure a smooth hand-over.\n", "orca-mini:3b": " Ken Bates has completed his takeover of Leeds United. He bought a 50% stake in the club, with his Swiss-based company known as The Forward Sports Fund. Bates said he was \"delighted\" to be taking over the club, which has fallen on hard times. He revealed that he plans to buy back Leeds' Elland Road stadium and Thorp Arch training ground and stabilize the club's cash flow. The outgoing chairman Gerald Krasner said Bates' proposals are for the benefit of the club and that his consortium asked to remain in the background for an undisclosed period to help ensure a smooth hand-over. Bates stepped down as Chelsea chairman in March 2018 following Roman Abramovich's £140m takeover at Stamford Bridge.", "hermes3:3b": "Ken Bates takes over Leeds United football club, completing a takeover and buying a 50% stake.", "stablelm-zephyr:3b": "Ken Bates completes takeover of Leeds United, purchasing a 50% stake in the club through a Geneva-based company, The Forward Sports Fund. Bates plans to stabilize cash flow and address remaining creditors while also buying back the Elland Road stadium and Thorp Arch training ground. Outgoing chairman Gerald Krasner believes the deal ensures long-term survival for the club and praises the work done in reducing debt over the past decade. New additions to Leeds' board include Peter Lorimer, Yvonne Todd, and Mark Taylor. Sebastien Sainsbury's £25m takeover bid was unsuccessful due to cost considerations, but Bates' investment saves the club from administration and potential 10-point deduction by the Football League.", "chatgpt-4o-latest": "Ken Bates has completed a takeover of Leeds United, acquiring a 50% stake through The Forward Sports Fund. He aims to stabilize the club's finances, buy back Elland Road and Thorp Arch, and return Leeds to the Premiership. Outgoing chairman Gerald Krasner stated the deal ensures the club's survival, with his consortium remaining temporarily to assist the transition. Bates' new board includes former Chelsea finance director Yvonne Todd and lawyer Mark Taylor. The club was close to administration before Bates' investment, which prevented a 10-point deduction. Previous takeover attempts, including Sebastien Sainsbury's, failed due to financial challenges.", "stablelm2:1.6b": "Ken Bates successfully took control of Leeds United, acquiring a 10% stake in the club under a Geneva-based company named The Forward Sports Fund. Part of his plan includes purchasing back the Elland Road stadium and Thorp Arch training ground. Outgoing chairman Gerald Krasner is content with the deal, believing Mr. Bates' proposals will ensure long-term success for Leeds United. Krasner's consortium has been asked to remain in the background during a smooth hand-over period. The new-look board includes outgoing directors Lorimer, McCormick, and Todd, as well as former Chelsea finance director Yvonne Todd and Bates' lawyer Mark Taylor. Outspoken comments about finances were made by Krasner.", "granite3.1-dense:2b": "Ken Bates, a 73-year-old former Chelsea chairman, completed his takeover of Leeds United on Friday at 02:27 GMT, acquiring a 50% stake in the club under the guise of The Forward Sports Fund. Bates expressed his commitment to revitalizing the club, which has faced financial struggles and fallen on hard times, with the aim of returning it to Premiership status. He plans to buy back Leeds' Elland Road stadium and Thorp Arch training ground in the future.\n\nLeeds' outgoing chairman, Gerald Krasner, stated that Bates' proposals are beneficial for the club's long-term survival and progress, acknowledging that his consortium reduced the club's debt from £103m to under £25m since taking over in March 2004. The outgoing directors will stay on unpaid as Lorimer, Peter McCormick, and other members continue their support roles.\n\nBates' new board includes Lorimer, former Chelsea finance director Yvonne Todd, and his lawyer Mark Taylor. Bates stepped down from his position at Chelsea in March 2022 following Roman Abramovich's takeover. Before this deal, Sheffield Wednesday rejected a £25m offer from Sebastien Sainsbury for a takeover due to the required £40m investment and potential £10m losses over six months, putting the club at risk of administration. Bates' arrival has prevented this outcome for Leeds United.", "reference": "Ken Bates has completed his takeover of Leeds United.Outgoing Leeds chairman Gerald Krasner said: \"This deal ensures the medium to long term survival of the club and I believe Mr Bates' proposals are totally for the benefit of the club.I recognise Leeds as a great club that has fallen on hard times.\"When we took over Leeds United in March 2004, the club had a debt of £103m, since that date, my board has succeeded in reducing the debt to under £25m.\"We are content that under Mr Bates, Leeds United will continue to consolidate and move forward.On Leeds' new-look board it is understood that Lorimer will be joined by former Chelsea finance director Yvonne Todd and Bates' lawyer Mark Taylor.The club was on the brink of administration - and the deduction of 10 points by the Football League - before Bates' arrival but his investment has spared them that prospect.The 73-year-old former Chelsea chairman sealed the deal at 0227 GMT on Friday, and has bought a 50% stake in the club.For the past year it has been a matter of firefighting - now we can start running the club again.\"Bates stepped down as Chelsea chairman in March last year following Roman Abramovich's £140m takeover at Stamford Bridge.Krasner revealed that his consortium has been asked to remain in the background at the club for an undisclosed period to help ensure a smooth hand-over.Sebastien Sainsbury had been close to a takeover of Leeds but withdrew his £25m offer last week.His efforts failed after he revealed it would take £40m to stage a takeover, and that the club will also lose £10m over the next six months."}