{"raw_text": "Old Firm pair handed suspensions\n \n Celtic's Henri Camara and Nacho Novo of Rangers have both been suspended for offences missed by the referee in a recent Old Firm game.\n \n Both were given automatic one-match bans and 12 additional disciplinary points for their actions. That means Novo will miss a further two games because of his prior record. Camara will miss one additional game. Novo was found guilty of stamping on Celtic's Stephen Pearson. Camara was punished for kicking Gregory Vignal. \"I'm extremely disappointed. I don't know if there's a lot to add to that,\" said Rangers manager Alex McLeish of Novo's punishment. \"But what I will say is that I'm at a loss as to why that incident should be picked up and highlighted when there were so many other incidents during the game.\" Both players will miss this weekend's games when Celtic host Dundee United and Rangers visit Kilmarnock unless they decide to appeal.\n \n The additional bans come into effect from 28 December meaning Camara will also be unavailable for the home game against Livingston while Novo will miss the meetings with Dundee United and Dunfermline. An SFA spokesman said: \"They have seven days to appeal but with matches coming along at the weekend they would need to do so before Friday. \"But if they do appeal it won't be heard before this weekend because it takes a bit of time to seat up an appeals tribunal.\" Meanwhile, Bob Malcolm and Rangers have been informed by letter as to the outcome of the hearing regarding his reaction to Rangers being awarded a penalty in the same game. Malcolm, a substitute on the day, was taken from the Rangers dug-out and spoken to by police about an alleged gesture he made. But the SFA would not detail what, if any, punishment Malcolm would receive. \"Once Rangers receive our letter we will be in a position to make a comment on the findings,\" added the spokesman.\n", "llama3.2:1b": "Henri Camara and Nacho Novo of Rangers have been handed suspensions for missed penalties by the referee. Both players were given automatic one-match bans, with additional disciplinary points due to prior infractions. They will miss games against Dundee United and Kilmarnock unless they appeal. The additional bans take effect from 28 December, with Camara missing his home game against Livingston as well. Rangers have received a letter informing them of the outcome of an SFA hearing regarding their reaction to being awarded a penalty in the same match, but no details are available at this time.", "llama3.2:3b": "Celtic's Henri Camara and Rangers' Nacho Novo have been suspended for a game each for stamping and kicking players respectively during an Old Firm match, with additional 12-point disciplinary points for their prior records. The suspensions take effect from December 28, but both players may appeal within seven days, which would prevent them playing against Dundee United this weekend if they decide to do so.", "gemma2:2b": "Henri Camara and Nacho Novo were given automatic one-match bans and 12 disciplinary points each for actions during the Old Firm match. Novo's ban includes two additional games due to his prior record, while Camara will miss one additional game.  Both players have seven days to appeal the decision. Bob Malcolm, a Rangers substitute, has also been investigated regarding his reaction to a penalty awarded during the same game. \n", "qwen2.5:0.5b": "Celtic midfielder Henri Camara and Rangers striker Nacho Novo of their respective clubs have been suspended for offences that were missed by referee officials. Both players received automatic one-match bans, 12 additional disciplinary points, and further penalty-time penalties for their actions in the recent Old Firm game at Celtic Park. Novo was found guilty of stamping on Pearson while Camara was punished for kicking Vignal during their previous game against Rangers. The Additional Suspensions will come into effect from December 28th and Novo will miss Kilmarnock's home game, while Camara will miss Dundee United's home match. Rangers are informed by letter regarding the outcome of their hearing regarding their reaction to Rangers being awarded a penalty in the same game.", "qwen2.5:1.5b": "Henri Camara and Nacho Novo of Celtic and Rangers have been suspended for one match each after recent Old Firm games where they missed referee's rulings. Novo had 12 additional points, while Camara got only one more game affected. The suspension begins on December 28th, affecting both players' upcoming matches against Livingston, Dundee United, and Dunfermline. They have 7 days to appeal but must do so by Friday due to scheduling conflicts with upcoming matches. Malcolm was suspended as well after being accused of an incident during a previous game, with no further details provided about any penalty he might receive.", "qwen2.5:3b": "Celtic's Henri Camara and Rangers' Nacho Novo have been suspended for one match each after being found guilty of stamping (Camara) and kicking (Novo). The additional bans take effect from 28 December, meaning Camara will miss home game against Livingston and Novo will miss matches with Dundee United and Dunfermline. Rangers manager Alex McLeish is disappointed at the severity of Novo's punishment. Bob Malcolm may face further action as well; details are pending after he received a letter from the SFA regarding his reaction during the match.", "opencoder:1.5b": "Old Firm pair handed suspensions for disciplinary actions in recent game.\n\nCamara was found guilty of stamping on Celtic's Stephen Pearson and Vignal kicking Gregory Vignal, both players were given automatic one-match bans and 12 additional disciplinary points for their actions. Novo will miss two more games because he had prior record. Camara will miss an additional game due to previous record. The manager Alex McLeish of Novo's punishment described a disappointment about why the incident should be picked up. They mentioned that there is nothing to add and they are at a loss as to why that incident should be highlighted.\n\nBoth players will miss games against Dundee United and Rangers visit Kilmarnock unless they decide to appeal.\n \nThe next day, SFA announced: \"They have seven days to appeal but with matches coming along at the weekend they would need to do so before Friday. However, if they do appeal it won't be heard before this weekend because it takes a bit of time to seat up an appeals tribunal.\" Meanwhile, Bob Malcolm and Rangers manager from letter were informed by an appeal regarding their reaction to being given a penalty in the same game. Malcolm was taken from the Rangers dug-out and spoken to by police about an alleged gesture he made. The SFA added that they would not detail what punishment Malcolm would receive.\n", "smollm:1.7b": "The Old Firm is a rivalry between two Scottish football clubs: Celtic FC and Rangers FC. The Old Firm is known for its intense competition, passionate fans, and rich history. In recent years, there have been several incidents that have led to suspensions and penalties for players on both sides of the border.\n\nIn a recent game, Henri Camara and Nacho Novo of Celtic FC were suspended for offenses missed by the referee in a 2-0 win over Rangers FC. This means that Camara will miss two games because of his prior record. Nacho Novo was punished for stamping on Celtic's Stephen Pearson.\n\nBoth players will also miss this weekend's games when Celtic hosts Dundee United and Rangers visit Kilmarnock unless they decide to appeal. The additional bans come into effect from 28 December, meaning Camara will be unavailable for the home game against Livingston while Novo will miss the meetings with Dundee United and Dunfermline.\n\nAn SFA spokesman said: \"They have seven days to appeal but with matches coming along at the weekend they would need to do so before Friday.\" Meanwhile, Bob Malcolm and Rangers have been informed by letter as to the outcome of the hearing regarding his reaction to Rangers being awarded a penalty in the same game.\n\nThe Old Firm is known for its intense competition, passionate fans, and rich history. In recent years, there have been several incidents that have led to suspensions and penalties for players on both sides of the border.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text. Let me read through it carefully and identify the key points.\n\nThe main action is about Old Firm pair handing suspensions to Henri Camara and Nacho Novo of Rangers. Both were suspended due to issues found by the referee in a game. \n\nFirst sentence: \"Old Firm pair handed suspensions\" - that's the title. Then, \"Celtic's Henri Camara and Nacho Novo of Rangers have both been suspended for offences missed by the referee...\" So, they're both suspended after missing games because their actions were not caught.\n\nNext, it says \"both were given automatic one-match bans and 12 additional disciplinary points.\" So, each gets an automatic one-match ban plus 12 points. This means Novo will miss two more games, Camara one more.\n\nThey have to schedule these next weekend's matches against Dundee and Dunfermline. The additional bans start from December 28th, so both are out for home games against Livingston as well. The SFA has seven days to appeal but can't do it until Friday because of the time it takes for an appeals tribunal.\n\nThen, there's information about Bob Malcolm being informed about a hearing regarding his reaction. He was taken from Rangers on that day and spoken to by police, but no details are given about what he'd receive. \n\nI need to make sure I include all the important details: who the suspensions went to, the implications of missing games, the schedules affected, the SFA's appeal timeline, and any info about Bob Malcolm.\n</think>\n\nOld Firm pair handed suspensions to Henri Camara and Nacho Novo from Rangers for missed games. Both received automatic one-match bans and 12 additional disciplinary points, meaning Novo will miss two more games and Camara one. The additional bans start from December 28th, affecting their home games against Livingston. The SFA has seven days to appeal but can't do so until Friday due to the appeals tribunal's time requirement. Bob Malcolm was informed about a hearing on his reaction regarding Rangers' penalty award.", "tinyllama:1.1b": "Old Firms pair Henri Camara and Nacho Novo were handed suspensions for missed Old Firm games, bringing their total number of suspensions to two. Both players were found guilty of kicking off-field incidents during a match between CeltiC and Livingston in November, with Camara given an automatic one-match ban and another ten points added for his actions. Camara's teammate Henri Camara, who was not penalized for this incident but received a three-match suspension, will be unavailable for the remaining matches of CeltiC's season due to being given a further two games because of his prior record. Novo's suspension has also been upheld, leaving him unable to participate in the home game against Dundee United and the upcoming match against Dunfermline. The SFAspeaker stated that if Novo appeals the decision, he will be unaffected from being suspended for the remaining matches.", "tinydolphin:1.1b": " The Scottish Football Association (SFA) has announced that Celtic midfielder Henri Camara and Nacho Novo, who played for Rangers, have been suspended for missing two games due to their prior disciplinary records. Both players were given automatic one-match bans and 12 additional disciplinary points for missing a game. This follows the decision by referee George McDonald to penalize Camara with a red card and Novo with a two-match ban for kicking Celtic midfielder Stephen Pearson. The two players were both shown suspended automatic one-match bans and 12 additional disciplinary points for missing two games in a row, starting from the last game of the Old Firm rivalry. This decision has led to concerns about the fairness of the referee's judgment, as well as the impact it may have on the players and their teams. The Scottish Football Association (SFA) will have seven days to consider any appeals or amendments to the original suspensions.", "phi:2.7b": " In a recent Old Firm game, Celtic' s Henri Camara and Nacho Novo of Rangers were both given automatic one-match bans and 12 additional disciplinary points for their actions. Both players will miss this weekend's games unless they appeal. The SFA has not yet informed Bob Malcolm and Rangers as to the outcome of his hearing regarding an alleged gesture he made.\n", "orca-mini:3b": " In a recent Old Firm game, Celtic's Henri Camara and Rangers' Nacho Novo were given automatic one-match suspensions and 12 additional disciplinary points for their actions. Both players were found guilty of stamping on Stephen Pearson and kicking Gregory Vignal, respectively. Camara also received an additional ban for an alleged gesture made during the game. The additional bans come into effect from December 28th and will see Camara miss games against Dundee United, Kilmarnock, and Dunfermline while Novo will miss games against Livingston and Rangers.", "hermes3:3b": "Celtic's Camara and Rangers' Novo get 1-game suspensions for missed referee offences in Old Firm match. Novo also gets additional ban due to prior record.", "stablelm-zephyr:3b": "Celtic's Henri Camara and Rangers' Nacho Novo were suspended for one match each and an additional 12 points for their offenses in an Old Firm game. Novo also had a prior record that adds two more games to his suspension. Both players will miss upcoming matches, with Camara unavailable for the game against Livingston and Novo missing Dundee United and Dunfermline. There were other incidents during the game, but these sanctions are due to their respective actions. A substitute named Bob Malcolm was also informed of the outcome of a hearing regarding his reaction to a penalty awarded in the match.", "chatgpt-4o-latest": "Celtic's Henri Camara and Rangers' Nacho Novo have been suspended for incidents missed by the referee in a recent Old Firm match. Both received one-match bans and 12 disciplinary points, with Novo missing two additional games due to prior infractions and Camara missing one more. Novo was penalized for stamping on Stephen Pearson, while Camara was punished for kicking Gregory Vignal. Rangers manager Alex McLeish expressed disappointment over Novo's punishment. The suspensions take effect from 28 December, affecting upcoming matches unless appealed. Meanwhile, Rangers' Bob Malcolm is awaiting the outcome of a hearing regarding his conduct during the game, though the SFA has not disclosed any potential punishment.", "stablelm2:1.6b": "Celtic's Henri Camara and Nacho Novo of Rangers received suspensions for off-field incidents during an Old Firm game. Both were given automatic one-match bans and additional disciplinary points. Novo will miss two more games due to his prior record, while Camara misses one more game. They will be unavailable for the upcoming matches unless they appeal. The suspensions come into effect from December, impacting both players' availability for home games against Livingston and other opponents.", "granite3.1-dense:2b": "Celtic's Henri Camara and Rangers' Nacho Novo have been suspended following offenses missed by referees during their recent Old Firm match. Both received automatic one-match bans and 12 disciplinary points. Novo, due to his prior record, will miss two additional games. Camara will only miss one extra game.\n\nNovo was penalized for stamping on Celtic's Stephen Pearson, while Camara was fined for kicking Gregory Vignal. Rangers manager Alex McLeish expressed disappointment, questioning the highlighted nature of Novo's incident amid numerous other game occurrences.\n\nCamara and Novo will be unavailable for their respective upcoming matches: Celtic vs. Dundee United and Rangers vs. Kilmarnock (unless they appeal). They have until Friday to lodge an appeal, but if successful, the tribunal hearing would occur before this weekend due to the need to assemble a tribunal.\n\nAdditionally, Bob Malcolm, a Rangers substitute, was informed of the hearing regarding his alleged gesture near the referee during the same game. The Scottish Football Association (SFA) will not disclose specific punishment for Malcolm, leaving Rangers to comment on the findings once they receive their letter.", "reference": "Camara will miss one additional game.Both players will miss this weekend's games when Celtic host Dundee United and Rangers visit Kilmarnock unless they decide to appeal.The additional bans come into effect from 28 December meaning Camara will also be unavailable for the home game against Livingston while Novo will miss the meetings with Dundee United and Dunfermline.Celtic's Henri Camara and Nacho Novo of Rangers have both been suspended for offences missed by the referee in a recent Old Firm game.Meanwhile, Bob Malcolm and Rangers have been informed by letter as to the outcome of the hearing regarding his reaction to Rangers being awarded a penalty in the same game.That means Novo will miss a further two games because of his prior record.Malcolm, a substitute on the day, was taken from the Rangers dug-out and spoken to by police about an alleged gesture he made."}