{"raw_text": "Robben and Cole earn Chelsea win\n \n Cheslea salvaged a win against a battling Portsmouth side just as it looked like the Premiership leaders would have to settle for a point.\n \n Arjen Robben curled in a late deflected left-footed shot from the right side of Pompey's box to break the home side's brave resistance. Chelsea had been continually frustrated but Joe Cole added a second with a 20-yard shot in injury-time. Nigel Quashie had Pompey's best chance when his effort was tipped over. The Fratton Park crowd were in good voice as usual and, even though Portsmouth more than held their own, Chelsea still managed to carve out two early chances. Striker Didier Drogba snapped in an angled shot to force home keeper Shaka Hislop into a smart save while an unmarked Frank Lampard had a strike blocked by Arjan De Zeeuw. But Pompey chased, harried and unsettled a Chelsea side as the south-coast side started to gain the upper hand and almost took the lead through Quashie.\n \n The midfielder struck a swerving long range shot which keeper Petr Cech tipped over at full stretch. Pompey stretched Arsenal to the limit recently and were providing a similarly tough obstacle to overcome for a Chelsea team struggling to exert any pressure. Velimir Zajec's players stood firm as the visitors came out in lively fashion after the break but, just as they took a stranglehold of the match, the visitors launched a counter-attack. Drogba spun to get a sight of goal and struck a fierce shot which rocked keeper Hislop back as he blocked before Arjan de Zeeuw cleared the danger.\n \n The home side were also left breathing a sigh of relief when a Glen Johnson header fell to Gudjohnsen who had his back to goal in a crowded Pompey goalmouth. The Icelandic forward tried to acrobatically direct the ball into goal but put his effort over. But, just like against Arsenal, Portsmouth let in a late goal when Robben's shot took a deflection off Matthew Taylor on its way past a wrong-footed Hislop. And Cole put a bit of gloss on a hard-fought win when he put a low shot into the bottom of the Pompey net.\n \n Hislop, Griffin, Primus, De Zeeuw, Taylor, Stone (Cisse 76), Quashie (Berkovic 83), Faye, O'Neil, Kamara (Fuller 65), Yakubu.\n \n Subs Not Used: Berger, Ashdown.\n \n Kamara.\n \n Cech, Paulo Ferreira, Gallas, Terry, Johnson, Duff, Makelele, Smertin (Cole 73), Lampard, Robben (Geremi 81), Drogba (Gudjohnsen 58).\n \n Subs Not Used: Cudicini, Bridge.\n \n Paulo Ferreira, Robben, Lampard.\n \n Robben 79, Cole 90.\n \n 20,210\n \n A Wiley (Staffordshire).\n", "llama3.2:1b": "Chelsea scored two goals in a 2-1 win over Portsmouth at Stamford Bridge. Arjen Robben curled in the winning goal in injury time. Joe Cole also scored in the 90th minute. The match was decided after Pompey's Nigel Quashie had his best chance denied by goalkeeper Shaka Hislop, but ultimately fell to Chelsea.", "llama3.2:3b": "Chelsea salvaged a win against Portsmouth with Arjen Robben's late deflected shot and Joe Cole's injury-time goal, as the visitors continually frustrated but ultimately broke down Pompey's resistance.", "gemma2:2b": "Chelsea won against Portsmouth in a hard-fought match. Arjen Robben scored the winning goal with a deflected shot late in the game. Joe Cole added a second goal in injury time.  The match was close until Chelsea's counterattack, which led to their final win. \n", "qwen2.5:0.5b": "Chelsea won against Portsmouth by a point. The home team scored late goals from Arjen Robben and Joe Cole with Liverpool not giving up. Pompey made a strong effort to take the lead but Chelsea's players were able to score. Pompey tried to come back but failed to win the match.", "qwen2.5:1.5b": "Chelsea won 2-1 against Portsmouth in a Premiership match. Arjen Robben scored the winner with a late free-kick, and Joe Cole added an insurance goal in stoppage time. The match was tense with Pompey frequently threatening but struggling to break through Chelsea's defense.", "qwen2.5:3b": "Chelsea secured a win against battling Portsmouth despite initial frustration. Arjen Robben scored the winning goal with a deflected shot from distance in injury time. Joe Cole added another goal to seal the victory for Chelsea. Portsmouth had several chances but were held back by robust defending. The match was closely contested, with both teams displaying strong resistance and moments of brilliance. Substitute players also contributed significantly, especially Arjen Robben and Joe Cole.", "opencoder:1.5b": "Robben and Cole earn the Chelsea win with a 90-yard shot. Arjen Robben curls in a late goal shot from the right side of Pompey's box. The home team struggles to carve out two early chances but they do it. The midfielder hits a swerving long range shot which keeper Petr Cech tips over at full stretch. The south-coast team almost took the lead through Quashie. Striker Didier Drogba snatches in an angled shot while an unmarked Frank Lampard had a strike blocked by Arjan De Zeeuw. But, they chased, harried and unsettled a Chelsea team as the match continued to gain pressure. The home side were also left breathing a sigh of relief when a Glen Johnson header fell to Gudjohnsen who had his back to goal in a crowded Pompey net. The Icelandic forward tried to acrobatically direct the ball into goal but put his effort over. The visitors launched a counter-attack on a short period of time, but they quickly reposed and won the game.\n", "smollm:1.7b": "Robben and Cole earn Chelsea win", "deepseek-r1:1.5b": "<think>\nOkay, so the user wants me to summarize a given text. They provided a detailed match summary about Chelsea vs. Portsmouth in Premier League. My task is to extract the key points and condense them into a concise summary.\n\nFirst, I'll read through the entire text carefully. It's quite lengthy, so I need to identify the main events. The story starts with Robben and Cole earning a win for Chelsea, which was a late comeback after a tough start against a battling team.\n\nThere are several key actions: Robben curled a shot from Pompey's box, Cole scored with an injury-time chance, and the crowd responded. Then, Lampard had a couple of chances to score but were blocked. Portsmouth had their own chances too, including a goal by Drogba after a counter-attack.\n\nThe writer lists the players involved in each team and the substitutions that occurred during the match. Also, there's information about the starting line-up and some specific scores from different parts of the game.\n\nI need to make sure I include all these details: who started which positions, key scorers like Drogba and Faye, the important saves by Cech, and the final tally with 20 goals for Chelsea. The summary should be in plain text without any explanations or formatting.\n\nWait, but the user also mentioned \"output only the summary as plain text.\" So I have to make sure it's concise without losing any important information about key ideas and details. That includes the main teams, the scoreline, key players, substitutions, and notable goals.\n\nI should structure it in a way that flows naturally, perhaps starting with the overall outcome, then mentioning Chelsea's comeback, some key goals by Drogba and Cole, and finally the final tally. Including specific players and their roles would add detail without being too verbose.\n\nLet me make sure I capture all the important points from each section: the match title, who earned the win, the key moments like Robben scoring, the substitutions that occurred, and the final scoreline. Also, listing the top scorers like Drogba and Faye is crucial for accuracy.\n\nI think that's all. Now, I can put it together into a concise summary that meets the user's requirements.\n</think>\n\nChelsea earned a win over Pompey in their Premier League match, with Arjen Robben securing a late winner from Pompey's box and Joe Cole adding a second goal in injury-time. The home side responded with two early goals, including a goalkeeper saving Frank Lampard's cross. Despite their efforts, Portsmouth pulled off a hard-fought victory after a late counter-attack by Drogba. Chelsea's key players included Didier Drogba, Faye, and Niko Quashie. Notable scorers for both teams were Drogba and Faye, while the starting lineup featured several top talent.", "tinyllama:1.1b": "The following text provides a brief summary of the match between Arsenal and Portsmouth in the Premier League on August 2nd, 2004. The game ended as a 2-1 victory for Arsenal, with the goals coming from Robben and Cole, who scored at both halves to secure the win. The game took place at Fratton Park, and the attendance was 20,210.", "tinydolphin:1.1b": " After reviewing the text carefully, I have determined that it is providing information about a football match between Chelsea and Portsmouth which resulted in a 2-1 win for Chelsea. The game took place at Stamford Bridge on September 7th, 2012, and involved teams from the English Premier League. \n\nSome key points in the summary include:\n\n1) Chelsea won against Portsmouth 2-1.\n2) Arjen Robben scored the winning goal for Chelsea with a left-footed shot.\n3) Joe Cole added a second goal for Chelsea with a right-footed shot in injury time.\n4) Nigel Quashie scored for Portsmouth, taking the lead but eventually losing it through an own goal by Frank Lampard.\n5) The game saw multiple substitutions by both teams.\n6) The match was played on a rainy day with Pompey's best chance of winning being when Arjen Robben curled in a left-footed shot that almost broke Chelsea's defense, but it was tipped over by Shaka Hislop.\n7) Portsmouth tried to create a counterattack and eventually won the ball back after the break, but Chelsea kept them at bay until the 90th minute when Arjen Robben scored the winning goal.\n8) Petr Cech saved a penalty taken by Velimir Zajec in the closing stages of extra time.\n9) Portsmouth's midfielder Velimir Zajec was sent off for a bookable challenge on Frank Lampard.\n10) The crowd at Stamford Bridge booed Chelsea supporters and called for their team to win.", "phi:2.7b": " Chelsea beat Portsmouth 3-1 in the Premier League game at Fratton Park. Arjen Robben scored a late goal from the right side of Pompey's box and Joe Cole added another in injury time. However, Pompey nearly equalized through Didier Drogba's angled shot which was saved by Shaka Hislop. The match was tight throughout with both teams creating chances, but Chelsea held on to win thanks to their strong defense and a brilliant performance from their midfielders.\n", "orca-mini:3b": " Robben and Cole scored late goals for Chelsea to beat Portsmouth 2-1 and salvage a win in their Premier League match.", "hermes3:3b": "Chelsea wins against Portsmouth\nRobben scores late deflected goal\nJoe Cole adds second goal in injury time", "stablelm-zephyr:3b": "Chelsea won against Portsmouth, thanks to goals from Arjen Robben and Joe Cole. Despite strong performances from both teams, Chelsea managed to break through Portsmouth's defense with their late-free kick goal by Robben and a 20-yard shot by Cole in injury time. Portsmouth had several chances but were ultimately unable to secure a point.", "chatgpt-4o-latest": "Chelsea secured a late 2-0 victory over Portsmouth, with Arjen Robben breaking the deadlock in the 79th minute through a deflected shot. Joe Cole sealed the win in injury time with a 20-yard strike. Portsmouth had put up strong resistance, with Nigel Quashie coming closest for the home side, forcing a save from Petr Cech. Chelsea had early chances through Didier Drogba and Frank Lampard but struggled against a determined Portsmouth side. Despite Portsmouth's resilience, Chelsea's late goals ensured they maintained their lead at the top of the Premiership.", "stablelm2:1.6b": "Chelsea narrowly beat Portsmouth in a hard-fought win, thanks to goals from Arjen Robben and Joe Cole. Despite Chelsea's continued pressure, Portsmouth more than held their own with a brave resistance. The match started evenly with both sides creating chances. However, the home side started to gain the upper hand as the game progressed. In the second half, Chelsea gained control, but it wasn..\n  \nThe match was not without its moments of excitement, with Pompey's Quashie nearly scoring for his side, and Drogba attempting a powerful shot that narrowly missed the goal post. A Glen Johnson header fell to Gudjohnsen, who had his back to goal in a crowded Pompey goalmouth. The Icelandic forward tried to acrobatically direct the ball into goal but put his effort over.\n\nIn the end, Chelsea emerged victorious with goals from Robben and Cole, thanks to an injury-time equalizer from Joe Cole. Hislop, Griffin, Primus, De Zeeuw, Taylor (Cisse cord), Quashie (Berkovic cord), Faye, O'Neil, Kamara (Fuller cord), Yakubu were all instrumental in Chelsea's win.\n\nSubstitutes played a crucial role in Chelsea's victory, with Paulo Ferreira, Robben, Lampard, Drogba, Gudjohnsen also making an impact. In contrast, Portsmouth was unable to make any serious breakthroughs and had to settle for holding onto their lead until the late stages when Robben's shot deflected off Matthew Taylor.\n\nOverall, Chelsea's win over Portsmouth showed that even though they are currently top of the table, it is still important not to take any team lightly in the Premiership.", "granite3.1-dense:2b": "Chelsea secured a hard-fought victory over Portsmouth at Fratton Park, with Arjen Robben scoring a late deflected goal and Joe Cole adding another in injury time. Despite Portsmouth's persistent pressure and numerous chances, including Nigel Quashie's effort tipped onto the post, Chelsea managed to break through with two well-executed strikes. The match remained competitive throughout, with both teams creating scoring opportunities and displaying strong defense. Petr Cech, the Chelsea goalkeeper, made crucial saves to keep his team in the game. The home crowd was lively, supporting their team, while Chelsea's squad, led by manager Jose Mourinho, demonstrated resilience and tactical prowess to secure a 2-0 win.", "reference": "Drogba spun to get a sight of goal and struck a fierce shot which rocked keeper Hislop back as he blocked before Arjan de Zeeuw cleared the danger.But, just like against Arsenal, Portsmouth let in a late goal when Robben's shot took a deflection off Matthew Taylor on its way past a wrong-footed Hislop.Arjen Robben curled in a late deflected left-footed shot from the right side of Pompey's box to break the home side's brave resistance.Cech, Paulo Ferreira, Gallas, Terry, Johnson, Duff, Makelele, Smertin (Cole 73), Lampard, Robben (Geremi 81), Drogba (Gudjohnsen 58).Striker Didier Drogba snapped in an angled shot to force home keeper Shaka Hislop into a smart save while an unmarked Frank Lampard had a strike blocked by Arjan De Zeeuw.And Cole put a bit of gloss on a hard-fought win when he put a low shot into the bottom of the Pompey net.Robben 79, Cole 90.But Pompey chased, harried and unsettled a Chelsea side as the south-coast side started to gain the upper hand and almost took the lead through Quashie.Chelsea had been continually frustrated but Joe Cole added a second with a 20-yard shot in injury-time.Hislop, Griffin, Primus, De Zeeuw, Taylor, Stone (Cisse 76), Quashie (Berkovic 83), Faye, O'Neil, Kamara (Fuller 65), Yakubu."}