{"raw_text": "TV calls after Carroll error\n \n Spurs boss Martin Jol said his team were \"robbed\" at Manchester United after Pedro Mendes' shot clearly crossed the line but was not given.\n \n \"The referee is already wearing an earpiece so why can't we just stop the game and get the decision right,\" said Jol after the 0-0 draw. \"But at the end of the day it's so obvious that Pedro's shot was over the line it's incredible. \"We feel robbed but it's difficult for the linesman and referee to see it.\" Mendes shot from 50 yards and United goalkeeper Roy Carroll spilled the ball into his own net before hooking it clear. Jol added: \"We are not talking about the ball being a couple of centimetres or an inch or two over the line, it was a metre inside the goal. \"What really annoys me is that we are here in 2005, watching something on a TV monitor within two seconds of the incident occurring and the referee isn't told about it.\n \n \"We didn't play particularly well but I am pleased - even now - with a point, although we should have had three.\" Mendes could not believe the 'goal' was not given after seeing a replay. He said: \"My reaction on the pitch was to celebrate. \"It was a very nice goal, it was clearly over the line - I've never seen one so over the line and not given in my career. \"It's really, really over. What can you do but laugh about it? It's a nice goal and one to keep in my memory even though it didn't count. \"It's not every game you score from the halfway line.\" Manchester United manager Sir Alex Ferguson sympathised with Tottenham and said the incident highlighted the need for video technology. \"I think it hammers home what a lot of people have been asking for and that's that technology should play a part in the game,\" Ferguson told MUTV. \"What I was against originally was the time factor in video replays. \"But I read an article the other day which suggested that if a referee can't make up his mind after 30 seconds of watching a video replay then the game should carry on.\n \n \"Thirty seconds is about the same amount of time it takes to organise a free-kick or take a corner or a goal-kick. So you wouldn't be wasting a lot of time. \"I think you could start off by using it for goal-line decisions. I think that would be an opening into a new area of football.\" Arsenal boss Arsene Wenger also used the incident to highlight the need for video technology. \"When the whole world apart from the referee has seen there should be a goal at Old Trafford, that just reinforces what I feel - there should be video evidence,\" said Wenger. \"It's a great example of where the referee could have asked to see a replay and would have seen in five seconds that it was a goal.\"\n", "llama3.2:1b": "Spurs boss Martin Jol said Spurs were robbed after Pedro Mendes' shot cleared the line but was not given as referee Roy Carroll spilled the ball into his own net. The incident has been disputed by both teams, with Spurs claiming they had clear possession and United saying the ball was over the line. Jol expressed frustration at the delay in making a decision, calling it \"incredible\" that the TV monitor showed no evidence of the goal being out.", "llama3.2:3b": "Spurs boss Martin Jol claims his team was \"robbed\" after Pedro Mendes' shot clearly crossed the line but was not given, while Manchester United manager Sir Alex Ferguson says the incident highlights the need for video technology to aid referees. Arsenal boss Arsene Wenger also supports the use of technology, saying it would have been clear in five seconds that the goal should be awarded.", "gemma2:2b": "Tottenham Hotspur manager Martin Jol protested a disallowed goal by Pedro Mendes at Manchester United's Old Trafford stadium, arguing the shot clearly crossed the line despite not being awarded.  Sir Alex Ferguson agreed with Jol, suggesting technology should play a role in making these decisions. The incident sparked debate about video technology use in football.  Arsenal manager Arsene Wenger also echoed the sentiment, emphasizing that video evidence would have confirmed the goal had been scored. \n", "qwen2.5:0.5b": "### Summary\n\nTV calls after Carroll error\n\nSpurs boss Martin Jol claimed his team lost the game due to a \"robbed\" call from the referee, despite Pedro Mendes' shot crossing the line but not being given. The reference officer is already wearing an earpiece so he can't stop the game right away, adding: \"We are not talking about the ball being a couple of centimetres or an inch or two over the line, it was a metre inside the goal.\" \n\nIn contrast, Mendes' 50-yard shot from the edge of the box and United goalkeeper Roy Carroll's 20-yard clearance kick after Carroll spilled the ball into his own net all contributed to the goal being ruled in. Jol said: \"We are not talking about the ball being a couple of centimetres or an inch or two over the line, it was a metre inside the goal.\" Arsenal boss Arsene Wenger used it as an example for video technology during the 2016-2017 England national team football tournament. Arsenal manager Paul Thomas said: \"We have some problems with our own record books and we need to improve them.\"\n\n### Explanation\n\nThe text discusses a notable incident in Manchester United's Premier League game against Chelsea on March 15, 2016, when the referee made an obvious error by giving a goal overreach call. This led to a clear red card being issued to Cristiano Ronaldo, who was subsequently substituted for the remainder of the match. The passage then explains why Martin Jol's team claims they were not robbed during this incident.\n\n### Key Points\n\n- Manchester United manager Sir Alex Ferguson criticized Tottenham as they played poorly.\n- \"We didn't play particularly well\" in his words; however, he was pleased with a point despite their poor form.\n- Arsenal manager Arsene Wenger also made the same point, emphasizing the importance of video technology in football matches.", "qwen2.5:1.5b": "Manchester United goalkeeper Roy Carroll mistakenly allowed Pedro Mendes' shot to cross over the line during a 0-0 draw between Tottenham and Manchester United, leading Spurs manager Martin Jol to criticize the referee's failure to call the goal despite being aware of the mistake. The incident highlights concerns about video technology in football and emphasizes the need for better communication between officials and players. Mourinho suggests that if referees can't make up their minds within 30 seconds of a replay, games should continue, while Wenger advocates for using video evidence as part of goal-line decision making.", "qwen2.5:3b": "Martin Jol of Tottenham expressed frustration after his team's missed opportunity against Manchester United, with Pedro Mendes' shot clearly crossing the line but not being awarded. Referee Roy Carroll made an error by spilling the ball into his own net before he cleared it away. Jol and team-mate Mendes felt they were 'robbed', while Sir Alex Ferguson of Manchester United praised video technology to assist in goal-line decisions, citing 30 seconds as sufficient time for a replay. Arsenal's Arsene Wenger also supported such technology.", "opencoder:1.5b": "\"The TV calls after Carroll error\"\n\nSpurs boss Martin Jol said his team were \"robbed\" at Manchester United after Pedro Mendes' shot clearly crossed the line but was not given.\n\n\"We feel robbed but it's difficult for the linesman and referee to see it.\"\n\nThe incident highlighted the need for video technology. \n\n\"We didn't play particularly well but I am pleased - even now - with a point, although we should have had three.\"\n\nAfter seeing a replay, Jol added: \"My reaction on the pitch was to celebrate. \"\n\nIt's really, really over. What can you do but laugh about it? It's a nice goal and one to keep in my memory even though it didn't count.\n\n\"He mentioned the time factor in video replays. \"\n", "smollm:1.7b": "The text is concise because it summarizes the main points of the original text without including unnecessary details or explanations. The key ideas are preserved, and the supporting information is not included.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help the user by summarizing the given text. The user provided a detailed paragraph about a TV call after a Manchester United player scored against Tottenham. They want me to summarize this into just plain text without any explanations or formatting.\n\nFirst, I'll read through the text carefully to identify the key points. It seems like Martin Jol from Spurs said something about the team being \"robbed\" after a goal by Pedro Mendes at Man United. The draw was 0-0, and Mendes scored from 50 yards, causing United goalkeeper Roy Carroll to spill the ball into his own net.\n\nJol explained that the referee is already wearing an earpiece but wasn't told about the incident yet because it was too obvious. He also mentioned that while the goal being over the line seems clear, there's still frustration for fans and officials who couldn't react quickly enough when they saw the situation on TV two seconds before.\n\nThe article then goes into how Manchester United's manager Sir Alex Ferguson and Arsenal boss Arsene Wenger used this incident to highlight the importance of video technology in football. They argue that without video replays, teams might miss crucial decisions made through live broadcasts.\n\nI need to make sure I capture all these points: Jol's initial comments about the team being robbed, Mendes' goal from 50 yards, the causeway spill by Carroll, the referee's confusion over not knowing about it, and the use of video technology by both teams. I should also note that while the game went to a draw, they still felt upset.\n\nI'll structure the summary to include Jol's initial statement, Mendes' goal details, the spill and spill net action, referee's reaction regarding the earpiece, the frustration for fans, the managers' comments on video technology, and conclude with the importance of video replays in football.\n</think>\n\nMartin Jol said his team were \"robbed\" after Pedro Mendes scored at Manchester United. The game was 0-0, and Mendes scored from 50 yards, causing Roy Carroll to spill the ball into his net. Jol noted the referee's confusion about not knowing about the earpiece but explained that it was too obvious that the shot overshot. Fans and officials found it frustrating as they couldn't react in time to make the call. Manchester United manager Sir Alex Ferguson and Arsenal boss Arsene Wenger highlighted the need for video technology, noting that video replays would be crucial for making decisions quickly during live broadcasts.", "tinyllama:1.1b": "Despite Pedro Mendes' clear shot being over the line, Spurs' Bossi Martin Joel called out for his team to stop the game after the incident and get the correct decision right. The linesman and the referee were not informed about it, which made it difficult for them to see the goal. Man United manager Sir Alex Ferguson sympathized with Tottenham, stating that video technology should play a role in games and highlighting that thirty seconds of watching a video replay should be enough to make up a decision. Arsenal's Arun Weingar also emphasized the need for using video technology to improve goal-line decisions.", "tinydolphin:1.1b": " In the match between Manchester United and Tottenham, which ended in a 0-0 draw, Spurs boss Martin Jol described the decision as \"robbed\" after Pedro Mendes' shot was ruled out by referee Roy Carroll. The incident occurred at the end of the 50th yard line with the ball nearing the penalty area. Both goalies were present and engaged in the incident, which resulted in a draw. Manchester United manager Sir Alex Ferguson sympathized with Tottenham, stating that he believes it highlights the need for video technology to make quick decisions. Arsenal's Arsene Wenger also used the incident to emphasize the importance of using video evidence during match-day incidents.", "phi:2.7b": " In a Manchester United vs Tottenham Hotspur match, Pedro Mendes scored a goal from 50 yards that crossed the line but was not given due to the linesman's error. Spurs boss Martin Jol felt his team was robbed of the win, as there was no video technology available at the time. Arsenal and Manchester City also agreed that it would be beneficial to use video replays in football matches.\n", "orca-mini:3b": " Martin Jol expressed dissatisfaction with the decision not to award a goal to Tottenham Hotspur at Manchester United after an incident involving Pedro Mendes' shot being ruled as offside by a linesman. The Spurs boss claimed that the referee was not informed of the incident, which he deemed \"obvious\" and \"clearly over the line\". The score remained 0-0, with Sir Alex Ferguson sympathizing with Tottenham due to the need for video technology in football.", "hermes3:3b": "TV calls for Spurs goal review after Pedro Mendes' shot clearly crossing line but not given goal by referee during match with Manchester United.", "stablelm-zephyr:3b": "Spurs manager Martin Jol accused Manchester United of \"robbing\" his team after a clear violation by Pedro Mendes' shot, which should have been disallowed for crossing the line. Jol questioned why the referee couldn't be informed about the incident instantly through TV monitor and argued that the decision shouldn't have taken so long since it was blatant. Despite not playing well, Spurs earned a 0-0 draw, with Mendes celebrating what he thought was an obvious goal. Manchester United's Sir Alex Ferguson agreed that video technology should play a part in the game, emphasizing the possibility of using it for goal-line decisions and starting with that option. Arsenal's Arsene Wenger also supported the idea of video evidence to help referees make more informed decisions.", "chatgpt-4o-latest": "Spurs manager Martin Jol claimed his team was \"robbed\" after Pedro Mendes' long-range shot clearly crossed the line but was not awarded in a 0-0 draw against Manchester United. Mendes and Jol were frustrated that modern technology could confirm the goal instantly, yet officials were not informed. Manchester United's Roy Carroll spilled the ball into his own net before clearing it, but the referee and linesman missed it. Sir Alex Ferguson and Arsene Wenger both supported the use of video technology, with Ferguson suggesting it could be used for goal-line decisions without significantly delaying the game. Wenger argued that when the entire world sees a goal except the referee, video evidence should be implemented.", "stablelm2:1.6b": "Spurs manager Martin Jol feels robbed after Manchester United goalkeeper Roy Carroll's spilled shot was not given a goal-line decision despite crossing the line by a metre. Sir Alex Ferguson supports video technology for such decisions, while Arsenal boss Arsene Wenger also emphasizes its importance in soccer matches.", "granite3.1-dense:2b": "Tottenham Hotspur's manager, Martin Jol, expressed frustration after his team's 0-0 draw with Manchester United, claiming they were \"robbed\" of a clear goal. Pedro Mendes' shot, from approximately 50 yards, appeared to cross the line and end up in United's net through their goalkeeper, Roy Carroll. Despite the incident being evident on television within two seconds, the referee did not stop the game to review it. Jol criticized the lack of technology, stating that 30 seconds of video replay time would be sufficient for such decisions without causing significant delays in the match. Manchester United manager, Sir Alex Ferguson, and Arsenal's Arsene Wenger echoed these concerns, advocating for the implementation of video technology to enhance accuracy in goal-line decisions. Mendes himself was surprised by the non-call, celebrating what he believed was a legitimate goal on the pitch. Despite the controversy, Jol acknowledged his team's satisfaction with a point, though they felt they should have secured three.", "reference": "\"It's a great example of where the referee could have asked to see a replay and would have seen in five seconds that it was a goal.\"\"It was a very nice goal, it was clearly over the line - I've never seen one so over the line and not given in my career.Spurs boss Martin Jol said his team were \"robbed\" at Manchester United after Pedro Mendes' shot clearly crossed the line but was not given.\"What I was against originally was the time factor in video replays.Mendes could not believe the 'goal' was not given after seeing a replay.Jol added: \"We are not talking about the ball being a couple of centimetres or an inch or two over the line, it was a metre inside the goal.\"When the whole world apart from the referee has seen there should be a goal at Old Trafford, that just reinforces what I feel - there should be video evidence,\" said Wenger.\"But I read an article the other day which suggested that if a referee can't make up his mind after 30 seconds of watching a video replay then the game should carry on.\"But at the end of the day it's so obvious that Pedro's shot was over the line it's incredible.He said: \"My reaction on the pitch was to celebrate.\"What really annoys me is that we are here in 2005, watching something on a TV monitor within two seconds of the incident occurring and the referee isn't told about it."}