{"raw_text": "Fuming Robinson blasts officials\n \n England coach Andy Robinson insisted he was \"livid\" after his side were denied two tries in Sunday's 19-13 Six Nations loss to Ireland in Dublin.\n \n Mark Cueto's first-half effort was ruled out for offside before the referee spurned TV replays when England crashed over in the dying minutes. \"[I'm] absolutely spitting. I'm livid. There's two tries we've been cost,\" Robinson told BBC Sport. \"We've got to go back to technology. I don't know why we didn't.\" South African referee Jonathan Kaplan ruled that Cueto was ahead of Charlie Hodgson when the fly-half hoisted his cross-field kick for the Sale wing to gather.\n \n Kaplan then declined the chance to consult the fourth official when Josh Lewsey took the ball over the Irish line under a pile of bodies for what could have been the game-winning try. \"I think Mark Cueto scored a perfectly legal try and I think he should have gone to the video referee on Josh Lewsey,\" said Robinson. \"It is how we use the technology. It is there, and it should be used. \"I am still trying to work out the Cueto try. I have looked at both, and they both looked tries. \"We are very disappointed, and this will hurt, there is no doubt about that. \"We are upset now, but the referee is in charge and he has called it his way and we have got to be able to cope with that.\n \n \"We did everything we could have done to win the game. I am very proud of my players and, with a couple of decisions, this could have been a very famous victory. \"I thought we dominated. Matt Stevens had an awesome game at tighthead prop, while the likes of Charlie Hodgson, Martin Corry and Lewis Moody all came through well. \"Josh Lewsey was awesome, and every one of the forwards stood up out there. Given the pressure we were under, credit must go to all the players. \"We have done everything but win a game of rugby, but Ireland are a good side. They defended magnificently and they've got every chance of winning this Six Nations.\" England have lost their first three matches in this year's Six Nations and four out of their six games since Robinson took over from Sir Clive Woodward in September.\n", "llama3.2:1b": "England coach Andy Robinson was furious after his team was denied two tries by officials, with Mark Cueto's first-half effort being ruled out for offside. The referee, Jonathan Kaplan, declined to consult the fourth official when Josh Lewsey scored a game-winning try.", "llama3.2:3b": "England coach Andy Robinson was \"livid\" after two tries were denied due to officiating errors, criticizing referee Jonathan Kaplan for not using technology correctly. Robinson believed Mark Cueto scored a try that should have been reviewed, and Josh Lewsey's attempt at a game-winning try was also overlooked. Despite his disappointment, Robinson praised his players for their performance, saying they dominated the game and had \"every chance of winning\".", "gemma2:2b": "Andy Robinson expresses his anger and disappointment after England lost to Ireland in the Six Nations due to disallowed tries, claiming the video replay technology should be utilized more often. He criticizes the referee's decision on two potential tries by England and notes how the team had a strong performance despite the loss. \n", "qwen2.5:0.5b": "English team Fuming Robinson was \"livid\" after his side were denied two tries in the 19-13 Six Nations defeat to Ireland in Dublin. He said England need to go back to technology and that they should be able to use it as a guide for the fly-half Mark Cueto's try in the final minutes of the game, but he couldn't identify whether the referee ruled on his side. England's fourth official, Jonathan Kaplan, then declined to consult him after Josh Lewsey took the ball over the Irish line without a goal. He said Robinson should have gone to the video referee and that was wrong. English players felt they dominated in the match, with Matt Stevens and Charlie Hodgson scoring their greatest tries of the tournament. Rangers' captain Lewis Moody had a standout performance too. England will be disappointed if this game is remembered as a \"very famous victory\" over Ireland.", "qwen2.5:1.5b": "England coach Andy Robinson is livid after losing to Ireland 19-13, with referee Jonathan Kaplan dismissing a Cueto try ruled offside and then spurning replays on Lewsey's try at the end of the game. Despite being \"dominated\" throughout, England has lost their first three matches this year in the Six Nations under Robinson's management.", "qwen2.5:3b": "England coach Andy Robinson is furious after his team were denied two tries in the 19-13 loss to Ireland in Dublin during the Six Nations. South African referee Jonathan Kaplan ruled against England, who believe they missed out on scoring tries due to offside calls and declined technology consultation. England praised their players' performance but express disappointment with decisions made by the referee. They have lost all three matches this year's Six Nations, including four of six games since Robinson took over from Sir Clive Woodward in September.", "opencoder:1.5b": "Fuming Robinson blasts officials, England coach Andy Robinson insisted he was \"livid\" after his side were denied two tries in Sunday's 19-13 Six Nations loss to Ireland in Dublin.\n\nMark Cueto's first-half effort was ruled out for offside before the referee spurned TV replays when England crashed over in the dying minutes. \"I'm absolutely spitting, I'm livid,\" Robinson told BBC Sport. \"We've got to go back to technology. I don't know why we didn't.\" South African referee Jonathan Kaplan ruled that Cueto was ahead of Charlie Hodgson when the fly-half hoisted his cross-field kick for the Sale wing to gather.\n\nKaplan then declined the chance to consult the fourth official when Josh Lewsey took the ball over the Irish line under a pile of bodies for what could have been the game-winning try. \"I think Mark Cueto scored a perfectly legal try and I think he should have gone to the video referee on Josh Lewsey,\" said Robinson. \"It is how we use the technology. It is there, and it should be used. \"I am still trying to work out the Cueto try. I have looked at both, and they both looked tries. \"We are very disappointed, and this will hurt, there is no doubt about that. \"We are upset now, but the referee is in charge and he has called it his way and we have got to be able to cope with that.\n\n\"We did everything we could have done to win the game, but Ireland are a good side. They defended magnificently and they've got every chance of winning this Six Nations.\" England have lost their first three matches in this year's Six Nations and four out of their six games since Robinson took over from Sir Clive Woodward in September.\n", "smollm:1.7b": "The summary is concise, preserving the key ideas and details of the original text while omitting unnecessary information. The main points are:\n\n1. Fuming Robinson blasts officials: Robinson's frustration with the referee's decision to rule out two tries in Sunday's Six Nations loss to Ireland.\n2. England coach Andy Robinson insisted he was \"livid\" after his side were denied two tries: Robinson's statement that he was \"livid\" and that the referee's decision was unfair is clear and concise.\n3. Mark Cueto's first-half effort was ruled out for offside before the referee spurned TV replays when England crashed over in the dying minutes: The referee's decision to rule out Cueto's first-half attempt as a try is clear and concise, with no explanation or justification given.\n4. Mark Kaplan ruled that Cueto was ahead of Charlie Hodgson when the fly-half hoisted his cross-field kick for the Sale wing to gather: Kaplan's ruling that Cueto was ahead of Hodgson is clear and concise, with no explanation or justification given.\n5. Mark Kaplan then declined the chance to consult the fourth official when Josh Lewsey took the ball over the Irish line under a pile of bodies for what could have been the game-winning try: Kaplan's decision not to consult the fourth official is clear and concise, with no explanation or justification given.", "deepseek-r1:1.5b": "<think>\nAlright, I'm looking at the user's query where they want a summary of a given text. The text is about a rugby match between England and Ireland. Let me read through it carefully.\n\nThe first paragraph talks about Fuming Robinson, England's coach, criticizing the performance of his team. He's \"livid\" after their loss in Dublin. That sets up some key points about their struggle.\n\nNext, there are details about Mark Cueto's first-half effort being ruled out for offside. The referee decided to replay that crucial moment because time was running out. Robinson admitted that he spits and is angry but mentions the rules don't take precedence over technology.\n\nThen, Jonathan Kaplan ruled Cueto ahead of Charlie Hodgson when he hoisted a cross-field kick. This leads to a conversation from Robinson about using technology for game management.\n\nThe summary then moves on to state that England lost the game, acknowledging their circumstances since Robinson's arrival in September. They've been struggling in the Six Nations. It also mentions that Ireland is a strong team defending well but hasn't won yet, giving them a chance.\n\nSo, I need to condense this into a concise summary without losing key details like the coach's frustration, technical decisions by the referee, players' performances, and the match outcome. I'll make sure to include all important points about the loss, their performance, and the team's current standing.\n</think>\n\nEngland lost their first three matches in the Six Nations after losing a 19-13 defeat to Ireland in Dublin. Fuming Robinson expressed frustration over his team's failure to score the two tries in Sunday's game. Mark Cueto was ruled out for offside before the referee ruled the TV replays, allowing Lapointe and Kaplan to rule Cueto ahead of Hodgson. Robinson mentioned using technology for game management but emphasized the importance of follow-through. The summary also notes that England had been dominating with performances from players like Matt Stevens and Charlie Hodgson, while Josh Lewsey was pivotal. Overall, England's performance was disappointing, though Ireland showed promise in defending.", "tinyllama:1.1b": "England coach Andy Robinson was \"livid\" after his side's 19-13 loss to Ireland in Dublin, which resulted in two tries being ruled out due to offside and a missed attempt for an easy conversion. The South African technology referee, Jonathan Kaplan, denied the fly-half Cueto's attempted conversion and instead penalized Lewis Moody for a piloted challenge on hooker Cianhear Foley. Robinson was dissatisfied with the calls made by the technical assistant and claimed that England should have had two tries awarded. He also expressed displeasure with the fourth official, who allowed Cueto's successful attempt to stand and denied Lewsey's conversion for the final try. Overall, Robinson admitted that England \"lost this Six Nations\" due to a lack of success on the field, while admitting they \"did everything but win the game.\"", "tinydolphin:1.1b": " The English rugby team was beaten by Ireland in Dublin, 19-13, after referee Jonathan Kaplan disallowed two tries that England coach Andy Robinson believed should have stood. The game was a disappointing loss for England, who have lost their first three matches and four of their last six games since taking over from Sir Clive Woodward in September. Robinson expressed frustration over the loss and accused the referee of not using proper technology to make his decision.", "phi:2.7b": " The England coach was angry after his team was denied two tries in a 19-13 loss to Ireland. He believed that the referees made wrong decisions, including ruling a try as offside and declining to use technology. He also said he was livid and upset but accepted the referee's decision.\n", "orca-mini:3b": " Andy Robinson expressed his displeasure with the referee's decision not to refer to the video referee during Josh Lewsey's try in England's 19-13 loss to Ireland in Dublin. He said that Mark Cueto scored a perfectly legal try and that he should have gone to the video referee on Josh Lewsey. The match could have been won by England if the referee had used the technology available to him.", "hermes3:3b": "Andy Robinson criticizes two tries denied by official Jonathan Kaplan in Six Nations match against Ireland, claiming he is \"livid\" about non-use of TV replays.", "stablelm-zephyr:3b": "England coach Andy Robinson expressed frustration over his team's 19-13 loss to Ireland in the Six Nations, where they were denied two tries. He specifically criticized South African referee Jonathan Kaplan for not using video replays to determine whether Mark Cueto's and Josh Lewsey's tries were legal. Despite the setback, Robinson praised his players' efforts, highlighting their strong performances by Matt Stevens, Charlie Hodgson, Martin Corry, and Lewis Moody.", "chatgpt-4o-latest": "England coach Andy Robinson was furious after his team was denied two tries in their 19-13 Six Nations loss to Ireland. Mark Cueto's first-half try was ruled offside, and referee Jonathan Kaplan refused to consult the video referee on Josh Lewsey's late effort. Robinson criticized the lack of technology use, insisting both tries were legitimate. Despite the loss, he praised his players' performance, highlighting Matt Stevens, Charlie Hodgson, Martin Corry, Lewis Moody, and Josh Lewsey. England dominated but failed to secure victory, while Ireland defended well and remain strong contenders for the Six Nations title. England has now lost their first three matches in the tournament and four of six under Robinson.", "stablelm2:1.6b": "England coach Andy Robinson is furious after his side was denied two tries during a 6 Nations loss to Ireland, as South African referee Jonathan Kaplan declined the opportunity to consult with the fourth official. Robinson urges the use of technology to rectify the errors and insists that they must adapt to cope with the result. Despite disappointment, England's players dominated the match while Josh Lewsey was praised for his performance.", "granite3.1-dense:2b": "England coach Andy Robinson expressed intense frustration following a 19-13 loss to Ireland in Dublin, citing two crucial denied tries that could have secured victory. The first, involving Mark Cueto, was ruled out due to offside, and the second, possibly scored by Josh Lewsey, was not reviewed despite clear evidence of a try by the fourth official. Robinson criticized the referee's decision not to use video review technology, emphasizing its importance in making correct calls. Despite being disappointed and upset, he praised his players' efforts, particularly Matt Stevens, Charlie Hodgson, Martin Corry, Lewis Moody, and Josh Lewsey, who stood firm under pressure. England has now lost four out of six games since Robinson's appointment in September, with this being their first Three Nations defeat.", "reference": "England coach Andy Robinson insisted he was \"livid\" after his side were denied two tries in Sunday's 19-13 Six Nations loss to Ireland in Dublin.\"We've got to go back to technology.\"I think Mark Cueto scored a perfectly legal try and I think he should have gone to the video referee on Josh Lewsey,\" said Robinson.\"We did everything we could have done to win the game.Kaplan then declined the chance to consult the fourth official when Josh Lewsey took the ball over the Irish line under a pile of bodies for what could have been the game-winning try.England have lost their first three matches in this year's Six Nations and four out of their six games since Robinson took over from Sir Clive Woodward in September.\"We have done everything but win a game of rugby, but Ireland are a good side.They defended magnificently and they've got every chance of winning this Six Nations.\"There's two tries we've been cost,\" Robinson told BBC Sport.South African referee Jonathan Kaplan ruled that Cueto was ahead of Charlie Hodgson when the fly-half hoisted his cross-field kick for the Sale wing to gather."}