{"raw_text": "Newcastle 27-27 Gloucester\n \n Newcastle centre Mathew Tait answered his critics as he scored one try and made another, but he could not stop Gloucester grabbing a draw.\n \n The Falcons were 22-6 down at the break before Tait, recently axed by England after just one Six Nations outing, inspired his side to a 27-22 lead. A last-gasp touchdown from Luke Narraway pulled the visitors level. But Gloucester missed out on victory when Henry Paul fluffed the conversion and Seti Kiole was denied a late try. Newcastle had a couple of chances at the start of the second half with line-outs in the corner. But they failed to make them count until Joe Shaw found Dave Walder, who released Mark Mayerholfer in his own 22.\n \n The former All Black broke clear and popped the ball up for Tait on halfway. He chipped ahead for Michael Stephenson to scorch through for the try, which Walder converted to give Newcastle a lifeline. They grabbed it with both hands, Mayerhofler breaking through and Tait making a brilliant early run to cut inside and race 30m to score. Walder converted to make it 22-20 before he was just wide with a 40m penalty in the 70th minute.\n \n Mayerhofler then scythed through the middle for a try after Hall Charlton popped the ball up, and Walder's conversion took Newcastle 27-22 ahead. With three minutes of normal time left, Narraway was driven over for a try in the corner which levelled the scores at 27-27. Henry missed the conversion but Gloucester nearly won it when Kiole broke through only to be hauled down by Charlton and Tom May.\n \n Walder; May, Tait, Mayerhofler, Stephenson; Wilkinson, Grindal; Isaacson, Long, Ward; Gross, Hamilton; McCarthy, Harris, Dowson.\n \n Replacements: Peel, Wilson, Thompson, Parling, Sititi, Charlton, Shaw.\n \n Goodridge; Garvey, Simpson-Daniel, Fanolua, Kiole; Paul, Gomarsall; Wood, Curnier, Powell; Eustace, Brown; Forrester, Buxton, Balding.\n \n Replacements: Elloway, Sigley, Cornwell, Narraway, Page, Davies, Mauger.\n", "llama3.2:1b": "Newcastle scored 27-22 in a draw against Gloucester at the end of a closely contested match.\n\nMathew Tait led Newcastle's efforts, scoring one try and making another. Luke Narraway pulled the visitors level with a late touchdown.\nGloucester also had chances to win but missed conversions and was denied a try by Seti Kiole.\nNewcastle took advantage of Gloucester's mistakes, particularly at line-outs in the corner where they scored two tries, including one by Joe Shaw.", "llama3.2:3b": "Newcastle Falcons drew 27-27 with Gloucester after trailing 22-6 at halftime. Mathew Tait scored two tries and converted one to inspire his team's comeback, but Gloucester equalized in the final minutes when Luke Narraway was driven over from a corner kick. Henry Paul missed the conversion, and Seti Kiole was denied another try attempt by Tom May.", "gemma2:2b": "Newcastle Falcons drew against Gloucester with a score of 27-27 after Gloucester took the lead in the final minutes.  Mathew Tait scored two tries for Newcastle, but Gloucester were able to tie up the game and nearly win it. \n", "qwen2.5:0.5b": " Newcastle 27-27 Gloucester\n\nIn the match between Newcastle and Gloucestershire, Mathew Tait scored two tries (one for Newcastle and one for Gloucestershire) but couldn't stop Gloucestershire from grabbing a draw. In the second half, Newcastle's line-out attempts were successful, but their chances of scoring were limited as they missed out on winning with Henry Paul missing the conversion and Seti Kiole being denied a late try by Mark Mayerholfer. In the final 3 minutes of the game, Walder converted to make it 27-20 for Newcastle, but Gloucestershire won the match with a score of 27-27.", "qwen2.5:1.5b": "Newcastle ended Gloucester's comeback attempt with a 27-27 draw in the Six Nations match. Newcastle scored two tries after leading 22-6 but were denied victory by missed conversion and late penalty attempts. Key moments included Mathew Tait scoring two tries, Joe Shaw finding Walder for a try, and Walder converting it to 27-22 lead. Gloucester nearly won the game with a final-minute score tied at 27-27 but were ultimately unsuccessful due to missed conversions by Henry Paul and Tom May's late tackle from Kiole.", "qwen2.5:3b": "Newcastle scored a 27-20 lead before Gloucester levelled through Luke Naylor's try and missed two conversion attempts. Henry Paul fluffed his goal-kicks in the final minutes. Newcastle led 27-22 at half-time with tries by Dave Walder, Mark Mayerholfer, and Mathew Tait. Luke Naylor's last-minute try drew Gloucester level 27-27. Gloucester missed a chance to win through Henry Paul's dropped goal-kick, which was not converted despite the score being correct.", "opencoder:1.5b": "Newcastle's performance during the Six Nations defeat by England has marked a dramatic turnaround in the Newcastle Falcons' campaign. The 27-27 lead was achieved through one of Gloucester's unsuccessful attempts to stop the other team (England) from getting their draw. Following that, Tait scored two tries and made another while he remained in possession of the ball. Despite failing to make it count, England managed to grab Gloucester's hand, causing a 22-6 lead.\n\nThe first part of the second half had several attempts at converting goals, but due to Gloucester's inability to stop the England attack, they failed to make any further count. The latter part was more of line-outs and corner kicks that left the scores at 27-27 after a late try by Gloucester. A last-gasp touchdown from Luke Narraway led the Falcons to a level finish.\n\nIn terms of players involved, Stephen Gomarsall stepped in through the middle for Tait on the ball, who made it onto the line and into play. Gloucester also finished up with a late try by Henry Paul flipping the conversion and Kiole being denied a try after Seti Kiole was fluffed.\n\nA normal start left Newcastle at 27-27, but they managed to take it on the final minute when Walder popped the ball up for Tait on the middle of the half. He scored in a try and ended up ahead, then converting to cut inside and race 30m to score. The penalty was a 40m draw by Charlton who converted and gave the game a lifeline.\n\nThe replacements were Peel, Wilson, Thompson, Parling, Sititi, Charlton, Shaw. The substitutes that completed the campaign from 27-27 were Garvey, Fanolua, Kiole, Paul, Gomarsall, Wood, Curnier, Powell, Eustace, Brown, Forrester, Buxton, and Mauger.\n\nOverall, Newcastle faced a difficult campaign, but managed to make it to the Six Nations final with a 27-27 lead.\n", "smollm:1.7b": "The summary should be concise and focus on the main points of the text. The key ideas are that Newcastle 27-27 Gloucester scored one try and inspired his side to a 27-22 lead. They were 22-6 down at the break before Tait, who was recently axed by England after just one Six Nations outing. A last-gasp touchdown from Luke Narraway pulled the visitors level. But they failed to make it count until Joe Shaw found Dave Walder and made him score a try. The former All Black broke clear and popped the ball up for Tait on halfway. He chipped ahead for Michael Stephenson to scorch through for the try, which Walker converted to give Newcastle a lifeline. They grabbed it with both hands, Mayerhofler breaking through and Tait making a brilliant early run to cut inside and race 30m to score. Walder's conversion took Newcastle 27-22 ahead. Henry missed the conversion but Gloucester nearly won it when Kiole broke through only to be hauled down by Charlton and Tom May.\n\nThe summary should preserve key ideas, including:\n\n* The main points of the text: Newcastle 27-27 Gloucester scored one try and inspired his side to a 27-22 lead. They were 22-6 down at the break before Tait, who was recently axed by England after just one Six Nations outing. A last-gasp touchdown from Luke Narraway pulled the visitors level. But they failed to make it count until Joe Shaw found Dave Walder and made him score a try. The former All Black broke clear and popped the ball up for Tait on halfway, which Walker converted to give Newcastle a lifeline. They grabbed it with both hands, Mayerhofler breaking through and Tait making a brilliant early run to cut inside and race 30m to score. Walder's conversion took Newcastle 27-22 ahead. Henry missed the conversion but Gloucester nearly won it when Kiole broke through only to be hauled down by Charlton and Tom May.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely while preserving key ideas and details. Let me read through it carefully first.\n\nThe game is Newcastle 27-27 Gloucester. Newcastle scores a try and another try from Matthew Tait, but he doesn't stop Gloucester from pulling a draw. The Falcons are down by 22-6 at the break. Tait inspires their side to 27-6. He scores a last-gasp TD from Luke Narraway. But Gloucester misses with Henry Paul in the conversion and Seti Kiole fails to score late, denying them victory.\n\nNewcastle has several chances through lineouts in the second half but fail to make it count until Joe Shaw releases Dave Walder, who cuts Mark Mayerholfer into a 27-22 lead. The former All Black's impact is evident from his scoring and contributions throughout the game.\n\nKey points are Newcastle's strong performances, substitutions, and the importance of their players like Tait and Walder. I should keep all these elements but in a concise manner without explanations or formatting.\n</think>\n\nNewcastle 27-27 Gloucester  \nNewcastle scores tries by Matthew Tait to lead a comeback despite Gloucester pulling a draw. Newcastle wins with 27-6 after Narraway's last-gasp TD, failing only to claim victory when Kiole misses late. Key players include Tait (94), Walder (18), and others mentioned in the substitutions section.", "tinyllama:1.1b": "The Newcastle vs Gloucester match ended in a draw with both teams having equal scores at halftime. Newcastle's center Mathieu Tai gave a last-gasp effort and scored the try to grab a 27-27 lead, but Gloucester missed the conversion. The Falcons were the beneficiaries of some good fortune as they had two chances at halftime with line-outs in their end. Despite this, the visitors were unable to capitalize on their opportunities and Newcastle's Mathieu Tai scored a try, followed by Henry Paul's conversion, to give them a 22-20 lead at half-time. The second half was played out with both teams struggling to convert opportunities, while Mayerhofler broke through for the Falcons to score a try and draw the game at 27-27. However, Gloucester's Henry missed a conversion and Newcastle had the final say as they scored a try in the corner to secure a 27-27 draw and take their lead to 40m on penalties before Henry's late miss.", "tinydolphin:1.1b": " Newcastle secured a thrilling victory against Gloucester after Mathew Tait scored one try and made another to pull away a nine-point deficit at halftime in the Six Nations match. This time, the team was led by Luke Narraway, who managed to ignite his side's performance with line-outs and set up a crucial touchdown for Tait. With Gloucester missing several key players, Newcastle relied on its own efforts to secure victory.\n\nThe game saw two tries from Dave Walder and another from Henry Paul, but it was Mathew Tait who came through with the decisive goal. The pressure finally paid off in the second half as Gloucester failed to score, allowing Newcastle to secure a crucial victory over their opponents. Newcastle's performance was undoubtedly aided by the presence of Henry and Dave Walder, while Luke Narraway's leadership played a vital role in leading his team to victory.", "phi:2.7b": " Newcastle scored two tries and tied the game with one minute left in the match against Gloucester at 27-27. Despite a late attempt by their opponents to win, Newcastle was able to secure a draw due to an early try from Michael Stephenson who converted it. The Falcons had some opportunities throughout the first half but couldn't make it count until Shaw found Mark Mayerhofler in the 22nd minute for a brilliant try. Walder's conversion made it 27-22, and Mayerhofler scored another try after Charlton was tackled by Henry Paul, with Walder converting again. In the final minutes of the match, Narraway scored a try which was almost lost due to being pulled down by Charlton. Newcastle missed out on victory when Henry Paul fumbled the conversion attempt and Tom May's conversion attempt also fell short. The key players for Newcastle were Tait, Walker, Stephenson, and Mayerhofler, while their opponents had good replacements such as Elloway, Sigley, Cornwell, and Narraway.\n", "orca-mini:3b": " Newcastle beat Gloucester 27-27 in a thrilling match with two tries from Mathew Tait and a last-gasp try from Joe Shaw. Henry Paul missed a conversion but Gloucester almost won it when Kiole was hauled down by Charlton and Tom May.", "hermes3:3b": "Newcastle and Gloucester ended in a 27-27 draw after Newcastle's Mathew Tait scored two tries.", "stablelm-zephyr:3b": "In a closely contested match, Newcastle and Gloucester ended with a 27-27 draw. Mathew Tait scored one try and made another to inspire his team, but Gloucester managed to regain momentum in the second half. Joe Shaw found Dave Walder who released Mark Mayerhofler for a touchdown, followed by another try from Stephenson. With three minutes left, Luke Narraway's last-gasp touchdown helped Gloucester tie the game at 27-27.", "chatgpt-4o-latest": "Newcastle and Gloucester played to a 27-27 draw in a dramatic match. Gloucester led 22-6 at halftime, but Newcastle's Mathew Tait inspired a comeback, scoring one try and assisting another to help his team take a 27-22 lead. However, Luke Narraway's late try leveled the score, and Henry Paul missed the conversion that could have secured Gloucester's win. Newcastle had earlier chances but failed to capitalize until Tait set up Michael Stephenson for a try. Tait then scored himself, and Mark Mayerhofler added another, with Dave Walder converting. In the final moments, Narraway's try tied the game, and Gloucester nearly won, but Seti Kiole was stopped just short.", "stablelm2:1.6b": "Newcastle and Gloucester played to a draw with the Falcons leading 6-0 at halftime. Mathew Tait inspired Newcastle's comeback by scoring one try and making another. Luke Narraway drove Gloucester to a last-minute equalizer. Despite chances for both teams at the start of the second half, they failed to score until near the end. Michael Stephenson scored a crucial try for Newcastle, followed by breaks from Mark Mayerhofler and Dave Walder. The final moments saw Gloucester nearly winning but held up when Kiole was tackled short of the line.", "granite3.1-dense:2b": "Newcastle and Gloucester played to a 27-27 draw in a closely contested match at Newcastle's stadium. Despite being down 22-6 at halftime, Newcastle rallied with inspirational play from centre Mathew Tait, who scored two tries and made another. Luke Narraway tied the game with a last-minute try for Gloucester when Henry Paul missed the conversion. Key moments included Tait's early brilliant run leading to his first try, Mayerhofler's second try, and Walder's conversions or penalties that kept Newcastle ahead at 27-20 and then 27-22. Gloucester nearly won it but Kiole was stopped just short in the final minutes.", "reference": "Mayerhofler then scythed through the middle for a try after Hall Charlton popped the ball up, and Walder's conversion took Newcastle 27-22 ahead.But Gloucester missed out on victory when Henry Paul fluffed the conversion and Seti Kiole was denied a late try.He chipped ahead for Michael Stephenson to scorch through for the try, which Walder converted to give Newcastle a lifeline.With three minutes of normal time left, Narraway was driven over for a try in the corner which levelled the scores at 27-27.Henry missed the conversion but Gloucester nearly won it when Kiole broke through only to be hauled down by Charlton and Tom May.Newcastle centre Mathew Tait answered his critics as he scored one try and made another, but he could not stop Gloucester grabbing a draw.Walder; May, Tait, Mayerhofler, Stephenson; Wilkinson, Grindal; Isaacson, Long, Ward; Gross, Hamilton; McCarthy, Harris, Dowson."}