{"raw_text": "London Irish 19-33 Wasps\n \n Wasps made light of the absence of several internationals to sink London Irish with a trio of second-half tries.\n \n Rob Hoadley returned to haunt his old club at the Madejski Stadium, scoring the opening try in the 43rd minute. Tom Voyce powered through the Irish defence for Wasps' second try before Richard Birkett went over unchallenged. Mark van Gisbergen added 18 points. Irish replied with three penalties and a Mark Mapletoft drop goal before Scott Staniforth ran in a consolation try. Barry Everitt, who replaced Mapletoft late in the game, added the conversion to become the fourth Premiership player to reach 1,000 points. He joins Jonny Wilkinson, Tim Stimpson and Paul Grayson in achieving that target. Wasps piled on the pressure in an attempt to grab a fourth try which would have secured them a bonus point, but they were denied by some desperate defending from Irish. Director of rugby Warren Gatland revealed that harsh words at half-time inspired his Wasps side to raise their game after the restart.\n \n \"They got a roasting and it was a good second-half performance when they came out and played to instructions,\" he said. Gatland also singled out stand-in flankers Tom Rees and John Hart for special praise. \"They did very well. The back row played some fantastic rugby,\" he added. London Irish coach Gary Gold felt the result exposed his side's lack of consistency.\n \n Irish trailed by just two points at the break and Gold said: \"For 55 minutes we lived with the best but we have got to get back for the full 80 minutes.\" Gold will now turn his attention to next week's Powergen Cup semi-final at struggling Leeds. \"We've got a good chance but with Leeds facing possible relegation they're going to come out firing,\" he added.\n \n Horak, Staniforth, Penney, Nordt, Bishop; Mapletoft, Edwards; Hatley, van der Walt, Hardwick; Kennedy, Casey; Gustard, Dawson, Murphy.\n \n Replacements: Everitt for Mapletoft (53), Hodgson for Edwards (77), Wheatley for Hatley (71), Paice for van der Walt (60), Strudwick for Kennedy (60), Danaher for Gustard (66), Reid for Murphy (47)\n \n Van Gisbergen; Voyce, Erinle, Hoadley, Roberts; King, Richards; Payne, Greening, Dowd; Shaw, Purdy; Hart, Rees, Dallaglio.\n \n Replacements: Priscott for Roberts (71), Green for Dowd (71), Skivington for Shaw (71), Birkett for Hart (57), Gotting for Rees (39). Not used: Fury, Brooks\n", "llama3.2:1b": "London Irish scored a consolation try through Mark van Gisbergen and later Scott Staniforth. The Wasps team made light of the absence of several internationals to score three tries. Rob Hoadley's second-half tries were crucial in securing Wasps' victory. London Irish trailed by just two points at halftime but looked shaky after being reduced to 11 men.", "llama3.2:3b": "Wasps defeated London Irish 19-33 with three second-half tries. Rob Hoadley scored the opening try, and Tom Voyce and Richard Birkett followed with their own tries. Mark van Gisbergen scored 18 points for Wasps, while London Irish replied with penalties and a drop goal. Barry Everitt became the fourth Premiership player to reach 1,000 points after adding the conversion for a consolation try by Scott Staniforth.", "gemma2:2b": "Wasps defeated London Irish 33-19. Rob Hoadley scored the opening try for Wasps and Mark van Gisbergen added 18 points.  Barry Everitt became the fourth Premiership player to reach 1000 points for Wasps.\nLondon Irish responded with penalties and a drop goal. Scott Staniforth scored a consolation try, while  Mark Mapletoft's replacement Barry Everitt added the conversion and brought up his 1000th point.  \nTheir Coach Gary Gold expressed disappointment that they failed to deliver a consistent performance. The coach will focus on their next match in the Powergen Cup semi-final against struggling Leeds.   \n\n", "qwen2.5:0.5b": "London Irish defeated Wasps by a margin of 12 points at the Madejski Stadium. The visitors were led by Tom Voyce with two tries and three penalties while London Irish had four. The match drew to a close when Martin Van Gisbergen scored his first try of the season, but Jack Erskine's goal proved too much for Wasps as they were unable to score another point. ITV commentator Warren Gatland praised both sides after the game. He said that Wasps' defensive struggles contributed to their defeat and pointed out Tom Rees, John Hart and stand-in flanker Tom Van Gisbergen were among his team's standout players. ITV coach Gary Gold feels that Ireland had a good second-half performance but is worried about the future as they face relegation in the Premiership. ITV director of rugby Warren Gatland praised Wasps' back row and their defensive efforts while adding that Ireland lacked consistency this half-time break. ITV coach Gold will focus on next week's Powergen Cup semi-final, which is at Leeds. ITV captain Martin Van Gisbergen scored his first try of the season for London Irish but Jack Erskine's goal proved too much for Wasps to score. ITV commentator Warren Gatland praised both sides after the game.", "qwen2.5:1.5b": "Wasps defeated London Irish 19-33, scoring three second-half tries after internationals were unavailable. Rob Hoadley scored in the first half and Tom Voyce later added two more. Wasps won with 27 points, while Irish had 20. Mark van Gisbergen contributed 18 points for Wasps, becoming the fourth player to reach 1,000 points in Premiership history. Gatland praised Rees and Hart's performances, noting improvements after halftime. Irish coach Gary Gold felt his team needed more consistent play but will focus on next week's Powergen Cup semi-final against Leeds.", "qwen2.5:3b": "London Irish lost to Wasps 19-33. Rob Hoadley scored the opening try for Wasps in the 43rd minute. Tom Voyce and Richard Birkett added tries in the second half. Mark van Gisbergen contributed 18 points, including a drop goal. London Irish replied with three penalties and a drop goal by Mark Mapletoft. Scott Staniforth scored a consolation try, while Barry Everitt became the fourth player to reach 1,000 Premiership points. Wasps tried to secure a bonus point but were denied. Head coach Warren Gatland praised his team's second-half performance after harsh words at half-time. Gary Gold of London Irish felt their consistency issues led to the loss and is focusing on next week’s Powergen Cup semi-final against struggling Leeds.", "opencoder:1.5b": "The text provides a summary of the game between the team of Wasps and their coach, who scored three tries in their first-half.\n\nIt mentions that Rob Hoadley returned to haunt his old club at the Madejski Stadium after scoring the opening try. Tom Voyce powered through the Irish defence for Wasps' second try before Richard Birkett went over unchallenged. Mark van Gisbergen added 18 points. Afterwards, three penalties and a Mark Mapletoft drop goal preceded Scott Staniforth running in a consolation try. Barry Everitt, who replaced Mapletoft late in the game, became the fourth Premiership player to reach 1,000 points. He joined Jonny Wilkinson, Tim Stimpson and Paul Grayson.\n\nThe team scored two points at the break and Irish coach Gary Gold praised them for a good second-half performance when they came out. They then got back for the full 80 minutes of the game but were denied due to some desperate defending.\n\nAt the end of the season, next week's Powergen Cup semi-final against struggling Leeds was won by their strong team. The results exposed their lack of consistency and allowed them to get back for the full 55 minutes of the season.\n", "smollm:1.7b": "The summary is concise and to the point. It captures the main ideas of the text while omitting unnecessary details. The key points are highlighted in bold. The summary is written in a neutral tone, without any explanations or justifications.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely while preserving key ideas and details. Let me read through the provided text first.\n\nThe main events are about a match between London Irish and Wasps from 19-33. Wasps made it hard for London Irish by missing some players in the second half. London Irish had an interesting performance where Paul Gray, their coach, said they were lacking consistency.\n\nI notice that Key points include Wasps' high-scoring, substitutions, the final scores, and specific substitutions mentioned. I should focus on these elements without going into too much detail about every player or substitution.\n\nI need to make sure my summary includes the main players, the outcome, key substitutions, and any notable substitutions like Horak's goal and Mapletoft's drop goal.\n\nPutting it all together, I'll structure the summary with the match details, the main substitution highlights (Horak and Mapletoft), and the substitutions that follow in each team.\n</think>\n\nLondon Irish 19-33 Wasps  \nWasps made a hard-fought match against London Irish at 19-33. Wasps scored three tries, including a standout goal by Horak and a crucial drop goal by Mapletoft. London Irish failed to score the second try in the second half due to an absence of international players. The game concluded with Paul Gray joining the ranking of Premiership players reaching 1,000 points, becoming the fourth such player. Wasps piled pressure, but their substitutions showed strong performances: Rees and Hart for the back row, van der Walt and Paice, Rees and Dallaglio, and Hatley and Priscott. London Irish's coach, Gary Gold, highlighted inconsistencies in the team's play.", "tinyllama:1.1b": "The LONDON IRISH 19-33 Wasps defeated the London Irish by a score of 33-19 in their Premier 15s match at the Madejski Stadium on Saturday. The visitors made the best use of their opportunities and scored three tries within the final 20 minutes to secure a crucial victory. LONDON IRISH captain Rob Hoadley was instrumental in securing the win, scoring the opening try for Wasps before Tom Voycé scored two penalties and another drop goal for his side. The match was marked by some passionate comments from Wasps Director of Rugby Warren Gauld on harsh words at half-time that inspired his team to raise their game after the restart. London Irish coach Gary Gold admitted they struggled to find consistency in their play, while LONDON IRISH captain Rob Hoadley praised his side's back row for playing some fantastic rugby. The match will now be a fixture in the Powergen Cup semi-final at LeeDS, while Wasps will face London Irish next week to continue their Premiership title defense.", "tinydolphin:1.1b": " London Irish won against Wasps with a score of 32-18. The game was marred by several absences due to international trials, with Rob Hoadley scoring the opening try and Tom Voyce adding two more tries. Wasps tried to gain momentum in the second half but couldn't do so. London Irish finished with 5 players and Wasps with 10. Both teams will meet again in the league on November 18.", "phi:2.7b": " The text discusses a rugby match between London Irish and Wasps. After a tough half-time, Wasps scored three tries to take the lead in a close game. However, the loss of several international players did not seem to affect London Irish's performance. The score was 22-22 at halftime, but Wasps scored two more tries in the second half to win 24-22. Despite their efforts, London Irish were unable to catch up and their coach criticized his team for lacking consistency. On the other hand, Wasps' coach praised the team's determination and defensive skills. The game was played with only six international players on each team, highlighting the current situation in English rugby due to various reasons such as injuries and suspensions.\n", "orca-mini:3b": " London Irish were defeated by a strong Wasps side with a score of 19-33. Rob Hoadley returned to haunt his old club at the Madejski Stadium, scoring the opening try in the 43rd minute. Tom Voyce powered through the Irish defence for Wasps' second try before Richard Birkett went over unchallenged. Mark van Gisbergen added 18 points. Barry Everitt became the fourth Premiership player to reach 1,000 points, and John Hart also performed well. However, they failed to grab a bonus point, which would have secured them a win. Gary Gold felt that the result exposed his side's lack of consistency. The match was preceded by some harsh words at half-time, which inspired Wasps' second-half performance.", "hermes3:3b": "Wasps beat London Irish 33-19 in rugby match, with Wasps scoring three tries in second half. Barry Everitt became fourth Premiership player to reach 1000 points.", "stablelm-zephyr:3b": "Wasps defeated London Irish with a trio of second-half tries in the absence of several internationals. Rob Hoadley scored the opening try at the Madejski Stadium, followed by Tom Voyce and Richard Birkett's tries. Mark van Gisbergen added 18 points for Wasps. London Irish responded with three penalties and a drop goal before Scott Staniforth's consolation try. Director of rugby Warren Gatland attributed their second-half performance to harsh words at half-time, while London Irish coach Gary Gold acknowledged his team's lack of consistency.", "chatgpt-4o-latest": "Wasps defeated London Irish 33-19 despite missing several internationals, scoring three second-half tries. Rob Hoadley opened the scoring against his former club, followed by tries from Tom Voyce and Richard Birkett. Mark van Gisbergen contributed 18 points. London Irish responded with three penalties, a Mark Mapletoft drop goal, and a late Scott Staniforth try, converted by Barry Everitt, who became the fourth Premiership player to reach 1,000 points. Wasps pushed for a fourth try to secure a bonus point but were denied by Irish's defense. Wasps' director of rugby Warren Gatland credited a halftime talk for their improved second-half performance and praised flankers Tom Rees and John Hart. London Irish coach Gary Gold acknowledged his team's inconsistency, noting they competed well for 55 minutes but needed to sustain their performance for the full match. He shifted focus to their upcoming Powergen Cup semi-final against Leeds.", "stablelm2:1.6b": "The Wasps defeated the London Irish with a trio of second-half tries, despite missing several international players. Rob Hoadley scored the opening try in the first minute, followed by Tom Voyce and Richard Birkett. Mark van Gisbergen added points for the Wasps. The Irish replied with three penalties and a Mark Mapletoft drop goal before Scott Staniforth scored a consolation try. Barry Everitt joined Jonny Wilkinson, Tim Stimpson, and Paul Grayson in scoring 1,000+ points as the fourth player to achieve that target. Warren Gatland praised Tom Rees and John Hart for their performance. London Irish coach Gary Gold felt his team's lack of consistency was exposed.", "granite3.1-dense:2b": "Wasps secured a 19-33 victory over London Irish at the Madejski Stadium, despite missing several international players. Key contributors to Wasps' scoring were Rob Hoadley, Tom Voyce, and Richard Birkett, who each scored tries in the second half. Mark van Gisbergen added 18 points for Wasps. London Irish responded with three penalties, a drop goal from Mapletoft, and a consolation try by Scott Staniforth. Barry Everitt became the fourth Premiership player to reach 1,000 points in the game. After receiving a halftime pep talk, Wasps' performance improved significantly, with standout performances from Tom Rees and John Hart in the back row. Director of rugby Warren Gatland praised these players and the team's ability to execute post-half-time instructions. London Irish coach Gary Gold acknowledged his side's lack of consistency, emphasizing the need for a full 80-minute effort. The match ended with Leeds potentially facing relegation, which adds pressure to their upcoming Powergen Cup semi-final against them.", "reference": "Replacements: Everitt for Mapletoft (53), Hodgson for Edwards (77), Wheatley for Hatley (71), Paice for van der Walt (60), Strudwick for Kennedy (60), Danaher for Gustard (66), Reid for Murphy (47)  Van Gisbergen; Voyce, Erinle, Hoadley, Roberts; King, Richards; Payne, Greening, Dowd; Shaw, Purdy; Hart, Rees, Dallaglio.Tom Voyce powered through the Irish defence for Wasps' second try before Richard Birkett went over unchallenged.Irish trailed by just two points at the break and Gold said: \"For 55 minutes we lived with the best but we have got to get back for the full 80 minutes.\"Mark van Gisbergen added 18 points.Irish replied with three penalties and a Mark Mapletoft drop goal before Scott Staniforth ran in a consolation try.Wasps piled on the pressure in an attempt to grab a fourth try which would have secured them a bonus point, but they were denied by some desperate defending from Irish.Wasps made light of the absence of several internationals to sink London Irish with a trio of second-half tries.Barry Everitt, who replaced Mapletoft late in the game, added the conversion to become the fourth Premiership player to reach 1,000 points.The back row played some fantastic rugby,\" he added."}