{"raw_text": "Murray returns to Scotland fold\n \n Euan Murray has been named in the Scotland training squad after an eight-week ban, ahead of Saturday's Six Nations match with Ireland.\n \n The Glasgow forward's ban for stamping ended on 2 February. \"I'm just happy to be back playing and be involved with the squad,\" said Murray on Monday. \"Hopefully I can get a couple of games under my belt and I might have a chance of playing later in the Six Nations. I'm just glad to be part of it all.\"\n \n Backs: Mike Blair (Edinburgh Rugby), Andy Craig (Glasgow Rugby), Chris Cusiter (The Borders), Simon Danielli (The Borders), Marcus Di Rollo (Edinburgh Rugby), Phil Godman (Edinburgh Rugby), Calvin Howarth (Glasgow Rugby), Ben Hinshelwood (Worcester Warriors), Andrew Henderson (Glasgow Rugby), Rory Lamont (Glasgow Rugby), Sean Lamont (Glasgow Rugby), Dan Parks (Glasgow Rugby), Chris Paterson (Edinburgh Rugby), Gordon Ross (Leeds Tykes), Hugo Southwell (Edinburgh Rugby), Simon Webster (Edinburgh Rugby) Forwards: Ross Beattie (Northampton Saints), Gordon Bulloch (captain, Glasgow Rugby), David Callam (Edinburgh Rugby), Bruce Douglas (The Borders), Jon Dunbar (Leeds Tykes), Iain Fullarton (Saracens), Stuart Grimes (Newcastle Falcons), Nathan Hines (Edinburgh Rugby), Allister Hogg (Edinburgh Rugby), Gavin Kerr (Leeds Tykes), Nick Lloyd (Saracens), Scott Lawson (Glasgow Rugby), Euan Murray (Glasgow Rugby), Scott Murray (Edinburgh Rugby), Jon Petrie (Glasgow Rugby), Robbie Russell (London Irish), Tom Smith (Northampton Saints), Jason White (Sale Sharks).\n", "llama3.2:1b": "Euan Murray returns to Scotland's training squad after an eight-week ban. He was named alongside other players who were previously banned for disciplinary reasons, including Mike Blair and Gordon Ross.", "llama3.2:3b": "Euan Murray has been named in the Scotland training squad ahead of Saturday's Six Nations match with Ireland, after an eight-week ban for stamping.", "gemma2:2b": "Euan Murray has been named in the Scotland training squad after an eight-week suspension for stamping. He is hoping to return to playing and potentially feature in later Six Nations matches. \n", "qwen2.5:0.5b": "Murray returns to Scotland for the Six Nations match against Ireland. He played in the Glasgow forward's ban and is currently part of the team that will face England next Saturday.", "qwen2.5:1.5b": "Euan Murray returns to Scotland's Six Nations squad following an eight-week ban, named ahead of a match against Ireland. He is praised for being \"happy\" to be back playing and involved with the squad. The new forwards list includes notable names like Jon Petrie, who will join Robbie Russell from London Irish.", "qwen2.5:3b": "Euan Murray returns to Scotland's training squad after an eight-week ban, ahead of the Six Nations match against Ireland. The Glasgow forward is eager to play in upcoming matches and hopes for a chance later in the tournament. The full list includes backs and forwards named, with Murray as the only new addition from his return to the team following a suspension for stamping.", "opencoder:1.5b": "Euan Murray has been named in the Scotland training squad after an eight-week ban, ahead of Saturday's Six Nations match with Ireland.\n\nMurray returns to Scotland fold. \"I'm just happy to be back playing and be involved with the squad,\" said Murray on Monday. Hopefully I can get a couple of games under my belt and I might have a chance of playing later in the Six Nations.\n\nBacks: Mike Blair (Edinburgh Rugby), Andy Craig (Glasgow Rugby), Chris Cusiter (The Borders), Simon Danielli (The Borders), Marcus Di Rollo (Edinburgh Rugby), Phil Godman (Edinburgh Rugby), Calvin Howarth (Glasgow Rugby), Ben Hinshelwood (Worcester Warriors), Andrew Henderson (Glasgow Rugby), Rory Lamont (Glasgow Rugby), Sean Lamont (Glasgow Rugby), Dan Parks (Glasgow Rugby), Chris Paterson (Edinburgh Rugby), Gordon Ross (Leeds Tykes), Hugo Southwell (Edinburgh Rugby), Simon Webster (Edinburgh Rugby).\nForwards: Ross Beattie (Northampton Saints), Gordon Bulloch (captain, Glasgow Rugby), David Callam (Edinburgh Rugby), Bruce Douglas (The Borders), Jon Dunbar (Leeds Tykes), Iain Fullarton (Saracens), Stuart Grimes (Newcastle Falcons), Nathan Hines (Edinburgh Rugby), Allister Hogg (Edinburgh Rugby), Gavin Kerr (Leeds Tykes), Nick Lloyd (Saracens), Scott Lawson (Glasgow Rugby), Euan Murray (Glasgow Rugby), Scott Murray (Edinburgh Rugby), Jon Petrie (Glasgow Rugby), Robbie Russell (London Irish), Tom Smith (Northampton Saints), Jason White (Sale Sharks).\n", "smollm:1.7b": "Murray returns to Scotland fold after eight-week ban", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text. Let's read through it carefully.\n\nMurray is returning to Scotland training after an eight-week ban for a sticker incident. The Six Nations match against Ireland is on Saturday. He was named in the squad and hasn't been playing for two weeks yet. His comments say he's happy back and looking forward to more games, hoping to play later. Backs include several Edinburgh and Glasgow players, forwards have a bunch too.\n\nI should focus on his return status, the ban duration, why it happened (stamping), his upcoming match, and the team composition.\n</think>\n\nMurray returns to Scotland training after an eight-week ban for a sticker incident ahead of Saturday's Six Nations match with Ireland. He's named in the squad and hasn't been active for two weeks. Murray is happy to be back playing and plans more games. His team includes Mike Blair, Andy Craig, Chris Cusiter, Simon Danielli, Marcus Di Rollo, Phil Godman, Calvin Howarth, Ben Hinshelwood, Andrew Henderson, Rory Lamont, Sean Lamont, Dan Parks, Gordon Ross, Hugo Southwell, Simon Webber, Ross Beattie, Gordon Bulloch (captain), David Callam, Bruce Douglas, Jon Dunbar, Iain Fullarton, Stuart Grimes, Nathan Hines, Allister Hogg, Gavin Kerr, Nick Lloyd, Scott Lawson, Euan Murray, Scott Murray, Jon Petrie, Robbie Russell, Tom Smith, and Jason White.", "tinyllama:1.1b": "Euan Murray, who served an eight-week ban for stamping, returns to Scotland's training squad ahead of the Six Nations match with Ireland. Murray had been expected to be included in the matchday 23 and will now have a chance to play later in the tournament if he is involved in any of the upcoming matches. The Glasgow forward was named in the squad on Monday, just hours before kick-off against Ireland at the Stade de France in Paris.", "tinydolphin:1.1b": " Scotland rugby player Euan Murray has been named in the training squad ahead of the upcoming Six Nations match against Ireland, with a three-week suspension ending on February 2. The forward is looking to get back into the fold for the competition and potentially feature later in the tournament. \"I'm just glad to be part of it all,\" said Murray. \"Hopefully, I can get a couple of games under my belt and get ready for this big occasion.\" Backs: Mike Blair (Edinburgh Rugby), Andy Craig (Glasgow Rugby), Chris Cusiter (The Borders), Simon Danielli (The Borders), Marcus Di Rollo (Edinburgh Rugby), Phil Godman (Edinburgh Rugby), Calvin Howarth (Glasgow Rugby), Ben Hinshelwood (Worcester Warriors), Andrew Henderson (Glasgow Rugby), Rory Lamont (Glasgow Rugby), Sean Lamont (Glasgow Rugby), Dan Parks (Glasgow Rugby), Chris Paterson (Edinburgh Rugby), Gordon Ross (Leeds Tykes), Hugo Southwell (Edinburgh Rugby), Simon Webster (Edinburgh Rugby) Forwards: Ross Beattie (Northampton Saints), Gordon Bulloch (captain, Glasgow Rugby), David Callam (Edinburgh Rugby), Bruce Douglas (The Borders), Jon Dunbar (Leeds Tykes), Iain Fullarton (Saracens), Stuart Grimes (Newcastle Falcons), Nathan Hines (Edinburgh Rugby), Allister Hogg (Edinburgh Rugby), Gavin Kerr (Leeds Tykes), Nick Lloyd (Saracens), Scott Lawson (Glasgow Rugby), Euan Murray (Glasgow Rugby), Scott Murray (Edinburgh Rugby), Jon Petrie (Glasgow Rugby), Robbie Russell (London Irish), Tom Smith (Northampton Saints), Jason White (Sale Sharks).", "phi:2.7b": " Euan Murray, a Glasgow forward, was named in the Scotland training squad after an eight-week ban for stamping ended on 2 February. He hopes to get some games under his belt before playing in the Six Nations.\n", "orca-mini:3b": " Murray returns to Scotland training squad after eight-week ban, ahead of Ireland match. He is one of eight players who were banned for stamping and returned to the fold on February 2nd. The Glasgow forward's ban was lifted.", "hermes3:3b": "Euan Murray re-joins Scotland squad.", "stablelm-zephyr:3b": "Euan Murray, a Glasgow forward, has been included in the Scotland training squad after an eight-week ban. He expressed his happiness in being back playing and potentially participating in future Six Nations matches. The text also lists various players and their respective teams.", "chatgpt-4o-latest": "Euan Murray has been named in Scotland's training squad after serving an eight-week ban for stamping, ahead of their Six Nations match against Ireland. The Glasgow forward expressed his happiness at returning and hopes to play later in the tournament. The squad includes a mix of backs and forwards from various clubs, with Gordon Bulloch as captain.", "stablelm2:1.6b": "Glasgow's Euan Murray returns to Scotland fold as he is named in the training squad ahead of the upcoming Six Nations match with Ireland. The eight-week ban for stamping ended on February 2nd, and Murray expressed his happiness at being back playing and involved with the squad. He hopes to earn a chance to play later in the Six Nations tournament.", "granite3.1-dense:2b": "Euan Murray, a Glasgow forward, has been reinstated into the Scotland national rugby team's training squad following an eight-week ban for a stamping offense, which concluded on February 2. Murray expressed his excitement about returning to play and being part of the Six Nations match against Ireland. The backs and forwards in the squad are:\n\nBacks: Mike Blair (Edinburgh), Andy Craig (Glasgow), Chris Cusiter (The Borders), Simon Danielli (The Borders), Marcus Di Rollo (Edinburgh), Phil Godman (Edinburgh), Calvin Howarth (Glasgow), Ben Hinshelwood (Worcester Warriors), Andrew Henderson (Glasgow), Rory Lamont (Glasgow), Sean Lamont (Glasgow), Dan Parks (Glasgow), Chris Paterson (Edinburgh), Gordon Ross (Leeds Tykes), Hugo Southwell (Edinburgh), Simon Webster (Edinburgh).\n\nForwards: Ross Beattie (Northampton), Gordon Bulloch (captain, Glasgow), David Callam (Edinburgh), Bruce Douglas (The Borders), Jon Dunbar (Leeds Tykes), Iain Fullarton (Saracens), Stuart Grimes (Newcastle Falcons), Nathan Hines (Edinburgh), Allister Hogg (Edinburgh), Gavin Kerr (Leeds Tykes), Nick Lloyd (Saracens), Scott Lawson (Glasgow), Euan Murray (Glasgow), Scott Murray (Edinburgh), Jon Petrie (Glasgow), Robbie Russell (London Irish), Tom Smith (Northampton), Jason White (Sale Sharks).", "reference": "\"I'm just happy to be back playing and be involved with the squad,\" said Murray on Monday.Euan Murray has been named in the Scotland training squad after an eight-week ban, ahead of Saturday's Six Nations match with Ireland.The Glasgow forward's ban for stamping ended on 2 February."}