{"raw_text": "Munster Cup tie switched to Spain\n \n Munster's Heineken Cup quarter-final tie against Biarritz on 3 April has been switched to Real Sociedad's Paseo de Anoeta stadium in San Sebastian.\n \n Real's ground holds 32,000 whereas the Parc des Sports Aguilera in Biarritz has a capacity of just 12,667. The Irish province will be given at least 8,000 tickets. \"The decision to move was a difficult one, but as we considered the fans as one of our primary objectives,\" said Biarritz chairman Marcel Martin. \"We hope we will be rewarded as a huge crowd behaving in the best rugby tradition.\" The match will be the first Heineken Cup fixture to be played in Spain, and is expected to attract the biggest-ever attendance for a rugby match in the country. Ulster were the last Irish team to play at the Paseo de Anoeta stadium where they faced a Euskarians side during a pre-season tour in 1998.\n", "llama3.2:1b": "Munster's Heineken Cup quarter-final tie is switching from Biarritz to Real Sociedad's stadium in San Sebastian due to capacity concerns.", "llama3.2:3b": "Munster's Heineken Cup quarter-final tie against Biarritz has been switched from Parc des Sports Aguilera in Biarritz to Real Sociedad's Paseo de Anoeta stadium in San Sebastian with the match taking place on April 3. The Irish province will receive at least 8,000 tickets and this will be the first Heineken Cup fixture played in Spain.", "gemma2:2b": "Munster's Heineken Cup quarter-final against Biarritz will be played at Real Sociedad's Paseo de Anoeta stadium in San Sebastian, Spain on April 3rd. The match will have the capacity of 32,000 while Biarritz's stadium holds only 12,667. Munster will receive a ticket allocation of at least 8,000.  \n", "qwen2.5:0.5b": "Real Sociedad's Paseo de Anoeta stadium in San Sebastian will host Munster's Heineken Cup quarter-final against Biarritz on 3 April, with the Irish province to be given at least 8,000 tickets for a crowd of up to 32,000. The stadium has a capacity of only 12,667 and will feature an audience number of 32,000.", "qwen2.5:1.5b": "Biarritz's Heineken Cup tie against Munster has been moved to Real Sociedad's Paseo de Anoeta, with the Irish province receiving at least 8,000 tickets and fans hoping for a large attendance. The change is considered as Biarritz prioritizes its fans' experience despite the diminished venue capacity. This will be the first Heineken Cup match in Spain.", "qwen2.5:3b": "Munster's Heineken Cup quarter-final tie against Biarritz has been switched from Biarritz to Real Sociedad’s Paseo de Anoeta stadium in San Sebastian due to the larger capacity of 32,000 compared to Biarritz's 12,667. The switch was made with fan consideration in mind by Biarritz chairman Marcel Martin. This will be the first Heineken Cup fixture played in Spain and is expected to attract a record-breaking attendance. Ulster previously played at this stadium in 1998 during a pre-season tour against an Euskarian side.", "opencoder:1.5b": "Munster Cup tie switched to Spain \n\nMunster's Heineken Cup quarter-final tie against Biarritz on 3 April has been switched to Real Sociedad's Paseo de Anoeta stadium in San Sebastian.\n\nReal's ground holds 32,000 whereas the Parc des Sports Aguilera in Biarritz has a capacity of just 12,667. The Irish province will be given at least 8,000 tickets. \"The decision to move was a difficult one, but as we considered the fans as one of our primary objectives,\" said Biarritz chairman Marcel Martin. \"We hope we will be rewarded as a huge crowd behaving in the best rugby tradition.\" The match will be the first Heineken Cup fixture to be played in Spain, and is expected to attract the biggest-ever attendance for a rugby match in the country. Ulster were the last Irish team to play at the Paseo de Anoeta stadium where they faced a Euskarians side during a pre-season tour in 1998.\n", "smollm:1.7b": "The Munster Cup tie was switched to Spain because of Real Sociedad's ground holds and Biarritz's capacity. The Irish province will be given at least 8,000 tickets for the match. The decision to move was a difficult one but as we considered the fans as one of our primary objectives, it is expected that they will behave in the best rugby tradition.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text about a rugby match switch from Munster to Real Sociedad. Let me read through it carefully.\n\nFirst, the main event is a Heineken Cup tie against Biarritz on April 3rd. It's being moved to Real Sociedad's stadium in San Sebastian instead of their previous home, Paseo de Anoeta. Okay, so that changes the location for both teams and fans.\n\nI notice that Real Sociedad has a bigger stadium with 32,000 seats compared to Biarritz's only 12,667. That's a significant difference in capacity. They're giving at least 8,000 tickets, so maybe they have a backup plan if the main game doesn't sell out.\n\nThe text mentions that this is the first Heineken Cup match in Spain since Real did it in 1998 when they played against Ulster. That adds context about why they're moving the game to Spain—likely because they want more attendance or better hosting.\n\nThe other important point is that Real was last an Irish team at Paseo de Anoeta, having last faced them during a pre-season in 1998. So this switch makes sense for them as well.\n\nIn terms of key ideas, the main points are: switch location to Spanish Stadium; change in venue and capacity; Real getting a larger crowd with backup tickets; first Heineken Cup match in Spain since last home game; Real being last Irish team at Paseo de Anoeta. These points need to be included concisely in the summary.\n\nI should keep it plain text without explanations or any formatting. Just the summary as a sentence or two, making sure each key point is included clearly.\n</think>\n\nThe Heineken Cup quarter-final between Munster and Biarritz on April 3 will switch venue to Real Sociedad's Paseo de Anoeta Stadium in San Sebastian. Real has a capacity of 32,000, while Biarritz's Parc des Sports Aguilera can only hold 12,667. Real's team is guaranteed at least 8,000 tickets. This move marks the first Heineken Cup match in Spain since Real did so in 1998 when they last faced an Irish team there during their pre-season tour. Real was the last Irish team to play at Paseo de Anoeta Stadium last year, which explains the decision to adjust the venue.", "tinyllama:1.1b": "Munster's Heiniken Cup quarter-final tie against Biarritz has been switched to Real Sociedad's Pasa de Anoeata stadium in San Sebastian, with a capacity of just 12,667. The match is set to attract a massive crowd, as Ulster were the last Irish team to play there during a pre-season tour in 1998.", "tinydolphin:1.1b": " A decision has been made to switch the Munster Cup tie between Biarritz and Munster to a stadium in San Sebastian, Spain. The match will be the first Heineken Cup fixture to take place in Spain and is expected to attract the biggest-ever attendance for a rugby match in the country.", "phi:2.7b": " Munster's Heineken Cup quarter-final tie against Biarritz has been moved from their home ground, Parkhouse Park, to Real Sociedad's Paseo de Anoeta stadium in San Sebastian due to capacity constraints at the original venue and the desire to attract a large crowd of rugby fans.\n", "orca-mini:3b": " Munster's Heineken Cup quarter-final tie against Biarritz has been switched to Real Sociedad's Paseo de Anoeta stadium in San Sebastian, Spain. The match will be the first Heineken Cup fixture to take place in Spain and is expected to attract the biggest-ever attendance for a rugby match in the country.", "hermes3:3b": "Munster Heineken Cup quarter-final vs Biarritz moved to San Sebastian's Real Sociedad stadium, due to smaller capacity of Biarritz ground; expected largest rugby attendance in Spain.", "stablelm-zephyr:3b": "Munster's Heineken Cup quarter-final tie against Biarritz has been moved to Real Sociedad's Paseo de Anoeta stadium in San Sebastian due to a capacity difference between the two venues. Real Sociedad's ground has 32,000 seats compared to Biarritz' Parc des Sports Aguilera with 12,667 seats. The match is expected to attract the largest-ever attendance for a rugby game in Spain. Munster will receive at least 8,000 tickets. This will be the first Heineken Cup fixture played in Spain.", "chatgpt-4o-latest": "Munster's Heineken Cup quarter-final against Biarritz on 3 April has been moved to Real Sociedad's Paseo de Anoeta stadium in San Sebastian, which holds 32,000, compared to Biarritz's 12,667-capacity ground. Munster will receive at least 8,000 tickets. Biarritz chairman Marcel Martin said the decision was difficult but aimed at accommodating more fans. This will be the first Heineken Cup match in Spain and is expected to set a national attendance record for rugby. The last Irish team to play at the venue was Ulster in 1998.", "stablelm2:1.6b": "The Heineken Cup quarter-final game between Munster and Biarritz has been moved from Ireland to Spain's Real Sociedad stadium due to the latter's smaller capacity. The match will take place on 3 April, with at least 8 tickets for Irish players going to Spain. This is the first Heineken Cup fixture in Spain, expected to attract the largest rugby audience ever seen there. Previously, Ulster faced a similar opponent during a pre-season tour when they played against Euskarians at the same stadium in 2017.", "granite3.1-dense:2b": "Munster's Heineken Cup quarter-final against Biarritz, scheduled for April 3, has been relocated from the smaller Parc des Sports Aguilera in Biarritz (capacity 12,667) to Real Sociedad's Paseo de Anoeta stadium in San Sebastian (32,000 capacity). This change was made primarily to accommodate Munster fans better. Biarritz chairman Marcel Martin expressed hope for a massive crowd emulating rugby tradition. The event marks the first Heineken Cup match in Spain and is anticipated to draw the largest rugby crowd in Spanish history, surpassing Ulster's 1998 pre-season encounter at the same venue.", "reference": "Munster's Heineken Cup quarter-final tie against Biarritz on 3 April has been switched to Real Sociedad's Paseo de Anoeta stadium in San Sebastian.Ulster were the last Irish team to play at the Paseo de Anoeta stadium where they faced a Euskarians side during a pre-season tour in 1998.Real's ground holds 32,000 whereas the Parc des Sports Aguilera in Biarritz has a capacity of just 12,667."}