{"raw_text": "Pountney handed ban and fine\n \n Northampton coach Budge Pountney has been fined £2,000 and banned from match-day coaching for six weeks for calling a referee \"a disgrace\".\n \n Pountney was found guilty of bringing the game into disrepute at a Rugby Football Union disciplinary hearing in London on Thursday night. Pountney criticised referee Steve Lander's performance in Northampton's defeat by Saracens on 5 February. The last two weeks of the six-week ban are suspended. Pountney pleaded guilty to the offence before a panel consisting of chairman Robert Horner, Nigel Gillingham and Jeff Probyn. The ban means former Scotland international Pountney cannot enter the playing enclosure, technical areas or go near the touchline, tunnel or players and officials' areas on the day of a game.\n", "llama3.2:1b": "Budge Pountney has been fined £2,000 and banned from match-day coaching for six weeks after calling referee Steve Lander \"a disgrace\" at a Rugby Football Union disciplinary hearing in London.", "llama3.2:3b": "Budge Pountney fined £2,000, banned for 6 weeks from match-day coaching after criticizing referee Steve Lander's performance.", "gemma2:2b": "Northampton coach Budge Pountney was fined £2,000 and banned from match-day coaching for six weeks after calling a referee \"a disgrace\". \n", "qwen2.5:0.5b": "Here is a concise summary of the text:\n\nNorthampton coach Budge Pountney was fined £2,000 and banned from match-day coaching for six weeks for calling a referee \"a disgrace\". He had earlier been found guilty at a disciplinary hearing in London. The ban on attending game areas suspended for the next two weeks.", "qwen2.5:1.5b": "Pountney fined £2,000 and banned from coaching for six weeks due to calling referee \"disgraceful\" in match against Saracens.", "qwen2.5:3b": "Northampton coach Budge Pountney was fined £2,000 and banned from match-day coaching for six weeks after being found guilty of bringing the game into disrepute during Northampton's defeat by Saracens in February. He criticized referee Steve Lander, leading to a Rugby Football Union disciplinary hearing where he pleaded guilty before a panel including chairman Robert Horner. The ban prevents Pountney from entering the playing enclosure and technical areas on match days for six weeks, with the last two weeks suspended.", "opencoder:1.5b": "Pountney handed a fine of £2,000 and banned from match-day coaching for six weeks due to calling a referee \"a disgrace\".\nThe previous hearing at the Rugby Football Union disciplinary hearing in London on Thursday night found Pountney guilty of bringing the game into disrepute.\nThe ban means former player Pountney cannot enter the playing enclosure, technical areas or go near the touchline, tunnel or players and officials' areas on the day of a game. The last two weeks of the six-week ban are suspended.\nPountney pleaded guilty to this offence before a panel consisting of chairman Robert Horner, Nigel Gillingham and Jeff Probyn.\n", "smollm:1.7b": "Pountney handed Ban and fine for calling referee \"a disgrace\"", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely. Let me read through it first.\n\nPountney gave a penalty for calling a referee \"a disgrace\" in Northampton's match-day coaching ban. He was fined £2,000 and banned for six weeks. Then, those six weeks were suspended, and he's now on a six-week suspension with no games affected except the last two weeks where he wasn't playing. He's guilty of bringing the game into disrepute after winning against Saracens in February.\n\nHmm, I need to capture all these points: his penalty, the duration, the suspension, why he was guilty, and the consequences on his activities during a game. I should make sure not to add any extra details but keep it precise.\n\nLet me try to structure this: mention his penalty, the six-week ban, which became a six-week suspension, who he's banned from, who is panel, etc. Make sure it's clear and concise.\n</think>\n\nPountney was fined £2,000 and suspended for six weeks for calling a referee \"a disgrace.\" He was guilty of bringing the game into disrepute after Northampton won against Saracens in February. This resulted in him being banned from match-day coaching for the last two weeks but not affecting future games.", "tinyllama:1.1b": "Pountney handed ban and fine for calling referee \"a disgrace\"", "tinydolphin:1.1b": " Pountney handed ban and fine - Northampton coach Budge Pountney has been fined £2,000 and banned from match-day coaching for six weeks for calling a referee \"a disgrace\". The offence occurred during the Northampton's 5th February match against Saracens. Pountney criticized the referee's performance, leading to his suspension from coaching the team.", "phi:2.7b": " Former Scottish rugby player Budge Pountney was fined £2,000 and banned from match-day coaching for six weeks after calling referee Steve Lander \"a disgrace\" during Northampton' defeat by Saracens on 5 February. The ban includes being forbidden to enter the playing enclosure, technical areas or go near the touchline, tunnel, or players and officials' areas on the day of a game.\n", "orca-mini:3b": " Northampton coach Budge Pountney was fined £2,000 and banned from coaching on matchday for six weeks. He criticized referee Steve Lander's performance in their defeat by Saracens on 5 February, calling him a \"disgrace.\"", "hermes3:3b": "Budge Pountney banned for 6 weeks & fined £2000 for calling referee \"disgrace\", during Rugby Football Union disciplinary hearing.", "stablelm-zephyr:3b": "Northampton coach Budge Pountney was fined £2,000 and banned from match-day coaching for six weeks for calling a referee \"a disgrace.\" He was found guilty of bringing the game into disrepute at a Rugby Football Union disciplinary hearing in London. The ban includes not being able to enter the playing enclosure, technical areas, or be near the touchline, tunnel, or players and officials' areas during games.", "chatgpt-4o-latest": "Northampton coach Budge Pountney has been fined £2,000 and banned from match-day coaching for six weeks, with the last two weeks suspended, for calling referee Steve Lander \"a disgrace\" after a defeat to Saracens. He was found guilty of bringing the game into disrepute at an RFU disciplinary hearing, where he pleaded guilty. The ban prohibits him from entering the playing enclosure, technical areas, touchline, tunnel, or players and officials' areas on match days.", "stablelm2:1.6b": "Northampton coach Budge Pountrey was fined £2 and banned from match-day coaching for six weeks after calling a referee \"a disgrace\" during a match against Saracens in February. He was found guilty of bringing the game into disrepute at a Rugby Football Union disciplinary hearing. Pountney can no longer enter technical areas or near the touchline, tunnel, or players and officials' areas on game days.", "granite3.1-dense:2b": "Northampton's coach, Budge Pountney, was fined £2,000 and barred from match-day coaching for six weeks by the Rugby Football Union due to his criticism of referee Steve Lander's performance in a February 5 game against Saracens. The ban, with two weeks suspended, prevents Pountney from entering playing areas or interacting with players and officials on match days. He pleaded guilty at a London disciplinary hearing before a panel, which included chairman Robert Horner, Nigel Gillingham, and Jeff Probyn.", "reference": "Northampton coach Budge Pountney has been fined £2,000 and banned from match-day coaching for six weeks for calling a referee \"a disgrace\".Pountney criticised referee Steve Lander's performance in Northampton's defeat by Saracens on 5 February.Pountney was found guilty of bringing the game into disrepute at a Rugby Football Union disciplinary hearing in London on Thursday night."}