{"raw_text": "Leeds v Saracens (Fri)\n \n Headingley\n \n Friday, 25 February\n \n 2000 GMT\n \n The Tykes have brought in Newcastle prop Ed Kalman and Tom McGee from the Borders on loan while fly-half Craig McMullen has joined from Narbonne. Raphael Ibanez is named at hooker for Saracens in one of four changes. Simon Raiwalui and Ben Russell are also selected in the pack while Kevin Sorrell comes in at outside centre.\n \n - Friday's game at Headingley got the go-ahead on Friday after passing an early pitch inspection. Leeds: Balshaw; Rees, Christophers, Bell, Doherty; McMullen, Dickens; McGee, Rawlinson, Gerber; Murphy, Palmer (capt), Morgan, Parks, Popham. Replacements: Kalman, Regan, Hyde, Rigney, McMillan, Rock, Vickerman. Saracens: Bartholomeusz; Castaignede, Sorrell, Harris, Vaikona; Jackson, Bracken; Yates, Ibanez, Visagie; Raiwalui, Fullarton; Randell, Russell, Vyvyan (capt). Replacements: Cairns, Lloyd, Broster, Chesney, Johnston, Rauluni, Little.\n", "llama3.2:1b": "Leeds played Leeds v Saracens at Headingley on Friday, 25 February 2000. The match got the go-ahead after passing an early pitch inspection. Key players included Leeds' Craig McMullen and Tom McGee, as well as Raphael Ibanez at hooker for Saracens, while Simon Raiwalui and Ben Russell were also selected in the pack.", "llama3.2:3b": "Leeds have made four changes to their squad for the game against Saracens on Friday, with Newcastle's Ed Kalman and Tom McGee joining from the Borders on loan, while Craig McMullen joins from Narbonne. Saracens make four changes, including Raphael Ibanez at hooker.", "gemma2:2b": "Leeds Tykes vs Saracens at Headingley on Friday, February 25th, 2000 GMT.  Leeds roster includes Ed Kalman and Tom McGee on loan, with Craig McMullen joining from Narbonne.  Saracens make four changes with Raphael Ibanez named as hooker, Simon Raiwalui and Ben Russell selected, along with Kevin Sorrell at outside center. \n", "qwen2.5:0.5b": "The Tykes have made some changes to their roster for the upcoming match at Headingley against Saracens on 25 February, including replacements named for the pack and hooker positions.", "qwen2.5:1.5b": "Leeds Rugby hosts Saracens in a Friday fixture at Headingley. Leeds brings new players including Kalman and McGee on loan from Newcastle and Narbonne for the match. New Zealand hooker Ibanez replaces Bartholomeusz as Saracens' starting ninth man with Raiwalui at outside centre.", "qwen2.5:3b": "Leeds v Saracens (Fri)\nHeadingley  \nFriday, 25 February  \n2000 GMT\n\nLeeds have brought in Ed Kalman and Tom McGee on loan, and Craig McMullen from Narbonne. Raphael Ibanez is selected as hooker for Saracens among four changes. Simon Raiwalui and Ben Russell are also included in the pack. Kevin Sorrell plays outside centre.\n\nSaracens: Bartholomeusz; Castaignede, Sorrell, Harris, Vaikona; Jackson, Bracken; Yates, Ibanez, Visagie; Raiwalui, Fullarton; Randell, Russell, Vyvyan (capt).\n\nLeeds: Balshaw; Rees, Christophers, Bell, Doherty; McMullen, Dickens; McGee, Rawlinson, Gerber; Murphy, Palmer (capt), Morgan, Parks, Popham. Replacements: Kalman, Regan, Hyde, Rigney, McMillan, Rock, Vickerman.\n\nSaracens: Castaignede, Sorrell, Harris, Vaikona; Jackson, Bracken; Yates, Ibanez, Visagie; Raiwalui, Fullarton; Randell, Russell, Vyvyan (capt). Replacements: Cairns, Lloyd, Broster, Chesney, Johnston, Rauluni, Little.", "opencoder:1.5b": "The output text summarizes the following key ideas and details:\n\n1. The game at Headingley got the go-ahead on Friday.\n2. Leeds had a total of 9 players including Newcastle prop Ed Kalman and Tom McGee from the Borders on loan while fly-half Craig McMullen has joined from Narbonne.\n3. Raphael Ibanez was named at hooker for Saracens in one of four changes by the captain.\n4. Simon Raiwalui and Ben Russell are also selected in the pack.\n5. Kevin Sorrell comes in at outside centre with replacements.\n", "smollm:1.7b": "Leeds v Saracens (Fri)\nThe Tykes have brought in Newcastle prop Ed Kalman and Tom McGee from the Borders on loan while fly-half Craig McMullen has joined from Narbonne. Raphael Ibanez is named at hooker for Saracens in one of four changes. Simon Raiwalui and Ben Russell are also selected in the pack while Kevin Sorrell comes in at outside centre.\n\nThe Tykes have brought in Newcastle prop Ed Kalman and Tom McGee from the Borders on loan while fly-half Craig McMullen has joined from Narbonne. The Tykes: Balshaw; Rees, Christophers, Bell, Doherty; McMillan, Dickens; McGee, Rawlinson, Gerber; Murphy, Palmer (capt), Morgan, Parks, Popham. Replacements: Kalman, Regan, Hyde, Rigney, McMillan, Rock, Vickerman. Saracens: Bartholomeusz; Castaignede, Sorrell, Harris, Vaikona; Jackson, Bracken; Yates, Ibanez, Visagie; Raiwalui, Fullarton; Randell, Russell, Vyvyan (capt). Replacements: Cairns, Lloyd, Broster, Chesney, Johnston, Rauluni, Little.", "deepseek-r1:1.5b": "<think>\nOkay, so the user has given me a query where they want a summary of a football match between Leeds and Saracens. The text is pretty detailed with dates, teams, players, and some statistics. They specifically asked for just the summary in plain text without any explanations or formatting.\n\nFirst, I need to parse through the provided text carefully. The main event is a match on Friday, 25 February, 2000 GMT at Headingley. Leeds have brought in Kalman and McGee from the Borders and McMullen from Narbonne. Saracens are adjusting their starting lineups with new players like Ibanez and Raiwalui.\n\nI should focus on the key points: which teams played, when, where; who substituted which players from each team; and a bit about the players themselves—like names and positions. Also, note that Leeds were the underdog but had a strong lineup, while Saracens had a mix of experienced and young players.\n\nI need to make sure I capture all these details without adding any extra information or explanations. The summary should be concise, only capturing what's essential for someone reading it quickly.\n</think>\n\nLeeds v Saracens (Fri)  \nHeadingley  \nFriday, 25 February, 2000 GMT  \nLeeds brought in Newcastle prop Ed Kalman and Tom McGee from the Borders on loan, while fly-half Craig McMullen joined Narbonne. Saracens named Raphael Ibanez as hooker, with Simon Raiwalui, Ben Russell, and Kevin Sorrell in the pack, replacing acaptain.  \n\n- Leeds had Balshaw; Rees, Christophers, Bell, Doherty; McMullen, Dickens; McGee, Rawlinson, Gerber; Murphy, Palmer (capt), Morgan, Parks, Popham. Replacements: Kalman, Regan, Hyde, Rigney, McMillan, Rock, Vickerman.  \n- Saracens had Bartholomeusz; Castaignede, Sorrell, Harris, Vaikona; Jackson, Bracken; Yates, Ibanez, Visagie; Raiwalui, Fullarton; Randell, Russell, Vyvyan (capt). Replacements: Cairns, Lloyd, Broster, Chesney, Johnston, Rauluni, Little.", "tinyllama:1.1b": "Summary of Headington Oxford vs St Albans City FC match on Friday, 25 February 2019, at HQ Stadium, Leeds:\n\nHeadingley, GMT. Headington Oxford and St Albans City face off in the second round of National League North with the Tykes in the lead by one point after a 4-3 win over Newcastle United Pro. The hosts have Kalman and McGee on loan from Narbonne while fly-half Craig McMullein joins from Narbonne on loan. Five changes are made to matchday lineups.\n\nHeadline: Saracens face off against Headington Oxford in the second round of National League North with a lead of one point after a 4-3 victory over Newcastle United Pro. Kalman, McGee and McMullein join from Narbonne while Vaikona, Bracken, Johnston and Litlte replace. Saracens lineup is the same as their last matchday against Cinderford Town FC.", "tinydolphin:1.1b": " Leeds United have secured a late victory against Saracens, with Ed Kalman, Tom McGee and Craig McMullen joining from Newcastle on loan. Raphael Ibanez starts at hooker for Saracens in the fourth change of the game. Simon Raiwalui and Ben Russell also play in the pack, while Kevin Sorrell comes in at outside centre. The match takes place at Headingley, kicking off at 20:00 GMT.", "phi:2.7b": " Leeds and Saracens play at Headingley on Friday, with Newcastle prop Ed Kalman and Tom McGee joining Leeds on loan from Borders. Craig McMullen also switches to Saracens after leaving Narbonne. There are no other changes to the starting line-up for either team.\n", "orca-mini:3b": " Leeds and Saracens played on Friday at Headingley with the permission of the referee after passing an early pitch inspection. The Tykes started with Balshaw, Rees, Christophers, Bell, Doherty, McMullen, McGee, Rawlinson, Gerber, Murphy, Palmer (capt), Morgan, Parks, Popham and replaced them with Kalman, Regan, Hyde, Rigney, McMillan, Rock, Vickerman. Saracens had Bartholomeusz, Castaignede, Sorrell, Harris, Vaikona, Jackson, Bracken, Yates, Ibanez, Visagie, Raiwalui, Fullarton, Randell, Russell, Vyvyan (capt). Replacements were Cairns, Lloyd, Broster, Chesney, Johnston, Rauluni, Little. The teams played in the 2000 GMT on February 23rd.", "hermes3:3b": "Leeds v Saracens rugby match details\n* Date: Fri, 25 Feb 2000\n* Venue: Headingley\n* Ref time: 2000 GMT\n* Players changes for Leeds and Saracens.", "stablelm-zephyr:3b": "Leeds vs Saracens, Friday 25 February, Headingley - early pitch inspection successful. Leeds make several new signings while Saracens replace a few players in their lineup. Both teams are ready for the match.", "chatgpt-4o-latest": "Leeds Tykes have signed Newcastle prop Ed Kalman and Tom McGee from the Borders on loan, along with fly-half Craig McMullen from Narbonne. Saracens have made four changes, including Raphael Ibanez at hooker, Simon Raiwalui and Ben Russell in the pack, and Kevin Sorrell at outside centre. The match at Headingley on Friday was confirmed after an early pitch inspection. Team line-ups for both Leeds and Saracens were announced, with captains Palmer and Vyvyan leading their respective sides.", "stablelm2:1.6b": "Leeds and Saracens face off at Headingley on Friday in a game that includes several changes for both teams. The Tykes make four alterations with Ed Kalman, Tom McGee, Craig McMullen, and Raphael Ibanez joining from Newcastle, Narbonne, and the Borders respectively. Saracens also make four changes with Kevin Sorrell coming in at outside centre. Both teams pass an early pitch inspection for Friday's game.", "granite3.1-dense:2b": "Leeds and Saracens are set to face each other in a match at Headingley on Friday, 25 February, 2000 GMT. Leeds' lineup includes new additions Ed Kalman (Newcastle prop), Tom McGee (from the Borders), and Craig McMullen (Narbonne fly-half). Saracens' team sees Raphael Ibanez at hooker, with Simon Raiwalui and Ben Russell in the forwards, and Kevin Sorrell at outside center. The game was confirmed after a successful pitch inspection on the same day.\n\nLeeds: Balshaw, Rees, Christophers, Bell, Doherty; McMullen, Dickens; McGee, Rawlinson, Gerber; Murphy, Palmer (capt), Morgan, Parks, Popham. Replacements: Kalman, Regan, Hyde, Rigney, McMillan, Rock, Vickerman.\n\nSaracens: Bartholomeusz, Castaignede, Sorrell, Harris, Vaikona; Jackson, Bracken; Yates, Ibanez, Visagie; Raiwalui, Fullarton; Randell, Russell, Vyvyan (capt). Replacements: Cairns, Lloyd, Broster, Chesney, Johnston, Rauluni, Little.", "reference": "Saracens: Bartholomeusz; Castaignede, Sorrell, Harris, Vaikona; Jackson, Bracken; Yates, Ibanez, Visagie; Raiwalui, Fullarton; Randell, Russell, Vyvyan (capt).Headingley  Friday, 25 February  2000 GMT  The Tykes have brought in Newcastle prop Ed Kalman and Tom McGee from the Borders on loan while fly-half Craig McMullen has joined from Narbonne.Replacements: Kalman, Regan, Hyde, Rigney, McMillan, Rock, Vickerman.Simon Raiwalui and Ben Russell are also selected in the pack while Kevin Sorrell comes in at outside centre."}