{"raw_text": "England coach faces rap after row\n \n England coach Andy Robinson is facing disciplinary action after criticising referee Jonathan Kaplan in his side's Six Nations defeat to Ireland.\n \n The Rugby Football Union (RFU) will investigate Robinson after deciding not to lodge a complaint against Kaplan. Robinson may even have to apologise for his comments in order to avoid sanction from the International Rugby Board. Robinson had said he was \"livid\" about Kaplan's decisions on Saturday to disallow two England \"tries.\" The England coach went on to claim that \"only one side was refereed\".\n \n After reviewing tapes of the match, the RFU decided not to formally complain to the IRB over the standard of Kaplan's refereeing. Instead the RFU said in a statement they would, \"set out any concerns the England team management may have in a confidential manner\".\n \n An IRB spokesman said on the matter: \"We take all breaches of the code very seriously. \"Should the RFU resolve the issue to our satisfaction, as happened last month when the Scotland coach Matt Williams apologised for remarks made, it would be the end of the matter.\"\n \n Kaplan has vigorously defended his performance in England's 19-13 defeat at Landsdowne Road and admitted he was \"very disappointed\" with Robinson's remarks. And the South African has been appointed to take charge of Scotland's match against Wales on 13 March.\n \n The RFU recently fined Northampton coach Budge Pountney £2,000 and imposed a six-week ban for his criticism of referee Steve Lander after a Premiership match.\n", "llama3.2:1b": "England coach Andy Robinson faces disciplinary action from the Rugby Football Union (RFU) for criticising referee Jonathan Kaplan in the Six Nations defeat to Ireland. The RFU will investigate, potentially requiring Robinson to apologise or face further sanction if he is found to have breached code standards.", "llama3.2:3b": "Andy Robinson faces disciplinary action from the International Rugby Board (IRB) for criticizing referee Jonathan Kaplan in England's Six Nations defeat to Ireland, potentially requiring an apology to avoid sanctions.", "gemma2:2b": "England coach Andy Robinson was investigated by the RFU after criticizing referee Jonathan Kaplan during England's loss to Ireland. The RFU will not lodge a formal complaint against Kaplan but may require Robinson to apologize to avoid sanction from the IRB. \nThe RFU intends to address their concerns with Robinson confidentially.  Kaplan defended his performance and has been appointed for Scotland vs Wales match.  The RFU previously fined coach Budge Pountney for criticizing referee Steve Lander. \n", "qwen2.5:0.5b": "England Rugby Football Union (RFU) disciplinary body Andy Robinson faces disciplinary action for criticizing referee Jonathan Kaplan in the Six Nations defeat to Ireland, potentially resulting in sanctions from both the RFU and IRB. He may have to apologise for his comments if the RFU does not lodge a complaint against Kaplan. The RFU has decided to set up an investigation to examine Robinson's actions, with possible consequences ranging from disciplinary action to immediate release. Budge Pountney, a former Northampton coach who criticized referee Steve Lander in an earlier match, received a six-week ban and a fine of £2, 000 following his criticism of Kaplan at the Premiership match against Scotland.", "qwen2.5:1.5b": "England coach Andy Robinson faces disciplinary action following comments criticizing referee Jonathan Kaplan in the Six Nations defeat to Ireland. The Rugby Football Union (RFU) will investigate Robinson's allegations about flawed refereeing decisions, potentially leading to an apology or further sanctions from the International Rugby Board. Kaplan has defended his performance and been appointed as a Scotland coach for Wales.", "qwen2.5:3b": "England coach Andy Robinson faces disciplinary action after criticizing referee Jonathan Kaplan following their Six Nations defeat to Ireland. The Rugby Football Union decided not to lodge a complaint against Kaplan but will investigate Robinson's comments, which included claiming only one side was refereed fairly. While the RFU stated they would address concerns confidentially, an IRB spokesman warned against breaches of the code. Kaplan has defended his performance and was appointed to referee Scotland's match against Wales. Northampton coach Budge Pountney received a fine and suspension for criticizing a different referee in a previous match.", "opencoder:1.5b": "England coach Andy Robinson is facing disciplinary action after criticising the referee in England's Six Nations defeat to Ireland.\n\nThe RFU will investigate Robinson after deciding not to lodge a complaint against the former England player. He may even have to apologise for his comments as part of their \"livid\" approach towards the Irish match.\n\nOn Saturday, the England coach went on to claim that only one side was covered by refereeing and he had said he was \"very livid\" about the decisions made by other players.\n\nAfter reviewing the game's records, the RFU decided not to formally complain to the International Rugby Board. Instead, they stated in a statement that they would, \"set out any concerns the England team management may have in a confidential manner\".\n\nAn IRB spokesman confirmed on the matter: \"We take all breaches of the code very seriously. If the RFU resolves the issue to our satisfaction, it would be the end of this matter.\"\n", "smollm:1.7b": "The summary should be: England coach Andy Robinson is facing disciplinary action after criticizing referee Jonathan Kaplan in his side's Six Nations defeat to Ireland. The Rugby Football Union (RFU) will investigate Robinson after deciding not to lodge a complaint against Kaplan. Robinson may even have to apologise for his comments in order to avoid sanction from the International Rugby Board. Robinson had said he was \"livid\" about Kaplan's decisions on Saturday to disallow two England \"tries.\" The England coach went on to claim that \"only one side was refereed\".\nAfter reviewing tapes of the match, the RFU decided not to formally complain to the IRB over the standard of Kaplan's refereeing. Instead the RFU said in a statement they would, \"set out any concerns the England team management may have in a confidential manner\". An IRB spokesman said on the matter: \"We take all breaches of the code very seriously. Should the RFU resolve the issue to our satisfaction, as happened last month when the Scotland coach apologised for remarks made, it would be the end of the matter.\" Kaplan has vigorously defended his performance in England's 19-13 defeat at Landsdowne Road and admitted he was \"very disappointed\" with Robinson's remarks. And the South African has been appointed to take charge of Scotland's match against Wales on 13 March. The RFU recently fined Northampton coach Budge Pountney £2,000 and imposed a six-week ban for his criticism of referee Steve Lander after a Premiership match.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely while preserving key ideas and details.\n\nFirst, the main event is England's coach Andy Robinson facing disciplinary action because he criticized referee Jonathan Kaplan in their 2019 Six Nations win against Ireland. \n\nKey points:\n- England Coach Andy Robinson faces disciplinary action.\n- Criticism of referee Jonathan Kaplan from England’s side.\n- RFU will investigate Robinson after not complying with his complaint against Kaplan.\n- Robinson might have to apologize if suspended or face further action.\n- Robinson stated he was \"livid\" about Lapointe's decisions to disallow two tries.\n- The investigation is based on the match details and other factors.\n- The IRB later mentioned it would end the matter if they resolved it satisfactorily last time (like when Williams apologized).\n- Kaplan's performance was praised, and he has been appointed for Scotland.\n\nI should focus on the main elements: Robinson facing disciplinary action, criticism of Lapointe, IRU investigation, possible apologies, mention of the ban and financial fine, and mention of Lapointe's past criticisms.\n</think>\n\nEngland Coach Andy Robinson faces disciplinary action after criticizing referee Jonathan Lapointe during a 2019 Six Nations win. The Rugby Football Union (RFU) will investigate Robinson after not complying with his complaint against Lapointe. Robinson might have to apologize for his comments, facing further action if suspended or faced more discipline. Lapointe has been appointed for Scotland and has praised the referee's work. The IRB mentioned ending a matter last time when someone apologized, but it hasn't happened in England yet.", "tinyllama:1.1b": "England coach Andy Robinson is facing disciplinary action after criticizing the referee's decision to disallow two England trials in their Six Nations defeat to Ireland. The RuGBY Football Union (RFU) decided not to file a formal complaint against him, instead deciding to conduct an internal review of the match and set out any concerns the England team management may have in a confidential manner. The IRB speaker noted that breaches of the code could lead to disciplinary action, but Kaplan defended his performance during the game and admitted being \"very disappointed\" by Robinson's comments. Scotland coach Matt Williams apologized for remarks made after the match and is set to take charge of Wales' upcoming match on 13 March. The RFU recently fined Northampton head coach Budge Poyntney £2,000 and imposed a six-week ban for his criticism of referee Steve Lander.", "tinydolphin:1.1b": " England coach Andy Robinson is facing disciplinary action after criticizing referee Jonathan Kaplan in the Six Nations match against Ireland. The Rugby Football Union (RFU) will investigate Robinson's comments, and if they deem him guilty, he may be forced to apologize for his criticism. If Robinson does not accept the decision of the RFU, he could face formal complaint to the International Rugby Board. However, it appears that Kaplan has defended his performance and admitted that only one side was refereed in the match against England. The RFU is handling this matter confidentially for now, but if the team managers choose to take matters further into their own hands, they could potentially end up facing an IRB ban.", "phi:2.7b": " England coach Andy Robinson is facing disciplinary action for criticizing referee Jonathan Kaplan in their Six Nations defeat to Ireland. However, the Rugby Football Union (RFU) decided not to lodge a complaint against Kaplan and may even require Robinson to apologize to avoid sanction from the International Rugby Board. The RFU will communicate any concerns with the England team management in confidentiality. Referee Kaplan defended his performance despite a fine imposed on Northampton coach Budge Pountney for criticizing him during a Premiership match.\n", "orca-mini:3b": " England coach Andy Robinson faced disciplinary action after criticizing referee Jonathan Kaplan in the Six Nations defeat to Ireland. The RFU will investigate him, and he may have to apologize for his comments. However, the IRB spokesperson said they would take all breaches of the code very seriously. Kaplan defended his performance, and the South African has been appointed to take charge of Scotland's match against Wales on March 13th. The RFU recently fined Northampton coach Budge Pountney £2,000 and imposed a six-week ban for his criticism of referee Steve Lander after a Premiership match.", "hermes3:3b": "England-coach faces disciplinary action after criticizing ref Jonathan Kaplan in rugby game.", "stablelm-zephyr:3b": "England coach Andy Robinson faces disciplinary action for criticizing referee Jonathan Kaplan following the Six Nations defeat to Ireland. The Rugby Football Union (RFU) will investigate Robinson and may require an apology to avoid sanction from the International Rugby Board. Despite initial concerns, the RFU decided not to formally complain against Kaplan's refereeing. Kaplan, a South African, defended his performance and was later appointed for Scotland's match against Wales on March 13th.", "chatgpt-4o-latest": "England coach Andy Robinson faces disciplinary action for criticizing referee Jonathan Kaplan after England's Six Nations loss to Ireland. The RFU will investigate Robinson but will not file a complaint against Kaplan. Robinson may need to apologize to avoid sanctions from the IRB. He had expressed anger over Kaplan's decisions, claiming only one side was refereed. The RFU, after reviewing the match, chose to address concerns privately. The IRB emphasized the seriousness of such breaches but may close the matter if resolved satisfactorily. Kaplan defended his officiating and was disappointed by Robinson's remarks. The RFU has previously fined and banned coaches for similar offenses.", "stablelm2:1.6b": "England coach Andy Robinson faces disciplinary action due to his criticism of referee Jonathan Kaplan during England's Six Nations defeat to Ireland. The Rugby Football Union will investigate, but has decided not to lodge a formal complaint against Kaplan. If Robinson apologizes, the International Rugby Board may lift the sanction. Kaplan defended his performance and has been appointed to lead Scotland's match against Wales on March 2nd. Northampton coach Budge Pountney received a £2 fine and a six-week ban for criticizing referee Steve Lander in a Premiership match.", "granite3.1-dense:2b": "England rugby coach Andy Robinson is under investigation by the Rugby Football Union (RFU) following critical remarks about referee Jonathan Kaplan post-match in their Six Nations defeat to Ireland. The RFU decided not to lodge a formal complaint with the International Rugby Board (IRB), instead intending to address concerns confidentially. Robinson expressed dissatisfaction with two potential tries being disallowed and accused Kaplan of \"only one side being refereed.\"\n\nThe IRB emphasizes that they take breaches of their code seriously, and should the RFU resolve the issue satisfactorily, as in the case of Matt Williams' apology for similar remarks last month, the matter would be closed. Kaplan has strongly defended his performance and expressed disappointment with Robinson's comments. He is now set to oversee Scotland's match against Wales on March 13.\n\nIn a related incident, Northampton coach Budge Pountney received a £2,000 fine and a six-week ban for criticizing referee Steve Lander following a Premiership game.", "reference": "Robinson had said he was \"livid\" about Kaplan's decisions on Saturday to disallow two England \"tries.\"England coach Andy Robinson is facing disciplinary action after criticising referee Jonathan Kaplan in his side's Six Nations defeat to Ireland.Instead the RFU said in a statement they would, \"set out any concerns the England team management may have in a confidential manner\".The Rugby Football Union (RFU) will investigate Robinson after deciding not to lodge a complaint against Kaplan.The England coach went on to claim that \"only one side was refereed\"."}