{"raw_text": "Wilkinson return 'unlikely'\n \n Jonny Wilkinson looks set to miss the whole of the 2005 RBS Six Nations.\n \n England's World Cup-winning fly-half said last week he was hoping to recover from his latest injury in time to play some role in the championship. But Rob Andrew, coach of Wilkinson's club side Newcastle, said that with only two games left to play Wilkinson was unlikely to be fit in time. \"It would be irresponsible to put him straight into a Test match,\" Andrew told the Times. Wilkinson is recovering from a knee injury which followed long-term neck and arm injuries. He has not played for England since the World Cup final in November 2003, since when the stuttering world champions have lost nine of their 14 matches. Wilkinson is aiming to make his third start to the season in the Zurich Premiership match against Harlequins on 13 March.\n \n That game is the day after England play Italy in the Six Nations and six days before their final match of the championship against Scotland. \"We are hoping Jonny will be ready in a fortnight, but it is touch and go,\" said Andrew. \"His recovery is going very well and the key now is how he is reintroduced to playing and with it goal-kicking. \"He will probably have to come off the bench to start and it would be ridiculous and irresponsible to put him straight back into a Test match. \"We can't afford to get it wrong with a knee injury. We are in touch with England and they are relaxed about it.\" Despite not playing for England, Wilkinson is still hoping to make the Lions tour to New Zealand this summer. Lions coach Sir Clive Woodward has not set a deadline for when Wilkinson has to start playing again in order to be considered for selection.\n", "llama3.2:1b": "Jonny Wilkinson's injury is unlikely to allow him to play in the 2005 RBS Six Nations or potentially the final match against Scotland, with Newcastle coach Rob Andrew saying he is \"touch and go\" with a recovery time of two weeks or less.", "llama3.2:3b": "Jonny Wilkinson's recovery from injury makes him unlikely to play in the 2005 RBS Six Nations, with Newcastle coach Rob Andrew stating that putting him straight into a Test match would be irresponsible.", "gemma2:2b": "Jonny Wilkinson is unlikely to play in all six matches of the 2005 RBS Six Nations due to a knee injury. He may return as soon as March but will likely make his starting comeback from the bench, and it's uncertain if he'll be fully game-ready for England's crucial matches.  Wilkinson is hoping to make the Lions tour this summer. \n", "qwen2.5:0.5b": "England's Jonny Wilkinson might miss the Six Nations tournament, but he remains hopeful of making his return despite the injury. Wilkinson's recovery is going well and he will probably have to come off the bench during the tour to New Zealand.", "qwen2.5:1.5b": "Jonny Wilkinson will miss all of the 2005 RBS Six Nations due to an injury, and his recovery is uncertain. He previously missed England's World Cup-winning team but is now aiming to play in a Premiership match against Harlequins. The coach is optimistic he'll be ready for the final Six Nations game against Scotland on June 3, with six days until that match and two more games remaining before it.", "qwen2.5:3b": "Jonny Wilkinson is expected to miss the entire 2005 RBS Six Nations due to a knee injury following long-term neck and arm injuries. Newcastle coach Rob Andrew believes it would be irresponsible to put Wilkinson back into action before he's fully recovered, despite his hope to play in a Premiership match against Harlequins on March 13. This could affect England’s tournament schedule, with their next matches coming up quickly. Although recovering well, Wilkinson may need to start slowly and potentially from the bench. Despite this setback, Wilkinson remains hopeful for the Lions tour to New Zealand this summer.", "opencoder:1.5b": "\"England's World Cup-winning fly-half said last week he was hoping to recover from his latest injury in time to play some role in the championship.\"\n\"Rob Andrew, coach of Wilkinson's club side Newcastle, said that with only two games left to play Wilkinson was unlikely to be fit in time. \"It would be irresponsible to put him straight into a Test match,\" Andrew told the Times.\"\n\"Andrew said that Wilkinson is recovering from a knee injury which followed long-term neck and arm injuries. He has not played for England since the World Cup final in November 2003, since when the stuttering world champions have lost nine of their 14 matches. Wilkinson is aiming to make his third start to the season in the Zurich Premiership match against Harlequins on 13 March.\"\n\"That game is the day after England play Italy in the Six Nations and six days before their final match of the championship against Scotland. \"We are hoping Jonny will be ready in a fortnight, but it is touch and go,\" said Andrew. \"His recovery is going very well and the key now is how he is reintroduced to playing and with it goal-kicking. \"He will probably have to come off the bench to start and it would be ridiculous and irresponsible to put him straight back into a Test match. \"\n\"Andrew also said that England's relaxed about Wilkinson's injury, despite not playing for England, is still hoping to make the Lions tour to New Zealand this summer. Lions coach Sir Clive Woodward has not set a deadline for when Wilkinson has to start playing again in order to be considered for selection.\"\n", "smollm:1.7b": "The summary should preserve the key ideas and details of the original text, while omitting any unnecessary information or explanations. The goal is to provide a concise and accurate summary that captures the main points without including any supporting details or analysis.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the provided text concisely while preserving key ideas and details. The user has given me a specific response already, but since the task is to create my own summary without any explanations or formatting, let me focus on extracting the main points.\n\nFirst, I should read through the entire text carefully. The main points are:\n\n1. Jonny Wilkinson is unlikely to play in the 2005 RBS Six Nations because of a recent injury.\n2. He's recovering from a knee injury after multiple neck and arm issues.\n3. He has not played England since the 2003 World Cup final, losing nine games.\n4. Newcastle's coach, Rob Andrew, told The Times that Wilkinson is likely in a Test match but says it would be irresponsible to send him straight into one.\n5. The match against Harlequins is on March 13, the day after six Nations games and before their final match against Scotland.\n6. Andrew mentioned hoping Jonny recovers in a fortnight but emphasizing the importance of his return for goal-kicking.\n7. Despite not playing, Wilkinson still wants to start in July when he's selected by Sir Clive Woodward.\n\nI need to condense this into a concise summary without any extra information or explanations. I'll make sure to include all these key points without overcomplicating it. Let me structure it step by step.\n</think>\n\nJonny Wilkinson is unlikely to participate in the 2005 RBS Six Nations due to a recent injury, having not played England since the 2003 World Cup final and losing nine of his 14 matches. He is recovering from a knee injury resulting from long-term neck and arm injuries. Newcastle's coach Tony Andrew is cautious about sending him into a Test match, fearing it would be irresponsible. Wilkinson aims to make his third start against Harlequins on March 13, the day after six Nations games against Italy and before their final match against Scotland. Andrew believes he will come off the bench but stressed the importance of goal-kicking recovery. Despite not playing for England, Wilkinson is hoping to return in July for selection by Sir Clive Woodward.", "tinyllama:1.1b": "Wilkinson, England's World Cup-winning fly-half, looks set to miss the entire 2005 RBS Six Nations due to ongoing knee injuries. The club coach Newcastle, Rob Andrew, stated that Wilkinson's recovery was progressing well but that the severity of his injuries required him to \"reintroduce\" himself into playing, and it would be \"irresponsible\" to put him straight into a Test match. Despite not playing for England in the World Cup final, Wilkinson is still hopeful of making the tour to New Zealand this summer. Lion's coach Sir Clive Woodward has stated that he will not rush Wilkinson back into action due to the ongoing injuries.", "tinydolphin:1.1b": " In summary, Jonny Wilkinson is expected to miss the entirety of the 2005 RBS Six Nations Championship after recovering from his latest knee injury only two games before their final match against Scotland. Coach Rob Andrew feels it would be irresponsible for him to return immediately and states that recovery time will be crucial for Wilkinson's fitness. England's World Cup-winning fly-half, Jonny Wilkinson, will miss the entirety of the 2005 RBS Six Nations Championship due to a knee injury, which he suffered during the final match of their World Cup victory in November 2003. Despite not playing for England since that tournament, Newcastle coach Wilkinson is hopeful that his knee will allow him to make his third start in the Zurich Premiership game against Harlequins on March 13th.", "phi:2.7b": " Jonny Wilkinson will miss the whole of the 2005 RBS Six Nations due to a knee injury he sustained after neck and arm injuries. Coach Rob Andrew believes it is unlikely that Wilkinson will recover in time to play, given they have only two games left to play. The England World Cup-winning fly-half has not played since November 2003 and aims to make his third start of the season against Harlequins on March 13th.\n", "orca-mini:3b": " Jonny Wilkinson, who hasn't played for England since the World Cup final in 2003, is unlikely to be fit in time for the 2005 RBS Six Nations championship due to a knee injury.", "hermes3:3b": "Jonny Wilkinson unlikely to play full 2005 RBS Six Nations.", "stablelm-zephyr:3b": "Jonny Wilkinson is unlikely to play in the 2005 RBS Six Nations championship due to a knee injury and ongoing recovery from neck and arm injuries. His coach, Rob Andrew, stated that it would be irresponsible to put him straight back into a Test match. Wilkinson has not played for England since November 2003. He aims to make his third start to the season in a Zurich Premiership match against Harlequins on 13 March, which is just before England's final Six Nations match against Scotland. While he may not play for England, Sir Clive Woodward, the Lions coach, has not set a deadline for when Wilkinson must regain his form to be considered for selection.", "chatgpt-4o-latest": "Jonny Wilkinson is unlikely to play in the 2005 RBS Six Nations due to a knee injury. Although he hoped to recover in time, Newcastle coach Rob Andrew stated it would be irresponsible to put him straight into a Test match. Wilkinson, who has not played for England since the 2003 World Cup final due to multiple injuries, aims to return in a Zurich Premiership match on 13 March. England is not pressuring his return, and despite his absence, Wilkinson still hopes to make the Lions tour to New Zealand, with coach Sir Clive Woodward not setting a deadline for his comeback.", "stablelm2:1.6b": "England rugby player Jonny Wilkinson is unlikely to play in the entire RBS Six Nations due to injuries, with only two games left to play. Coach Rob Andrew stated that with only two games left, it would be irresponsible to put him straight into a test match after recovering from previous injuries. Despite not playing for England, Wilkinson is still aiming to make the Lions tour to New Zealand this summer.", "granite3.1-dense:2b": "Jonny Wilkinson, England's World Cup-winning fly-half, is highly unlikely to participate in the 2005 RBS Six Nations due to a persistent knee injury that followed previous neck and arm issues. He last played for England in November 2003, contributing to their loss in nine of their subsequent 14 matches. Wilkinson aims to feature in Newcastle's Zurich Premiership match against Harlequins on March 13, which is the day before England's first Six Nations game against Italy and two days before their final match against Scotland. Coach Rob Andrew expects him to be fit in about a fortnight but acknowledges it's uncertain. Wilkinson plans to start as a substitute, avoiding direct involvement in Test matches until fully recovered. Despite this setback, he remains a candidate for the Lions tour to New Zealand this summer, with no specific deadline set by coach Sir Clive Woodward.", "reference": "Despite not playing for England, Wilkinson is still hoping to make the Lions tour to New Zealand this summer.Lions coach Sir Clive Woodward has not set a deadline for when Wilkinson has to start playing again in order to be considered for selection.But Rob Andrew, coach of Wilkinson's club side Newcastle, said that with only two games left to play Wilkinson was unlikely to be fit in time.That game is the day after England play Italy in the Six Nations and six days before their final match of the championship against Scotland.England's World Cup-winning fly-half said last week he was hoping to recover from his latest injury in time to play some role in the championship.Wilkinson is aiming to make his third start to the season in the Zurich Premiership match against Harlequins on 13 March."}