{"raw_text": "Williams stays on despite dispute\n \n Matt Williams insists he has no thoughts of quitting as national coach as a result of the power struggle currently gripping Scottish rugby.\n \n The chairman, chief executive and three non-executive directors all departed in a row over the game's future direction. But Williams said: \"I want to make it clear that I'm committed totally to Scottish rugby. \"I've brought my family here and we've immersed ourselves in Scottish life. There's no way that I'm walking away.\" However, he attempted to steer clear of taking sides in the dispute. \"I'd like to stress that the national team is separate to the political situation,\" he said.\n \n \"When you come to an undertaking like this and you are trying to make a difference then there are always people who will begrudge you, who are jealous and want to try to drag you down. \"When you have that situation, you have to have the courage of your convictions to see it through. \"There was some very unhelpful and uninformed comment that the national team had received a massive increase in budget at the expense of other parts of Scottish rugby and that is simply not the case. \"Like all good coaches, you go and ask for an increase. But we were told in no uncertain terms that the financial situation did not allow that. \"The idea that we are lighting cigars with £20 notes while the rest of Scottish rugby flounders is absolutely untrue. \"We also attracted criticism because of the number of days players spent with the national team. \"But let me give you the truth. Our Irish counterparts, whom we have to compete with in a few days' time, had 70 days together at the summer. \"They are currently in camp now and they will have another 21 days in camp before the Six Nations. \"That means they will have 91 days away from their club from July until the Six Nations. We, on the other hand, will have 16. \"There must be a win-win philosophy and attitude within Scottish rugby and that is what we are after - both groups winning, not competing.\"\n", "llama3.2:1b": "Matt Williams insists he has no thoughts of quitting as national coach despite controversy over the power struggle in Scottish rugby. He claims to have committed to the team but acknowledges that it will be difficult to navigate the situation with his family already immersed in Scottish life.", "llama3.2:3b": "Matt Williams says he's committed to Scottish rugby despite a power struggle among its leaders. He defends the national team against claims of being given an unfair budget increase. Williams criticizes rival teams for their training schedules, saying Scotland has fewer days with the national team.", "gemma2:2b": "Matt Williams intends to remain as national coach despite a power struggle in Scottish rugby involving departing board members.  He maintains his commitment to the team and emphasizes the separation between the political situation and the national team's progress. He acknowledges some criticism regarding budget allocation but clarifies that funding constraints prevented a substantial increase. Williams also points out the number of days players spend with the national team, referencing Ireland's longer training duration, as a reason for potential bias in their assessments.  Williams ultimately advocates for a win-win approach within Scottish rugby to ensure both parties succeed. \n", "qwen2.5:0.5b": "The article discusses Matt Williams, a prominent Scottish rugby player, declining to quit as a national coach in light of a power struggle within the team. The main points are:\n\n1. Matt Williams has no thoughts about quitting as a national coach.\n2. His chairman and other key personnel left during the same row over the future direction of Scottish rugby.\n3. He insisted he was committed entirely to Scottish rugby, bringing his family to the country.\n4. There were some negative comments made about the national team's budget increase compared to other parts of Scottish rugby.\n5. Matt Williams emphasized the need for bold decisions and a clear win-win approach within Scottish rugby.", "qwen2.5:1.5b": "Matt Williams insists he has no thoughts of quitting as national coach due to power struggle in Scottish rugby, stating his commitment to the team despite financial disagreements and criticism over days spent with the national team. He stresses the separation between the national team's funding and other parts of Scottish rugby and emphasizes a win-win philosophy for both groups to succeed.", "qwen2.5:3b": "Williams remains committed to being national coach despite power struggle in Scottish rugby, stating his support for the team and distancing himself from broader disputes. He denies allegations of budget increases harming other parts of the game and counters criticism about player availability with data showing Irish counterparts having more training time. Williams advocates for a win-win strategy within Scottish rugby.", "opencoder:1.5b": "The chairman, chief executive and three non-executive directors all departed in a row over the game's future direction. But Williams said: \"I want to make it clear that I'm committed totally to Scottish rugby. I've brought my family here and we've immersed ourselves in Scottish life. There's no way that I'm walking away.\" However, he attempted to steer clear of taking sides in the dispute. \"I'd like to stress that the national team is separate to the political situation,\" he said.\n \n \"When you come to an undertaking like this and you are trying to make a difference then there are always people who will be grudging you, who are jealous and want to drag you down.\" When you have that situation, you have to have the courage of your convictions to see it through. \"There was some very unhelpful and uninformed comment that the national team had received a massive increase in budget at the expense of other parts of Scottish rugby and that is simply not the case. As for all good coaches, you go and ask for an increase. But we were told in no uncertain terms that the financial situation did not allow that. The idea that we are lighting cigars with £20 notes while the rest of Scottish rugby flounders is absolutely untrue. We also attracted criticism because of the number of days players spent with the national team. But let me give you the truth. Our Irish counterparts, whom we have to compete in a few days' time, had 70 days together at the summer camp. They are currently in camp now and they will have another 21 days in camp before the Six Nations. We, on the other hand, will have 16. That means they will have 91 days away from their club from July until the Six Nations. That's what we're after - both groups winning, not competing.\"\n", "smollm:1.7b": "Williams stays on despite dispute", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Matt Williams staying on as national rugby coach despite some power struggles. Let me read through the text carefully.\n\nFirst paragraph talks about Williams trying to stay because of the dispute. He mentions his family and the immersion they've had in Scottish life. So that's key points: commitment, family involvement, embedded community, no idea he'll leave.\n\nNext part is about the chair, CEO, and non-executive directors all leaving, but Williams isn't taking any sides. He's trying to stay focused on making a difference. That means he wants to emphasize their team being separate from the political stuff. \n\nThen it brings up the financial situation: they're increasing the budget for the national team without others losing money. The comment about £20 notes is dismissed as incorrect, which shows both sides are cautious.\n\nThe text also mentions criticism based on player time with the team and how their camp duration is longer than Irish counterparts who have more time. But Williams emphasizes a win-win strategy where everyone benefits, not just one side.\n\nSo putting it all together, I need to capture his commitment, his focus on their team, the financial clarity despite any issues, and the desire for mutual success.\n</think>\n\nMatt Williams continues his role as national rugby coach, emphasizing his commitment to Scottish rugby through his family involvement and embedded community. He maintains a clear stance regarding the power struggle, focusing on his own team's independence while advocating for a win-win strategy. Despite potential financial pressures, he seeks to steer clear of taking sides, prioritizing clarity and mutual success.", "tinyllama:1.1b": "Matt Williams, the national coach of Scotland, has stated his commitment to Scottish rugby despite the ongoing power struggle currently affecting the game. The chairman, CEO, and three non-executive director board members all left in a row over the direction of the sport's future. Despite this, Williams believes that the nation's team is separate from political matters and he wants to maintain his commitment to making a difference through the national squad. In response to critics' claims that the team received an excessive increase in budget at the expense of other aspects of Scottish rugby, Williams stated that the financial situation did not allow it. Furthermore, he believes that Scotland will have more time between camps than their Irish counterparts due to the length of time away from club football. The national rugby coach highlighted the importance of a win-win philosophy and attitude within Scottish rugby while stressing his commitment to the sport despite the ongoing power struggle.", "tinydolphin:1.1b": " In summary, Matt Williams, the national team coach of Scotland, remains committed to leading the team despite the ongoing power struggle among chairman, chief executive, and three non-executive directors. He emphasized his support for the national team's direction while expressing frustration over the perceived budget increase in favor of other rugby areas. Williams also clarified that he has no intentions to step down as coach, stating his commitment to both Scottish rugby and its development.", "phi:2.7b": " Matt Williams remains committed to coaching the national rugby team despite a power struggle in Scotland's rugby scene. He believes his family has immersed themselves in Scottish life and he is determined to make a difference. Williams tries to avoid taking sides in the dispute but is criticized for spending time with the team that others say was at the expense of other parts of Scottish rugby. However, he argues the financial situation did not allow an increase in budget and the national team's travels are in line with those of other countries. Williams wants a win-win philosophy and attitude within Scottish rugby where both sides can succeed.\n", "orca-mini:3b": " Matt Williams, the national coach of Scotland, remains committed to the team despite a power struggle within Scottish rugby. The chairman, chief executive and three non-executive directors left their positions in a row over the game's future direction. However, Williams emphasized that the national team is separate to the political situation and went on to explain that players received an increase in budget but were told they could not afford it. He also denied claims that the team had more days together with the national team.", "hermes3:3b": " Williams remains national coach despite disputes in Scottish rugby, insisting he's committed to Scottish rugby and denies increased budget for national team at expense of others.", "stablelm-zephyr:3b": "Matt Williams, the national coach of Scottish rugby, remains committed to his role despite the ongoing power struggle involving the chairman, chief executive, and three non-executive directors. Williams emphasized that he brought his family to Scotland and has immersed himself in Scottish life, adding that there is \"no way\" he would walk away from the sport. He steered clear of taking sides in the dispute but addressed some misconceptions surrounding budget increases for the national team. Williams argued that like all good coaches, he requested a budget increase but was told the financial situation did not allow it. Criticism surrounding player days with the national team was also addressed; Williams pointed out that Irish teammates had significantly more time spent away from their clubs during training camps. He called for a win-win philosophy within Scottish rugby to achieve mutual success.", "chatgpt-4o-latest": "Matt Williams remains committed as Scotland's national rugby coach despite a leadership dispute within Scottish rugby. Several top officials resigned over disagreements on the sport's direction, but Williams emphasized his dedication, stating he and his family are fully invested in Scotland. He distanced the national team from the political turmoil and defended his coaching approach, rejecting claims that the team received disproportionate funding. Williams also addressed criticism over player training time, highlighting that Scotland's preparation period is significantly shorter than Ireland's. He called for a cooperative mindset in Scottish rugby to ensure mutual success.", "stablelm2:1.6b": "Matt Williams remains committed to Scottish rugby despite power struggles surrounding the team's future direction. The chairman, CEO, and directors left due to the disagreement, but Williams asserts his dedication and intent to stay. He avoids getting involved in the dispute by emphasizing that the national team is separate from politics. A comment made about a budget increase for the national team was misunderstood as false; it wasn.. However, he acknowledges the criticism of spending many days with the national team against Scottish rugby's club players. The goal is for both groups to win and create a win-win situation within Scottish rugby according to Williams.", "granite3.1-dense:2b": "Despite recent political upheaval in Scottish rugby, national coach Matt Williams remains committed to his role. He emphasized his family's integration into the Scottish lifestyle and his unwavering dedication to the national team. Williams dismissed allegations of a significant budget increase for the national squad at the expense of other rugby parts, stating it was not possible due to financial constraints. He also refuted claims that the national team's training days were excessive compared to their Irish counterparts, who would have 91 days off from clubs by the time of a major tournament, while his team would have only 16. Williams stressed the importance of collaboration and mutual success between the national and regional teams, advocating for a win-win rugby culture in Scotland.", "reference": "But Williams said: \"I want to make it clear that I'm committed totally to Scottish rugby.\"I'd like to stress that the national team is separate to the political situation,\" he said.\"There was some very unhelpful and uninformed comment that the national team had received a massive increase in budget at the expense of other parts of Scottish rugby and that is simply not the case.Matt Williams insists he has no thoughts of quitting as national coach as a result of the power struggle currently gripping Scottish rugby.\"That means they will have 91 days away from their club from July until the Six Nations.\"We also attracted criticism because of the number of days players spent with the national team.\"The idea that we are lighting cigars with £20 notes while the rest of Scottish rugby flounders is absolutely untrue.\"There must be a win-win philosophy and attitude within Scottish rugby and that is what we are after - both groups winning, not competing.\""}