{"raw_text": "Wasps 31-37 Leicester\n \n Leicester withstood a stunning Wasps comeback to win a pulsating Heineken Cup encounter at the Causeway Stadium.\n \n The Tigers stormed 22-6 ahead within 18 minutes through tries from Lewis Moody, Geordan Murphy and Martin Corry. European champions Wasps fought back through a Josh Lewsey try and Mark van Gisbergen's boot, and they were level at 31-31 with five minutes remaining. But it was the visitors who kept their cool as Andy Goode kicked the Tigers to victory with a penalty and a drop goal. The closing moments saw desperate defence from Leicester as Wasps turned down several penalties to go for the try they needed. Wasps pounded the line and a penalty try looked likely before referee Nigel Williams controversially blew for full-time. Fly-half Goode was the Tigers hero, kicking 22 points in total, while Leicester's overwhelming domination in the scrums ultimately told. Even their lack of discipline in defence - which presented the admirable Van Ginsberg with 26 points - could not undo them as they held out for a famous win.\n \n Lawrence Dallaglio's team have now got it all to do in the quest for a quarter-final place given that two of their last three games are away - against Leicester and Biarritz. However, Wasps rugby director Warren Gatland warned his side will will not relinquish their European title without a fight. \"If we lose next week, then we are struggling,\" said Gatland. \"But we don't want to give this trophy away. We worked so hard to win it last season, we will go down fighting. \"We have got to get our scrum right next week, it is the biggest cause for concern.\" Leicester coach John Wells saluted the outstanding work of Graham Rowntree and Julian White, who were magnificent up front. \"They were the backbone of our performance today,\" said Wells. \"And to score three tries against the European champions at home was also something I am pleased about.\"\n \n Van Gisbergen; Lewsey, Erinle, Abbott, Voyce; King, Dawson; Dowd, Greening, Green; Shaw, Birkett; Worsley, O'Connor, Dallaglio (capt).\n \n Replacements: Gotting, McKenzie, Lock, Hart, Biljon, Brooks, Hoadley.\n \n Murphy; Rabeni, Smith, Gibson, Healey; Goode, Ellis; Rowntree, Chuter, White, M Johnson (capt), L Deacon; Moody, Back, Corry.\n \n Replacements (from): Buckland/Cockerill, Morris, Kay, W Johnson/B Deacon, H Tuilagi, Bemand, A Tuiliagi, Lloyd, Vesty.\n", "llama3.2:1b": "Wasps 31-37 Leicester \n\nWasps scored 22 points through Josh Lewsey and Mark van Gisbergen's boot, while Lewis Moody, Geordan Murphy, and Martin Corry scored tries for Leicester. \n\nThe match was level at 31-31 with five minutes remaining. Andy Goode kicked a penalty to win the game.\n\nDespite being heavily dominated in scrums by Leicester, Wasps turned down several penalties to go for the try they needed, and referee Nigel Williams blew for full-time against fly-half Goode's drop goal attempt.", "llama3.2:3b": "Leicester defeated Wasps 31-37 in a Heineken Cup encounter at the Causeway Stadium. The Tigers took an early lead with tries from Lewis Moody and Geordan Murphy but Wasps fought back to level the score at 31-31. Leicester's Andy Goode kicked two penalties and a drop goal to seal a narrow victory. Wasps' fly-half Mark van Gisbergen scored 26 points for his side, who now face an uphill task in their European title bid after losing.", "gemma2:2b": "Leicester defeated Wasps in a Heineken Cup match.  Despite a strong start by Wasps, Leicester ultimately secured victory with penalties and a drop goal from Andy Goode.  Wasps will need to regroup for their remaining European games. \n", "qwen2.5:0.5b": "Leicester narrowly won a Heineken Cup match against Wasps at the Causeway Stadium, with three players making their tackles crucial to the Tigers' victory. Lawrence Dallaglio’s side secured an important win in the quest for a quarter-final spot after losing their last three games away from home. Warren Gatland urged his team to not give up on their European title despite facing Leicester and Biarritz, but was relieved that they had won the game. Graham Rowntree's side dominated in the scrums and secured valuable points with a 22-18 victory. John Wells praised the performances of Julian White and Graham Rowntree, while Van Gisbergen and Lewsey made their marks against Wasps' European champions.", "qwen2.5:1.5b": "Leicester beat Wasps in a Heineken Cup match by 31-37 at the Causeway Stadium, with Leicester leading throughout and maintaining their dominance through scrums and penalties to secure victory despite the comeback from the European champions.", "qwen2.5:3b": "Leicester Tigers secured a 31-37 win over Wasps in the Heineken Cup with a late victory after leading at halftime. Leicester scored early tries from Lewis Moody, Geordan Murphy and Martin Corry for a 22-6 lead. Wasps responded with Josh Lewsey's try and Mark van Gisbergen's conversion to tie the score at 31-31. Andy Goode sealed the win with two penalties and a drop goal. Despite Wasps' efforts, Leicester held firm in defense, ultimately securing the victory. Warren Gatland cautioned against conceding their European title, while John Wells praised his front row for the impressive performance.", "opencoder:1.5b": "Wasps 31-37 Leicester: \n\nLeicester struggled to keep their momentum in the match, but Asians were relentless and they won a heartening Heineken Cup encounter at the Causeway Stadium. The Tigers rushed 22-6 ahead with impressive performances from Lewis Moody, Geordan Murphy and Martin Corry. They led by a penalty try and a boot, leading them to level 31-31 with five minutes remaining. The penalty got them down as Andy Goode kicked the Tigers out of the field. However, it wasn't their fault; they needed more penalties to keep up their momentum.\n\nLeicester's domination in the scrums made it a thrilling chase but it was not enough due to Van Gisbergen’s absence of discipline. As he tried his best to score the three tries against the Wasps at home, he was quick to kick the 22 points, a testament to their hard work and determination.\n\nThe season went well with Lawrence Dallaglio's team making it an all-time favourite. Despite being struggling with the European title, they won it last season thanks to their remarkable performances. Graham Rowntree and Julian White were also impressive in their first few games. They backed off and scored three tries on their behalf.\n\nVan Gisbergen’s contributions strengthened the wasps' confidence in the England champions. He scored a remarkable 26 points, which not only bolstered their chances at home but also made them look good in a fight for an all-time favourite. \n\nThe European champions were equally pleased with the outcome, despite the absence of Van Gisbergen’s penalty. The wasps' dominance reflected their hard work and determination to win the cup. It was a testament to the man's resilience and persistence in overcoming any challenge.\n\nIn terms of replacements, Graham Rowntree, Julian White, and L Deacon were replaced but Van Gisbergen was not. They had more time this season to focus on the cup match.\n", "smollm:1.7b": "Wasps 31-37 Leicester", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this rugby article into a concise summary. Let me read through the text carefully first.\n\nThe article talks about a game between the Leicester Tigers and Wasps rugby team at Causeway Stadium. The Tigers won 31-37 against Wasps. Leicester had some early tries in the first 18 minutes, including Lewis Moody's try, Geordan Murphy's, and Martin Corry's. Then Wasps fought back but eventually fell behind by five minutes.\n\nThe Tigers scored a penalty from Andy Goode and then a drop goal, making it a win for them. Leicester had some good players too, like Fly-half Goode who contributed 22 points. The article mentions that while Wasps dominated the scrums, their defense wasn't great enough to prevent them from winning.\n\nThere's a section about Lawrence Dallaglio leading Leicester towards a quarter-final place, but Wasps has an ongoing struggle and won't give up their European title unless they fight. Both teams have some key players and substitutions mentioned.\n\nThe user provided specific details like player names and some substitutions. The task is to create a summary that captures the main points without too much detail.\n\nI should start by stating who won, the game's outcome, the key players, and any notable achievements or players. I need to make sure to include the final score, both teams' performances, the importance of the win for Leicester, and the overall dynamics of the match.\n</think>\n\nLeicester Tigers defeated Wasps in a Heineken Cup encounter at Causeway Stadium (31-37). Leicester had early tries from Lewis Moody, Geordan Murphy, and Martin Corry. Wasps fought back but fell by five minutes. Leicester's substitution players showed promise, including Fly-half Goode with 22 points. Wasps dominated the scrums but Leicester's defense was a problem. Lawrence Dallaglio leads Leicester to quarter-final placement, while Wasps aims to secure their European title unless they concede. Key players include Rowntree, Julian White, Graham Rowntree, and others. Substitutions by Graham Rowntree and Julian White highlighted their strong front line.", "tinyllama:1.1b": "The Heiniken Cup encounter between Leicester and Wasps at the Causeway Stadium was a dramatic finish as the visitors managed to come back from being behind by 22-6 to win 31-37. Wasp's fly-half Lawrence Dallaglio admitted that losing their European title would be a struggle if they were to get to the quarter-finals, while Wasps director Warren Gaulland predicted that his side will not relinquish their title without a fight. However, Leicester coach John Wells praised the outstanding work of Graham Rowntree and Julian White up front and saluted their team for maintaining strong scrums throughout the game. The match saw an outstanding performance from scrumhalf Graham Rowntree who scored three tries against Wasps, while Wasps also had a dominant display in defense.", "tinydolphin:1.1b": " In a highly-anticipated match at the Causeway Stadium, Leicester Tigers secured their second consecutive Heineken Cup victory with a thrilling comeback against Wasps. The lead was short-lived as the visitors took an early lead through Josh Lewsey's try and Mark van Gisbergen's boot. However, the Tigers demonstrated resilience, turning the tide with tries from Lewis Moody and Geordan Murphy, along with a penalty from Andy Goode. After a nervous finish, Leicester secured victory with two successful penalties and a drop goal from Josh Lewsey to complete their famous comeback. Wasps were left in disbelief as they failed to convert any of their own attempts, while the Tigers managed to secure a memorable victory.", "phi:2.7b": " The Tigers' defeat in the Heineken Cup final against Wasps was a stunning comeback, with the Tigers initially falling behind 22-6 before being brought back to level at 31-31. However, the Tigers were ultimately defeated when Andy Goode kicked two penalties and a drop goal for a 28-30 win. Lawrence Dallaglio's team has now got everything they need to qualify for the quarter-finals, but Wasps' rugby director warned his side will not give up their European title without a fight. Despite this loss, wasps coach Warren Gatland praised the Tigers' scrum work and the outstanding performance of Graham Rowntree and Julian White.\n", "orca-mini:3b": " Leicester defeated Wasps 31-37 in a thrilling Heineken Cup match at the Causeway Stadium. The Tigers stormed into a 22-6 lead within 18 minutes through tries from Lewis Moody, Geordan Murphy and Martin Corry. European champions Wasps fought back through a Josh Lewsey try and Mark van Gisbergen's boot, but it was the visitors who held their nerve to go down to the wire. Andy Goode kicked the Tigers to victory with a penalty and a drop goal, and Lawrence Dallaglio's team have now got it all to do in the quest for a quarter-final place given that two of their last three games are away - against Leicester and Biarritz. However, Wasps rugby director Warren Gatland warned his side will not relinquish their European title without a fight. \"If we lose next week, then we are struggling,\" he said. \"But we don't want to give this trophy away. We worked so hard to win it last season, we will go down fighting. \"We have got to get our scrum right next week, it is the biggest cause for concern.\"", "hermes3:3b": "Leicester beats Wasps 31-37 in a Heineken Cup match, with Leicester securing victory despite a strong comeback from Wasps. Leicester dominated the scrum and won with a last-minute drop goal by Andy Goode, while Lawrence Dallaglio's Wasps need to improve their scrum for future games.", "stablelm-zephyr:3b": "Leicester won a close Heineken Cup match against Wasps at the Causeway Stadium, with fly-half Andy Goode's heroics sealing their victory. Despite being ahead 31-31 with five minutes remaining, Wasps came back with a try and a conversion, only for Goode to kick a penalty and a drop goal that secured Leicester's win. The Tigers' scrum dominance proved crucial, while Wasps struggled with their lack of discipline in defense, allowing Van Gisbergen and others to score 26 points. Despite the loss, Wasps rugby director Warren Gatland vowed not to give up without a fight for the European title.", "chatgpt-4o-latest": "Leicester Tigers secured a thrilling 37-31 victory over Wasps in the Heineken Cup despite a strong comeback from the European champions. Leicester raced to a 22-6 lead with early tries from Lewis Moody, Geordan Murphy, and Martin Corry, but Wasps fought back through Josh Lewsey’s try and Mark van Gisbergen’s kicking, leveling the score at 31-31 with five minutes left. Andy Goode sealed the win for Leicester with a penalty and a drop goal, while their dominant scrum proved decisive. Wasps pressed for a late try but were denied as the referee controversially ended the game. Goode contributed 22 points, while Van Gisbergen scored 26 for Wasps. Leicester coach John Wells praised the forwards, particularly Graham Rowntree and Julian White. Wasps now face a tough challenge to reach the quarter-finals, with coach Warren Gatland vowing to fight for their title defense.", "stablelm2:1.6b": "Leicester Tigers defeated the Wasps in a thrilling Heineken Cup match at the Causeway Stadium. The Tigers led 6-0 within minutes through tries from Lewis Moody, Geordan Murphy, and Martin Corry. However, Wasps fought back with Josh Lewsey's try and Mark van Gisbergen's boot, making it 5-5 in the closing stages. Andy Goode's penalty and drop goal secured a memorable victory for Leicester. Despite some disciplinary issues from Leicester in defense, they ultimately prevailed. The Tigers need a win against Leicester and Biarritz to secure a quarter-final place, while Wasps will not relinquish their European title without a fight.", "granite3.1-dense:2b": "Leicester secured a thrilling 37-31 victory over European champions Wasps in the Heineken Cup at Causeway Stadium. Despite an initial 22-6 lead by Leicester's tries from Moody, Murphy, and Corry, Wasps fought back through Josh Lewsey's try and van Gisbergen's boot. The match remained closely contested until the final moments, with Leicester's defensive resilience and Andy Goode's consistent kicking securing the win. Despite Wasps' dominance in the scrums and a penalty try, referee Nigel Williams ruled against a try for Wasps due to time expiring. Leicester's powerful scrums played a crucial role, while Wasps' coach Warren Gatland emphasized their determination to retain the title. Leicester coach John Wells praised the front row duo of Graham Rowntree and Julian White for their significant contributions.", "reference": "The closing moments saw desperate defence from Leicester as Wasps turned down several penalties to go for the try they needed.European champions Wasps fought back through a Josh Lewsey try and Mark van Gisbergen's boot, and they were level at 31-31 with five minutes remaining.\"And to score three tries against the European champions at home was also something I am pleased about.\"Murphy; Rabeni, Smith, Gibson, Healey; Goode, Ellis; Rowntree, Chuter, White, M Johnson (capt), L Deacon; Moody, Back, Corry.The Tigers stormed 22-6 ahead within 18 minutes through tries from Lewis Moody, Geordan Murphy and Martin Corry.Leicester withstood a stunning Wasps comeback to win a pulsating Heineken Cup encounter at the Causeway Stadium.Wasps pounded the line and a penalty try looked likely before referee Nigel Williams controversially blew for full-time.Lawrence Dallaglio's team have now got it all to do in the quest for a quarter-final place given that two of their last three games are away - against Leicester and Biarritz.\"If we lose next week, then we are struggling,\" said Gatland."}