{"raw_text": "Ireland call up uncapped Campbell\n \n Ulster scrum-half Kieran Campbell is one of five uncapped players included in Ireland's RBS Six Nations squad.\n \n Campbell is joined by Ulster colleagues Roger Wilson and Ronan McCormack along with Connacht's Bernard Jackman and Munster's Shaun Payne. Gordon D'Arcy is back after injury while Munster flanker Alan Quinlan also returns to international consideration. \"The squad is selected purely on form. A lot of players put their hands up,\" coach Eddie O'Sullivan told BBC Sport. \"Kieran Campbell was just one of those players. He has been playing very well in the Heineken Cup and deserves his call-up. \"There is big competition in some departments and not so much in others. There were one or two players who were unfortunate just to miss out.\" Back-row forwards David Wallace and Victor Costello are omitted, with O'Sullivan having Quinlan, Wilson, Simon Easterby, Anthony Foley, Denis Leamy and Johnny O'Connor vying for the three positions.\n \n With David Humphreys, Kevin Maggs, Simon Best and Tommy Bowe again included, it is Ulster's biggest representation in a training panel for quite some time. Munster and Leinster have 12 and 11 players in the squad respectively while Jackman is the sole Connacht representative. Four British-based players are also included. Ulster forward Ronan McCormack said he was \"totally shocked\" to be included. \"I'm really looking forward to it,\" said McCormack. \"I played with guys like Brian O'Driscoll and Denis Hickie back in my school days in Leinster so I do know a few of them although not that well. \"It will be great to work with them.\"\n \n S Best (Ulster), S Byrne (Leinster), R Corrigan (Leinster), L Cullen (Leinster), S Easterby (Llanelli), A Foley (Munster), J Hayes (Munster), M Horan (Munster), B Jackman (Connacht), D Leamy (Munster), E Miller (Leinster), R McCormack (Ulster), D O'Callaghan (Munster), P O'Connell (Munster), J O'Connor (Wasps), M O'Kelly (Leinster), F Sheahan (Munster), R Wilson (Ulster), A Quinlan (Munster).\n \n T Bowe (Ulster), K Campbell (Ulster), G D'Arcy (Ulster), G Dempsey (Leinster), G Duffy (Harlequins), G Easterby (Leinster), D Hickie (Leinster), A Horgan (Munster), S Horgan (Leinster), D Humphreys (Ulster), K Maggs (Ulster), G Murphy (Leicester), B O'Driscoll, (Leinster), R O'Gara (Munster), S Payne (Munster), P Stringer (Munster).\n \n K Gleeson (Leinster), T Howe (Ulster), J Kelly (Munster), N McMillan (Ulster).\n", "llama3.2:1b": "Ireland has called up uncapped players Kieran Campbell, Roger Wilson, Ronan McCormack, and Bernard Jackman to the RBS Six Nations squad. \n\nThe squad also includes Gordon D'Arcy, who is back after injury. Munster flankers Alan Quinlan and Shaun Payne return to international consideration.", "llama3.2:3b": "Ireland call up uncapped Kieran Campbell, one of five new players in the RBS Six Nations squad. The squad is selected based on form, with big competition in some departments and not so much in others. Ulster has its biggest representation ever in a training panel for the tournament.", "gemma2:2b": "Ireland has named an RBS Six Nations squad with five uncapped players: Kieran Campbell, Roger Wilson, Ronan McCormack, Bernard Jackman, and Shaun Payne.  Eddie O'Sullivan selected the squad based on performance.  The team includes 19 players from Ulster and 10 from other clubs, including a notable representation of British-based players.  \n", "qwen2.5:0.5b": "In Ireland, Kieran Campbell is a scrum-half who has been uncapped and will be included in the RBS Six Nations squad. He'll be joined by four other uncapped players: Roger Wilson, Ronan McCormack, Bernard Jackman, and Shaun Payne. Also included are Gordon D'Arcy, Connacht's Ulster player; Munster flanker Alan Quinlan is also back from injury.\n\nLeinster won the cup this year and has 12 players in their squad. Both Leinster and Munster have 11 players, with only one Leinster player (Connacht) on the panel for a training session. All of Ulster's players are represented again in the panel but Kieran Campbell is one of those who will be chosen to play.", "qwen2.5:1.5b": "Ireland has called up five uncapped players to its RBS Six Nations squad, including scrum-half Kieran Campbell. Munster's Alan Quinlan and Connacht's Bernard Jackman are back after injury, while Ulster's David Wallace is omitted from the squad due to competition for positions in the back-row forwards.", "qwen2.5:3b": "Ireland call up uncapped Ulster scrum-half Kieran Campbell for the RBS Six Nations. Other players include Connacht's Bernard Jackman, Munster's Shaun Payne and Gordon D'Arcy returning from injury. The squad is selected based on form; Campbell was one of those selected due to his recent good form in Heineken Cup matches. Four British-based players are included as well. Ulster have the biggest representation with Ronan McCormack being \"totally shocked\" to be called up, stating he played with former Ireland teammates like Brian O'Driscoll and Denis Hickie. The squad includes 26 players from eight provinces: Ulster (10), Leinster (12), Munster (13), Connacht (4), and British-based players (4).", "opencoder:1.5b": "Ireland call up uncapped Campbell\n\nUlster scrum-half Kieran Campbell is one of five uncapped players included in Ireland's RBS Six Nations squad.\n\nCampbell is joined by Ulster colleagues Roger Wilson and Ronan McCormack along with Connacht's Bernard Jackman and Munster's Shaun Payne. Gordon D'Arcy is back after injury while Munster flanker Alan Quinlan also returns to international consideration. \"The squad is selected purely on form. A lot of players put their hands up,\" coach Eddie O'Sullivan told BBC Sport. \"Kieran Campbell was just one of those players. He has been playing very well in the Heineken Cup and deserves his call-up. There are big competition in some departments and not so much in others. There were one or two players who were unfortunate just to miss out.\" Back-row forwards David Wallace and Victor Costello are omitted, with O'Sullivan having Quinlan, Wilson, Easterby, Foley, Leamy, and O'Connor vying for the three positions.\n\nWith David Humphreys, Kevin Maggs, Simon Best and Tommy Bowe again included, it is Ulster's biggest representation in a training panel for quite some time. Munster and Leinster have 12 and 11 players in the squad respectively while Jackman is the sole Connacht representative. Four British-based players are also included. Ulster forward Ronan McCormack said he was \"totally shocked\" to be included. \"I'm really looking forward to it,\" said McCormack. \"I played with guys like Brian O'Driscoll and Denis Hickie back in my school days in Leinster so I do know a few of them although not that well. It will be great to work with them.\"\n\nS Best (Ulster), S Byrne (Leinster), R Corrigan (Leinster), L Cullen (Leinster), S Easterby (Llanelli), A Foley (Munster), J Hayes (Munster), M Horan (Munster), B Jackman (Connacht), D Leamy (Munster), E Miller (Leinster), R McCormack (Ulster), D O'Callaghan (Munster), P O'Connell (Munster), J O'Connor (Wasps), M O'Kelly (Leinster), F Sheahan (Munster), R Wilson (Ulster), A Quinlan (Munster).\n\nT Bowe (Ulster), K Campbell (Ulster), G D'Arcy (Ulster), G Dempsey (Leinster), G Duffy (Harlequins), G Easterby (Leinster), D Hickie (Leinster), A Horgan (Munster), S Horgan (Leinster), D Humphreys (Ulster), K Maggs (Ulster), G Murphy (Leicester), B O'Driscoll, Leinster), R O'Gara (Munster), S Payne (Munster), P Stringer (Munster).\n\nK Gleeson (Leinster), T Howe (Ulster), J Kelly (Munster), N McMillan (Ulster).\n", "smollm:1.7b": "Ireland call up uncapped Campbell.", "deepseek-r1:1.5b": "<think>\nAlright, let's tackle this query. The user has provided a text about the selection of Ulster's players for the Six Nations and wants me to summarize it concisely. They specified that only plain text is needed without any explanations or formatting.\n\nFirst, I'll read through the provided text carefully to identify the key points. It mentions that Ireland brings up uncapped Campbell with others like Wilson, McCormack, Jackman, and Payne. Eddie O'Sullivan's statement about selection purely on form is important. The team competition in some departments but less so elsewhere.\n\nLooking at the squad numbers, Ulster has 12 players, Leinster 11, and two British representers. Some standout mentions are Campbell being \"shockingly included,\" Wilson, and others like Quinlan and O'Conner.\n\nI need to condense all this into a summary that captures each main point without unnecessary details. I'll make sure to include the key names like Kieran Campbell, their roles, the injury status of Gordon D'Arcy, and the team's strengths, such as Ulster's strong backline and forward play.\n\nFinally, I'll structure it so it flows well while hitting all essential elements from the original text. I should ensure that each highlighted player is mentioned clearly and concisely.\n</think>\n\nIreland selects Kieran Campbell for the Six Nations after being one of five uncapped players in their RBS squad. Alongside Wilson, McCormack, Jackman, and Payne, Ulster includes other key players like Quinlan, Wilson, Easterby, Foley, Leamy, O'Connor, Humphreys, Maggs, Corrigan, Cullen, Best, D'Arcy, Dempsey, Dyke, Horgan, Stringer, and O’Knell. The team is led by Eddie O'Sullivan, who commends his players for their form. Campbell's inclusion highlights competition among UK teams. Ulster boasts a strong backline and forward play, supported by Wilson, Corrigan, and O'Conner.", "tinyllama:1.1b": "Ireland calls up uncapped Campbell in their RBS Six Nations squad, including five uncapped players: Ulster back-rowers Roger Wilson and Ronan McCormack, Munster forward Alan Quinlan, and Connacht players Shaundy Payne and Gordon D'Arcy. Former Irish captain Eddie O'Sullivan says their selection is purely based on form rather than experience. Sixteen British-based players also make up the squad.", "tinydolphin:1.1b": " Aidan Doyle, a renowned Irish rugby coach, has announced the Six Nations squad for Ireland. The team includes five uncapped players, including Ulster scrum-half Kieran Campbell. In addition to this, five British-based players have also been included in the lineup: Ronan McCormack from Munster, Shaun Payne from Connacht, and Johnny O'Connor from Leinster. The other four British-based players are not selected yet, but are likely to be included as they are more experienced than their Irish counterparts.", "phi:2.7b": " Ireland has a squad of uncapped players for the RBS Six Nations, including Kieran Campbell from Ulster. Other Irish players in the squad are Roger Wilson, Bernard Jackman, and Shaun Payne. The coach, Eddie O'Sullivan, selected the players solely based on their form. However, some players who were unlucky to miss out included David Wallace and Victor Costello as back-row forwards.\n \nThe other three British-based players to join the squad are not named in the summary. Ulster has the most represented players in the team's training panel for a while. Ronan McCormack is one of those Irish players, who was \"totally shocked\" and looking forward to playing with his school mates Brian O'Driscoll and Denis Hickie.\n \nThe coach included S Best (Ulster), S Byrne (Leinster), R Corrigan (Leinster), L Cullen (Leinster), S Easterby (Llanelli), A Foley (Munster), J Hayes (Munster), M Horan (Munster), B Jackman (Connacht), D Leamy (Munster), E Miller (Leinster), R McCormack (Ulster), D O'Callaghan (Munster), P O'Connell (Munster), J O'Connor (Wasps), M O'Kelly (Leinster), F Sheahan (Munster), R Wilson (Ulster), A Quinlan (Munster). \n \nT Bowe (Ulster), K Campbell (Ulster), G D'Arcy (Ulster), G Dempsey (Leinster), G Duffy (Harlequins), G Easterby (Leinster), D Hickie (Leinster), A Horgan (Munster), S Horgan (Leinster), D Humphreys (Ulster), K Maggs (Ulster), G Murphy (Leicester), B O'Driscoll, R O'Gara (Leinster), S Payne (Munster), P Stringer (Munster).\n \nThe squad also includes T Bowe from Ulster. The coach, Eddie O'Sullivan, selected the players solely based on their form. However, some players who were unlucky to miss out included David Wallace and Victor Costello as back-row forwards. \n", "orca-mini:3b": " Ireland call up uncapped Ulster scrum-half Kieran Campbell. The 27-year-old joins five other uncapped players in the country's RBS Six Nations squad, including Ronan McCormack and Bernard Jackman. Back-row forwards David Wallace and Victor Costello are omitted, with Ulster's Simon Easterby, Anthony Foley, Denis Leamy, and Johnny O'Connor vying for the three positions. The squad is selected purely on form.", "hermes3:3b": "Ireland includes uncapped scrum-half Kieran Campbell in squad. Ulster's Campbell, Wilson and McCormack are among five players called up for the RBS Six Nations team, with coach Eddie O'Sullivan praising their form.", "stablelm-zephyr:3b": "Uncapped Kieran Campbell joins five others in the Ireland RBS Six Nations squad, with coach Eddie O'Sullivan highlighting that selection was based on form. The squad features 12 players from Ulster, making it the team's largest representation in a training panel for some time. Four British-based players are also included.", "chatgpt-4o-latest": "Ulster scrum-half Kieran Campbell is among five uncapped players named in Ireland's RBS Six Nations squad, alongside Roger Wilson, Ronan McCormack, Bernard Jackman, and Shaun Payne. Gordon D'Arcy and Alan Quinlan return after injury. Coach Eddie O'Sullivan emphasized selection based on form, noting strong competition in some positions. David Wallace and Victor Costello are omitted, with several players competing for back-row spots. Ulster has a significant presence in the squad, with Munster and Leinster also well represented. Ronan McCormack expressed surprise at his inclusion and looks forward to training with familiar faces. The squad includes players from all four Irish provinces and four British-based players.", "stablelm2:1.6b": "Ulster scrum-half Kieran Campbell is one of five uncapped players included in Ireland's RBS Six Nations squad. Coach Eddie O'Sullivan praised his form and selection, while acknowledging strong competition in some departments. Notable omissions are back-row forwards David Wallace and Victor Costello. Ulster has the biggest representation among their training panel, with five players from Ulster, four each from Leinster and Munster, and one from Connacht. Kieran McCormack is excited to join players like Brian O'Driscoll and Denis Hickie for training sessions. The squad also includes several British-based players and international players.", "granite3.1-dense:2b": "Ireland's RBS Six Nations squad, announced by coach Eddie O'Sullivan, includes five uncapped players from Ulster: scrum-half Kieran Campbell, Roger Wilson, Ronan McCormack, Bernard Jackman, and Shaun Payne. Notable inclusions are Gordon D'Arcy returning after injury and Munster flanker Alan Quinlan, who returns to international consideration. David Wallace and Victor Costello are notably absent from the squad due to intense competition in back-row positions. Ulster's representation is at its highest in a training panel for some time, with five players selected. The squad also features 12 Munster players, 11 Leinster players, and four British-based players. Kieran Campbell expressed shock upon receiving his call-up, citing his childhood memories of playing against players like Brian O'Driscoll and Denis Hickie from Leinster.", "reference": "S Best (Ulster), S Byrne (Leinster), R Corrigan (Leinster), L Cullen (Leinster), S Easterby (Llanelli), A Foley (Munster), J Hayes (Munster), M Horan (Munster), B Jackman (Connacht), D Leamy (Munster), E Miller (Leinster), R McCormack (Ulster), D O'Callaghan (Munster), P O'Connell (Munster), J O'Connor (Wasps), M O'Kelly (Leinster), F Sheahan (Munster), R Wilson (Ulster), A Quinlan (Munster).T Bowe (Ulster), K Campbell (Ulster), G D'Arcy (Ulster), G Dempsey (Leinster), G Duffy (Harlequins), G Easterby (Leinster), D Hickie (Leinster), A Horgan (Munster), S Horgan (Leinster), D Humphreys (Ulster), K Maggs (Ulster), G Murphy (Leicester), B O'Driscoll, (Leinster), R O'Gara (Munster), S Payne (Munster), P Stringer (Munster).Ulster scrum-half Kieran Campbell is one of five uncapped players included in Ireland's RBS Six Nations squad.Munster and Leinster have 12 and 11 players in the squad respectively while Jackman is the sole Connacht representative.Ulster forward Ronan McCormack said he was \"totally shocked\" to be included.K Gleeson (Leinster), T Howe (Ulster), J Kelly (Munster), N McMillan (Ulster).Four British-based players are also included.Campbell is joined by Ulster colleagues Roger Wilson and Ronan McCormack along with Connacht's Bernard Jackman and Munster's Shaun Payne."}