{"raw_text": "Barbarians 19-47 New Zealand\n \n New Zealand proved too strong for an Australian-dominated Barbarians to round off their unbeaten northern hemisphere tour with an easy win.\n \n Rico Gear ran in two of the All Blacks' seven tries in what was a predominantly second-string line-up. The Baa-Baas did threaten, scoring tries through Albert van den Bergh, Xavier Rush and Andrea Lo Cicero, but never looked like winning. All Black Aaron Mauger was in good form with the boot, adding 10 points. The All Blacks featured only two of the side which started last weekend's emphatic Test victory over France in Paris, while the Baa-Baas had nine Wallabies in their starting line-up. And New Zealand coach Graham Henry said: \"It was a quality performance against a very experienced side and a number of young guys came through very well. \"They learnt from the older players and this was a way of thanking the guys who had been mentoring them on the tour.\" But the running rugby the crowd had been hoping for rarely materialised. Marty Holah got the All Blacks onslaught under way with his fifth-minute try before Rush hit back moments later. But New Zealand went ahead once more as Gear made use of the space vacated by a temporarily injured Chris Latham to slide in. Ma'a Nonu then found his way through the Barbarians defence to give his side a 19-7 half-time lead. The hosts failed to ignite in the second half and, the moment Gear scored his second just after the interval, there was only ever going to be one winner. Lo Cicero, the sole European for the Barbarians, bundled over for a try to briefly curtail the deficit. But the match was blighted by controversy moments later when Justin Marshall, was felled with a high tackle by Jimmy Cowan. Referee Andy Turner waved play on and Casey Laulala coasted in for his side's fifth try. Jermoe Keino and Piri Weepu both added tries to the All Blacks' tally before the final whistle, while van den Bergh gained some consolation for the Baa-Baas. After the match, Barbarians coach Bob Dwyer warned that South African flanker Schalk Burger needed a proper off-season break to maintain his standards. Burger, 21, was recently crowned player of the year by both his peers and the International Rugby Board, but has struggled for form in recent weeks. \"It's his first year at that level and he was phenomenal up until the end of the southern hemisphere season. \"I don't think he's played anywhere near that level on tour,\" he said.\n", "llama3.2:1b": "New Zealand defeated an Australian-dominated Barbarians 19-47 with seven tries from Rico Gear, including two in the second half. The All Blacks' starting lineup featured only two players from their last Test victory over France. New Zealand coach Graham Henry praised the team's learning experience and young players' contributions.", "llama3.2:3b": "New Zealand beat a second-string Barbarians team 19-47 in a one-sided rugby match, with All Blacks player Rico Gear scoring two tries. The Baa-Baas threatened to score but could not overcome the experienced New Zealand side, who featured only two of their starting lineup from last weekend's Test victory over France. Schalk Burger was criticized by his coach Bob Dwyer for struggling on tour despite being crowned player of the year by peers and the International Rugby Board.", "gemma2:2b": "New Zealand defeated the Barbarians 47-19 in a match featuring mostly second-string All Blacks players.  The All Blacks dominated with Rico Gear scoring two tries, while Aaron Mauger kicked points for his side. The Barbarians scored some tries but struggled to maintain their momentum and ultimately lost to New Zealand.  \n", "qwen2.5:0.5b": "New Zealand beat Australia 19-7 to keep their unbeaten northern hemisphere tour alive, with two New Zealand players scoring tries: Rico Gear from the Baa-Baas line-up and Martino Holah (his fifth-minute try). The Baa-Baas team won the match after a high tackle by Justin Marshall on Jermoe Keino. Burger struggled for form during his early months in the tour, but he was crowned player of the year at South Africa's national level.", "qwen2.5:1.5b": "New Zealand defeated Australia's Barbarians 32-19, despite second-string All Blacks lineup. Gear scored two tries for New Zealand, while Mauger provided excellent boots. Despite a promising start by the Baa-Baas, they failed to capitalize after half-time and were eliminated. Burger struggled during the contest.", "qwen2.5:3b": "Barbarians 19-47 New Zealand:\nNew Zealand defeated an Australian-dominated Barbarians team in their final unbeaten match of a northern hemisphere tour. Rico Gear scored two tries, while Albert van den Bergh and others also contributed for the Barbarians. The All Blacks were made up mostly of second-string players, including only two from the Test-winning side against France. Despite some promising moments, particularly in the first half, the game was largely dominated by the All Blacks, with Marty Holah, Ma'a Nonu, Jermoe Keino, Piri Weepu, and Gear scoring tries. The match ended in a one-sided victory for New Zealand, which Coach Graham Henry credited as a quality performance against an experienced side. The Barbarians coach Bob Dwyer warned about Schalk Burger's need for a break to maintain his high standards.", "opencoder:1.5b": "New Zealand proved too strong for an Australian-dominated Barbarians to round off their unbeaten northern hemisphere tour with an easy win. They went ahead once more as Gear made use of the space vacated by a temporarily injured Chris Latham to slide in. Ma'a Nonu then found his way through the Barbarians defence to give his side a 19-7 half-time lead.\n", "smollm:1.7b": "The summary is concise and to the point, preserving key ideas and details from the original text. The main points are:\n\n1. The New Zealand team proved too strong for an Australian-dominated Barbarians to round off their unbeaten northern hemisphere tour with an easy win.\n2. Rico Gear ran in two of the All Blacks' seven tries in what was a predominantly second-string lineup.\n3. Rico Gear's performance was hampered by injuries, and he only managed to score once more before the Barbarians scored again.\n4. The New Zealand team featured only two of the side which started last weekend's emphatic Test victory over France in Paris, while the Baa-Baas had nine Wallabies in their starting lineup.\n5. And New Zealand coach Graham Henry said: \"It was a quality performance against an experienced side and a number of young guys came through very well.\"\n6. The All Blacks' coaching staff mentored them on the tour, and this helped the team to perform better.\n7. The Barbarians scored 19-7 in their first half, but they went ahead once more as Gear got the ball rolling with his fifth-minute try before Rush hit back moments later.\n8. The second half was marred by controversy when Justin Marshall, a young player from New Zealand, was felled with a high tackle by Jimmy Cowan.\n9. The referee, Andy Turner, waved play on and awarded the Barbarians 20 minutes to get into the final.\n10. Jermoe Keino and Piri Weepu both added tries to the All Blacks' tally before the final whistle, while van den Bergh gained some consolation for the Baa-Baas.\n\nThe summary is concise and easy to understand, with key ideas and details preserved from the original text.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help the user by summarizing the given text concisely while preserving key ideas and details. The output should be plain text without any explanations or formatting.\n\nFirst, I'll read through the entire text carefully to understand its main points. The article is about a rugby match between New Zealand and the All Blacks in 19-47 New Zealand. It discusses how New Zealand's strong performance was met by the All Blacks' two tries, despite their mostly second-string line-up.\n\nI notice that the user wants only the summary without any explanations or extra information. So I'll focus on capturing each important aspect of the match, including key players, scores, and any notable moments like Marty Holah's try or Justin Marshall being sent off.\n\nI should ensure that all critical details are included: New Zealand's victory, All Blacks' performance with two tries, the coach's comment about mentorship, the crowd's expectation for running rugby, and the specific events during the game like Jermoe Keino and Piri Weepu scoring their own goals.\n\nPutting it all together, I'll structure the summary to highlight New Zealand's dominance, All Blacks' lack of pace, key players, and the overall outcome. This way, the summary is concise yet comprehensive.\n</think>\n\nNew Zealand demonstrated exceptional performance in their last northern hemisphere tour match, securing an easy 19-47 victory over the All Blacks. The All Blacks, despite a predominantly second-string line-up, managed only two tries with limited pace throughout the game. Key players included Aaron Mauger, Marty Holah (scoring his fifth try), Jermoe Keino, and Piri Weepu for New Zealand, while All Blacks had only nine Wallabies in their starting lineup. The coach emphasized mentorship from experienced players, and there were moments of controversy, including Justin Marshall being sent off for a high tackle by Jimmy Cowan. Overall, the match was a resounding success for New Zealand, though the All Blacks' form remained shaky.", "tinyllama:1.1b": "Barbarians 19-47 New Zealand defeated an Australian-dominated Barbarian team with ease, scoring two tries in each half to win comfortably. The All Blacks featured only two of the starting lineup and performed poorly as a result of several key players missing through injury or form. Despite playing under ideal conditions on their home soil, the hosts had few opportunities to score. The game was dominated by the superior rugby of the All Blacks, who displayed quality play but lacked firepower for most of the second half. After the match, coach Graham Henry warned that South African player Schalk Burgers needed a proper off-season break to maintain his high standards in international rugby.", "tinydolphin:1.1b": " The Barbarians, a team known for its strong northern hemisphere presence, faced a test from the All Blacks in New Zealand with an undefeated record and a predominantly second-string line-up. Despite dominating play and scoring tries through Xavier Rush, Martin Gear, and Andrea Lo Cicero, the All Blacks found a way to secure a narrow win. The game was marked by key performances from newcomers to the tour, including Aaron Mauger, who showcased his skills with the boot. Additionally, the Baa-Baas had nine Wallabies in their starting line-up, but struggled against the All Blacks' experience and intensity. Despite an impressive performance against the experienced team, the Barbarians were unable to capitalize on their opportunities and ultimately fell short of securing a win. Nonetheless, the All Blacks showed their dominance on tour and celebrated another significant victory in a predominantly successful journey for the northern hemisphere All Blacks.", "phi:2.7b": " New Zealand won an easy win against Barbarians, scoring five tries. The All Blacks dominated with tries from Rico Gear, Xavier Rush, and Andrea Lo Cicero. Only two All Black players were in the starting line-up compared to nine Wallabies for Barbarians. The match was short on running but controversial when Justin Marshall was tackled by Casey Laulala after a high tackle by Cowan caused the game to be paused. After the match, coach Bob Dwyer warned South African flanker Schalk Burger needed a proper break to maintain his standards.\n", "orca-mini:3b": " The Barbarians 19-47 New Zealand in a match where the All Blacks proved too strong for an Australian-dominated Barbarians to round off their unbeaten northern hemisphere tour with an easy win.", "hermes3:3b": "New Zeland beat Barbarians (with some Australian players) 19-7, with NZ all-stars dominating; NZ coach praises young players' performance.", "stablelm-zephyr:3b": "New Zealand's Barbarians team defeated an Australian-dominated Barbarians side in a match featuring predominantly second-string players. New Zealand coach Graham Henry praised the performance of the young players, who learned from the older players during the northern hemisphere tour. The match saw tries from Rico Gear, Aaron Mauger, Ma'a Nonu, and Jermoe Keino, with Albert van den Bergh scoring for the opposing Barbarians team. South African flanker Schalk Burger faced controversy after a high tackle by Jimmy Cowan resulted in a warning from referee Andy Turner.", "chatgpt-4o-latest": "New Zealand secured a dominant 47-19 victory over an Australian-dominated Barbarians side, concluding their unbeaten northern hemisphere tour. The All Blacks, featuring a largely second-string lineup, scored seven tries, with Rico Gear contributing two. Despite tries from Albert van den Bergh, Xavier Rush, and Andrea Lo Cicero, the Barbarians never posed a serious threat. Aaron Mauger added 10 points with the boot. New Zealand coach Graham Henry praised the young players' performance and learning experience. The match lacked the expected running rugby, and controversy arose when Justin Marshall was hit with a high tackle, leading to a Casey Laulala try. Jerome Kaino and Piri Weepu also scored for New Zealand, while van den Bergh added a late consolation try. Barbarians coach Bob Dwyer expressed concerns over Schalk Burger's form, emphasizing the need for a proper off-season break.", "stablelm2:1.6b": "New Zealand defeated the Australian-ruled Barbarians with an easy win, led by All Black Aaron Mauger's boot. Rico Gear scored two out of seven tries for the All Blacks in a primarily second-string lineup, while the Barbarians had nine players in their starting line-up. Marty Holah and Xavier Rush contributed tries early on; however, the hosts failed to ignite in the second half. The final result was determined by Lo Cicero's try after the interval. Additionally, there were controversies involving a high tackle and player of the year Schalk Burger needing an off-season break.", "granite3.1-dense:2b": "New Zealand, an All Blacks squad with a mix of experienced players and young talent, easily defeated an Australian-dominated Barbarians side during their northern hemisphere tour. The match, held in New Zealand, saw Rico Gear score twice for the All Blacks, while Albert van den Bergh, Xavier Rush, and Andrea Lo Cicero also found the tryline for the Baa-Baas. Despite threats from the Barbarians, New Zealand's superior skill and teamwork led to a 36-19 victory. Key performances included Aaron Mauger's accurate kicking and Marty Holah's early try. The All Blacks featured two players who started their previous match against France, while the Barbarians had nine Wallabies in their lineup. Coach Graham Henry praised young players for learning from veterans during this tour game. Controversy arose when referee Andy Turner allowed a try despite Justin Marshall's high tackle by Jimmy Cowan. Barbarians coach Bob Dwyer criticized South African flanker Schalk Burger, recommending he take an off-season break to maintain his form, which had waned after his recent player of the year accolade.", "reference": "Rico Gear ran in two of the All Blacks' seven tries in what was a predominantly second-string line-up.\"They learnt from the older players and this was a way of thanking the guys who had been mentoring them on the tour.\"But the match was blighted by controversy moments later when Justin Marshall, was felled with a high tackle by Jimmy Cowan.And New Zealand coach Graham Henry said: \"It was a quality performance against a very experienced side and a number of young guys came through very well.Burger, 21, was recently crowned player of the year by both his peers and the International Rugby Board, but has struggled for form in recent weeks.Marty Holah got the All Blacks onslaught under way with his fifth-minute try before Rush hit back moments later.\"It's his first year at that level and he was phenomenal up until the end of the southern hemisphere season.Lo Cicero, the sole European for the Barbarians, bundled over for a try to briefly curtail the deficit."}