{"raw_text": "Dawson wins England squad recall\n \n Wasps scrum-half Matt Dawson has been recalled to England's training squad ahead of the RBS Six Nations and been reinstated in the Elite Player Squad.\n \n Coach Andy Robinson dropped Dawson for the autumn Tests after he missed training to film 'A Question of Sport.' \"I always said I would consider bringing Matt back if I felt he was playing well,\" Robinson said. \"He merits his return on current form.\" Newcastle's 18-year-old centre Mathew Tait is also in the training squad. \"It's obviously an honour to be asked to train with England,\" said Tait, who has burst into contention recently. \"I look forward to going down and doing the sessions, but the most important thing at the moment is Sunday's game against Newport, so I'm not looking any further than that.\" Robinson has invited 42 players to attend a three-day session in Leeds next week, in which his squad will train in part with the Leeds Rhinos rugby league squad.\n \n With Mike Tindall ruled out of the opening two matches and Will Greenwood sidelined for the entire Six Nations, Tait is one of six or seven contenders for the two centre berths. Stuart Abbott, Jamie Noon, Ollie Smith, Olly Barkley and Henry Paul - who retains his place despite his early substitution against Australia - are also in the mix. Ben Cohen could also be considered after switching from the wing for his club Northampton recently. Prop Phil Vickery and lock Simon Shaw both return to the squad after missing the autumn Tests through injury, while Wasps wing Tom Voyce is recalled. The group also includes Bath flanker Andy Beattie and Leicester hooker George Chuter. \"Beattie has matured greatly as a player these past two seasons,\" Robinson said. Jonny Wilkinson, Tindall and Martin Corry have all been included despite their unavailability for the opening two matches against Wales and France.\n \n The revised 56-man elite squad includes Wasps hooker Phil Greening, who replaces the retired Mark Regan, and Sale wing Mark Cueto. Cueto was selected for the November internationals despite not being part of the group, but scored four tries in three England appearances. Leicester scrum-half Harry Ellis has also been promoted from the senior national academy, and will contest the number nine jersey with Dawson and Gloucester's Andy Gomarsall. The players in Robinson's elite squad can only play 32 matches for club and country. They can be called up for a total of 16 training days in addition to the recognised international weeks for each of the years leading up to the next World Cup.\n \n Balshaw, Cohen, Cueto, Lewsey, Robinson, Simpson-Daniel, Voyce, Abbott, Noon, Paul, Smith, Tait, Tindall, Barkley, Hodgson, King, Wilkinson, Dawson, Ellis, Gomarsall.\n \n Chuter, Thompson, Titterrell, Rowntree, Sheridan, Stevens, Vickery, White, Borthwick, Brown, L Deacon, Grewcock, Kay, Shaw, Beattie, Corry, Forrester, Hazell, Jones, Moody, Vyvyan, J Worsley.\n \n Abbott, Balshaw, Borthwick, A Brown, Chuter, Cohen, Corry, Cueto, Dawson, Ellis, Flatman, Gomarsall, Greening, Greenwood, Grewcock, Hazell, Hill, Hodgson, Kay, King, Lewsey, Moody, Noon, Paul, Robinson, Rowntree, Shaw, Simpson-Daniel, Thompson, Tindall, Titterrell, Vickery, Vyvyan, White, Wilkinson, J Worsley, M Worsley.\n \n Barkley, Beattie, Christophers, L Deacon, Forrester, C Jones, Palmer, Rees, Sheridan, Skinner, Smith, Stevens, Tait, Voyce.\n \n Dowson, Haughton, Monye, Roques, P Sanderson.\n", "llama3.2:1b": "Matt Dawson has been recalled to England's training squad for the RBS Six Nations and Elite Player Squad after missing training due to filming commitments.\n\nAdditionally, wasps centre Mathew Tait is also in the training squad, while Newcastle's Ben Cohen could be considered after switching from wing for Northampton.", "llama3.2:3b": "Matt Dawson has been recalled to England's training squad ahead of the RBS Six Nations. The squad also includes Mathew Tait and a number of other players, including those who missed the autumn Tests due to injury or unavailability. The revised 56-man elite squad includes notable players such as Jonny Wilkinson, Martin Corry, and Phil Vickery. Dawson will compete with Harry Ellis for the scrum-half position.", "gemma2:2b": "Matt Dawson has been recalled to England's training squad ahead of the RBS Six Nations. He is among 42 players invited for a three-day session in Leeds next week, along with  young center Mathew Tait.  Several key players remain unavailable due to injuries and other commitments. This new elite squad includes experienced and young talents, including Phil Vickery, Simon Shaw, Tom Voyce, and Jonny Wilkinson. The group can only play 32 matches for club and country while attending a total of 16 training days over the next year.  \n", "qwen2.5:0.5b": "Aired off Wasps scrum-half Matt Dawson for England's training squad ahead of the RBS Six Nations and the Elite Player Squad. Dawson missed training to film \"A Question of Sport\" after being dropped from the group due to missing training to film a 'Question of Sport'. The squad comprises six players, including Matt Dawson, Mathew Tait, Stuart Abbott, Jamie Noon, Ollie Smith, Olly Barkley, and Henry Paul. Highlights include Phil Greening replacing Mark Regan, Sale wing Harry Ellis promoted from the senior national academy, and George Chuter also in the squad.", "qwen2.5:1.5b": "Matt Dawson returns to England's training squad ahead of the RBS Six Nations. Newcastle center Mathew Tait also joins the team for upcoming games against Newport and Wales. Players named in the revised 56-man elite squad include Wasps hooker Phil Greening and Leicester scrum-half Harry Ellis, who replaces injured players and has a promotion to senior national academy status.", "qwen2.5:3b": "Matt Dawson has been recalled to England's training squad ahead of the RBS Six Nations after being dropped for autumn Tests due to missing training to film 'A Question of Sport.' Newcastle's Mathew Tait is also in the squad. Stuart Abbott, Jamie Noon, Ollie Smith, Olly Barkley and Henry Paul are potential center contenders with Ben Cohen joining from wing. Wasps' Tom Voyce returns after being away for club reasons, while Phil Vickery and Simon Shaw come back after injury absence. The revised 56-man elite squad includes players like Mark Cueto, Harry Ellis, Andy Gomarsall, and new recruit Mark Greening. Robinson's squad can only play up to 32 matches per season for club and country, with additional training days available before the next World Cup.", "opencoder:1.5b": "The summary of the text can be as follows:\n\n1. Dawson wins England squad recall\n\n2. Has been recalled to England's training squad ahead of the RBS Six Nations and been reinstated in the Elite Player Squad.\n\n3. Coach Andy Robinson dropped Dawson for the autumn Tests after he missed training to film 'A Question of Sport.'\n\n4. \"I always said I would consider bringing Matt back if I felt he was playing well,\" Robinson said.\n\n5. Newcastle's 18-year-old centre Mathew Tait is also in the training squad and says \"It's obviously an honour to be asked to train with England.\"\n\n6. The group includes Wasps hooker Phil Greening, who replaces the retired Mark Regan, and Sale wing Mark Cueto. Cueto was selected for the November internationals despite not being part of the group, but scored four tries in three England appearances.\n\n7. Robo players include St.uart Abbott, Jamie Noon, Olly Smith, Olly Barkley and Henry Paul. They retire from the squad after each game against Australia.\n\n8. The 56-man elite squad includes Wasps hooker George Chuter, who has been promoted from the senior national academy, and will contest the number nine jersey with Dawson and Gloucester's Andy Gomarsall.\n\n9. Robo players include Jonny Wilkinson, Tindall and Martin Corry all unavailability for England and France.\n\n10. The total 16 training days in addition to the recognised international weeks for each of the years leading up to the next World Cup. Players can be called up for a total of 16 training days.\n\n11. The rest of the players are Balshaw, Cohen, Cueto, Lewsey, Robinson, Simpson-Daniel, Thompson, Tindall, Titterrell, Vickery, Vyvyan, White, Wilkinson and J Worsley.\n\n12. They comprise Bath flanker Andy Beattie and Leicester hooker George Chuter.\n", "smollm:1.7b": "The summary is:\n\nDawson wins England squad recall\n\nWasps scrum-half Matt Dawson has been recalled to England's training squad ahead of the RBS Six Nations and been reinstated in the Elite Player Squad.\n\nCoach Andy Robinson dropped Dawson for the autumn Tests after he missed training to film 'A Question of Sport.' \"I always said I would consider bringing Matt back if I felt he was playing well,\" Robinson said. \"He merits his return on current form.\" Newcastle's 18-year-old centre Mathew Tait is also in the training squad. \"It's obviously an honour to be asked to train with England,\" said Tait, who has burst into contention recently. \"He looks forward to going down and doing the sessions, but the most important thing at the moment is Sunday's game against Newport, so I'm not looking any further than that.\" Robinson has invited 42 players to attend a three-day session in Leeds next week, in which his squad will train in part with the Leeds Rhinos rugby league squad.\n\nWith Mike Tindall ruled out of the opening two matches and Will Greenwood sidelined for the entire Six Nations, Tait is one of six or seven contenders for the two centre berths. Stuart Abbott, Jamie Noon, Ollie Barkley and Henry Paul - who retains his place despite his early substitution against Australia - are also in the mix.\n\nThe revised 56-man elite squad includes Wasps hooker Phil Greening, who replaces the retired Mark Regan, and Sale wing Mark Cueto. Cueto was included for the November internationals despite not being part of the group, but scored four tries in three England appearances. Leicester hooker Harry Ellis has also been promoted from the senior national academy, and will contest the number nine jersey with Dawson and Glasgow's Andy Beattie. The players in Robinson's elite squad can only play 32 matches for club and country. They can be called up for a total of 16 training days in addition to the recognized international weeks for each of the years leading up to the next World Cup.\n\nBalshaw, Cohen, Cueto, Dawson, Ellis, Flatman, Grewcock, Hazell, Hill, Hodgson, King, Wilkinson, L Deacon, J Worsley, M Worsley are all included in the 56-man elite squad.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Dawson being recalled for England's squad and some other key players. The user wants a concise summary with only the key ideas and details.\n\nFirst, I'll read through the text carefully to identify the main points. Dawson was recalled from England's training squad after missing his training to film a documentary. His return is based on current form. He's still in his 18-year-old position as a scrum-half. Mathew Tait is also with the squad.\n\nThen, I'll look at the other players who are being brought in, like Mathew Tait, Tom Tait, and others. They have some mentions of the 56-man elite squad that includesWasps players, including Phil Greening instead of Mark Regan and Mark Cueto from Wasps.\n\nI notice a lot of specific names and some details about their roles. I should make sure to include all these names as they're part of the summary. Also, there's mention of training days for each year leading up to the World Cup, which is important information for understanding how the players will train.\n\nWait, does the user want just the key points without explanations? Yes, they said no explanations and no formatting or reasoning, so I should keep it simple and only focus on the main info about Dawson's recall and the other team members in the squad.\n\nI'll make sure to include all the names and roles mentioned, as they're crucial to the summary. I need to avoid any extra details that aren't essential for understanding the main points about this particular text.\n</think>\n\nDawson is recalled to England’s training squad after missing his training due to film of a documentary. He remains at 18-year-old scrum-half position. Mathew Tait is also in training. The team includes Wasps players, including Phil Greening and Mark Cueto, with others who return or are injured. Each year leading up to the World Cup has designated training days for new players.", "tinyllama:1.1b": "Awsons wins England squad recall: Wasps scrum-half Matt Dawson has been recalled to England's training squad ahead of the RBS Six Nations and has also been reinforced in the Elite Player Squad. The 42 players, who include 18-year-old center Mathew Tai, will attend a three-day session in Lee's next week. With Mike Tiundall ruled out of the opening two matches and Will Greenwood sidelined for the entire Six Nations, Tai is one of six or seven content contenders for the two center berths. Ben Cohen, Olly Barklay, Jake Ball, Jonathan Davies, Adam Hastings, Danny Cipriani, Jonny Wilkinson, Tom Viete and Jamie Noon are also in the mix.", "tinydolphin:1.1b": " The summary describes the current England squad and their notable additions for the upcoming Six Nations and RBS World Cup. Notable absentees include Mark Regan, who has been ruled out due to injury. This squad represents a mix of experience and youth in addition to those mentioned above.", "phi:2.7b": " The coach of the English national rugby team has recalled scrum-half Matt Dawson to their training squad for the upcoming RBS Six Nations tournament and the Elite Player Squad. He was dropped after missing training sessions due to a personal commitment but will be reinstated if he performs well. Newcastle' 18-year-old centre Mathew Tait is also in the training squad. There are six or seven contenders for two centre berths, including Stuart Abbott, Jamie Noon, Ollie Smith, Olly Barkley and Henry Paul. Other potential players are Ben Cohen and Will Greenwood, but Mike Tindall is not available due to injury. The group includes several experienced players such as Jonny Wilkinson, Martin Corry, and Tom Voyce. New additions to the elite squad include Wasps hooker Phil Greening and Sale wing Mark Cueto. The players in this elite squad can only play 32 matches for club and country. They are expected to attend a three-day session with the Leeds Rhinos rugby league team.\n", "orca-mini:3b": " Dawson wins England squad recall and is reinstated in the Elite Player Squad, along with being one of six or seven contenders for the two centre berths. He is joined by Stuart Abbott, Jamie Noon, Ollie Smith, Olly Barkley and Henry Paul, who retains his place despite his early substitution against Australia. Phil Vickery and Simon Shaw both return to the squad after missing the autumn Tests through injury, while Wasps wing Tom Voyce is recalled. The group also includes Bath flanker Andy Beattie and Leicester hooker George Chuter. Players in Robinson's elite squad can only play 32 matches for club and country. They can be called up for a total of 16 training days in addition to the recognised international weeks for each of the years leading up to the next World Cup. The revised 56-man elite squad includes Wasps hooker Phil Greening, who replaces the retired Mark Regan, and Sale wing Mark Cueto. The players in Robinson's elite squad can only play 32 matches for club and country. They can be called up for a total of 16 training days in addition to the recognised international weeks for each of the years leading up to the next World Cup. The group includes six or seven contenders for the two centre berths, with Matt Dawson, Stuart Abbott, Jamie Noon, Ollie Smith, Olly Barkley and Henry Paul all in the mix.", "hermes3:3b": "Matt Dawson re-called to England rugby squad and Mathew Tait included.", "stablelm-zephyr:3b": "Matt Dawson, a Wasps scrum-half, has been recalled to England's training squad ahead of the Six Nations and reinstated in the Elite Player Squad. Coach Andy Robinson said he always considered bringing him back if he was playing well. Newcastle center Mathew Tait is also part of the training squad, with several other contenders for the center position. The revised 56-man elite squad includes new additions Phil Greening and Mark Cueto. Players in the squad can only play 32 matches for club and country and have additional training days available to them.", "chatgpt-4o-latest": "Matt Dawson has been recalled to England's training squad for the RBS Six Nations and reinstated in the Elite Player Squad after being dropped for missing training. Coach Andy Robinson cited Dawson's strong form as the reason for his return. Newcastle's 18-year-old centre Mathew Tait has also been included in the training squad. With injuries to key players like Mike Tindall and Will Greenwood, several contenders, including Tait, are vying for centre positions. Other notable recalls include Phil Vickery, Simon Shaw, and Tom Voyce. The revised 56-man elite squad features new additions such as Phil Greening and Mark Cueto, while Harry Ellis has been promoted to compete for the scrum-half position. Robinson's squad will train in Leeds, including sessions with the Leeds Rhinos rugby league team, and players in the elite squad have match and training limits leading up to the next World Cup.", "stablelm2:1.6b": "Scrum-_half Matt Dawson has been recalled to England's training squad ahead of the RBS Six Nations and reinstated in the Elite Player Squad after Coach Andy Robinson considered his current form. Newcastle centre Mathew Tait is also part of the training squad. Six or seven contenders are competing for two center spots, with Stuart Abbott, Jamie Noon, Ollie Smith, Olly Barkley and Henry Paul among them. Prop Phil Vickery and lock Simon Shaw return to the squad after missing the autumn Tests due to injury. The elite squad includes Wasps hooker Phil Greening, who replaces retired Mark Regan, and Sale wing Mark Cueto. The players in Robinson's elite squad can only play for club and country matches and can be called up for a total S+1 training days in addition to the recognized international weeks for each of the years leading up to the next World Cup.", "granite3.1-dense:2b": "England's training squad for the RBS Six Nations has been reshaped following coach Andy Robinson's decision to recall Wasps scrum-half Matt Dawson and include 18-year-old Newcastle centre Mathew Tait, who has gained prominence. Dawson was previously dropped due to missing training for 'A Question of Sport,' but his recent strong form has earned him a return. The coach also invited 42 players to a three-day session in Leeds, where the squad will train alongside Leeds Rhinos rugby league players.\n\nThe revised 56-man elite squad includes Dawson, Tait, and several other contenders for center positions such as Stuart Abbott, Jamie Noon, Ollie Smith, Olly Barkley, and Henry Paul, who retains his place despite recent substitutions. Mike Tindall is ruled out of the opening two matches, while Will Greenwood will miss all Six Nations games due to injury.\n\nKey players returning from injuries are prop Phil Vickery and lock Simon Shaw, with Tom Voyce also recalled. Notable inclusions despite being unavailable for the initial matches are Jonny Wilkinson, Mike Tindall, and Martin Corry. The squad features 16 players who can play 32 matches for club and country over a year leading up to the next World Cup, with 16 additional training days during that period.", "reference": "Wasps scrum-half Matt Dawson has been recalled to England's training squad ahead of the RBS Six Nations and been reinstated in the Elite Player Squad.Balshaw, Cohen, Cueto, Lewsey, Robinson, Simpson-Daniel, Voyce, Abbott, Noon, Paul, Smith, Tait, Tindall, Barkley, Hodgson, King, Wilkinson, Dawson, Ellis, Gomarsall.Abbott, Balshaw, Borthwick, A Brown, Chuter, Cohen, Corry, Cueto, Dawson, Ellis, Flatman, Gomarsall, Greening, Greenwood, Grewcock, Hazell, Hill, Hodgson, Kay, King, Lewsey, Moody, Noon, Paul, Robinson, Rowntree, Shaw, Simpson-Daniel, Thompson, Tindall, Titterrell, Vickery, Vyvyan, White, Wilkinson, J Worsley, M Worsley.Newcastle's 18-year-old centre Mathew Tait is also in the training squad.Robinson has invited 42 players to attend a three-day session in Leeds next week, in which his squad will train in part with the Leeds Rhinos rugby league squad.\"Beattie has matured greatly as a player these past two seasons,\" Robinson said.Prop Phil Vickery and lock Simon Shaw both return to the squad after missing the autumn Tests through injury, while Wasps wing Tom Voyce is recalled.The players in Robinson's elite squad can only play 32 matches for club and country.Chuter, Thompson, Titterrell, Rowntree, Sheridan, Stevens, Vickery, White, Borthwick, Brown, L Deacon, Grewcock, Kay, Shaw, Beattie, Corry, Forrester, Hazell, Jones, Moody, Vyvyan, J Worsley.The revised 56-man elite squad includes Wasps hooker Phil Greening, who replaces the retired Mark Regan, and Sale wing Mark Cueto."}