{"raw_text": "Lions blow to World Cup stars\n \n British and Irish Lions coach Clive Woodward says he is unlikely to select any players not involved in next year's RBS Six Nations Championship.\n \n World Cup winners Lawrence Dallaglio, Neil Back and Martin Johnson had all been thought to be in the frame for next summer's tour to New Zealand. \"I don't think you can ever say never,\" said Woodward. \"But I would have to have a compulsive reason to pick any player who is not available to international rugby.\" Dallaglio, Back and Johnson have all retired from international rugby over the last 12 months but continue to star for their club sides. But Woodward added: \"The key thing that I want to stress is that I intend to use the Six Nations and the players who are available to international rugby as the key benchmark. \"My job, along with all the other senior representatives, is to make sure that we pick the strongest possible team. \"If you are not playing international rugby then it's still a step up to Test rugby. It's definitely a disadvantage.\n \n \"I think it's absolutely critical and with the history of the Lions we have got to take players playing for the four countries.\" Woodward also revealed that the race for the captaincy was still wide open. \"It is an open book,\" he said. \"There are some outstanding candidates from all four countries.\" And following the All Blacks' impressive displays in Europe in recent weeks, including a 45-6 humiliation of France, Woodward believes the three-test series in New Zealand will provide the ultimate rugby challenge. \"Their performance in particular against France was simply awesome,\" said the Lions coach. \"Certain things have been suggested about the potency of their front five, but they're a very powerful unit.\" With his customary thoroughness, Woodward revealed he had taken soundings from Australia coach Eddie Jones and Jake White of South Africa following their tour matches in Britain and Ireland.\n \n As a result, Woodward stressed his Lions group might not be dominated by players from England and Ireland and held out hope for the struggling Scots. \"Scotland's recent results have not been that impressive but there have been some excellent individual performances. \"Eddie in particular told me how tough they had made it for Australia and I will take on board their opinions.\" And Scotland forward Simon Taylor looks certain to get the call, provided he recovers from knee and tendon problems. \"I took lessons from 2001 in that they did make a mistake in taking Lawrence Dallaglio when he wasn't fit and went on the trip. \"Every player has to be looked at on their own merits and Simon Taylor is an outstanding player and I have no doubts that if he gets back to full fitness he will be on the trip. \"I am told he should be back playing by March and he has plenty of time to prove his fitness for the Lions - and there are other players like Richard Hill in the same boat.\"\n", "llama3.2:1b": "Clive Woodward says he is unlikely to select any players not involved in next year's RBS Six Nations Championship. Woodward also revealed that the race for the captaincy is still open, with outstanding candidates from all four countries. He believes that a strong performance by the All Blacks will provide the ultimate challenge for the Lions, and that Scotland has potential but needs to improve its recent results before being considered for selection.", "llama3.2:3b": "Lions coach Clive Woodward is unlikely to select any non-RBS Six Nations Championship players for next year's tour to New Zealand. He plans to use the Six Nations as a benchmark to pick the strongest possible team, prioritizing international rugby experience over club side performances. The captaincy race remains open, with candidates from all four countries in contention. Woodward has taken soundings from other coaches and believes Scotland forward Simon Taylor is an outstanding player who could return for the tour by March, provided he recovers from injury.", "gemma2:2b": "Clive Woodward, coach of the British and Irish Lions, states that only players involved in the upcoming RBS Six Nations Championship will be considered for the 2010 tour to New Zealand. The choice of captaincy is still open with numerous strong candidates from all four countries. Woodward acknowledges the All Blacks' impressive recent performance against France and anticipates a challenging test series in New Zealand. He also notes that Scotland has shown potential despite their recent struggles, seeking to leverage their experience as learned in 2001.  \n", "qwen2.5:0.5b": "Lion's boss Clive Woodward says he won't select any players not involved in next year's RBS Six Nations Championship. He believes it's important that World Cup winners Lawrence Dallaglio, Neil Back and Martin Johnson be included. Woodrow also revealed Scotland should take the spot for England and Ireland as they are tough but might be able to use Scotland forward Simon Taylor.", "qwen2.5:1.5b": "British and Irish Lion coach Clive Woodward says he won't select any players not involved in next year's RBS Six Nations Championship, stressing the key benchmark is international rugby performance. He also reveals the race for captaincy is still wide open and acknowledges a 45-6 defeat by France against the All Blacks' display might provide an \"ultimate rugby challenge\" in New Zealand.", "qwen2.5:3b": "British and Irish Lions coach Clive Woodward is unlikely to select any players not involved in next year's RBS Six Nations Championship. Previous World Cup winners Lawrence Dallaglio, Neil Back, and Martin Johnson have retired but continue playing for club sides. Woodward intends to use Six Nations players as the benchmark and will consider all four countries' representatives. The race for Lions captaincy remains open, with emphasis on New Zealand's potent All Blacks side in the three-test series. Woodward has taken advice from Australia coach Eddie Jones and South Africa's Jake White regarding their tours. He considers Scotland's performances, including Simon Taylor's fitness, as potential candidates for selection.", "opencoder:1.5b": "Lions' unpredictable nature can lead to weak teams, as they may not have a diverse player base. Therefore, it is vital that we select strong, capable players from around the world, rather than ones not involved in the upcoming rugby season.\n\nEngage with international and domestic rugby enthusiasts who are well-versed with players' strengths, weaknesses and capabilities, ensuring to pick players who can withstand any potential challenge. The goal of the team should be to build strength and endurance over time, thus we must focus on players with a strong dribbling, agility and finishing ability.\n\nMoreover, it's equally important to consider players' performance in international matches. Good international performances can enhance player's chances of coming up in top-tier positions like captain or managerial role.\n\nLastly, keep track of players' potential injuries and future prospects in rugby. The more we select, the better our team is positioned to withstand potential challenges.\n\nBy taking these aspects into account, we should be able to build a strong, capable team that can withstand the unpredictable nature of rugby.\n", "smollm:1.7b": "The summary is concise, preserving key ideas and details while omitting unnecessary information. It captures the main points from the original text:\n\n1. The British and Irish Lions coach Clive Woodward says he is unlikely to select any players not involved in next year's RBS Six Nations Championship.\n2. World Cup winners Lawrence Dallaglio, Neil Back and Martin Johnson had all been thought to be in the frame for next summer's tour to New Zealand.\n3. Woodward believes he intends to use the Six Nations and the players who are available to international rugby as the key benchmark.\n4. The key thing that Woodward wants to stress is that he intends to use the Six Nations and the players who are available to international rugby as the key benchmark for his team selection.\n5. Woodward also reveals that the race for the captaincy was still wide open, with certain outstanding candidates from all four countries.\n6. The All Blacks' impressive displays in Europe last week were particularly noteworthy, including a 45-6 humiliation of France.\n7. Woodward believes the three-test series in New Zealand will provide the ultimate rugby challenge for his team.\n8. He holds out hope for Scotland's recent results and Eddie Jones and Jake White of South Africa following their tour matches in Britain and Ireland.\n9. Woodward also stresses that he has taken soundings from Australia coach Eddie Jones and Jake White of South Africa, providing valuable insights into the teams' performances.\n10. Woodward believes Scotland's recent results have not been as impressive as they could be, but there have been some excellent individual performances.\n11. He is told that Simon Taylor should recover from his knee and tendon problems by March to ensure he gets back to full fitness for the Lions - and there are other players like Richard Hill in the same boat.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Clive Woodward and his team. Let me read through it carefully.\n\nThe user wants a concise summary without any explanations or formatting, just plain text. The key points I should include are: the coach's thoughts on selecting players for the Six Nations, mentions of Lawrence Dallaglio, Neil Back, and Martin Johnson who all retired but keep playing for their clubs, Woodward's reasoning about using available players as a benchmark, the importance of covering four countries, the race for captaincy being open, mention of Australia and South Africa coaches taking soundings, and the hope for Scotland.\n\nI need to make sure I capture all these without losing important details. Let me start by stating the main idea: Woodward likely won't select players from England or Ireland, hoping for a strong squad despite some current issues.\n\nHmm, should I include the entire passage? The user said output only the summary as plain text—no explanations, no formatting, no reasoning. So maybe just key points.\n\nI think breaking it into two sentences would work: first about selection criteria, second about Scotland's hopes.\n</think>\n\nClive Woodward likely won't select players from England or Ireland for the Six Nations team, as he aims to build a strong squad using available international rugby players as a benchmark. He remains hopeful for Scotland, which has shown impressive results in recent tournaments, despite some challenges with the team composition.", "tinyllama:1.1b": "The British and Irish Lion coach Clively Woodward stated that he is unlikely to pick any players not involved in the upcoming RBS Six Nations Championship, stating that they will be selected based on their own merits rather than the players' availability. The key criterion for selection is to use the strength of the four countries' squads as a benchmark. Woodward stressed that Australia coach Eddie Jones and South African coach Jaco White have sounded him out, but has not taken any solid opinions on the current players. Scotland forward Simon Taylor is expected to be selected based on his impressive performances in recent tours. Despite some uncertainty about the team's prospects, England and Ireland are seen as being well-represented among the possible candidates for the upcoming tour of New Zealand.", "tinydolphin:1.1b": " The British and Irish Lions team is set to select a new captain for the upcoming series against the All Blacks, with coach Clive Woodward indicating that the criteria for choosing the best player available will be used. The squad will participate in three tests over two weeks in New Zealand next year, and it remains to be seen whether the current crop of players can rise to the challenge presented by the all-powerful All Blacks.", "phi:2.7b": " The British and Irish Lions coach, Clive Woodward, is unlikely to select any players who will not be involved in the RBS Six Nations Championship. He believes that the key benchmark should be players playing for their national team or test rugby, and that he needs to take into account all four countries represented by the Lion's squad. The race for the captaincy is still open, with several outstanding candidates from all four nations. After watching the All Blacks' performances in Europe, Woodward believes that they will provide the ultimate challenge during the three-test series in New Zealand. He has taken soundings from Australia and South Africa coaches, Eddie Jones and Jake White, and believes there may be a shift away from England and Ireland to other players like Scotland's Simon Taylor who have been performing well recently but are dealing with knee and tendon issues.\n", "orca-mini:3b": " The British and Irish Lions coach Clive Woodward says he may not select any players who are not involved in next year's RBS Six Nations Championship. He also revealed that the race for the captaincy is still wide open, and he took lessons from 2001 tour to New Zealand where they made a mistake in taking Lawrence Dallaglio when he wasn't fit. Simon Taylor looks certain to get the call, provided he recovers from knee and tendon problems.", "hermes3:3b": "Lions coach Woodward unlikely to pick unavail international rugby players for NZ tour, prioritizing Six Nations players.", "stablelm-zephyr:3b": "British and Irish Lions coach Clive Woodward states he is unlikely to select players not involved in next year's RBS Six Nations Championship. He emphasizes using the available international rugby players as a benchmark for the strongest possible team. Woodward mentions that the race for captaincy is open and highlights Scotland's potential, expressing hope for Simon Taylor's recovery after recovering from knee and tendon problems.", "chatgpt-4o-latest": "British and Irish Lions coach Clive Woodward stated he is unlikely to select players not involved in the 2005 Six Nations Championship, making it doubtful that World Cup winners Lawrence Dallaglio, Neil Back, and Martin Johnson will be included in the squad. While not ruling them out entirely, Woodward emphasized the importance of international rugby experience as a benchmark for selection. He also noted that the race for the team captaincy remains open, with strong candidates from all four nations. Acknowledging the strength of the All Blacks, particularly after their dominant win over France, Woodward consulted with Australia and South Africa's coaches for insights. He suggested that the Lions squad may not be dominated by English and Irish players and recognized individual Scottish performances despite the team's struggles. He highlighted Simon Taylor as a potential selection if he recovers from injury, stressing the importance of full fitness for all players.", "stablelm2:1.6b": "British & Irish Lions coach Clive Woodward is unlikely to select any players not involved in next year's RBS Six Nations Championship, as World Cup winners Lawrence Dallaglio, Neil Back, and Martin Johnson had been considered for a tour to New Zealand. Woodward plans to use the Six Nations players as the benchmark and aims to pick the strongest possible team based on international rugby availability. The captaincy is still open, with outstanding candidates from all four countries. Scotland forward Simon Taylor looks certain to join if he recovers from knee and tendon problems.", "granite3.1-dense:2b": "British and Irish Lions coach Clive Woodward stated that he is unlikely to select players not involved in next year's RBS Six Nations Championship, emphasizing that international rugby is crucial for Team selection. Players like Lawrence Dallaglio, Neil Back, and Martin Johnson, recent retirees from international rugby, are highly valued due to their club performances. Woodward stressed that the Six Nations will serve as the primary benchmark for choosing the strongest possible team, with no disadvantage for those not participating in international matches. He noted outstanding candidates from all four countries competing for key positions, including potential captaincy. Following impressive All Black performances against France, Woodward anticipates a formidable challenge in New Zealand. Australia and South African coaches provided insights, influencing his decision-making process. Despite Scotland's recent struggles, Woodward remains hopeful for their participation, citing Eddie Jones' praise of their impact on Australia. Simon Taylor, with potential knee and tendon issues, is seen as a likely pick if he recovers by March.", "reference": "But Woodward added: \"The key thing that I want to stress is that I intend to use the Six Nations and the players who are available to international rugby as the key benchmark.\"But I would have to have a compulsive reason to pick any player who is not available to international rugby.\"\"Every player has to be looked at on their own merits and Simon Taylor is an outstanding player and I have no doubts that if he gets back to full fitness he will be on the trip.\"I think it's absolutely critical and with the history of the Lions we have got to take players playing for the four countries.\"British and Irish Lions coach Clive Woodward says he is unlikely to select any players not involved in next year's RBS Six Nations Championship.As a result, Woodward stressed his Lions group might not be dominated by players from England and Ireland and held out hope for the struggling Scots.\"I am told he should be back playing by March and he has plenty of time to prove his fitness for the Lions - and there are other players like Richard Hill in the same boat.\"\"If you are not playing international rugby then it's still a step up to Test rugby.And following the All Blacks' impressive displays in Europe in recent weeks, including a 45-6 humiliation of France, Woodward believes the three-test series in New Zealand will provide the ultimate rugby challenge.Dallaglio, Back and Johnson have all retired from international rugby over the last 12 months but continue to star for their club sides."}