{"raw_text": "Wilkinson fit to face Edinburgh\n \n England captain Jonny Wilkinson will make his long-awaited return from injury against Edinburgh on Saturday.\n \n Wilkinson, who has not played since injuring his bicep on 17 October, took part in full-contact training with Newcastle Falcons on Wednesday. And the 25-year-old fly-half will start Saturday's Heineken Cup match at Murrayfield on the bench. But Newcastle director of rugby Rob Andrew said: \"He's fine and we hope to get him into the game at some stage.\" The 25-year-old missed England's autumn internationals after aggravating the haematoma in his upper right arm against Saracens. He was subsequently replaced as England captain by full-back Jason Robinson. Sale's Charlie Hodgson took over the number 10 shirt in the internationals against Canada, South Africa and Australia. Wilkinson's year has been disrupted by injury as his muscle problem followed eight months on the sidelines with a shoulder injury sustained in the World Cup final.\n", "llama3.2:1b": "Jonny Wilkinson will return to rugby against Edinburgh on Saturday after recovering from an injury. He took part in full-contact training with Newcastle Falcons and is expected to start in the bench role for England. Wilkinson has missed England's autumn internationals due to a shoulder injury, which aggravated during a match with Saracens earlier this year.", "llama3.2:3b": "Jonny Wilkinson will return from injury for Newcastle Falcons' Heineken Cup match against Edinburgh on Saturday, starting on the bench but potentially entering the game later.", "gemma2:2b": "Jonny Wilkinson will return to playing after an injury layoff for Newcastle Falcons against Edinburgh on Saturday. He will start on the bench.  He missed England's autumn internationals due to a re-injury of his arm and has not played since October 17th.   \n", "qwen2.5:0.5b": "England’s Jonny Wilkinson is set to return from injury after missing the autumn internationals due to a shoulder injury. He will play against Edinburgh on Saturday, starting at number 10 in the Scotland squad. Wilkinson has undergone full-contact training with Newcastle Falcons and should make his return soon. However, Andrew believes he can still get him into the game by the end of the year.", "qwen2.5:1.5b": "England fly-half Jonny Wilkinson will make long-awaited return from injury to play for Edinburgh in Heineken Cup match on Saturday, although not starting due to uncertainty about whether he'll be fully fit enough at that point.", "qwen2.5:3b": "England captain Jonny Wilkinson will face Edinburgh for the first time since October following a long recovery from an injured bicep. At 25, he participated in full-contact training with Newcastle Falcons and is set to come off the bench against Edinburgh in Saturday's Heineken Cup match at Murrayfield. Wilkinson missed England's autumn internationals after aggravating a hematoma in his arm. He was initially replaced as captain by Jason Robinson but Sale's Charlie Hodgson took over temporarily during those matches. Wilkinson has had an interrupted year, having also been sidelined with a shoulder injury sustained in the World Cup final.", "opencoder:1.5b": "\"England captain Jonny Wilkinson will make his long-awaited return from injury against Edinburgh on Saturday.\"\n\nThe captain of England, Jonny Wilkinson will make his return from injury against Edinburgh on Saturday.\n", "smollm:1.7b": "England captain Jonny Wilkinson will make his long-awaited return from injury against Edinburgh on Saturday. England fly-half Jonny Wilkinson took part in full-contact training with Newcastle Falcons on Wednesday and is expected to start Saturday's Heineken Cup match at Murrayfield on the bench. However, Newcastle director of rugby Rob Andrew said: \"He's fine and we hope to get him into the game at some stage.\" The 25-year-old missed England's autumn internationals after aggravating the haematoma in his upper right arm against Saracens. He was subsequently replaced as England captain by full-back Jason Robinson. Sale's Charlie Hodgson took over the number 10 shirt in the internationals against Canada, South Africa and Australia. Wilkinson's year has been disrupted by injury as his muscle problem followed eight months on the sidelines with a shoulder injury sustained in the World Cup final.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text. Let me read through it carefully.\n\nThe main event is Jonny Wilkinson from England making his return against Edinburgh. He was injured with a bicep and hasn't played since October 17. Newcastle Falcons gave him some training before the match on Saturday at Murrayfield. Rob Andrew said he's fine but not ready yet. Wilkinson missed internationals after a haematoma, so he was replaced by Jason Robinson. Sale's Charlie Hodgson took over number one for other countries.\n\nI need to capture all key points without explanations or formatting.\n</think>\n\nWilkinson, England captain Jonny, will return against Edinburgh on Saturday from Newcastle Falcons training. He missed the past eight months with an upper right arm injury sustained in a World Cup final and was replaced by Jason Robinson. His training included full-contact exercises before his match at Murrayfield against Edinburgh.", "tinyllama:1.1b": "England captain Jonny Wilkinson is set to make his long-awaited return from injury against Edinburgh on Satuday, taking part in full-contact training alongside Newcastle Falcons players on Wednesday. The fly-half will start the Heiniken Cup match at Murrayfield, but Newcastle director of rugby Rob Andrew stated that Wilkinson's health is \"fine\" and he hopes to get him into the game at some stage. Despite missing England's autumn internationals due to a haematoma incurred during the game against Saracens, Wilkinson was replaced as captain by Jason Robinson for the subsequent matches. Charlton Hoogson took over the number 10 shirt for the matches against Canada, South Africa and Australia, with Wilkinson's year interrupted by injury.", "tinydolphin:1.1b": " England captain Jonny Wilkinson is set to make his long-awaited return from injury when his team takes on Edinburgh at Murrayfield on Saturday. Wilkinson, who has been sidelined since injuring his arm in October, participated in full-contact training with Newcastle Falcons earlier this week. Although he took part in the session, it is unclear if he will start against Edinburgh. It was reported that Newcastle director of rugby Rob Andrew had said Wilkinson was \"fine\" and would be available for selection at some stage during the match. However, Andrew later clarified that Wilkinson was not yet fit enough to play, stating that his arm is in a \"battered but manageable state.\"", "phi:2.7b": " England captain Jonny Wilkinson will make his long-awaited return from injury against Edinburgh on Saturday after taking part in full-contact training with Newcastle Falcons and not playing since injuring his bicep on October 17th. He will start on the bench for the Heineken Cup match at Murrayfield but hopes to be included in the game, while Sale's Charlie Hodgson took over the number 10 shirt. Wilkinson has been out of action for eight months due to a shoulder injury and muscle problem that followed his shoulder injury from the World Cup final.\n", "orca-mini:3b": " Jonny Wilkinson will start Saturday's Heineken Cup match at Murrayfield on the bench after not playing since injuring his bicep in October.", "hermes3:3b": "Jonny Wilkinson to play for England against Edinburgh, returns from bicep injury.", "stablelm-zephyr:3b": "England captain Jonny Wilkinson is set to make a return from injury ahead of Newcastle Falcons' match against Edinburgh on Saturday. He last played on 17 October due to an injured bicep, but participated in full-contact training on Wednesday. Though he will start the game on the bench, Newcastle hopes to integrate him into the match at some point. Wilkinson missed England's autumn internations after aggravating his upper right arm haematoma during the Saracens match, which led to Jason Robinson taking over as captain and Charlie Hodgson playing in Wilkinson's position during the international matches against Canada, South Africa, and Australia. His year has been significantly disrupted due to injuries sustained, following an eight-month absence caused by a shoulder injury he sustained during the World Cup final.", "chatgpt-4o-latest": "England captain Jonny Wilkinson will return from injury for Newcastle against Edinburgh in the Heineken Cup on Saturday. He has not played since injuring his bicep on 17 October but participated in full-contact training. Wilkinson will start on the bench, with Newcastle's director of rugby Rob Andrew hopeful he will play. He missed England's autumn internationals due to the injury, leading to Jason Robinson replacing him as captain and Charlie Hodgson taking over as fly-half. Wilkinson's year has been plagued by injuries, including an earlier eight-month absence due to a shoulder injury from the World Cup final.", "stablelm2:1.6b": "England captain Jonny Wilkinson will return to action after missing the Autumn Internationsals due to a bicep injury, facing Edinburgh in the Heineken Cup at Murrayfield on Saturday. Despite being on the bench for England's international matches, he participated in full-contact training with Newcastle Falcons and is expected to be introduced into the game during the match.", "granite3.1-dense:2b": "Jonny Wilkinson, England's captain and 25-year-old fly-half, is set to rejoin Newcastle Falcons against Edinburgh on Saturday, following an injury that sidelined him since October 17 due to a bicep tear. He participated in full-contact training on Wednesday and will start the match on the bench. Despite his participation, he remains unavailable for international duties as England captain, having been replaced by Jason Robinson following an aggravated shoulder injury from the World Cup final. Charlie Hodgson filled in for Wilkinson during autumn internationals against Canada, South Africa, and Australia.", "reference": "England captain Jonny Wilkinson will make his long-awaited return from injury against Edinburgh on Saturday.Wilkinson, who has not played since injuring his bicep on 17 October, took part in full-contact training with Newcastle Falcons on Wednesday.Wilkinson's year has been disrupted by injury as his muscle problem followed eight months on the sidelines with a shoulder injury sustained in the World Cup final.The 25-year-old missed England's autumn internationals after aggravating the haematoma in his upper right arm against Saracens."}