{"raw_text": "Farrell saga to drag on - Lindsay\n \n Wigan chairman Maurice Lindsay says he does not expect a quick solution to the on-going saga of captain Andy Farrell's possible switch to rugby union.\n \n Leicester and Saracens are leading the chase for the player, but Lindsay told the BBC it was not yet a done deal. \"As well as the Rugby Football Union, the league, the individual club and the England coaching team have a say, so it's not a quick decision,\" he said. \"He's given us 12 years service so if he wants to go, we'd support him.\" The prospect of Farrell switching codes has been the main talking point of the Super League season so far. \"It came as a bolt out of the blue to us,\" admitted Lindsay. \"But he's a very loyal friend to the club, so there's no question that he's deserting us. He just fancies a challenge.\"\n \n Although the move would be a lucrative one for both Farrell and Wigan, Lindsay said money was not a motivating factor for the club. \"The money side of things hasn't been concluded, but it's not the point for Wigan,\" he told Radio Five Live. \"A shortage of money has never been a problem for us. \"Even if we did have it, under the salary cap we can't spend a penny of it anyway - we'd rather have the player.\"\n \n Lindsay also said he understood why rugby union was so interested in signing up Farrell. \"It'd be a great loss for us but a great boost for them,\" said the Warriors chief. \"This guy is an absolute sporting icon. He's been at the top for so long and has demonstrated so many attributes that you need to make it in a tough contact sport. \"Athletes like him - Ellery Hanley and Martin Johnson - don't come along very often. You're very lucky to have them whilst you've got them.\"\n", "llama3.2:1b": "Maurice Lindsay, Wigan chairman, says the club does not expect an immediate solution for captain Andy Farrell's potential switch to rugby union, due to various parties' involvement in the decision-making process.\n\nLindsay stated that he has 12 years of service from Farrell and would support him if he chose to leave the club, citing loyalty. However, he emphasized that money is not a motivating factor and that Wigan's salary cap limits their spending on player transfers.\n\nLindsay also acknowledged that rugby union is interested in signing up Farrell, citing his sporting icon status and attributes as an athlete.", "llama3.2:3b": "Wigan chairman Maurice Lindsay says he doesn't expect a quick solution to Andy Farrell's possible switch to rugby union, as clubs Leicester and Saracens are also interested in the player. The club would support him if he wants to leave, but money is not the main motivation for Wigan. Lindsay acknowledges that losing Farrell would be a significant blow, but sees the move as a great opportunity for rugby union.", "gemma2:2b": "Wigan chairman Maurice Lindsay expects the decision regarding Andy Farrell's potential switch from rugby league to rugby union to be a lengthy process, involving multiple parties and not just financial considerations. While Farrell's move would be financially advantageous for both him and the club, it's not the primary concern. Lindsay acknowledges the substantial impact of Farrell's choice on rugby union, emphasizing his influence and expertise as a significant selling point. He also highlights that money is not the main factor in this situation, and Wigan is committed to supporting Farrell regardless of his decision. \n", "qwen2.5:0.5b": "In the ongoing saga over Andy Farrell's potential switch to rugby union, Leicester and Saracens are leading the charge, but chairman Maurice Lindsay insists it is not yet a done deal. The club believes he has 12 years of service as a Wigan player, which would support him in making the decision. Despite money being an additional factor, the club sees Farrell as a valuable asset and underno obligation to sign for another club. They also consider that if they do make the move, it could be lucrative both for them and the club. While they understand rugby union's interest in signing Farrell, the club sees him as a significant player with high potential.", "qwen2.5:1.5b": "Wigan chairman Lindsay says he does not expect a quick decision on captain Andy Farrell switching from rugby league to union, citing the need for agreement from multiple parties before signing. The move has become a focal point of the Super League season, but it is seen as both beneficial and challenging for Wigan.", "qwen2.5:3b": "Wigan chairman Maurice Lindsay expects the ongoing debate over captain Andy Farrell's potential move to rugby union to persist, citing input from various parties including the Rugby Football Union and England coaching team. While Leicester and Saracens are leading the chase for Farrell, who has given Wigan 12 years of service, Lindsay says he would support his decision if needed. Despite it being a lucrative move financially for both parties, Wigan emphasizes loyalty over monetary concerns. Lindsay acknowledges rugby union's interest in Farrell, viewing him as a significant asset to their sport, praising his long-term success and skill set.", "opencoder:1.5b": "Farrell saga to drag on - Lindsay\n\nLindsay Wigan chairman Maurice Lindsay said he does not expect a quick solution to the ongoing saga of captain Andy Farrell's possible switch to rugby union.\n\nLeicester and Saracens are leading the chase for the player, but Lindsay told the BBC it was not yet a done deal. \"As well as the Rugby Football Union, the league, the individual club and the England coaching team have a say, so it's not a quick decision,\" he said. \"He’s given us 12 years service so if he wants to go, we’d support him.\" The prospect of Farrell switching codes has been the main talking point of the Super League season so far. \"It came as a bolt out of the blue to us,\" admitted Lindsay.\n\nAlthough the move would be a lucrative one for both Farrell and Wigan, Lindsay said money was not a motivating factor for the club. “The money side of things hasn’t been concluded, but it’s not the point for Wigan,” he told Radio Five Live. “A shortage of money has never been a problem for us. Even if we did have it, under the salary cap we can’t spend any penny of it anyway - we’d rather have the player.”\n\nLindsay also said he understood why rugby union was so interested in signing up Farrell. \"It'd be a great loss for us but a great boost for them,” said the Warriors chief.\n\n\"We’re happy to have him at the top for so long and has demonstrated many attributes that you need to make it in a tough contact sport. “Athletes like him - Ellery Hanley and Martin Johnson - don't come along very often. You're very lucky to have them whilst you’ve got them.\"\n", "smollm:1.7b": "The summary should contain the main ideas of the text, preserving key details while omitting unnecessary information. The focus is on the main points of the text, without adding or changing any of the original content.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely. Let me read through it carefully.\n\nThe main points are about Maurice Lindsay, Wigan's chairman, discussing the potential switch of Andy Farrell to rugby union. He doesn't expect a quick solution and mentions that even though the move is good for both teams, money isn't the motivating factor anymore because there's not enough funds available. He says he understands why the rugby union team would want him and thinks him very much as a sporting icon.\n\nI should focus on key ideas: Lindsay's stance, the impact on Wigan, and his views on funding. I'll make sure to include all that without getting into too much detail.\n</think>\n\nLindsay does not expect a quick solution for the ongoing saga of Andy Farrell switching to rugby union. He acknowledges the team is in a race against time for him but emphasizes the move's potential benefits for both Wigan and the rugby union team. Despite his understanding of why the rugby union interest would want him, he points out that funding remains a challenge due to financial constraints.", "tinyllama:1.1b": "The on-going saga of captain Andy Farrell's potential switch to rugby union has been the main topic of discussion in the Super League this season. While it's not a quick decision, Lindsay, the chairman of Warriors Rugby Limited, stated that he supports Farrell's desire for a change in codes if he wants to go. Despite the surprise move being reported by some media outlets, Lindsay said money was not a motivating factor for the club and emphasized the importance of loyalty and friendship towards the team. In terms of the Super League season so far, Wigan is currently leading the race for the title but Lindsay stated that a shortage of money has not been a problem for the club. The Warriors chief emphasized why rugby union was interested in signing up Farrell and underscored the importance of having a player like him at the top level.", "tinydolphin:1.1b": " The ongoing saga of Wigan captain Andy Farrell, with potential moves to rugby union due to a lack of funds, has dominated the Super League this season. Wigan chairman Maurice Lindsay told BBC Radio Five Live that while they would support Farrell if he left, it's not a done deal and the players and coaching staff need to make decisions for themselves. \n\nFarrell is renowned for his exceptional service with the club, having played over 12 years of rugby union with Wigan. The decision between Wigan or Leicester has been the main talking point of this season, with Farrell currently under contract at the DW Stadium until June 2026. \n\nDespite his loyalty to the club, Lindsay admits that he is unaware if Farrell is considering a move to rugby union. However, he does believe that the opportunity for Farrell to take on a different challenge could be one of the reasons behind his recent absence from the side's training sessions. \n\nLindsay also explained that while financial constraints may be a factor in Wigan's pursuit of Farrell, it is not the main driving force behind their decision. He said that money is not an issue for the club, and that the players and staff have to make decisions for themselves based on individual aspirations and career goals. \n\nLindsay emphasized his understanding of why rugby union has shown interest in signing Farrell. He noted that it would be a great loss for Wigan but a great boost for them if the player were to move to their ranks. The Warriors chief further explained that this is an exceptional athlete who has demonstrated numerous attributes throughout his career, such as skill and leadership. \n\nFarrell's status in rugby union has helped him reach several milestones over the years, including captaining England on two occasions and being awarded a knighthood for his services to the sport. Wigan is proud of their player, and they will do everything possible to support Farrell as he decides his next move.", "phi:2.7b": " Wigan chairman Maurice Lindsay does not expect a quick solution to captain Andy Farrell's possible switch to rugby union, as there are multiple parties involved in the decision-making process. Although it would be lucrative for both Farrell and Wigan, money is not the motivating factor for the club. They are more concerned about the player's loyalty and desire for a challenge. While they understand why rugby union is interested in signing up Farrell, they acknowledge his status as an athletic icon and appreciate his contribution to the sport.\n", "orca-mini:3b": " The article reports that Wigan captain Andy Farrell's possible switch to rugby union is still ongoing, with Leicester and Saracens leading the chase for his services. Although the move would be lucrative for both Wigan and Farrell, Lindsay said money was not a motivating factor for the club. He also stressed that the club has not yet made any decision on whether to let Farrell go. Additionally, while the Super League season is still ongoing, rugby union is showing interest in signing up Farrell. However, Lindsay said that Wigan will always prioritize its loyal friend and team captain over money.", "hermes3:3b": "Farrell rugby saga continues, Wigan expect no quick resolution, as captain Andy Farrell's possible switch to rugby union is pursued by Leicester & Saracens.", "stablelm-zephyr:3b": "Wigan chairman Maurice Lindsay acknowledges the ongoing saga of captain Andy Farrell potentially switching to rugby union, stating it's not a quick decision as multiple parties must agree. Although Leicester and Saracens are leading the chase for Farrell, Wigan supports him regardless. Lindsay clarifies money is not a motivating factor and expresses understanding of rugby union's interest in signing Farrell, considering him a sporting icon and rarity among athletes.", "chatgpt-4o-latest": "Wigan chairman Maurice Lindsay does not expect a quick resolution to captain Andy Farrell's potential switch to rugby union, with Leicester and Saracens leading the chase. Lindsay emphasized that multiple parties, including the Rugby Football Union and England's coaching team, are involved in the decision. While Farrell's departure would be a major talking point in the Super League, Lindsay supports his desire for a new challenge, denying financial motives for Wigan. He acknowledged Farrell's immense value to rugby union, calling him a rare sporting icon comparable to Ellery Hanley and Martin Johnson.", "stablelm2:1.6b": "Andy Farrell's possible switch from rugby league to rugby union is expected to take time as various parties, including the Rugby Football Union, the league, individual clubs, and England coaching team, have a say in the decision. Wigan chairman Maurice Lindsay does not expect a quick solution and considers Farrell's years of service. Although financially lucrative for both parties, money is not a motivating factor for Wigan. Lindsay acknowledges Farrell's sporting icon status but believes it would be a great loss to rugby union and a boost for players like Ellery Hanley and Martin Johnson.", "granite3.1-dense:2b": "Wigan chairman Maurice Lindsay expects the potential switch of captain Andy Farrell from rugby league to union to take time, involving multiple parties such as the Rugby Football Union, league, club, and England coaching team. Despite 12 years of service, Farrell's decision remains uncertain due to his loyalty to Wigan. Lindsay emphasizes that money is not a deciding factor for the club, as they prioritize retaining valuable players under the salary cap. The chief acknowledges rugby union's interest in Farrell, describing him as a sporting icon who would significantly benefit the signing team. Lindsay believes Farrell's departure would be a substantial loss for Wigan but a significant gain for his potential new club.", "reference": "Although the move would be a lucrative one for both Farrell and Wigan, Lindsay said money was not a motivating factor for the club.Lindsay also said he understood why rugby union was so interested in signing up Farrell.\"As well as the Rugby Football Union, the league, the individual club and the England coaching team have a say, so it's not a quick decision,\" he said.\"But he's a very loyal friend to the club, so there's no question that he's deserting us.Wigan chairman Maurice Lindsay says he does not expect a quick solution to the on-going saga of captain Andy Farrell's possible switch to rugby union.\"A shortage of money has never been a problem for us.\"It came as a bolt out of the blue to us,\" admitted Lindsay.Leicester and Saracens are leading the chase for the player, but Lindsay told the BBC it was not yet a done deal."}