{"raw_text": "Sydney to host north v south game\n \n Sydney will host a northern versus southern hemisphere charity match in June or July, the Australian Rugby Union (ARU) said on Wednesday.\n \n The match will include players from the Lions tour of New Zealand. \"The Australian Rugby Union has thrown its support behind a proposed North-South match to raise funds for the tsunami appeals,\" the ARU said. The date is yet to be decided but the most likely venue is Sydney's Olympic Stadium. ARU chief executive Gary Flowers said the world cricket charity match in Melbourne earlier this month had inspired the ARU. \"We still need to discuss the options with the IRB (International Rugby Board), the Lions and our SANZAR (South Africa, New Zealand and Australia Rugby) partners, but June or July is seen as a better option than March to ensure we have the cream of southern hemisphere rugby available,\" he said. Wallabies captain George Gregan said the charity match was a \"great initiative\". Tri-Nations rivals Australia, New Zealand and South Africa would feature prominently in a southern team against a northern side comprised of Six Nations teams France, Ireland, England, Wales, Italy and Scotland. Coach Clive Woodward's Lions squad will tour New Zealand in June and July, including Tests on 25 June, 2 and 9 July.\n \n Almost 80,000 fans packed into Melbourne Cricket Ground on 10 January for a charity match that raised £5.9m for victims of the Asian tsunami.\n", "llama3.2:1b": "Sydney to host northern vs southern rugby game in June or July.\nThe Australian Rugby Union supports a North-South charity match to raise funds for tsunami appeals.\nThe match will feature players from the Lions tour of New Zealand, including Tests on 25 June and 9 July.\nA World Cricket charity match inspired the ARU's decision.\nCoach Clive Woodward's Lions squad tours New Zealand in June and July.", "llama3.2:3b": "Sydney to host a northern versus southern hemisphere charity rugby match in June or July, with players from the Lions tour of New Zealand, featuring teams from Australia, New Zealand, South Africa, France, Ireland, England, Wales, Italy and Scotland, to raise funds for tsunami appeals.", "gemma2:2b": "An Australian Rugby Union (ARU) proposed North-South rugby charity match is set to take place in Sydney in June or July.  Players from the Lions tour of New Zealand will be involved, and the most likely venue is Sydney's Olympic Stadium. The event aims to raise funds for tsunami appeals after inspiration from a similar cricket charity match earlier this month. \n", "qwen2.5:0.5b": "Australia is hosting a charity match to raise money for the tsunami appeals in New Zealand. The Australian Rugby Union has thrown its support behind the North-South match, which will be played at Sydney's Olympic Stadium. A world cricket charity match was held earlier this month in Melbourne, and it's seen as a better option than March in order to ensure the southern hemisphere rugby team has the best players. George Gregan, Tri-Nations rivals Australia, New Zealand, and South Africa are also scheduled to participate in the Northern side.", "qwen2.5:1.5b": "Sydney will host a North-South rugby union charity match in June or July involving players from the Lions tour to New Zealand and featuring Six Nations teams against Southern Hemisphere nations, with Wallabies captain George Gregan supporting. The ARU has thrown support behind the event inspired by a previous cricket charity match in Melbourne.", "qwen2.5:3b": "Sydney will host a northern versus southern hemisphere rugby union charity match in June or July, featuring players from the Lions tour of New Zealand. The ARU aims to use this event to raise funds for tsunami appeals, with the Olympic Stadium as the likely venue. Similar matches have been successful in Melbourne, where over 80,000 fans attended a charity game raising £5.9m for tsunami victims earlier this year.", "opencoder:1.5b": "Sydney to host a northern versus southern hemisphere charity match in June or July\n\nThe Australian Rugby Union will host a match between fans from the Lions tour of New Zealand and a southern hemisphere team, including a rival from South Africa. The match includes players from the Lion's tour, which has raised funds for the tsunami appeals, and is yet to be determined on a specific date. A likely venue would be the Olympic Stadium in Sydney.\n", "smollm:1.7b": "Sydney will host a northern versus southern hemisphere charity match in June or July, the Australian Rugby Union (ARU) said on Wednesday. The match will include players from the Lions tour of New Zealand. The ARU has thrown its support behind a proposed North-South match to raise funds for the tsunami appeals. The date is yet to be decided but the most likely venue is Sydney's Olympic Stadium. The IRB, the Lions and SANZAR (South Africa, New Zealand and Australia Rugby) partners have discussed the possibility of hosting the charity match in Melbourne earlier this month. The ARU chief executive Gary Flowers said the world cricket charity match in Melbourne earlier this month had inspired the ARU. \"We still need to discuss the options with the IRB,\" he said. \"June or July is seen as a better option than March to ensure we have the cream of southern hemisphere rugby available.\" The Lions squad will tour New Zealand in June and July, including Tests on 25 June, 2 and 9 July.\n \n Almost 80,000 fans packed into Melbourne Cricket Ground on 10 January for a charity match that raised £5.9m for victims of the Asian tsunami.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help the user by summarizing the given text. The user wants only the summary in plain text without any explanations or formatting. \n\nFirst, I'll read through the provided text carefully to understand all the key points. It's about Sydney's upcoming charity match between the Lions and a northern vs southern hemisphere team. The ARU is supporting a North-South match due to funds needed for a tsunami appeal.\n\nLooking at each paragraph: The first one talks about the match location, venue, and some players involved. The second mentions Gary Flowers' comments from Melbourne earlier this month and more discussion with IRB. The third mentions wallabies as part of the event. Then there's another paragraph about the charity match in Melbourne raising funds and specific dates for their Tests.\n\nI need to make sure that I capture all these points but keep it concise. The user wants only the summary, so I'll focus on the main event: Sydney hosting the match with details from the players, venue, and objectives.\n\nI should mention that the match is between the Lions and a southern/horizontal team, the venue is Sydney's Olympic Stadium, the number of expected fans, the funds raised in Melbourne, and the key events like the Test dates. Also, including that the match aims to raise money for the tsunami appeal would be important.\n\nI need to ensure that I don't include any explanations or additional information beyond what's provided. Keeping it straightforward and only summarizing without adding anything else.\n</think>\n\nSydney will host a charity match between the Australian Rugby Union (ARU) and a northern vs southern hemisphere team, with players from the Lions traveling to New Zealand. The event is set to take place at Sydney's Olympic Stadium in June or July. The ARU aims to raise funds for the Asian tsunami appeal. A charity match was held in Melbourne earlier this month, featuring 80,000 fans who raised £5.9m. The match will include highlights of their Test series against France, Ireland, England, Wales, Italy, and Scotland.", "tinyllama:1.1b": "The Australian RuGBY Union has thrown its support behind a proposed North-South match to raise funds for the Tsunami appeal, scheduled in June or July at Sydney's Olympic Stadium, with the most likely venue being Melbourne earlier this month's World Cup charity match. The Wallabies will feature prominent players from Six Nations teams France, Ireland, England, Wales, Italy and Scotland, including Tests on 25 June, 2 and 9 July, which will include a southern team against a northern side comprised of Australia, New Zealand, and South Africa. Tri-Naition rivalries between Australia, New Zealand, and South Africa will be featured in the match. The Australian RuGBY Union has thrown its support behind a proposed North-South match to raise funds for Tsunami appeal, which is scheduled in June or July at Sydney's Olympic Stadium with the most likely venue being Melbourne earlier this month's World Cup charity match. The Wallabies will feature prominent players from Six Nations teams France, Ireland, England, Wales, Italy and Scotland, including Tests on 25 June, 2 and 9 July, featuring a southern team against a northern side comprised of Australia, New Zealand, and South Africa.", "tinydolphin:1.1b": " Sydney will host a northern versus southern hemisphere rugby charity match in June or July, as announced by the Australian Rugby Union (ARU) on Wednesday. The match will include players from the Lions tour of New Zealand, with the most likely venue being Sydney's Olympic Stadium. The ARU is supporting a proposed North-South match to raise funds for tsunami relief efforts. The game will take place in June or July, with potential dates yet to be discussed with international partners.", "phi:2.7b": " A charity match between northern and southern hemisphere rugby teams is set to be played in Sydney in June or July. The world cricket charity match in Melbourne earlier this month has inspired the Australian Rugby Union (ARU) to support the event, which aims to raise funds for tsunami appeals. The ARU chief executive said the date was yet to be decided, but the most likely venue is Sydney's Olympic Stadium. Tri-Nations rivals Australia, New Zealand and South Africa will feature in a southern team against France, Ireland, England, Wales, Italy and Scotland from the north. Clive Woodward's Lions squad will tour New Zealand in June and July, including Tests on  25 June,  2 and 9 July. Almost 80,000 fans packed into Melbourne Cricket Ground to watch the charity match, which raised £5.9m for tsunami victims.\n", "orca-mini:3b": " The text reports that Sydney will host a northern versus southern hemisphere charity match in June or July to raise funds for tsunami relief efforts. The match will feature players from the Lions tour of New Zealand, and the date is yet to be decided. The ARU hopes to have the world cricket charity match in Melbourne earlier this month as a inspiration. The Lions and SANZAR (South Africa, New Zealand and Australia) rugby partners are also involved. The southern team would include Wallabies captain George Gregan and Tri-Nations rivals Australia, New Zealand, and South Africa. The northern team would comprise Six Nations teams France, Ireland, England, Wales, Italy, and Scotland. The article does not explain why June or July is seen as a better option than March for the charity match. However, it notes that almost 80,000 fans packed into Melbourne Cricket Ground on 10 January for a charity match that raised £5.9m for victims of the Asian tsunami.", "hermes3:3b": "Sydney to host North v South rugby match in June/July, featuring Lions tour players for tsunami charity.", "stablelm-zephyr:3b": "Sydney will host a northern versus southern hemisphere charity rugby match in June or July to raise funds for tsunami appeals. The Australian Rugby Union (ARU) supported the idea after seeing success from a similar event in Melbourne earlier that month. The date and venue, likely to be Sydney's Olympic Stadium, are still being discussed with the International Rugby Board, the Lions team, and SANZAR partners. The match will feature prominent players from Australia, New Zealand, and South Africa, as well as teams from the Six Nations tournament.", "chatgpt-4o-latest": "Sydney will host a northern versus southern hemisphere charity rugby match in June or July, supported by the Australian Rugby Union (ARU) to raise funds for tsunami relief. The match will feature players from the Lions tour of New Zealand, with Sydney's Olympic Stadium as the likely venue. ARU chief executive Gary Flowers cited inspiration from a recent cricket charity match in Melbourne. The southern team will include players from Australia, New Zealand, and South Africa, while the northern team will consist of Six Nations teams. The Lions squad, coached by Clive Woodward, will be touring New Zealand during this period. A previous charity cricket match in Melbourne raised £5.9m for tsunami victims.", "stablelm2:1.6b": "Sydney will host a rugby charity match between northern and southern hemisphere teams in June or July, with players from the Lions tour of New Zealand. The ARU supports this initiative, and the most likely venue is Sydney's Olympic Stadium. ARU chief executive Gary Flowers aims for the match to feature top southern hemisphere rugby, while Coach Clive Woodward's Lions squad tours NZ. Tri-Nations rivals AUS, NZ, & SA will join the southern team, which includes Six Nations teams France, Ireland, England, Wales, Italy, and Scotland. Melbourne charity match raised £5.9m for Asian tsunami victims in 2004.", "granite3.1-dense:2b": "Sydney is set to host a north-south charity rugby match in June or July, organized by the Australian Rugby Union (ARU) and the Lions tour participants. The event aims to raise funds for tsunami appeals, inspired by a successful world cricket charity match in Melbourne earlier this year that gathered 80,000 spectators at the Melbourne Cricket Ground, generating £5.9 million for Asian tsunami victims. The proposed match will feature players from Australia's Wallabies and Tri-Nations rivals against a northern team comprising Six Nations nations: France, Ireland, England, Wales, Italy, and Scotland. The most likely venue is Sydney's Olympic Stadium. ARU chief Gary Flowers will discuss the details with the International Rugby Board (IRB), Lions, and SANZAR partners to finalize the date and team composition.", "reference": "Sydney will host a northern versus southern hemisphere charity match in June or July, the Australian Rugby Union (ARU) said on Wednesday.\"We still need to discuss the options with the IRB (International Rugby Board), the Lions and our SANZAR (South Africa, New Zealand and Australia Rugby) partners, but June or July is seen as a better option than March to ensure we have the cream of southern hemisphere rugby available,\" he said.The match will include players from the Lions tour of New Zealand.ARU chief executive Gary Flowers said the world cricket charity match in Melbourne earlier this month had inspired the ARU."}