{"raw_text": "Fuming Robinson blasts officials\n \n England coach Andy Robinson said he was \"livid\" after his side were denied two tries in Sunday's 19-13 Six Nations loss to Ireland in Dublin.\n \n Mark Cueto's first-half effort was ruled out for offside before the referee spurned TV replays when England crashed over in the dying minutes. \"[I'm] absolutely spitting. I'm livid. There's two tries we've been cost,\" Robinson told BBC Sport. \"We've got to go back to technology. I don't know why we didn't.\" South African referee Jonathan Kaplan ruled that Cueto was ahead of Charlie Hodgson when the fly-half hoisted his cross-field kick for the Sale wing to gather.\n \n Kaplan then declined the chance to consult the fourth official when Josh Lewsey took the ball over the Irish line under a pile of bodies for what could have been the game-winning try. \"I think Mark Cueto scored a perfectly legal try and I think he should have gone to the video referee on Josh Lewsey,\" said Robinson. \"It is how we use the technology. It is there, and it should be used.\n \n \"I am still trying to work out the Cueto try. I have looked at both, and they both looked tries. \"We are very disappointed, and this will hurt, there is no doubt about that. \"We are upset now, but the referee is in charge and he has called it his way and we have got to be able to cope with that.\n \n \"We did everything we could have done to win the game. I am very proud of my players and, with a couple of decisions, this could have been a very famous victory. \"I thought we dominated. Matt Stevens had an awesome game at tighthead prop, while the likes of Charlie Hodgson, Martin Corry and Lewis Moody all came through well. \"Josh Lewsey was awesome, and every one of the forwards stood up out there. Given the pressure we were under, credit must go to all the players. \"We have done everything but win a game of rugby, but Ireland are a good side. They defended magnificently and they've got every chance of winning this Six Nations.\" England have lost their first three matches in this year's Six Nations and four out of their six games since Robinson took over from Sir Clive Woodward in September.\n", "llama3.2:1b": "England coach Andy Robinson was \"livid\" after his team was denied two tries in a 19-13 loss to Ireland in Dublin, with Mark Cueto's first-half effort being ruled out for offside and a replayed try by Josh Lewsey being declined due to the fourth official not consulting.", "llama3.2:3b": "England coach Andy Robinson was livid after losing to Ireland due to two denied tries, one ruled out for offside by referee Jonathan Kaplan and the other missed due to a failure to consult video technology.", "gemma2:2b": "England coach Andy Robinson was angry after his team was denied two tries during a 19-13 loss to Ireland.  Robinson criticized the referee for not consulting video replays on both tries, believing that technology should have been used. Despite a strong performance by England, they fell short in a tight game against an excellent Irish side. \n", "qwen2.5:0.5b": "England coach Andy Robinson is furious at his team, saying it committed two crucial errors that cost them a game loss. He criticizes the technology used for video replays as irrelevant, calling out South African referee Jonathan Kaplan who missed the crucial Cueto try by turning away from the ball. Despite criticism of the referee, England still maintain they dominated the match and won it decisively despite Ireland's strong performances. The Six Nations championship is a goal to achieve, but Robinson remains disappointed with his team's performance.", "qwen2.5:1.5b": "England coach Andy Robinson is livid after his team was denied two tries that could have been game-winning ones due to officiating errors during the 19-13 loss to Ireland in Dublin. Robinson accuses officials of not utilizing technology properly and suggests they should be allowed to consult fourth officials when making decisions.", "qwen2.5:3b": "England coach Andy Robinson criticized officials after his team was denied two tries against Ireland, leading to a 19-13 loss. The first try by Mark Cueto was ruled offside, while the second potential try by Josh Lewsey went unconfirmed due to referee Jonathan Kaplan's refusal of a video review request. Robinson expressed disappointment and frustration over missed decisions that could have changed the game’s outcome. Despite positive performances from players like Matt Stevens and Charlie Hodgson, England conceded their first three Six Nations matches under his leadership since replacing Sir Clive Woodward in September.", "opencoder:1.5b": "\"In 2012, the English player who was \"livid\" due to his defeat against Ireland in a six-match competition scored a two-try win that could have been achieved with more tries and better technique than any other player could hope for.\n", "smollm:1.7b": "Fuming Robinson blasts officials", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the provided text into a concise summary while preserving the key ideas and details. The user specified that only the summary should be outputted without any explanations or formatting.\n\nFirst, let's read through the entire text carefully to identify the main points.\n\nThe text starts with England coach Andy Robinson saying he was \"livid\" after their loss to Ireland in Dublin. He mentions that two tries were faked due to offside before a replays incident where the officials ruled out Cueto's try but later decided not to consult the fourth official.\n\nThen, Robinson discusses the technology used by the officials, referring to it as \"perfectly legal,\" and highlights that they use it to determine who gets credit for the try. He also expresses disappointment and effort in winning despite the loss, acknowledging players' performances and the pressure they faced.\n\nAt the end, he states that England has lost their first three matches since Robinson's arrival and four out of six games in the Six Nations series against Ireland. This sets up future matches but doesn't change the key summary points.\n\nI need to condense this into a single concise paragraph without any additional explanations or formatting.\n</think>\n\nEngland coach Andy Robinson, following a 19-13 loss to Ireland in Dublin, expressed his fury after faked two tries due to offside before officials ruled out Mark Cueto's first-half effort. He referenced the use of technology for determining who scored the try and highlighted disappointment over not consulting the fourth official. Robinson also acknowledged players' performances but expressed frustration at losing despite having won all three initial matches in their Six Nations series against Ireland.", "tinyllama:1.1b": "Based on the given text, the coach, Andy Robinson, was \"livid\" after his side was denied two tries in Sunday's 19-13 Six Nations loss to Ireland in Dublin. The coach also cited a referral decision that should have been used by South African officials and lamented the lack of use of the technology. Overall, Robinson expressed disappointment with the decision made by the team's fourth official on Cueto's try and the inability for his side to secure a victory due to the referee's decision.", "tinydolphin:1.1b": " In summary, the coach of England rugby team, Andy Robinson, was frustrated after a close 19-13 loss to Ireland in Dublin. The referee had ruled out two tries by Mark Cueto and ruled against TV replays, which the coach believes should have gone against Cueto's try. Despite this, Robinson has now called for more scrutiny of the technology used in rugby matches.", "phi:2.7b": " In Sunday's 19-13 loss to Ireland, English coach Andy Robinson expressed his frustration with the game being called \"livid\" due to missed opportunities for tries by his team. The referee ruled that Mark Cueto's first-half attempt was offside and declined to consult the fourth official when Josh Lewsey attempted a game-winning try. Robinson believes technology should be used more effectively in rugby, but acknowledged the difficult position of the referee. Despite his disappointment, he praised his players for their performance under pressure. England has lost three out of their six games since Robinson took over as coach.\n", "orca-mini:3b": " Andy Robinson was angry after the Six Nations loss to Ireland where England were denied two tries by a referee's decision. Mark Cueto's first-half effort was ruled out for offside before the referee spurned TV replays when England crashed over in the dying minutes, leaving Robinson fuming. The coach praised his players for their performance but felt that the officials' decisions cost them the game.", "hermes3:3b": "Andy Robinson criticized for being \"livid\" after two try disallowals in England's Six Nations loss to Ireland, calling for use of technology to review rulings.", "stablelm-zephyr:3b": "England coach Andy Robinson expressed frustration over his team's denied tries in a 19-13 Six Nations loss to Ireland. Mark Cueto's first-half touchdown was ruled offside, and Robinson accused the referee of not using video replays. He also mentioned the potential game-winning try by Josh Lewsey but acknowledged the referee's final decision. Despite the setback, Robinson praised his players' efforts, highlighting their dominant performance against Ireland. England has now lost four games out of six under Robinson's leadership in the Six Nations.", "chatgpt-4o-latest": "England coach Andy Robinson was furious after his team was denied two tries in their 19-13 Six Nations loss to Ireland. Mark Cueto's first-half try was ruled offside, and referee Jonathan Kaplan refused to consult the video referee on Josh Lewsey's potential game-winning try. Robinson criticized the lack of technology use, insisting both tries were legitimate. Despite the loss, he praised his players' performance, highlighting Matt Stevens, Charlie Hodgson, Martin Corry, Lewis Moody, and Josh Lewsey. England has now lost their first three Six Nations matches and four of six games under Robinson.", "stablelm2:1.6b": "England coach Andy Robinson is angry about his team losing two tries in a 6-try defeat to Ireland during the recent Six Nations match. South African referee Jonathan Kaplan denied Mark Cueto's perfectly legal try, while replays weren..\nThe summary of the text is: England coach Andy Robinson is furious after his side was denied two tries in their loss to Ireland during the recent Six Nations match. The South African referee declined the chance to consult with the fourth official when Josh Lewsey scored for what could have been the game-winning try. Despite the loss, England dominated and showed resilience from players such as Matt Stevens and Josh Lewsey. Ireland is a strong opponent and has every chance of winning this year's Six Nations, according to Robinson.", "granite3.1-dense:2b": "England coach Andy Robinson expressed fury after his team was denied two potential tries during a 19-13 loss to Ireland in Dublin on Sunday. The first try, scored by Mark Cueto, was ruled out for offside, and the second, which occurred near the end of the match when Josh Lewsey appeared to score under a pile of players, was not awarded despite appearing legal to Robinson. Robinson criticized the referee, South African Jonathan Kaplan, for not utilizing television review technology on both calls. Despite feeling disappointed and upset, Robinson praised his players' performance, highlighting Matt Stevens' strong display at tighthead prop and overall team effort under pressure. England has now lost four of their six games since Robinson took over as coach in September, with three consecutive defeats in this year's Six Nations.", "reference": "England coach Andy Robinson said he was \"livid\" after his side were denied two tries in Sunday's 19-13 Six Nations loss to Ireland in Dublin.\"I think Mark Cueto scored a perfectly legal try and I think he should have gone to the video referee on Josh Lewsey,\" said Robinson.\"We've got to go back to technology.\"We did everything we could have done to win the game.Kaplan then declined the chance to consult the fourth official when Josh Lewsey took the ball over the Irish line under a pile of bodies for what could have been the game-winning try.England have lost their first three matches in this year's Six Nations and four out of their six games since Robinson took over from Sir Clive Woodward in September.\"We have done everything but win a game of rugby, but Ireland are a good side.They defended magnificently and they've got every chance of winning this Six Nations.\"There's two tries we've been cost,\" Robinson told BBC Sport.South African referee Jonathan Kaplan ruled that Cueto was ahead of Charlie Hodgson when the fly-half hoisted his cross-field kick for the Sale wing to gather."}