{"raw_text": "Henman overcomes rival Rusedski\n \n Tim Henman saved a match point before fighting back to defeat British rival Greg Rusedski 4-6 7-6 (8-6) 6-4 at the Dubai Tennis Championships on Tuesday.\n \n World number 46 Rusedski broke in the ninth game to take a tight opening set. Rusedski had match point at 6-5 in the second set tie-break after Henman double-faulted, but missed his chance and Henman rallied to clinch the set. The British number one then showed his superior strength to take the decider and earn his sixth win over Rusedski. Serve was held by both players with few alarms until the seventh game of the final set, when Rusedski's wild volley gave Henman a vital break. A furious Rusedski slammed his racket onto the ground in disgust and was warned by the umpire.\n \n Henman, seeded three, then held his serve comfortably thanks to four serve-and-volley winners to take a clear 5-3 lead. Rusedski won his service game but Henman took the first of his three match points with a service winner to secure his place in the second round at Dubai for the first time in three years. It was the first match between the pair for three years - Henman last lost to Rusedski six years ago - and lasted two hours and 40 minutes. The pair are now likely to only face each other on court as rivals - rather than as team-mates - after Henman decided to retire from Davis Cup tennis leaving Rusedski to lead the team out against Israel on 4-6 March. Henman, who now faces Russian Igor Andreev in the last 16, admitted afterwards it was difficult coming up against his compatriot on a fast surface. \"You just take it point by point when you're fighting to stay in the match,\" he said. \"I had to keep playing aggressively and competing to get a chance. \"I now have to recover in time for the next match because the body doesn't recover as quick as it used to, especially after two hours and 40 minutes.\"\n", "llama3.2:1b": "Tim Henman overcame British rival Greg Rusedski at the Dubai Tennis Championships to win 4-6 7-6 (8-6) 6-4. Henman broke in the ninth game of the first set to take a lead, but missed match points. He then held his serve comfortably in the final set before winning three consecutive service games and taking a 5-3 lead. Rusedski pushed Henman hard, including after Henman's racket went flying off during a break in the third set, prompting an umpire warning. Henman eventually won the match with four service winners and took his place in the second round for the first time since 2010.", "llama3.2:3b": "Tim Henman defeated Greg Rusedski 4-6 7-6 (8-6) 6-4 at the Dubai Tennis Championships. Henman saved a match point in the second set tie-break before rallying to take the decisive set, his sixth win over Rusedski.", "gemma2:2b": "Tim Henman defeated Greg Rusedski in a three-set match at the Dubai Tennis Championships to advance to the second round.  Henman overcame a break point deficit in the second set and won a decisive final set to win his sixth victory over Rusedski. Henman will face Igor Andreev in the last 16. \n", "qwen2.5:0.5b": "Henman defeated Rusedski in the Dubai Tennis Championships to advance to his first round of the tournament.", "qwen2.5:1.5b": "Tim Henman defeated Greg Rusedski 4-6, 7-6 (8-6), 6-4 at the Dubai Tennis Championships. Prior to defeating him in a tight match point battle, Henman showed superior strength to secure victory.", "qwen2.5:3b": "Tim Henman defeated British rival Greg Rusedski 4-6 7-6 (8-6) 6-4 at the Dubai Tennis Championships. Henman saved match point in the second set tie-break and showed superior strength to win the third set. Despite Rusedski's initial advantage, Henman secured a win with three match points. This was their first meeting in three years, following which Henman retired from Davis Cup tennis. Henman won his place back at Dubai for the first time in three years, facing Russian Igor Andreev in the next round.", "opencoder:1.5b": "\"Tim Henman overcomes rival Rusedski\"\n\n\"Henman saved a match point before fighting back to defeat British rival Greg Rusedski 4-6 7-6 (8-6) 6-4 at the Dubai Tennis Championships on Tuesday.\"\n\n\"Rusedski broke in the ninth game, Henman held his serve and missed his chance to clinch the set.\"\n\n\"In the final set of the match, Rusedski's wild volley gave Henman a vital break. A furious Rusedski slammed his racket onto the ground in disgust, and Benman was warned by the umpire.\"\n", "smollm:1.7b": "Henman overcomes rival Rusedski by winning the first match of the second round at Dubai Tennis Championships on Tuesday.", "deepseek-r1:1.5b": "<think>\nOkay, so I've got this text about Tim Henman fighting against Greg Rusedski. I need to summarize it into a concise summary that preserves all key ideas and details.\n\nFirst, let me read through the original text carefully. The main points are:\n\n1. Henman overcomes Rusedski in a tennis match at the Dubai Tennis Championships.\n2. They played a 4-6-7-6 set.\n3. Henman saved a match point before fighting back to win.\n4. World number 46, Rusedski had an opening set.\n5. Rusedski broke in the ninth game and took the decider, earning his sixth victory.\n6. The final set was intense with a wild volley from Rusedski giving Henman a break.\n7. Henman's serve was strong, using multiple points to secure a 5-3 lead.\n8. Rusedski won his service game butHenman had a match point first and secured the second round for three years.\n9. The previous match was six years ago, lasting two hours and 40 minutes.\n10. Henman is now facing Igor Andreev in the last 16 of the Davis Cup.\n\nNow, I need to condense this into a summary without explanations or formatting. So, key points include:\n\n-Henman's victory over Rusedski.\n-The set conditions: 4-6-7-6, winner based on deuce, game, and point.\n-Henman saved the match before fighting back, had multiple points in the set.\n-R usedski broke early, taking a tight set win.\n-Henman secured the second round now, despite previous loss six years ago.\n-The serve conditions were tough but he was strong enough to win.\n-Points from deuce: Henman had four wins there.\n-Rusedski won his service game first.\n\nI should structure it in a way that's clear and concise. Maybe start with the outcome, then the set format, Henman's points, Rusedski's early break, etc.\n\nLet me try to put this into a sentence or two. Make sure all the main events are included without getting too detailed.\n</think>\n\nTim Henman overcomes Greg Rusedski in a tennis match at the Dubai Tennis Championships, winning a 4-6-7-6 set that concluded with Henman securing a clear victory based on deuce conditions. During the final set, Henman earned a vital break from Rusedski's wild serve, and he secured his second round qualification for the Davis Cup against Igor Andreev, having previously lost to Rusedski six years ago in a two-hour and 40-minute match.", "tinyllama:1.1b": "Henman overcomes rival Rusedski in Dubai Tennis Championships to secure his place in second round. Tim Henman saved a match point before fighting back to defeat British rival Greg Rusedski 4-6 7-6 (8-6) 6-4 at the event, where World No. 46 Rusedski had match point at 6-5 in the second set tie-break. Henman's opponent, Russian Igor Andreev, awaits after facing Henman in the last 16 of Davis Cup tennis.", "tinydolphin:1.1b": " Tim Henman overcame his British rival Greg Rusedski to secure a thrilling victory at the Dubai Tennis Championships. The match was held on Tuesday and saw Henman save match point in the ninth game of the second set tie-break to take control of the match, eventually defeating Rusedski 4-6, 7-6 (8-6), 6-4. This victory over Rusedski marks a remarkable comeback for Henman, who had not secured a win against Rusedski since 2013. However, Serve was held by both players with few alarms until the seventh game of the final set, when Rusedski's wild volley gave Henman a crucial break. Throughout the match, Rusedski showed frustration on the court and was warned for his outburst. After securing his victory in the third and fourth sets, Henman held his serve comfortably thanks to four service winners and reached the second round of the competition at Dubai for the first time since 2015. It was a significant triumph for Rusedski, who had been struggling with injury and form following his defeat against Tomas Berdych in the previous rounds.", "phi:2.7b": " Tim Henman defeated British rival Greg Rusedski 6-4 7-6(8-6) 4-6 at the Dubai Tennis Championships on Tuesday. Despite having a match point in the second set, Rusedski missed his chance to win and eventually lost to Henman's superior strength. The match lasted two hours and 40 minutes, with the pair playing as rivals rather than team-mates since Henman retired from Davis Cup tennis leaving Rusedski to lead the team out against Israel on 4-6 March.\n", "orca-mini:3b": " Tim Henman defeated Greg Rusedski in three sets at the Dubai Tennis Championships on Tuesday. The match was close with both players having match points, but Henman held his serve and won the tie-breaker. The pair were rivals for several years and are now unlikely to face each other again as team-mates. Henman is seeded three and will face Igor Andreev in the last 16.", "hermes3:3b": "Tim Henman beat British rival Greg Rusedski 4-6 7-6 (8-6) 6-4 at Dubai Tennis Championships, taking match point in second set tie-break but winning decider. Rusedski warned for slamming racket during match. This marked Henman's first win over Rusedski in three years.", "stablelm-zephyr:3b": "Tim Henman defeated British rival Greg Rusedski 4-6 7-6 (8-6) 6-4 at the Dubai Tennis Championships, winning his sixth match against Rusedski. Despite a close opening set, Henman rallied and secured three match points to advance to the second round. The match was challenging on a fast surface due to their rivalry but both players maintained focus and competitive spirit throughout.", "chatgpt-4o-latest": "Tim Henman saved a match point and fought back to defeat Greg Rusedski 4-6, 7-6 (8-6), 6-4 at the Dubai Tennis Championships. Rusedski took the first set and had a match point in the second-set tie-break, but Henman rallied to win. In the final set, Henman broke Rusedski’s serve in the seventh game, prompting a frustrated reaction from Rusedski. Henman then held serve and secured victory with a service winner, marking his sixth win over Rusedski. The match lasted two hours and 40 minutes, their first meeting in three years. Henman, who recently retired from Davis Cup tennis, now faces Igor Andreev in the last 16. He acknowledged the challenge of playing a compatriot and emphasized the need for recovery before his next match.", "stablelm2:1.6b": "In Dubai, Tim Henman defeated Greg Rusedski with a 4-6, 7-6, 8-6, 6-4 victory. Rusedski took the opening set but broke in the ninth game, while Henman showed his superior strength to win the second set tie-break. In the decider, Henman held his serve and earned his sixth win over Rusedski. With a clear 5-3 lead, Henman secured his place in the second round at Dubai for the first time in three years.", "granite3.1-dense:2b": "Tim Henman, ranked third, defeated British rival Greg Rusedski (ranked 46) 4-6, 7-6 (8-6), 6-4 at the Dubai Tennis Championships on Tuesday. Despite having match points in the second set tie-break and serving advantageously, Henman overcame Rusedski after a two-hour, 40-minute battle. Rusedski, last beating Henman six years ago, missed crucial opportunities due to errors like a wild volley that led to a key break for Henman. Henman's victory marks his sixth win over Rusedski and seals his place in the second round at Dubai after three years without qualifying. The rivalry between these two will likely shift from teammates to competitors post-Henman's retirement from Davis Cup tennis, with Henman set to face Igor Andreev next. Henman acknowledged the challenge of competing on a fast surface and the need for quicker recovery due to extended playtime.", "reference": "Rusedski had match point at 6-5 in the second set tie-break after Henman double-faulted, but missed his chance and Henman rallied to clinch the set.It was the first match between the pair for three years - Henman last lost to Rusedski six years ago - and lasted two hours and 40 minutes.Tim Henman saved a match point before fighting back to defeat British rival Greg Rusedski 4-6 7-6 (8-6) 6-4 at the Dubai Tennis Championships on Tuesday.Rusedski won his service game but Henman took the first of his three match points with a service winner to secure his place in the second round at Dubai for the first time in three years.World number 46 Rusedski broke in the ninth game to take a tight opening set.Henman, seeded three, then held his serve comfortably thanks to four serve-and-volley winners to take a clear 5-3 lead."}