{"raw_text": "Rochus shocks Coria in Auckland\n \n Top seed Guillermo Coria went out of the Heineken Open in Auckland on Thursday with a surprise loss to Olivier Rochus of Belgium.\n \n Coria lost the semi-final 6-4 6-4 to Rochus, who goes on to face Czech Jan Hernych, a 6-4 7-5 winner over Jose Acasuso of Argentina. Fifth seed Fernando Gonzalez eased past American Robby Ginepri 6-3 6-4. The Chilean will meet sixth seed Juan Ignacio Chela next after the Argentine beat Potito Starace 6-1 7-6 (7-5). Rochus made the semi-finals at the Australian hardcourt championships in Adelaide last week and is naturally delighted with his form. \"It's been two unbelievable weeks for me,\" he said. \"Today I knew I had nothing to lose. If I beat him great, if I lost, I would be losing to a top-10 player.\" Coria conceded that Rochus \"played just too good,\" and added: \"When you give your best out there you can't be too sad.\"\n", "llama3.2:1b": "Guillermo Coria lost to Olivier Rochus in the Heineken Open semi-finals, 6-4 6-4. \n\nCoria also lost to Jan Hernych and Fernando Gonzalez.\n\nRochus advanced to the Australian hardcourt championships semi-finals after beating Jose Acasuso.", "llama3.2:3b": "Guillermo Coria lost to Olivier Rochus in the Heineken Open semi-finals 6-4 6-4. Rochus also beat Jan Hernych 6-4 7-5 and will face Fernando Gonzalez next.", "gemma2:2b": "Guillermo Coria lost in the semi-finals of the Heineken Open to Olivier Rochus. Rochus will face Jan Hernych in the final, after beating Jose Acasuso in a 6-4 7-5 victory.  Fernando Gonzalez advanced to the semi-final with a win over Robby Ginepri. Juan Ignacio Chela beat Potito Starace to reach the same round as Gonzalez. \n", "qwen2.5:0.5b": "Top seed Guillermo Coria won the Heineken Open with a surprise loss to Olivier Rochus. After beating Rochus 6-4 6-4, he went on to face Czech Jan Hernych. In his semifinal, Coria played against fifth-seeded Fernando Gonzalez. Juan Ignacio Chela will next meet him after defeating American Robby Ginepri in the Australian hardcourt championships.", "qwen2.5:1.5b": "Top seed Guillermo Coria loses to Olivier Rochus in semi-final of the Heineken Open in Auckland, advancing to play Czech Jan Hernych after winning 6-4, 7-5 against Jose Acasuso. Other matches include fifth seed Fernando Gonzalez beating American Robby Ginepri and sixth seed Juan Ignacio Chela defeating Argentine Potito Starace. Rochus had a strong week at the Australian hardcourt championships in Adelaide.", "qwen2.5:3b": "Top seed Guillermo Coria of Argentina was shocked by Olivier Rochus of Belgium in the semi-finals of the Heineken Open in Auckland, losing 6-4 6-4. Rochus will face Czech Jan Hernych next while Gonzalez and Chela advance to the final four. Rochus praised his form after reaching the semi-finals at the Australian championships last week.", "opencoder:1.5b": "Rochus shocks Coria in Auckland.\nCorya went out of the Heineken Open in Auckland on Thursday with a surprise loss to Olivier Rochus of Belgium. Coria lost the semi-final 6-4, who faced Czech Jan Hernych, a 6-4 winner over Jose Acasuso of Argentina and his form was appreciated by the Dutch fans. Fernando Gonzalez eased past American Robby Ginepri who scored 6-3 against Potito Starace 6-1 (7-5) with a win. The Chilean matches the Australian hardcourt championships in Adelaide last week, and he is deeply delighted that he made it.\n", "smollm:1.7b": "Rochus shocked Coria in Auckland", "deepseek-r1:1.5b": "<think>\nOkay, so the user has given me this task where they want me to summarize a text concisely. The key points I need to extract are about the matches between certain players in different tournaments. Let me read through the text carefully.\n\nFirst sentence: \"Rochus shocks Coria in Auckland.\" That tells me it's about the Heineken Open match, between these two players in Auckland.\n\nNext lines mention that Top seed Guillermo Coria lost to Olivier Rochus of Belgium on Thursday. So I should note his loss and who he beat.\n\nThen, it says Coria was defeated 6-4/6-4 by Rochus for the semi-finals. That's a big upset, so I need to highlight that detail.\n\nRochus then faced Jan Hernych, a 6-4/7-5 winner over Jose Acasuso of Argentina. It's good to mention who he faced and the outcome.\n\nFifth seed Fernando Gonzalez defeated Robby Ginepri in a 6-3/6-4 match. That’s an important result for him.\n\nChela, from Chile, will meet another player next after the Argentine beat Potito Starace in a 6-1/7-6 (7-5) set.\n\nRochus made semi-finals at the Australian HCC last week and is proud of his form. He said if he beats Coria, it's a big step to becoming a top-10 player, but if not, that's also sad. So I need to include his confidence and feelings about his performance.\n\nPutting this all together, the summary should cover all these points succinctly without explanations or formatting. The user provided an example response, so I can model my answer after that structure.\n\nI'll start with the match in Auckland, then Coria's loss, his upset, facing Hernych, Gonzalez's win, Chela's next opponent, andochus' confidence and feelings about it all while mentioning Ginepri. That should cover everything from the original text.\n</think>\n\nRochus shocks Coria in Auckland, who lost to Olivier Rochus of Belgium in their Heineken Open semi-final against him.", "tinyllama:1.1b": "Rochus shocks Coria at the Heinken Open in Auckland, defeating the Top seed Olivier Rochus with an unexpected victory. The Frenchman overcame the Argentine in the semi-finals of the Australian hardcourt championship with a decisive victory. Meanwhile, Coria struggled to win against Rocchus, who is known for his prowess on grass courts. Despite coming out on top, Coria admitted that he had nothing to gain by winning and was content with his performance.", "tinydolphin:1.1b": " The Heineken Open in Auckland has seen a shocking defeat for the top seed Guillermo Coria, who lost to Belgian Olivier Rochus. Rochus, seeded sixth, defeated Guillermo Coria 6-4 6-4 in the semi-finals. Coria's poor play is attributed to his loss at the Australian hardcourt championships in Adelaide last week, where he was defeated by fifth seed Fernando Gonzalez. Despite Coria's defeat, Rochus advances to the final, where he will face sixth seed Juan Ignacio Chela. Rochus has previously reached the semi-finals at the Australian hardcourt championships and is looking forward to making a statement with his victory in Auckland.", "phi:2.7b": " Top seed Guillermo Coria lost his semi-final match in Auckland against Belgian Olivier Rochus. Rochus went on to play against Jan Hernych, the Czech Republic's top seed. Fernando Gonzalez and Juan Ignacio Chela also made it through to the next round. Rochus is happy with his form after winning at the Australian hardcourt championships last week and is looking forward to the final match.\n", "orca-mini:3b": " Top seed Guillermo Coria lost to Olivier Rochus in the semi-finals of the Heineken Open in Auckland.", "hermes3:3b": "Olivier Rochus upsets Top seed Guillermo Coria in Auckland semi-final.", "stablelm-zephyr:3b": "Top seed Guillermo Coria was unexpectedly eliminated by Olivier Rochus in the semi-finals of the Heineken Open in Auckland. Rochus advanced to face Czech player Jan Hernych, a winner against Jose Acasuso of Argentina with a score of 6-4 7-5. Meanwhile, Fernando Gonzalez defeated American player Robby Ginepri 6-3 6-4 and will now meet sixth seed Juan Ignacio Chela. Rochus had previously made it to the semi-finals at the Australian hardcourt championships in Adelaide last week. Coria admitted that Rochus played \"just too good,\" while Fernando Gonzalez expressed his satisfaction with the victory over Robby Ginepri, emphasizing that even when giving one's best effort on the court, there is no cause for sadness.", "chatgpt-4o-latest": "Top seed Guillermo Coria was upset by Olivier Rochus in the Heineken Open semi-finals, losing 6-4 6-4. Rochus will face Jan Hernych, who defeated Jose Acasuso. Fernando Gonzalez beat Robby Ginepri and will play Juan Ignacio Chela, who overcame Potito Starace. Rochus, coming off a strong performance in Adelaide, expressed delight with his form, while Coria acknowledged Rochus played exceptionally well.", "stablelm2:1.6b": "In the Heineken Open in Auckland, top seed Guillermo Coria lost to Olivier Rochus in a surprise semi-final defeat. Rochus advances to face Czech Jan Hernych while Coria plays against Juan Ignacio Chela next. Rochus is pleased with his performance at the Australian hardcourt championships in Adelaide last week, stating that he knew he could not lose.", "granite3.1-dense:2b": "Guillermo Coria, the top seed at the Heineken Open in Auckland, was upset by Olivier Rochus of Belgium in a semi-final match, 6-4, 6-4. Rochus, who also reached the quarter-finals at last week's Australian Open, will now face Czech Jan Hernych, who defeated Jose Acasuso 6-4, 7-5. Meanwhile, fifth seed Fernando Gonzalez overcame Robby Ginepri 6-3, 6-4 and will play sixth seed Juan Ignacio Chela, who outlasted Potito Starace 6-1, 7-6 (7-5). Rochus expressed satisfaction with his performance, considering it two remarkable weeks. Coria acknowledged that Rochus played exceptionally well and that he gave his best effort.", "reference": "Top seed Guillermo Coria went out of the Heineken Open in Auckland on Thursday with a surprise loss to Olivier Rochus of Belgium.Coria lost the semi-final 6-4 6-4 to Rochus, who goes on to face Czech Jan Hernych, a 6-4 7-5 winner over Jose Acasuso of Argentina.Coria conceded that Rochus \"played just too good,\" and added: \"When you give your best out there you can't be too sad.\"Rochus made the semi-finals at the Australian hardcourt championships in Adelaide last week and is naturally delighted with his form."}