{"raw_text": "Hewitt fights back to reach final\n \n Lleyton Hewitt kept his dream of an Australian Open title alive with a four-set win over Andy Roddick in Friday's second semi-final.\n \n The home favourite will face Marat Safin in Sunday's final after coming through 3-6 7-6 (7-3) 7-6 (7-4) 6-1. Hewitt fought back from a set down and trailed in both tie-breaks but would not be denied, thrilling the Melbourne crowd with a typically battling effort. He is aiming to be the first Australian winner since Mark Edmondson in 1976. Hewitt is the first Australian to make the final since Pat Cash lost to Mats Wilander in 1988, but faces a huge challenge against Safin - the conqueror of Roger Federer. After needing five sets in his last two matches there was reason to think Hewitt might struggle for fitness. He certainly made a sluggish start, dropping his opening service game, and Roddick dominated with his huge serve as he took the first set.\n \n After 12 tense games in the second, the key moment came when Hewitt raised his game in the tie-break to overturn an early mini-break. That energised the crowd but Roddick was not finished and raced 4-1 clear in the crucial third before Hewitt pegged him back and forced another tie-break. Again Roddick broke first and again Hewitt fought back, taking the lead with a superb backhand pass.\n \n The Australian was not to be denied and a disheartened Roddick made little impact in the fourth set as Hewitt raced to victory, sending the Melbourne crowd wild and ensuring the final will be a huge occasion. \"It's awesome,\" said Hewitt. \"I started preparing for this tournament nine months ago. \"I've done a lot of hard yards to get here. \"I've always said I'd do anything to get in the first night final at the Australian Open. Now I've got my chance.\" Roddick was furious with himself for failing to take advantage of leads in both tie-breaks. \"I'm usually pretty money in those,\" said Roddick. \"Either one of those would have given me a distinct advantage. \"I'm mad, I felt I was in there with a shot. He put himself in position to win big points. I donated a little more than I would have wanted.\" And the American played down the influence of one spectator who appeared to contribute to a double fault by shouting during Rodick's service action. \"It just took one jackass to shout out,\" said Roddick, adding that the crowd overall was \"very respectful\".\n", "llama3.2:1b": "Lleyton Hewitt fought back from 3-6 in his second set and then trailed in both tie-breaks but ultimately won against Andy Roddick.\n\nHewitt, who is seeking an Australian Open title for the first time since Mark Edmondson in 1976, overcame a sluggish start and struggled with fitness issues in his last two matches. He eventually fought back to take the fourth set and win the match in four sets.", "llama3.2:3b": "Lleyton Hewitt won the second semi-final match against Andy Roddick 3-6, 7-6 (7-3), 7-6 (7-4), 6-1 to reach the final. He will face Marat Safin in Sunday's final and aims to be the first Australian winner since Mark Edmondson in 1976.", "gemma2:2b": "Lleyton Hewitt defeated Andy Roddick in four sets to advance to the Australian Open final. Hewitt will face Marat Safin after winning a hard-fought match. \n", "qwen2.5:0.5b": "Lleyton Hewitt faced off against Andy Roddick in Melbourne and ultimately won 7-6 (7-3) 7-6 (7-4) 6-1. He fought back from a set down to take the match, but Roddick was dominant with his serve, leading 2-0 after two sets. The Australian will face Marat Safin in the final and aims for his first Australian Open title since Mark Edmondson's loss in 1976. He fought through fatigue during the second semi-final, raising his game to overturn a set down and lead early. The crowd was extremely supportive of Hewitt after nine months preparing for the tournament.", "qwen2.5:1.5b": "Lleyton Hewitt won three-set victory over Andy Roddick in semi-final to reach Australian Open final against Marat Safin.", "qwen2.5:3b": "Lleyton Hewitt fought back to win in four sets against Andy Roddick in the semi-final of the Australian Open and will face Marat Safin in Sunday's final. The home favourite overcame a set down and trailed in both tie-breaks, but refused to be denied. Hewitt aims to become the first Australian winner since 1976 and is the first man from Australia to reach this stage since Pat Cash lost to Mats Wilander in 1988. Despite needing five sets in his last two matches, Hewitt delivered a typically battling performance to reach the final, which will be a significant occasion. Andy Roddick was critical of himself for failing to capitalize on lead opportunities in the tie-breaks and also complained about noise from an opponent's support during one point.", "opencoder:1.5b": "Hewitt fought back to reach his dream of an Australian Open title with a four-set win over Andy Roddick in Friday's second semi-final. The home favourite will face Marat Safin in Sunday's final after coming through 3-6 7-6 (7-3) 7-6 (7-4) 6-1. He fought back from a set down and trailed in both tie-breaks but would not be denied, thrilling the Melbourne crowd with a typically battling effort. He aims to be the first Australian winner since Mark Edmondson in 1976. Hewitt is the first Australian to make the final since Pat Cash lost to Mats Wilander in 19888, but faces a huge challenge against Safin - the conqueror of Roger Federer. After needing five sets in his last two matches there was reason to think Hewitt might struggle for fitness. He certainly made a sluggish start, dropping his opening service game, and Roddick dominated with his huge serve as he took the first set.\nAfter 12 tense games in the second, the key moment came when Hewitt raised his game in the tie-break to overturn an early mini-break. That energised the crowd but Roddick was not finished and raced 4-1 clear in the crucial third before Hewitt pegged him back and forced another tie-break. Again, he broke first and again, Hewitt fought back, taking the lead with a superb backhand pass.\nThe Australian was not to be denied and a disheartened Roddick made little impact in the fourth set as Hewitt raced to victory, sending the Melbourne crowd wild and ensuring the final will be a huge occasion. \"It's awesome,\" said Hewitt. \"I started preparing for this tournament nine months ago.\" I've done a lot of hard yards to get here. \"I’ve always said I’d do anything to get in the first night final at the Australian Open. Now I’ve got my chance.\" Roddick was furious with himself for failing to take advantage of leads in both tie-breaks. \"I’m usually pretty money in those,\" said Roddick. \"Either one of those would have given me a distinct advantage. I felt I was in there with a shot. He put himself in position to win big points. I donated a little more than I’d want.\"\nAnd the American played down the influence of one spectator who appeared to contribute to a double fault by shouting during Rodick’s service action. \"It just took one jackass to shout out,\" said Roddick, adding that the crowd overall was “very respectful”.\n", "smollm:1.7b": "Hewitt fought back from a set down and trailed in both tie-breaks but would not be denied. He is aiming to be the first Australian winner since Mark Edmondson in 1976. Hewitt is the first Australian to make the final since Pat Cash lost to Mats Wilander in 1988, but faces a huge challenge against Safin - the conqueror of Roger Federer. After needing five sets in his last two matches there was reason to think Hewitt might struggle for fitness. He certainly made a sluggish start, dropping his opening service game, and Roddick dominated with his huge serve as he took the first set.\nAfter 12 tense games in the second, the key moment came when Hewitt raised his game in the tie-break to overturn an early mini-break. That energised the crowd but Roddick was not finished and raced 4-1 clear in the tie-breaker before Hewitt broke first and again Roddick broke last. Again Roddick broke first and again Hewitt fought back, taking the lead with a superb backhand pass. The Australian was not to be denied and a disheartened Roddick made little impact in the fourth set as Hewitt raced to victory, sending the Melbourne crowd wild and ensuring the final will be a huge occasion. \"It's awesome,\" said Hewitt. \"I've done a lot of hard yards to get here. \"I've always said I'd do anything to get in the first night final at the Australian Open. Now I've got my chance.\" Roddick was furious with himself for failing to take advantage of leads in both tie-breaks. \"I'm usually pretty money in those,\" said Roddick. \"Either one of those would have given me a distinct advantage. \"I'm mad, I felt I was in there with a shot. He put himself in position to win big points. \"I donated a little more than I would have wanted.\" And the American played down the influence of one spectator who appeared to contribute to a double fault by shouting out. \"It just took one jackass to shout out,\" said Roddick, adding that the crowd overall was \"very respectful\".", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this tennis match between Lleyton Hewitt and Andy Roddick in the Australian Open. The user wants a concise summary that includes key ideas and details, without any explanations or formatting.\n\nFirst, I'll read through the text carefully. It's about a second semi-final where Hewitt won 4-3 over Roddick. They both played well, but it's not without some drama. Key points include the home advantage, their performance against Marat Safin in the final, and the emotional aspects during the match.\n\nI should make sure to highlight Hewitt's goal of becoming the first Australian Open winner since 1976 and facing Safin, who he considers the greatest player ever. Also, mention how they played tough but also showed physicality despite being a bit slow in the first set.\n\nThe summary needs to be straightforward: just a few sentences covering their victory, the final, the home advantage, the emotional moments, and the significance of their roles against other top players.\n</think>\n\nHewitt triumphed 4-3 over Roddick in their second semi-final at the Australian Open, aiming for the first Australian win since 1976. The match saw Marat Safin reach the final after defeating Roddick 7-4, 7-6 and 7-6 (7-3). Hewitt pushed back from a set down in both tie-breaks and showed resilience with an engaging performance, including a disheartening moment where he cut through Roddick's serve. The emotional exchange between them highlights the tension of their journey to victory.", "tinyllama:1.1b": "The Australian Open second semi-final between Lleyton Hewiitt and Andy Roddick ended in a thrilling four-set victory for the home favorite. Despite trailing both sets to none, Hewiitt fought back with a series of tenacious efforts to secure the match's crucial fifth set tie-break. The Australian was not to be denied as he raced to victory and will now face Marat Safin in Sunday's final. \"I started preparing for this tournament nine months ago,\" said Hewiitt, who is aiming for his first Australian Open title. The home favorite would become just the sixth Australian to make a final at Melbourne Park, but he will have to contend with world No. 2 Safin.", "tinydolphin:1.1b": " In the second-semifinal match, Lleyton Hewitt won a thrilling four-set victory over Andy Roddick, advancing to face Marat Safin in the final. Hewitt's determination and battle against the Australian sunshine sidelined Roddick in the past. However, Hewitt managed to edge out Safin in thrilling three sets, 7-6 (7-3), 7-6 (7-4) 6-1, proving he's capable of overcoming adversity and achieving his dream.", "phi:2.7b": " Lleyton Hewitt defeated Andy Roddick 4-6 7-6(7-3) 6-4 in the second semi-final of the Australian Open. The home favourite is now set to face Marat Safin in Sunday's final after recovering from a slow start and winning three tough sets.\n", "orca-mini:3b": " Hewitt fights back to reach final after winning a four-set match over Andy Roddick in Friday's second semi-final. The home favourite will face Marat Safin in Sunday's final after coming through 3-6 7-6 (7-3) 7-6 (7-4) 6-1. Hewitt faced a set down but fought back to reach the final, which will be a huge occasion. The Australian is aiming to win the Australian Open title for the first time since Mark Edmondson in 1976. He defeated Roddick, the conqueror of Roger Federer, by taking the second and third sets before the tie-break. Hewitt was not to be denied, winning the final two sets to secure victory. The American Roddick was furious with himself for not taking advantage of leads in both tie-breaks.", "hermes3:3b": "Hewitt reaches final for Australian Open; to face Marat Safin.", "stablelm-zephyr:3b": "Lleyton Hewitt defeated Andy Roddick in the Australian Open semi-finals, reaching the final against Marat Safin. After trailing in both tie-breaks, Hewitt made a thrilling comeback, winning six consecutive games in the fourth set to secure the victory. The final match will be a huge occasion for Hewitt, who aims to become Australia's first winner since Mark Edmondson in 1976 and faces a challenging opponent in Marat Safin.", "chatgpt-4o-latest": "Lleyton Hewitt kept his Australian Open title hopes alive with a four-set victory over Andy Roddick in the semi-finals, winning 3-6, 7-6 (7-3), 7-6 (7-4), 6-1. Despite trailing in both tie-breaks, Hewitt fought back, thrilling the Melbourne crowd with his resilience. He becomes the first Australian to reach the final since 1988 and aims to be the first home winner since 1976. Hewitt will face Marat Safin, who defeated Roger Federer, in the final. Roddick, frustrated by missed opportunities in the tie-breaks, acknowledged Hewitt's ability to win key points. The victory marks a significant achievement for Hewitt, who had been preparing for the tournament for months.", "stablelm2:1.6b": "Lleyton Hewitt advanced to the final at the Australian Open after defeating Andy Roddick in a four-set victory. Hewitt battled through set losses and tie-break difficulties, ultimately reaching the final against Marat Safin. Hewitt aims to become the first Australian winner since Mark Edmondson in 1986. In his previous two matches, Hewitt required five sets. Roddick was unable to capitalize on early leads, resulting in a tense match and ultimately, Hewitt's victory.", "granite3.1-dense:2b": "Lleyton Hewitt secured his spot in the Australian Open final after a four-set victory over Andy Roddick (3-6, 7-6, 7-6, 6-1). Despite losing the first set and being tied in both tie-breaks, Hewitt fought back with intense play, inspiring the Melbourne crowd. This marks his third final appearance for Australia since Pat Cash's loss to Mats Wilander in 1988. His opponent in the final will be Marat Safin, who defeated Roger Federer earlier in the tournament. Hewitt, aiming to become the first Australian winner since Mark Edmondson in 1976, expressed his excitement and dedication to this long-awaited opportunity. Roddick, frustrated with his missed opportunities in tie-breaks, attributed one of his double faults to an unruly spectator rather than the crowd's overall support.", "reference": "The Australian was not to be denied and a disheartened Roddick made little impact in the fourth set as Hewitt raced to victory, sending the Melbourne crowd wild and ensuring the final will be a huge occasion.\"I've always said I'd do anything to get in the first night final at the Australian Open.\"It just took one jackass to shout out,\" said Roddick, adding that the crowd overall was \"very respectful\".Again Roddick broke first and again Hewitt fought back, taking the lead with a superb backhand pass.That energised the crowd but Roddick was not finished and raced 4-1 clear in the crucial third before Hewitt pegged him back and forced another tie-break.Lleyton Hewitt kept his dream of an Australian Open title alive with a four-set win over Andy Roddick in Friday's second semi-final.Hewitt is the first Australian to make the final since Pat Cash lost to Mats Wilander in 1988, but faces a huge challenge against Safin - the conqueror of Roger Federer.\"It's awesome,\" said Hewitt.Hewitt fought back from a set down and trailed in both tie-breaks but would not be denied, thrilling the Melbourne crowd with a typically battling effort.Roddick was furious with himself for failing to take advantage of leads in both tie-breaks."}