{"raw_text": "Officials respond in court row\n \n Australian tennis' top official has defended the Australian Open courts at Melbourne Park after criticism of the playing surface by Lleyton Hewitt.\n \n Hewitt said he had had a \"gutful\" of trying to persuade them to make the surface faster but Tennis Australia's Geoff Pollard rejected his comments. \"We did ask for it to be made faster than last year and, to my knowledge, it is faster,\" he said. \"We spent a substantial amount of money on modifications to make it faster.\" Hewitt, who has not got past the fourth round at Melbourne in seven attempts, had earlier said the surface was not worthy of such a prestigious tournament. But he said he would play on whatever surface he had to in order to have a chance of winning. The tournament starts on 17 January, and Pollard said the surface had been speeded up since last year's tournament following complaints by several Australian players. But he refused to accept that the Melbourne surface may have had a bearing on Hewitt's performances over the years. \"Lleyton's proving how versatile he is on all surfaces,\" he said. \"It is faster than last year and that'll be faster than the one Lleyton beat Roger Federer on in the Davis Cup in 2003.\"\n", "llama3.2:1b": "Australian tennis official Geoff Pollard defends playing surface at Melbourne Park after criticism from former player Lleyton Hewitt, saying it has been speeded up since last year's tournament following complaints. Pollard denies any bearing of the surface on Hewitt's performances, citing Hewitt's ability to adapt to different surfaces.", "llama3.2:3b": "Australian tennis official Geoff Pollard defended the Australian Open courts at Melbourne Park after criticism from Lleyton Hewitt, who had a \"gutful\" of trying to persuade them to make the surface faster. Pollard said the surface was made faster than last year and that Hewitt's performances were a result of his versatility on all surfaces, not the playing condition.", "gemma2:2b": "Lleyton Hewitt criticized Australian Open court speed, saying it was not worthy of the tournament. Geoff Pollard defended Tennis Australia's efforts to make the surface faster, claiming they invested money and achieved a faster playing surface than last year. Pollard refuted claims linking the surface to Hewitt's performance struggles, emphasizing his versatility on various surfaces. \n", "qwen2.5:0.5b": "Australian tennis officials have defended the speed of the Australian Open courts, but tennis player Lleyton Hewitt has criticized the surface, claiming it was not worth playing on due to concerns about its suitability for a prestigious tournament. Hewitt would play with whatever surface he had available at Melbourne Park, and he insists that the court's speed factor should not be used as an indicator of players' abilities.\nThe table tennis tournament starts on 17 January, and tennis officials have expressed concern about the speed of the Australian Open courts, but the top player Lleyton Hewitt has defended their stance.", "qwen2.5:1.5b": "Australian tennis official Geoff Pollard defends Australian Open courts against criticism by former player Lleyton Hewitt, stating the surface has been speeded up since the previous tournament and is faster than last year's. Hewitt still believes the surface isn't worthy of a major event despite his recent struggles.", "qwen2.5:3b": "Australian tennis' top official, Geoff Pollard, defended the Australian Open courts at Melbourne Park after criticism by former player Lleyton Hewitt regarding the playing surface. Hewitt claimed he had tried to persuade changes but was unsuccessful. Pollard asserted that the court is faster than last year and has been modified with substantial investment. Despite Hewitt's earlier statements about the inferiority of the surface, Pollard defended its suitability for the tournament. He noted improvements since last year following complaints from several Australian players and highlighted the current speed compared to previous years and a match against Roger Federer in 2003.", "opencoder:1.5b": "The key idea and detail here are:\n\n1) The Australian tennis top official has defended the Australian Open courts.\n2) The Australian Open is a British two-round, singles competition that was held in August 1956 to win the title.\n3) It's against the rules to play outside of this specific tournament.\n\nHewitt, who had initially been criticized for trying to persuade them to make the playing surface faster, has since corrected their statements. They spent substantial money on modifications to make the surface faster. This was probably done to speed up the competition and attract more spectators.\n", "smollm:1.7b": "The Australian tennis' top official has defended the Australian Open courts at Melbourne Park after criticism of the playing surface by Lleyton Hewitt. Officials have responded to criticisms that the surface is not worthy of such a prestigious tournament, saying it was speeded up since last year's tournament following complaints from several Australian players. However, they refused to accept that the Melbourne surface may have had a bearing on Hewitt's performances over the years. Lleyton's proving how versatile he is on all surfaces, including the one at Melbourne Park, suggests that the surface may not be as slow as some critics claim.", "deepseek-r1:1.5b": "<think>\nAlright, so I have this text to summarize. The user wants me to create a concise summary preserving key ideas and details, and output only plain text without explanations or formatting.\n\nFirst, I'll read through the text carefully. It's about Australian tennis officials defending the playing surface at Melbourne Park against criticism from Lleyton Hewitt. The main points are:\n\n1. Geoff Pollard, Tennis Australia's official, defends the court.\n2. Hewitt criticized the speed of the surface but dismissed it as outdated for a prestigious tournament.\n3. Pollard says the surface was already faster after last year's tournament and acknowledged that the Melbourne speed might have influenced his performances.\n\nI need to capture all these elements without adding any extra information. I'll make sure to include key players (Tennis Australia, Geoff Pollard), the issue with the court, Hewitt's comments, Pollard's confirmation of the surface being already fast, and the impact on his past performances.\n\nLet me structure this into a coherent summary that flows naturally while covering all important points.\n</think>\n\nGeoff Pollard defends the playing surface at Melbourne Park against criticism from Lleyton Hewitt. Pollard confirms the court is now faster than last year's tournament and acknowledges the influence of the Melbourne speed on his past performances.", "tinyllama:1.1b": "Australian tennis official Geoff Pollard has responded to criticism of the playing surface at the Australian Open by rejecting comments made by Lleyton Hewiitt. Pollard rejected Hewiitt's statement that he had asked for the courts to be made faster, stating that Tennis Australia spent substantial amounts on modifications to make it so. Furthermore, Pollard claimed that Hewiitt had stated that the surface was not worthy of a prestigious tournament such as the Australian Open, adding that the tennis player would have been permitted to play on whatever surface he needed. Pollard's statement comes after criticism from several Australian players about the playing conditions, including John Newbury who claimed in a video that the courts were too slow.", "tinydolphin:1.1b": " Australian tennis' top official, Geoff Pollard, has defended the Australian Open courts at Melbourne Park after criticism from Australian tennis player Lleyton Hewitt. Hewitt claimed he had had a \"gutful\" of trying to persuade Tennis Australia to make the courts faster, but Pollard refuted his comments and rejected Hewitt's claim that the surface was not worthy of the prestigious tournament.", "phi:2.7b": " The top official of Australian Tennis defended the playing surface at Melbourne Park after criticism from Lleyton Hewitt, who had trouble persuading officials to make it faster. However, Geoff Pollard said that the surface was already made faster than last year and they had spent a lot of money on modifications. Hewitt had also suggested that the surface may have affected his performance over the years, but Pollard refused to accept this. The tournament starts on January 17th, with some Australian players complaining about the surface's speed in the past.\n", "orca-mini:3b": " Officials have responded to Hewitt's criticism of the Australian Open courts by defending the surface as faster than last year and better suited to the tournament.", "hermes3:3b": "Australian Open court defense after Hewitt criticism.", "stablelm-zephyr:3b": "Australian Tennis top official, Geoff Pollard, defends Melbourne Park courts against criticism from former player Lleyton Hewitt. Hewitt had claimed the surface wasn't fast enough for a prestigious tournament, but Pollard maintains it is faster than last year and highlights its speed compared to when Hewitt beat Roger Federer in 2003. The Australian Open begins on January 17th.", "chatgpt-4o-latest": "Australian tennis official Geoff Pollard defended the Melbourne Park courts after Lleyton Hewitt criticized the surface for being too slow. Hewitt expressed frustration over failed attempts to make it faster, but Pollard insisted modifications had been made to increase speed. Despite Hewitt's struggles at the Australian Open, Pollard denied the surface affected his performance, noting Hewitt's versatility. The tournament, starting on 17 January, features a surface Pollard claims is faster than last year and even faster than the one Hewitt won on in the 2003 Davis Cup.", "stablelm2:1.6b": "Australian tennis official Geoff Pollard defends the Australian Open courts, rejecting criticism by Lleyton Hewitt over the playing surface being too slow. Tennis Australia spent money on modifications to make it faster and faster than last year's tournament. Hewitt has not progressed beyond the fourth round at Melbourne in seven attempts but said he would play on whatever surface necessary to have a chance of winning. Pollard emphasizes that the surface was speeded up since last year's tournament following complaints by several Australian players, but refuses to accept that it may have influenced Hewitt's performances over the years.", "granite3.1-dense:2b": "Tennis Australia's Geoff Pollard defended the Australian Open courts at Melbourne Park against criticism from top player Lleyton Hewitt. Hewitt expressed frustration with the surface, stating it wasn't suitable for a prestigious event and had hindered his progress in the tournament. However, Pollard countered that the court has been made faster this year than last, citing significant modifications to accommodate Australian players' preferences. Despite Hewitt's concerns, Pollard emphasized Hewitt's adaptability across various surfaces and noted that the current courts are faster than those used when Hewitt defeated Roger Federer in the Davis Cup in 2003. The tournament is set to commence on January 17, with Pollard assuring the surface will provide a competitive environment for all players, including Hewitt.", "reference": "Hewitt said he had had a \"gutful\" of trying to persuade them to make the surface faster but Tennis Australia's Geoff Pollard rejected his comments.\"We did ask for it to be made faster than last year and, to my knowledge, it is faster,\" he said.The tournament starts on 17 January, and Pollard said the surface had been speeded up since last year's tournament following complaints by several Australian players.Hewitt, who has not got past the fourth round at Melbourne in seven attempts, had earlier said the surface was not worthy of such a prestigious tournament."}