{"raw_text": "Mirza makes Indian tennis history\n \n Teenager Sania Mirza completed a superb week at the Hyderabad Open by becoming the first Indian in history to win a WTA singles title.\n \n In front of a delirious home crowd, the 18-year-old battled past Alyona Bondarenko of the Ukraine 6-4 5-7 6-3. Mirza, ranked 134 in the world, sunk to her knees in celebration after serving out the match against Bondarenko. \"It is a big moment in my career and I would like to thank everyone who has been a part of my effort,\" she said. \"This win has made me believe more in myself and I can now hope to do better in the coming days. \"I wanted to win this tournament very badly since it was in my hometown.\" At the Australian Open in January, Mirza became the first Indian woman to reach the third round of a Grand Slam before losing to eventual champion Serena Williams.\n \n And a year ago, she became the youngest Indian to win a professional title by claiming the doubles at the Hyderabad Open. Mirza, playing in her first WTA final, began nervously in front of a raucous home crowd - committing three double faults in her opening service game. But from 0-2 down, Mirza broke serve twice in a row and held on to her advantage to take the first set. In a see-saw second set, Bondarenko raced into a 5-2 lead and though Mirza hauled herself level, the Ukrainian broke again before finally levelling the match. Mirza rediscovered the aggressive strokes that took her to the first set in the decider established a 5-2 lead. At 5-3, the stadium erupted in celebration when Mirza thought she had delivered an ace to secure victory but the serve was ruled to have clipped the net. Mirza eventually lost the point but to the relief of the crowd, she broke Bondarenko again in the next game to clinch the title.\n", "llama3.2:1b": "Sania Mirza becomes first Indian tennis player to win WTA singles title at age 18 after beating Alyona Bondarenko 6-4 5-7 6-3 at Hyderabad Open.", "llama3.2:3b": "Sania Mirza won the Hyderabad Open becoming first Indian woman to win a WTA singles title defeating Alyona Bondarenko 6-4 5-7 6-3. The 18-year-old became first Indian woman to reach Grand Slam third round in January and youngest Indian to win professional title last year, playing nervously at home.", "gemma2:2b": "Sania Mirza won the WTA Hyderabad Open singles title, making her the first Indian woman to win a WTA singles title and becoming the youngest Indian to do so at this level. \nHer victory came after overcoming Alyona Bondarenko in a closely contested match.  Mirza won the final despite a shaky start and celebrated with a historic achievement. \n", "qwen2.5:0.5b": "18-year-old Indian tennis player Sania Mirza became the first Indian to win a WTA singles title at the Hyderabad Open by defeating Alyona Bondarenko of Ukraine 6-4 5-7 6-3.\n\nHighlights:\n\n1. Sania Mirza defeated Alyona Bondarenko of Ukraine\n2. She won the match with service out (sinking to her knees)\n3. Mirza became the first Indian to win a WTA singles title at the Hyderabad Open\n4. She is now on track to become the youngest Indian professional tennis player to win a tournament before her 18th birthday (as of writing this)", "qwen2.5:1.5b": "Indian teenager Sania Mirza becomes the first Indian woman to win a WTA singles title at the Hyderabad Open, defeating Alyona Bondarenko 6-4, 5-7, 6-3 after committing three double faults early on.", "qwen2.5:3b": "Teenager Sania Mirza became the first Indian to win a WTA singles title at the Hyderabad Open. She defeated Alyona Bondarenko 6-4 5-7 6-3 in her home country, with her victory believed to have boosted her confidence and aspirations for future tournaments. Earlier this year, she achieved another milestone by winning the youngest Indian professional title at the same event. Her win was a significant moment after making history at the Australian Open in January.", "opencoder:1.5b": "Mirza makes Indian tennis history\n\nTeenager Sania Mirza completed a superb week at the Hyderabad Open by becoming the first Indian in history to win a WTA singles title.\n\nIn front of a delirious home crowd, the 18-year-old battled past Alyona Bondarenko of the Ukraine 6-4 5-7 6-3. Mirza, ranked 134 in the world, sunk to her knees in celebration after serving out the match against Bondarenko.\n\n\"Thank you for all who have been a part of my effort,\" she said. This win has made me believe more in myself and I can now hope to do better in the coming days. I wanted to win this tournament very badly since it was in my hometown.\nAt the Australian Open in January, Mirza became the first Indian woman to reach the third round of a Grand Slam before losing to eventual champion Serena Williams.\n\nAnd a year ago, she became the youngest Indian to win a professional title by claiming the doubles at the Hyderabad Open. Mirza played in her first WTA final, began nervously in front of a raucous home crowd - committing three double faults in her opening service game.\n\nBut from 0-2 down, Mirza broke serve twice in a row and held on to her advantage to take the first set. In a see-saw second set, Bondarenko raced into a 5-2 lead and though Mirza hauled herself level, the Ukrainian broke again before finally levelling the match.\n\nMirza rediscovered the aggressive strokes that took her to the first set in the decider established a 5-2 lead. At 5-3, the stadium erupted in celebration when Mirza thought she had delivered an ace to secure victory but the serve was ruled to have clipped the net. Mirza eventually lost the point but to the relief of the crowd, she broke Bondarenko again in the next game to clinch the title.\n", "smollm:1.7b": "Summarizing a text concisely requires identifying the main ideas and key details while omitting unnecessary information. Here's how you can summarize the given text:\n\n1. Identify the main idea: The text is about Mirza making Indian tennis history by becoming the first Indian in history to win a WTA singles title.\n2. Identify the supporting details: The supporting details include the fact that Mirza completed a superb week at the Hyderabad Open, defeated Alyona Bondarenko of the Ukraine 6-4 5-7 6-3, and became the first Indian woman to reach the third round of a Grand Slam before losing to Serena Williams.\n3. Omit unnecessary information: The text does not provide any additional details about Mirza's personal life or her motivation for winning the WTA singles title. It only focuses on the achievement itself and its significance in tennis history.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Sania Mirza. Let me read through it carefully.\n\nFirst, Sania is a teenager who won the Hyderabad Open as the first Indian woman and teenager in history. She beat Alyona and was super happy with her win.\n\nThen there's another part where she became the youngest Indian to win a title at the Australian Open by claiming doubles before losing to Serena Williams. That seems important because it shows her progression towards becoming a professional tennis player.\n\nI should focus on key points: her successes, achievements, and why they're significant. Make sure to mention how young she was when she won those titles and that she's aiming for professional play now.\n</think>\n\nSania Mirza became the first Indian woman and teenager to win a WTA singles title at the Hyderabad Open, defeating Alyona Bondarenko 6-4 5-7 6-3. She celebrated her victory with tears in her eyes, expressing pride in her career growth and promising future as a tennis professional. Additionally, Mirza claimed the youngest Indian woman to win a women's doubles title at the Australian Open before losing to Serena Williams, showcasing her ambition and determination.", "tinyllama:1.1b": "In a historic week at the Hyderabad Open, Indian tennis player Teenager Sania Mirza won her first WTA singles title after defeating Alyoya Bondarenko of Ukraine with victory overcoming a tough opponent in the final. Despite trailing by two sets to one and losing 5-2 in the second set, Mirza refused to give up and managed to break Bondarenko twice before finally leveling the score to win the match. In a see-saw second set, Mirza's opponent broke again, but she was able to regain her lead before eventually securing victory with an ace that overturned the umpire's decision. The win marks Mirza as India's first female tennis player to reach the final and win a major tournament at home. The triumph has also brought immense pride and joy for Mirza, who credited the support of her hometown crowd for helping her succeed in her career.", "tinydolphin:1.1b": " The text provided is about a young Indian tennis player named Mirza making an important achievement by winning her first WTA singles title at the Hyderabad Open. This victory came against a very strong opponent named Alyona Bondarenko, who was ranked 134th in the world. It was a superb performance for Mirza and helped her to boost her career as a tennis player.", "phi:2.7b": " Indian tennis player Sania Mirza made history at the Hyderabad Open by becoming the first Indian woman to win a WTA singles title. She defeated Alyona Bondarenko from Ukraine 6-4 5-7 6-3, and then went on to reach her first Grand Slam final at the Australian Open in January. Mirza also won her first professional title at the same tournament last year by claiming the doubles event. She began her match nervously but bounced back to take the first set. In a close second set, she held off Bondarenko's aggressive play and eventually secured the win with a hard-fought victory.\n", "orca-mini:3b": " Teenager Sania Mirza became the first Indian woman to win a WTA singles title by defeating Alyona Bondarenko at the Hyderabad Open. She also became the youngest Indian to win a professional title, winning the doubles at the Hyderabad Open a year ago. In a see-saw second set, Bondarenko raced into a 5-2 lead and though Mirza hauled herself level, the Ukrainian broke again before finally levelling the match. Mirza rediscovered her aggressive strokes to take the third set but was ultimately defeated by Bondarenko's consistency.", "hermes3:3b": "Sania Mirza becomes first Indian woman to win WTA singles title, making Indian tennis history.", "stablelm-zephyr:3b": "Sania Mirza became the first Indian to win a WTA singles title at the Hyderabad Open, beating Alyona Bondarenko 6-4, 5-7, 6-3 in front of a home crowd. Her victory follows her performance at the Australian Open earlier this year where she reached the third round as the first Indian woman. This accomplishment solidified her reputation as the youngest Indian to win a professional title last year by winning the doubles at the same event. Despite beginning nervously, Mirza managed to break serve twice in a row and eventually secured the victory.", "chatgpt-4o-latest": "Teenager Sania Mirza made history by becoming the first Indian to win a WTA singles title at the Hyderabad Open, defeating Alyona Bondarenko 6-4, 5-7, 6-3. Ranked 134 in the world, the 18-year-old celebrated her victory in front of a home crowd, calling it a significant moment in her career. Earlier in the year, she became the first Indian woman to reach the third round of a Grand Slam at the Australian Open. Despite a nervous start in her first WTA final, Mirza fought back to win the first set, lost the second, and regained control in the third to secure the title.", "stablelm2:1.6b": "Teenage tennis player Sania Mirza made Indian history by becoming the first Indian to win a WTA singles title at the Hyderabad Open. She defeated Alyona Bondarenko in front of a cheering home crowd after battling past double faults and ultimately securing her victory with aggressive strokes. This marks another milestone for Mirza, who previously reached the third round of the Australian Open in January 2013 before losing to eventual champion Serena Williams, and became the youngest Indian to win a professional title by winning the doubles at the Hyderabad Open earlier that year.", "granite3.1-dense:2b": "Sania Mirza, at 18 years old and ranked 134th globally, achieved Indian tennis history by winning her first WTA singles title at the Hyderabad Open. Mirza battled past Ukrainian Alyona Bondarenko in a thrilling four-set match (6-4, 5-7, 6-3), becoming the first Indian to accomplish this feat. Playing in front of an enthusiastic home crowd, Mirza overcame initial nervousness and double faults to secure her victory. The match was a rollercoaster, with Bondarenko leading at 5-2 in the second set before Mirza reclaimed control. Mirza's triumphant serve in the final game sparked ecstatic celebrations from the crowd. This win marks a significant milestone for Mirza, following her third-round appearance at the Australian Open and her first professional title in doubles at the same tournament a year prior.", "reference": "Teenager Sania Mirza completed a superb week at the Hyderabad Open by becoming the first Indian in history to win a WTA singles title.Mirza eventually lost the point but to the relief of the crowd, she broke Bondarenko again in the next game to clinch the title.But from 0-2 down, Mirza broke serve twice in a row and held on to her advantage to take the first set.Mirza, playing in her first WTA final, began nervously in front of a raucous home crowd - committing three double faults in her opening service game.In a see-saw second set, Bondarenko raced into a 5-2 lead and though Mirza hauled herself level, the Ukrainian broke again before finally levelling the match.Mirza rediscovered the aggressive strokes that took her to the first set in the decider established a 5-2 lead."}