{"raw_text": "Poppins musical gets flying start\n \n The stage adaptation of children's film Mary Poppins has had its opening night in London's West End.\n \n Sir Cameron Mackintosh's lavish production, which has cost £9m to bring to the stage, was given a 10-minute standing ovation. Lead actress Laura Michelle Kelly soared over the heads of the audience holding the nanny's trademark umbrella. Technical hitches had prevented Mary Poppins' flight into the auditorium during preview performances. A number of celebrities turned out for the musical's premiere, including actress Barbara Windsor, comic Graham Norton and Sir Richard Attenborough.\n \n The show's director Richard Eyre issued a warning earlier in the week that the show was unsuitable for children under seven, while under-threes are barred. Mary Poppins was originally created by author Pamela Travers, who is said to have cried when she saw Disney's 1964 film starring Julie Andrews. Travers had intended the story to be a lot darker than the perennial family favourite. Theatre impresario Sir Cameron Mackintosh has said he hopes the musical is a blend of the sweet-natured film and the original book.\n", "llama3.2:1b": ["The stage adaptation of Mary Poppins opened in London's West End with a 10-minute standing ovation.", "The production, led by director Richard Eyre, features lead actress Laura Michelle Kelly holding an umbrella.", "Technical hitches prevented flight during preview performances, but many celebrities attended, including Barbara Windsor and Graham Norton.", "Mary Poppins was originally created by author Pamela Travers, who intended for the story to be darker than Disney's film, with under-3s barred from attending due to safety concerns."], "llama3.2:3b": ["The stage adaptation of Mary Poppins in London's West End received a 10-minute standing ovation on its opening night, with lead actress Laura Michelle Kelly flying over the audience using an umbrella.", "The show, costing £9m, was attended by celebrities including Barbara Windsor and Sir Richard Attenborough.", "The director warned that it is unsuitable for children under seven, and the original book was darker than the Disney film."], "gemma2:2b": ["The stage adaptation of Mary Poppins premiered in London's West End with a successful opening night, receiving a 10-minute standing ovation.", "Technical challenges were overcome, allowing the nanny to fly over the audience.", "The show features celebrities such as Barbara Windsor, Graham Norton, and Sir Richard Attenborough.", "Director Richard Eyre recommends the musical for audiences older than seven years old, while under threes are barred."], "qwen2.5:0.5b": ["Mary Poppins musical premiered in London's West End with a standing ovation from the audience, who held Mary Poppins' trademark umbrella.", "Technical hitches prevented Mary Poppins' arrival during preview performances.", "Sir Cameron Mackintosh directed the production and warned it was unsuitable for children under seven while under-threes are barred.", "The show is being staged as a blend of the film and original book to cater to audiences, with Sir Cameron Mackintosh hoping that it will be a success in terms of both genres."], "qwen2.5:1.5b": ["Mary Poppins stage adaptation opens in London's West End, receiving a 10-minute standing ovation despite technical hitches during preview performances.", "Lead actress Laura Michelle Kelly performs Mary Poppins' flight over audience heads while many celebrities attend premiere.", "Directed by Richard Eyre, who warns the show is unsuitable for children under seven and bans under-threes.", "Originally created as darker than Disney's 1964 film, Sir Cameron Mackintosh hopes it will be a \"sweet blend\" of the source material and its beloved animated version."], "qwen2.5:3b": ["Poppins musical gets flying start in London's West End with a £9m production featuring a 10-minute standing ovation at its opening night.", "Technical issues occurred during previews, but stars including Barbara Windsor and Graham Norton attended the premiere.", "The show is unsuitable for children under seven or under-threes.", "Initially darker than the beloved film, it aims to blend elements of both Pamela Travers' book and the Disney version starring Julie Andrews."], "opencoder:1.5b": ["The stage adaptation of children's film Mary Poppins has had its opening night in London's West End, followed by a 10-minute standing ovation by Sir Cameron Mackintosh.", "The show's director issued a warning earlier that it was unsuitable for children under seven, while under-threes are also banned.", "A technical hitch prevented the movie from flying into the auditorium during preview performances.", "The musical's premiere included starring actors like Laura Michelle Kelly and Barbara Windsor, as well as characters like Graham Norton, Richard Attenborough and Pamela Travers who also mentioned the book's theme."], "smollm:1.7b": ["The stage adaptation of children's film Mary Poppins has had its opening night in London's West End.", "Sir Cameron Mackintosh's lavish production, which has cost £9m to bring to the stage, was given a 10-minute standing ovation.", "Lead actress Laura Michelle Kelly soared over the heads of the audience holding the nanny's trademark umbrella.", "Technical hitches had prevented Mary Poppins' flight into the auditorium during preview performances.", "A number of celebrities turned out for the musical's premiere, including actress Barbara Windsor, comic Graham Norton and Sir Richard Attenborough.", "The show's director Richard Eyre issued a warning earlier in the week that the show was unsuitable for children under seven, while under-threes are barred.", "Mary Poppins was originally created by author Pamela Travers, who is said to have cried when she saw Disney's 1964 film starring Julie Andrews.", "Travers had intended the story to be a lot darker than the perennial family favourite.", "Theatre impresario Sir Cameron Mackintosh has said he hopes the musical is a blend of the sweet-natured film and the original book."], "deepseek-r1:1.5b": ["The London West End performance of Mary Poppins' stage adaptation by Sir Cameron Mackintosh opened with a 10-minute standing ovation.", "The production cost £9 million, directed by Richard Eyre, aimed to blend the sweet-natured film with its original story by Pamela Travers, who intended a darker narrative than Disney's 1964 film.", "The lead actress, Laura Michelle Kelly, stood over the audience holding Mary Poppins' umbrella during the opening.", "Technical issues prevented Mary Poppins from flying in preview performances, but several celebrities attended including Barbara Windsor and Graham Norton."], "tinyllama:1.1b": ["The stage adaptation of children's film Mary Popins has had its opening night in London's West End, with a standing ovation given to actress Laura Michelle Kelly who held onto the umbrella-wielding character throughout the performance.", "The musical cost £9m to produce, and celebrity fans included British actor Richard Attenborough.", "Despite being rated too young for children under seven, the show has been recommended as a family affair with under-three-year-olds barred from entering."], "tinydolphin:1.1b": [" The stage adaptation of the beloved children's film \"Mary Poppins\" has received an unprecedented opening night with a standing ovation.", "The lavish production, which cost £9 million to bring to the West End, has been hailed as a triumph by audiences and critics alike.", "The lead actress, Laura Michelle Kelly, has captivated the crowd with her performance in \"Mary Poppins,\" and technical difficulties have not deterred her or her team from creating a spectacular production.", "In addition to stars like Barbara Windsor and Graham Norton, the premiere was attended by a number of celebrities, including actress Barbara Windsor, comedian Graham Norton, and Sir Richard Attenborough.", "The show's director, Richard Eyre, has warned that the production is unsuitable for children under seven, while under-threes are barred.", "Mary Poppins was created by author Pamela Travers, who was reported to have been crying when she saw Disney's 1964 film.", "The original story was intended to be darker than the family favorite, but this version promises a delightful blend of sweet-naturedness and magic."], "phi:2.7b": [" The stage adaptation of Mary Poppins, directed by Richard Eyre and costing £9m, had its opening night in London's West End with a 10-minute standing ovation.", "Lead actress Laura Michelle Kelly received a standing ovation for her performance while technical hitches prevented Mary Poppins' flight into the auditorium during preview performances.", "The show is not suitable for children under seven and under-threes are barred."], "orca-mini:3b": [" The stage adaptation of Mary Poppins, featuring Laura Michelle Kelly's performance, received a 10-minute standing ovation at its opening night in London's West End.", "Technical hitches prevented Mary Poppins from flying during preview performances, but the show is still suitable for children under seven and under-threes are barred.", "The musical blends the sweet-natured film with the original book."], "hermes3:3b": ["Mary Poppins musical opens in London, West End, with standing ovation; $9m production directed by Richard Eyre, unsuitable for under-7s, based on original author's darker story but aiming for blend of film sweetness & book content."], "stablelm-zephyr:3b": ["The stage adaptation of Mary Poppins had its opening night in London's West End, receiving a 10-minute standing ovation.", "The £9m production features lead actress Laura Michelle Kelly and director Richard Eyre's warning that it's unsuitable for children under seven.", "Celebrities such as Barbara Windsor attended the musical's premiere, which aims to blend the sweet nature of the film and the original book by Pamela Travers."], "stablelm2:1.6b": ["The stage adaptation of children's film Mary Poppins debuted in London's West End with lavish production costs of £9m, receiving a standing ovation after opening night.", "Lead actress Laura Michelle Kelly performed as a flying character with a trademark umbrella, while technical issues during preview performances halted the plane's entrance into the auditorium.", "Celebrities attended the premiere, including Barbara Windsor, Graham Norton, and Sir Richard Attenborough.", "The show's director, Richard Eyre, warned that children under seven were unsuitable for the production, as it was originally intended to be darker than its popular family character.", "Originally created by author Pamela Travers, who reportedly cried upon seeing Disney's film starring Julie Andrews, Mackintosh hopes this blend of film and original book will create a successful musical."], "granite3.1-dense:2b": ["The stage adaptation of \"Mary Poppins\" opened in London's West End, directed by Richard Eyre, with a 10-minute standing ovation for lead actress Laura Michelle Kelly.", "Despite technical issues preventing the famous chimney sweep scene during previews, the production cost £9m and attracted celebrities like Barbara Windsor, Graham Norton, and Sir Richard Attenborough.", "Eyre cautioned that the show is inappropriate for children under seven and those under three.", "The musical aims to capture the essence of Pamela Travers' original darker story while incorporating elements from the beloved 1964 Disney film."], "chatgpt-4o-latest": ["The stage adaptation of *Mary Poppins* premiered in London's West End with a lavish £9m production, receiving a 10-minute standing ovation.", "Lead actress Laura Michelle Kelly flew over the audience with the iconic umbrella after technical issues had delayed the effect in previews.", "Celebrities including Barbara Windsor, Graham Norton, and Sir Richard Attenborough attended the premiere.", "Director Richard Eyre warned the show was unsuitable for children under seven, with under-threes barred.", "The original *Mary Poppins* author, Pamela Travers, had envisioned a darker story than Disney’s 1964 film.", "Producer Sir Cameron Mackintosh aimed to blend the film’s charm with the book’s tone."]}