{"raw_text": "Da Vinci Code is 'lousy history'\n \n The plot of an international bestseller that thousands of readers are likely to receive as a Christmas present is 'laughable', a clergyman has said.\n \n The Da Vinci Code claims Jesus was not crucified, but married Mary Magdalene and died a normal death. It claims this was later covered up by the Church. The Bishop of Durham, the Rt Rev Dr Tom Wright, described the novel as a \"great thriller\" but \"lousy history\". The book has sold more than seven million copies worldwide. Despite enjoying Dan Brown's conspiracy theory, the Bishop said there was a lack of evidence to back up its claims.\n \n Writing his Christmas message in the Northern Echo, the Bishop said: \"Conspiracy theories are always fun - fun to invent, fun to read, fun to fantasise about. \"Dan Brown is the best writer I've come across in the genre, but anyone who knows anything about 1st century history will see that this underlying material is laughable.\" A great deal of credible evidence proves the Biblical version of Jesus' life was true, according to the Bishop. \"The evidence for Jesus and the origins of Christianity is astonishingly good,\" he said. \"We have literally a hundred times more early manuscripts for the gospels and letters in the New Testament than we have for the main classical authors like Cicero, Virgil and Tacitus.\n \n \"Historical research shows that they present a coherent and thoroughly credible picture of Jesus, with all sorts of incidental details that fit the time when he lived, and don't fit the world of later legend.\" Brown's book has become a publishing phenomenon, consistently topping book charts in the UK and US. The Da Vinci Code has been translated into 42 languages and has spawned its own cottage industry of publications, including guides on to how to read the book, rebuttals and counter claims. The book, which has become an international best-seller in little over two years, is set to be made into a film starring Tom Hanks.\n", "llama3.2:1b": ["Dan Brown's \"Da Vinci Code\" claims Jesus was married to Mary Magdalene and died normally but says it lacks evidence from 1st century history.", "Bishop Dr Tom Wright of Durham described the book as \"lousy history\".", "The Bishop, who is an expert in 1st century history, criticizes the book's lack of credible evidence."], "llama3.2:3b": ["The Bishop of Durham describes Dan Brown's \"Da Vinci Code\" as \"lousy history\" due to the lack of evidence supporting its conspiracy theories about Jesus' life and death.", "Despite being a bestseller, the book's claims are seen as laughable by those familiar with 1st century history, which present a coherent picture of Jesus' life based on credible historical research."], "gemma2:2b": ["The Da Vinci Code, while a successful thriller, is considered \"laughable history\" by Bishop Tom Wright due to its lack of supporting evidence for the claims about Jesus's life.", "The bishop argues that credible historical evidence supports the traditional account of Jesus' life as documented in early manuscripts and letters."], "qwen2.5:0.5b": ["Da Vinci Code: A Lousy History Despite Its International Sales, the novel about Jesus' crucifixion and resurrection receives low reviews from historians."], "qwen2.5:1.5b": ["A clergyman criticizes Dan Brown's \"Da Vinci Code\" as laughable conspiracy theory without historical evidence for its claims about Jesus' life and death.", "The Bishop of Durham states the novel lacks credibility compared to reputable historical sources supporting the traditional Christian account of Jesus."], "qwen2.5:3b": ["Da Vinci Code is described as 'lousy history' by Bishop of Durham Dr Tom Wright, who appreciates the novel's thriller qualities but criticizes its historical inaccuracies.", "The book claims Jesus was not crucified and suggests he married Mary Magdalene.", "Wright argues there is insufficient evidence to support these claims, pointing out that credible historical evidence supports the Biblical version of Jesus' life.", "He notes that there are over 100 early manuscripts for New Testament gospels compared to a handful for classical authors like Cicero, Virgil, and Tacitus.", "Despite its popularity with readers, Wright views the book's conspiracy theories as 'laughable'."], "opencoder:1.5b": ["The Da Vinci Code is not 'lousy history'.", "The plot of this book is 'laughable', but the story is about Jesus who was not crucified and married Mary Magdalene and died a normal death, later explained by the Church.", "The authors' claims are backed up by credible evidence, and it's set to be made into a film starring Tom Hanks."], "smollm:1.7b": ["The Da Vinci Code is \"lousy history\" because it lacks credible evidence to support its claims about Jesus Christ's life and the origins of Christianity.", "The book presents a conspiracy theory that has been thoroughly debunked by historians and scholars, who have consistently found that the early Christian texts provide a coherent and credible picture of Jesus' life."], "deepseek-r1:1.5b": ["Da Vinci Code is labeled as 'lousy history' by a clergyman, who describes it as laughable due to its unlikeable claims about Jesus's life and Christian origins.", "A book销售数百万次，但仍有传说是基于后世的 legend。 bishop of durham称其为 great thriller but lacking solid evidence, despite selling over 7 million copies worldwide.", "the story has inspired film, with tom hanks in it."], "tinyllama:1.1b": ["The Da Vinci Code is \"lousy history,\" according to the Bishop of Durham, who described it as a \"great thriller\" but noted that there was no solid evidence to support its claims.", "The novel's popularity has led to various adaptations, including books, guides, and films based on the conspiracy theories in the book.", "Despite enjoying Brown's own books, the Bishop lamented the lack of evidence for the claims made in the Da Vinci Code, which is a publishing phenomenon with a cult following.", "The book has become a top-seller and continues to be a topic of debate among historians and religious scholars."], "tinydolphin:1.1b": [" Summary: The Da Vinci Code, a novel by best-selling author Dan Brown, is criticized as being \"lousy history\" due to claims that Jesus was not crucified, but married Mary Magdalene and died a normal death.", "The Bishop of Durham, Dr Tom Wright, described the book as a \"great thriller,\" but found the evidence presented by Brown to be \"laughable.\"", "Brown's book has become a publishing phenomenon, consistently topping book charts in the UK and US and being translated into 42 languages."], "phi:2.7b": [" The Da Vinci Code is a best-selling novel that posits Jesus had a secret marriage with Mary Magdalene and died naturally, but the Church covered it up.", "Bishop Tom Wright, however, finds this theory \"lousy history\" and believes there is no credible evidence to support it.", "He argues that there are abundant historical sources supporting the traditional account of Jesus' life.", "The book's popularity has spawned numerous related publications and a film adaptation."], "orca-mini:3b": [" The Da Vinci Code is considered a \"lousy history\" by some as it claims Jesus was not crucified but married Mary Magdalene and died a normal death.", "However, Dan Brown's conspiracy theory has been met with skepticism due to the lack of evidence to support its claims.", "The book has sold over seven million copies worldwide despite being criticized as \"lousy history.\""], "hermes3:3b": ["Da Vinci Code criticized as lousy history; Bishop of Durham calls it laughable history despite enjoying thriller aspect."], "stablelm-zephyr:3b": ["A clergyman criticized Dan Brown's bestselling novel, The Da Vinci Code, calling it \"lousy history.\"", "The book claims that Jesus was not crucified but married Mary Magdalene and died of natural causes, which the Bishop of Durham, Rt Rev Dr Tom Wright, dismissed as laughable.", "Despite selling more than seven million copies worldwide, Bishop Wright emphasized that there is a lack of evidence to support the novel's conspiracy theories.", "He noted that there is astonishingly good evidence supporting the Biblical version of Jesus' life and the origins of Christianity.", "The Da Vinci Code has become an international bestseller and has been translated into 42 languages, with its own publishing industry consisting of various books, guides, and rebuttals."], "stablelm2:1.6b": ["The Da Vinci Code is widely considered \"laughable\" by historians due to its conspiracy theories about Jesus' crucifixion, marriage, and cover-up by the Church.", "Despite being a bestseller with seven million copies sold worldwide, there's no evidence to support these claims according to Bishop Tom Wright.", "In contrast, credible historical evidence shows that Jesus was a real figure in 1st century AD, with numerous early manuscripts providing a coherent and accurate picture of his life.", "Dan Brown is praised as a good writer but criticized for having laughable content.", "The book has been adapted into multiple languages and will be turned into a movie starring Tom Hanks."], "granite3.1-dense:2b": ["Bishop Dr. Tom Wright of Durham criticizes Dan Brown's \"The Da Vinci Code\" as a captivating thriller but poor history.", "The novel, which suggests Jesus was married and died naturally instead of being crucified, lacks substantial evidence to support its claims.", "Dr. Wright emphasizes the abundance of reliable early manuscripts for New Testament texts, contrasting this with scarce sources for classical authors like Cicero, Virgil, and Tacitus.", "Despite this, The Da Vinci Code has sold over seven million copies worldwide, been translated into 42 languages, and is set to be a film starring Tom Hanks.", "Dr. Wright acknowledges Brown's writing skills but maintains the historical accuracy of the traditional Jesus narrative."], "chatgpt-4o-latest": ["The Bishop of Durham, Rt Rev Dr Tom Wright, criticized *The Da Vinci Code* as \"lousy history\" despite acknowledging it as a great thriller.", "The novel claims Jesus was not crucified but married Mary Magdalene, a theory the Bishop dismissed as laughable due to a lack of evidence.", "He argued that historical research strongly supports the Biblical account of Jesus' life, with far more early manuscripts for the New Testament than for classical authors.", "Despite this, Dan Brown's book has sold over seven million copies, been translated into 42 languages, and is set to be adapted into a film starring Tom Hanks."]}