{"raw_text": "Uganda bans Vagina Monologues\n \n Uganda's authorities have banned the play The Vagina Monologues, due to open in the capital, Kampala this weekend.\n \n The Ugandan Media Council said the performance would not be put on as it promoted and glorified acts such as lesbianism and homosexuality. It said the production could go ahead if the organisers \"expunge all the offending parts\". But the organisers of the play say it raises awareness of sexual abuse against women. \"The play promotes illegal, unnatural sexual acts, homosexuality and prostitution, it should be and is hereby banned,\" the council's ruling said.\n \n The show, which has been a controversial sell-out around the world, explores female sexuality and strength through individual women telling their stories through monologues. Some parliamentarians and church leaders are also siding with the Media Council, Uganda's New Vision newspaper reports. \"The play is obscene and pornographic although it was under the guise of women's liberation,\" MP Kefa Ssempgani told parliament.\n \n But the work's author, US playwright Eve Ensler, says it is all about women's empowerment. \"There is obviously some fear of the vagina and saying the word vagina,\" Ms Ensler told the BBC. \"It's not a slang word or dirty word it's a biological, anatomical word.\" She said the play is being produced and performed by Ugandan women and it is not being forced on them. The four Ugandan NGOs organising the play intended to raise money to campaign to stop violence against women and to raise funds for the war-torn north of the country. \"I'm extremely outraged at the hypocrisy,\" the play's organiser in Uganda, Sarah Mukasa, told the BBC's Focus on Africa programme. \"I'm amazed that this country Uganda gives the impression that it is progressive and supports women's rights and the notions of free speech; yet when women want to share their stories the government uses the apparatus of state to shut us up.\"\n", "llama3.2:1b": ["Uganda has banned The Vagina Monologues due to its content, which the Ugandan Media Council considers to promote acts like lesbianism and homosexuality.", "However, the play's author Eve Ensler says it is about women's empowerment, while some parliamentarians and church leaders are opposed to the play, claiming it is obscene."], "llama3.2:3b": ["Uganda has banned The Vagina Monologues, citing concerns over lesbianism, homosexuality, and prostitution.", "However, the play's author and Ugandan organizers say it aims to raise awareness about sexual abuse against women and promote women's empowerment through individual stories."], "gemma2:2b": ["Uganda banned a performance of The Vagina Monologues, citing its promotion of lesbianism and homosexuality.", "The play explores female sexuality and strength through individual women's monologues, sparking opposition from some parliamentarians and church leaders who view it as obscene and pornographic.", "Author Eve Ensler defends the play as empowering for women and states that the performance is being produced by Ugandan women without coercion."], "qwen2.5:0.5b": ["Uganda bans a play called \"The Vagina Monologues\" after organizers were found guilty of promoting illegal, unnatural sexual acts.", "The play explores female sexuality and strength through individual women telling their stories through monologues.", "Uggan's author, US playwright Eve Ensler, says the play is about women's empowerment rather than sex abuse."], "qwen2.5:1.5b": ["Uganda bans The Vagina Monologues due to concerns about promoting homosexuality and prostitution, with organizers arguing it raises awareness of sexual abuse against women."], "qwen2.5:3b": ["Ugandan authorities have banned The Vagina Monologues in Kampala due to its perceived promotion of lesbianism, homosexuality, and prostitution.", "Uganda's Media Council stated it would not be staged unless offensive parts are removed, while some parliamentarians and church leaders support the ban citing moral objections.", "However, the play’s author argues that it promotes women's empowerment by exploring female sexuality through monologues.", "Ugandan organizers assert the production raises funds for women's rights and war-torn areas but face opposition from state entities."], "opencoder:1.5b": ["Uganda bans Vagina Monologues.", "The Ugandan authorities have banned the play The Vagina Monologues due to promoting and glorifying acts like lesbianism, homosexuality, and prostitution.", "The play says it raises awareness of sexual abuse against women and can't be put on as its promoted acts such as this cause inappropriate behavior.", "However, the organisers say it allows for better understanding of the issue.", "The show, which has been controversial, explores female sexuality through individual women telling their stories through monologues.", "Some parliamentarians and church leaders are also supporting the Media Council's stance.", "However, the work's author says it is all about women's empowerment.", "\"There is definitely some fear of the vagina and saying the word vagina,\" Ms Ensler told the BBC.", "\"It's not a slang word or dirty word, it's a biological, anatomical word; it's just a way to promote women's liberation.\"", "She said that the play was produced and performed by Ugandan women, and it isn't being forced on them.", "The organizations planned to raise funds for the war-torn north of the country, saying they're outraged at the perceived hypocrisy."], "smollm:1.7b": ["The Vagina Monologues, a play written by Eve Ensler, explores female sexuality and empowerment through individual women telling their stories.", "The show is controversial due to its explicit content and open discussion of sexual abuse against women.", "Uganda's authorities have banned the production of the play due to its promotion of illegal, unnatural sexual acts, homosexuality and prostitution.", "The show raises awareness about these issues by exploring the experiences of individual women."], "deepseek-r1:1.5b": ["Uganda has banned The Vagina Monologues due to its promotion of sexual misconduct.", "The show promotes harmful activities like lesbianness and homophobia.", "The Uganda Media Council advises that production expunges offensive elements, while advocates argue the show undermines women's rights by exposing their stories.", "Ugandans organize the show for fundraising and womanhood causes.", "Critical voices from Uganda's government highlight the hypocrisy of not supporting women's rights."], "tinyllama:1.1b": ["The Uganada authorities have banned a play called \"Vaadin Monologues,\" which has been widely praised for promoting and glorifying acts such as lesbianism, prostitution, and female sexuality.", "The production raises awareness of sexual abuse against women and is presented by Uganadan women who intend to use the proceeds to campaign against violence and raise funds for war-torn areas in the north of the country.", "The play's author, US playwright Evelyn Ensler, aims to empower women through her words and says she intended to perform it herself.", "However, the Uganan Media Council's ruling bans the production due to its promotions of unnatural acts and sexual abuse against women."], "tinydolphin:1.1b": [" The play, 'The Vagina Monologues', is set to make its Kampala debut this weekend.", "However, the Uganda Media Council has banned it because it promotes and glorifies acts such as lesbianism and homosexuality, which they deem are not desirable or healthy for women.", "The council cited that the production raises awareness of sexual abuse against women, and the play should remain prohibited if the organizers cancels or expels all offending parts.", "Some parliamentarians and church leaders have also sided with the Media Council on this issue.", "However, Eve Ensler, the author of the play, claims that it is about empowerment for women rather than promoting violence against them.", "The play's four Ugandan NGOs plan to raise money through ticket sales and funds raised will be used to campaign against violence against women and raise funds for the war-torn northern region of their country."], "phi:2.7b": [" The Uganda Media Council banned a controversial play called The Vagina Monologues, citing its promotion of homosexuality and prostitution.", "However, supporters of the show argue that it raises awareness of sexual abuse against women.", "The ban has sparked debate about freedom of speech in the country."], "orca-mini:3b": [" Uganda has banned the play The Vagina Monologues, due to open in Kampala this weekend.", "The production is controversial and some parliamentarians and church leaders are siding with the Media Council, which says it promotes illegal, unnatural sexual acts, homosexuality, and prostitution.", "The show explores female sexuality and strength through individual women telling their stories through monologues.", "Some Ugandan NGOs want to raise money to campaign against violence against women and to raise funds for the north of the country.", "The play's author, Eve Ensler, says it is all about women's empowerment, although some parliamentarians and church leaders are afraid of the word \"vagina\".", "The show is being produced and performed by Ugandan women and it is not being forced on them."], "hermes3:3b": ["Uganda bans The Vagina Monologues due to promotion of lesbianism & homosexuality."], "stablelm-zephyr:3b": ["Uganda has banned the play The Vagina Monologues due to its promotion of acts like lesbianism and homosexuality, with the Ugandan Media Council stating that it could be put on if the offending parts were removed.", "Author Eve Ensler argues that the play is about women's empowerment and doesn't forcefully impose it on Ugandan women.", "The play was initially intended to raise money for campaigns against violence against women and in support of the war-torn north of the country.", "Some parliamentarians and church leaders also oppose the play, citing its alleged obscenity and pornographic content."], "stablelm2:1.6b": ["Uganda has banned The Vagina Monologues due to concerns about promoting lesbianism and homosexuality.", "The play, which explores female sexuality and strength through individual women's stories, has been a global sell-out and was intended by four Ugandan NGOs to raise funds for war-affected areas.", "Critics argue that the banned production may be forced on local women without their consent."], "granite3.1-dense:2b": ["Ugandan authorities have banned The Vagina Monologues, set to premiere in Kampala this weekend.", "The Ugandan Media Council cited the play's promotion of lesbianism and homosexuality as grounds for the ban, demanding removal of offensive content.", "Organizers argue that the play raises awareness about sexual abuse against women, fostering empowerment through storytelling.", "Critics, including some MPs and church leaders, view it as obscene and pornographic, despite its intent to combat violence against women and support north Uganda's war-affected populace.", "Playwright Eve Ensler asserts that the word \"vagina\" should not be considered vulgar, emphasizing the play's focus on women's liberation and biological anatomy.", "The organizer in Uganda, Sarah Mukasa, expressed outrage at the government's hypocrisy, given Uganda's perceived commitment to women's rights and free speech."], "chatgpt-4o-latest": ["Uganda's authorities have banned the play *The Vagina Monologues* in Kampala, citing its promotion of homosexuality and prostitution.", "The Ugandan Media Council stated the play could proceed only if \"offending parts\" were removed.", "Supporters argue the play raises awareness of sexual abuse and women's empowerment, while critics, including some politicians and church leaders, deem it obscene.", "Playwright Eve Ensler defends it as a celebration of women's strength, and organizers intended to use proceeds to combat violence against women.", "Activist Sarah Mukasa condemned the ban as hypocritical, criticizing Uganda's stance on free speech and women's rights."]}