{"raw_text": "Spark heads world Booker list\n \n Dame Muriel Spark is among three British authors who have made the shortlist for the inaugural international Booker Prize.\n \n Doris Lessing and Ian McEwan have also been nominated. McEwan and Margaret Atwood are the only nominees to have previously won the main Booker Prize. The new £60,000 award is open to writers of all nationalities who write in English or are widely translated. The prize commends an author for their body of work instead of one book.\n \n Gabriel Garcia Marquez, Saul Bellow, Milan Kundera and John Updike also feature on the 18-strong list of world literary figures.\n \n But other past winners of the regular Booker Prize, such as Salman Rushdie, JM Coetzee and Kazuo Ishiguro have failed to make the shortlist. The prize, which will be awarded in London in June, will be given once every two years. It will reward an author - who must be living - for \"continued creativity, development and overall contribution to fiction on the world stage\". An author can only win once. The international award was started in response to criticisms that the Booker Prize is only open to British and Commonwealth authors.\n \n \n \n Margaret Atwood (Canada) Saul Bellow (Canada) Gabriel Garcia Marquez (Colombia) Gunter Grass (Germany) Ismail Kadare (Albania) Milan Kundera (Czech Republic) Stanislaw Lem (Poland) Doris Lessing (UK) Ian McEwan (UK) Naguib Mahfouz (Egypt) Tomas Eloy Martinez (Argentina) Kenzaburo Oe (Japan) Cynthia Ozick (US) Philip Roth (US) Muriel Spark (UK) Antonio Tabucchi (Italy) John Updike (US) Abraham B Yehoshua (Israel)\n", "llama3.2:1b": ["Dame Muriel Spark, Doris Lessing, Ian McEwan, and Margaret Atwood are among three British authors shortlisted for the inaugural international Booker Prize."], "llama3.2:3b": ["Dame Muriel Spark is among three British authors nominated for the inaugural international Booker Prize, which also includes Doris Lessing and Ian McEwan.", "Other notable nominees include Gabriel Garcia Marquez, Saul Bellow, Milan Kundera, and John Updike.", "The prize aims to recognize an author's \"continued creativity, development and overall contribution to fiction on the world stage\" every two years, starting in June in London, with a £60,000 award."], "gemma2:2b": ["Dame Muriel Spark, along with Doris Lessing and Ian McEwan, is among the nominees for the inaugural International Booker Prize.", "Other notable authors on the list include Gabriel Garcia Marquez, Saul Bellow, Milan Kundera, John Updike, and Margaret Atwood.", "The prize recognizes a writer's overall body of work and aims to celebrate international fiction."], "qwen2.5:0.5b": ["The inaugural international Booker Prize was awarded in 2014 to three British authors—Doris Lessing, Ian McEwan, and Margaret Atwood.", "These authors have been nominated for the main Booker Prize but failed to win it due to their nationality or language skills.", "Other notable world literary figures on the list include Gabriel Garcia Marquez, Saul Bellow, Milan Kundera, John Updike, and Gunter Grass."], "qwen2.5:1.5b": ["British authors Dame Muriel Spark, Doris Lessing, and Ian McEwan are among three shortlisted for the inaugural international Booker Prize.", "The £60, 000 award is open to writers worldwide who write in English or have been widely translated.", "Other past winners of the regular Booker Prize have not made the shortlist this time."], "qwen2.5:3b": ["Dame Muriel Spark is among three British authors nominated for the inaugural international Booker Prize, which opens to writers from all nationalities writing in English or widely translated.", "Also included are Doris Lessing and Ian McEwan, who have previously won the main Booker Prize.", "The prize awards an author's body of work instead of a single book, with winners being restricted to one award.", "Past winners like Salman Rushdie and Kazuo Ishiguro did not make this shortlist due to criticisms that the regular Booker Prize is limited to British and Commonwealth authors.", "Notable figures on the list include Gabriel García Márquez, Saul Bellow, Milan Kunderra, John Updike, among others from various countries."], "opencoder:1.5b": ["The text presents a summary of the given text.", "The key ideas and details about the authors who have won the Booker Prize are summarized as follows:\n\n- Author Margaret Atwood (Canada) has been chosen to win the Booker Prize.", "- Author Saul Bellow (Canada) also made the list.", "- Author Gabriel Garcia Marquez (Colombia) and Gunter Grass (Germany) also participated in the Booker Prize.", "- Author Stanislaw Lem (Poland) has also won the list.", "- The remaining authors, including Doris Lessing (UK), Ian McEwan (UK), Tomas Eloy Martinez (Argentina), Kenzaburo Oe (Japan), Cynthia Ozick (US), Philip Roth (US), and Antonio Tabucchi (Italy) have also participated in the list.", "They have not won the Booker Prize yet.", "- The authors who write in English or are widely translated have also contributed to the list, but they will not be considered as they haven't made the initial list selection due to their nationality."], "smollm:1.7b": ["The summary is concise and to the point, preserving the key ideas and details of the original text.", "It captures the main points of the text without adding or subtracting any information.", "The summary should be written in a clear and neutral tone, avoiding any personal opinions or biases."], "deepseek-r1:1.5b": ["Three British authors are on the shortlist for the 2024 International Booker Prize: Muriel Spark (UK), Doris Lessing (UK), Ian McEwan (UK), and others listed below.", "The £60,000 award is open to writers writing in English or widely translated.", "Other past winners, such as Salman Rushdie and JM Coetzee, failed to make it, and this year's shortlist will be recognized for its international focus."], "tinyllama:1.1b": ["A British author, Doris Lessing, and two other writers, Ian McEwan and Gabriel García Márquez, have been shortlisted for the inaugural international Booker Prize.", "The new prize aims to reward an author for their \"continuous creativity, development, and overall contribution to fiction on the world stage.\"", "Excluding previous winners who were widely translated, only three British authors are on the list of 18 writers, including Margaret Atwood, Saul Bellows, Gabriel García Marquez, Gunther Graß, Ismail Ka'daré, Milan Kundera, Stanislaw Lem, Doris Lessing, Ian McEwan, Naguib Mahfouz, Tomas Eloy Martinez, Kenzaburo Oe, Cyndi Ozike, Philip Roth, Muriel Spark, Antonio Tabucchi, John Updike, and Abrha'm B. Yehoshu'a.", "The list of 18 writers will be announced on June 1st at the Booker Prize ceremony in London."], "tinydolphin:1.1b": [" Summary: The Booker Prize, an international literary award given once every two years, has a new winner in addition to the previously announced ones.", "Notable winners include Gabriel Garcia Marquez, Salman Rushdie, John Updike, Kazuo Ishiguro and Ian McEwan.", "However, past winners of the regular Booker Prize have not fared well on this occasion.", "The award will be given in London in June for \"continued creativity, development, and overall contribution to fiction.\""], "phi:2.7b": [" The international Booker Prize is open to writers of all nationalities who write in English or are widely translated.", "The prize recognizes an author for their overall contribution to fiction on the world stage, with a new £60,000 award that commends an author's body of work instead of one book.", "Some past winners of the regular Booker Prize have failed to make it onto the shortlist, including Salman Rushdie, JM Coetzee, and Kazuo Ishiguro.", "The prize is given once every two years and aims to be more inclusive than previous iterations by only accepting living authors.", "The 18-strong list includes literary figures such as Gabriel Garcia Marquez, Saul Bellow, Milan Kundera, John Updike, Gabriel Garcia Marquez, and others."], "orca-mini:3b": [" Dame Muriel Spark, Ismail Kadare, Gunter Grass, Milan Kundera, Stanislaw Lem, Doris Lessing, Ian McEwan, Naguib Mahfouz, Tomas Eloy Martinez, Kenzaburo Oe, Cynthia Ozick, Philip Roth, Muriel Spark and Abraham B Yehoshua are among the 18-strong list of world literary figures who have made the shortlist for the inaugural international Booker Prize.", "The prize is awarded to an author who has \"continued creativity, development and overall contribution to fiction on the world stage\", with Margaret Atwood winning it in 2009 for her novel \"The Blind Assassin\"."], "hermes3:3b": ["Muriel Spark, Doris Lessing, Ian McEwan shortlisted for 1st International Booker Prize."], "stablelm-zephyr:3b": ["Dame Muriel Spark, along with Doris Lessing and Ian McEwan, have been nominated for the inaugural international Booker Prize.", "The award, worth £60,000, is open to authors of all nationalities who write in English or are widely translated.", "Previously winners of the main Booker Prize, such as Salman Rushdie and JM Coetzee, failed to make the shortlist for this new prize.", "The International Prize for Fiction will be awarded every two years and recognize an author's \"continued creativity, development, and overall contribution to fiction on the world stage.\""], "stablelm2:1.6b": ["Dame Muriel Spark, along with Doris Lessing and Ian McEwan, has been nominated for the inaugural international Booker Prize.", "This new award honors an author's body of work instead of one book, and writers of all nationalities can participate in English or widely translated works.", "Margaret Atwood is the only previous winner among the nominees.", "Past winners like Salman Rushdie, JM Coetzee, and Kazuo Ishiguro did not make the shortlist.", "The prize will be awarded once every two years in London, with the author receiving recognition for \"continued creativity, development, and overall contribution to fiction on the world stage.\""], "granite3.1-dense:2b": ["British author Dame Muriel Spark, along with Doris Lessing and Ian McEwan, is among the three nominees for the inaugural international Booker Prize.", "This £60,000 award, open to writers of all nationalities who write in English or are widely translated, honors an author's overall creative output rather than a single book.", "Previous regular Booker Prize winners like Salman Rushdie and JM Coetzee did not make the shortlist this year.", "The prize, to be awarded in London in June, aims to address criticisms that the regular Booker Prize favors British and Commonwealth authors.", "Other nominees include Gabriel Garcia Marquez, Saul Bellow, Milan Kundera, John Updike, and others from diverse backgrounds like Canada, Germany, Colombia, Poland, the US, Israel, Japan, and Argentina.", "The winner will be selected for continued creativity and global fiction contributions, with an author being eligible to win only once."], "chatgpt-4o-latest": ["Dame Muriel Spark, Doris Lessing, and Ian McEwan are among the British authors shortlisted for the inaugural international Booker Prize, a £60,000 award recognizing an author's body of work rather than a single book.", "The prize is open to writers of all nationalities who write in English or are widely translated and will be awarded every two years.", "Other notable nominees include Gabriel Garcia Marquez, Saul Bellow, Milan Kundera, and John Updike.", "However, past Booker Prize winners like Salman Rushdie, JM Coetzee, and Kazuo Ishiguro did not make the shortlist.", "The award was introduced to address criticism that the Booker Prize was limited to British and Commonwealth authors."]}