{"raw_text": "Versace art portfolio up for sale\n \n The art collection of murdered fashion designer Gianni Versace could fetch up to £9m ($17m) when it is auctioned in New York and London later this year.\n \n Among the pictures for sale are works by Roy Lichtenstein, Andy Warhol and Henri Matisse. The collection was housed at Versace's six-storey New York townhouse. The 51-year-old designer was shot outside his Florida home in 1997 by suspected serial killer Andrew Cunanan, who later killed himself. The auction, at Sotheby's, will feature 45 contemporary, impressionist and 19th Century paintings. One of the highlights of the sale is Roy Lichtenstein's Blue Nude which has been given an estimate of £1.8m ($3.4m).\n \n Tobias Meyer, Sotheby's worldwide head of contemporary art, said: \"This collection reflects Mr Versace's wide-ranging taste and impeccable eye, and many of the works were commissioned directly from the artists. \"Outstanding later examples from champions of the Pop movement, such as Roy Lichtenstein, are juxtaposed with masterpieces from the most visible artists of the 1980's, including Jean-Michel Basquiat and the collaborative genius of Basquiat and Warhol, as well as Francesco Clemente.\" Much of the collection will be offered for sale at three auctions in New York in June, with smaller contemporary paintings going under the hammer in London on 22 and 23 June. A sale of Versace's furniture and artworks sold in 2001fetched £5.5m ($10.3m).\n", "llama3.2:1b": ["Gianni Versace's art collection is up for sale at Sotheby's, with estimates ranging from $17m to $9m.", "The collection includes works by Roy Lichtenstein, Andy Warhol, Henri Matisse, and Jean-Michel Basquiat, among others."], "llama3.2:3b": ["Gianni Versace's art collection is up for auction in New York and London, featuring works by Roy Lichtenstein, Andy Warhol, Henri Matisse, and Jean-Michel Basquiat, with an estimated value of £9m ($17m)."], "gemma2:2b": ["A collection of art by Roy Lichtenstein, Andy Warhol, Henri Matisse, and others owned by murdered fashion designer Gianni Versace is being auctioned in New York and London later this year.", "The collection is estimated to fetch up to £9 million ($17 million), featuring pieces commissioned from the artists themselves.", "It will be auctioned at Sotheby's with highlights including Roy Lichtenstein's Blue Nude."], "qwen2.5:0.5b": ["A collection of Roy Lichtenstein, Andy Warhol and Henri Matisse paintings by Gianni Versace is up for auction at Sotheby's on June 22-23, New York City.", "The sale will feature 45 contemporary impressionist works alongside 19th-century masterpieces from the museum's collection of 70-year-old photos.", "One work, Roy Lichtenstein’s Blue Nude, has been estimated to fetch £1.8 million ($3.4 million), making it one of the most valuable pieces in the sale.", "The Versace portfolio also includes works by Pablo Picasso and Salvador Dalí."], "qwen2.5:1.5b": ["The art collection of murdered fashion designer Gianni Versace, consisting of paintings by Roy Lichtenstein, Andy Warhol, and Henri Matisse among others, is up for sale at auction in New York and London later this year.", "The estimated value of the entire collection is £9 million ($17 million)."], "qwen2.5:3b": ["The art collection of murdered fashion designer Gianni Versace, including works by Roy Lichtenstein, Andy Warhol, and Henri Matisse, is up for sale at Sotheby's in New York and London later this year.", "The collection valued up to £9m ($17m) was originally housed in his six-storey New York townhouse.", "It features 45 contemporary, impressionist, and 19th Century paintings with highlights like Roy Lichtenstein’s Blue Nude estimated at £1.8m ($3.4m).", "Tobias Meyer of Sotheby's describes the collection as reflecting Versace's wide-ranging taste and eye, showcasing works by Pop movement champions alongside those from prominent artists of the 1980s.", "The sale comprises three auctions in New York in June, with smaller pieces auctioned in London on 22 and 23 June.", "A previous sale of furniture and artworks fetched £5.5m ($10.3m) in 2001."], "opencoder:1.5b": ["\"Versace art portfolio up for sale, including works by Roy Lichtenstein, Andy Warhol and Henri Matisse, housing the designer at a New York townhouse, selling auctions featuring contemporary, impressionist and 19th Century paintings, with an estimate of £1.8m ($3.4m).", "The collection was offered for sale at three auctions in New York in June and a sale of Versace's furniture and artworks sold in 2001fetched £5.5m ($10.3m).\"", "This summarizes the main points from the original text, without including any additional explanations or details."], "smollm:1.7b": ["The art collection of Gianni Versace could fetch up to $9 million when it is auctioned in New York and London later this year, according to a report from Sotheby's.", "The collection includes works by Roy Lichtenstein, Andy Warhol and Henri Matisse, among others.", "The 51-year-old designer was murdered outside his Florida home in 1997 by suspected serial killer Andrew Cunanan, who later killed himself.", "The auction will feature a range of contemporary paintings, including works by Roy Lichtenstein, Andy Warhol and Henri Matisse.", "One of the highlights of the sale is Roy Lichtenstein's Blue Nude which has been given an estimate of $1.8 million ($3.4m).", "Tobias Meyer, Sotheby's worldwide head of contemporary art, said: \"This collection reflects Gianni Versace's wide-ranging taste and impeccable eye, and many of the works were commissioned directly from the artists.\"", "The sale will feature a range of contemporary paintings, including works by Roy Lichtenstein, Andy Warhol and Henri Matisse.", "Much of the collection will be offered for sale at three auctions in New York in June, with smaller contemporary paintings going under the hammer in London on 22 and 23 June.", "A sale of Versace's furniture and artworks sold in 2001 fetched $5.5 million ($10.3m)."], "deepseek-r1:1.5b": ["The art portfolio of Gianni Versace, featuring works by Roy Lichtenstein, Andy Warhol, and Henri Matisse, is up for sale.", "The collection could fetch £9 million when auctioned in New York and London later this year.", "It includes 51-year-old design master Versace, who was killed in 1997 by a suspect serial killer known as Andrew Cunanan.", "Roy Lichtenstein's \"Blue Nude\" is highlighted at £1.8 million.", "The collection features contemporary and impressionist paintings from the 20th century, totaling 51 pieces."], "tinyllama:1.1b": ["The art collection belonging to murdered fashion designer Gianni Versace could fetch up to $9m at auction later this year.", "The six-storey New York townhouse was home to the Italian's six-figure collection, which has been house-crowned by suspected serial killer Andrew Cuñaan.", "Among the 45 contemporary and impressionist paintings, one of Roy Lichtenststein's 'Blue Nude' is expected to fetch over $1.8m ($3.4m).", "The collection reflects Versace's wide-ranging taste for the arts, and includes works commissioned by the fashion mogul directly from artists, such as Roy Lichtenststein, while masterpieces from pop movement champions are juxtaposed with 1980s masterpieces.", "A total of three auctions will take place in New York and London later this year."], "tinydolphin:1.1b": [" The auction for the Versace art collection is scheduled to take place later this year, with high-end works fetching up to £9 million ($17 million) when they go under the hammer.", "Among the pictures on offer are pieces by renowned artists such as Roy Lichtenstein and Andy Warhol, alongside works created in collaboration with pop-art legends Basquiat and Warhol.", "This collection was housed at the six-storey New York townhouse of Gianni Versace, who was murdered by a suspected serial killer.", "The estate will be sold through Sotheby's, and only five paintings have been pre-sold so far.", "The collection is expected to fetch up to £1 million ($1.8 million) per picture, with many of the works set to go under the hammer in June."], "phi:2.7b": [" Gianni Versace's collection of art could fetch up to £9m ($17m) at auctions in New York and London, with works by Roy Lichtenstein, Andy Warhol, Henri Matisse, and other contemporary, impressionist, and 19th-century paintings expected to be sold.", "The collection reflects Versace's diverse taste and impeccable eye, with many of the works commissioned directly from the artists.", "There will also be a sale of his furniture and artworks in 2001 for £5.5m ($10.3m)."], "orca-mini:3b": [" Versace's art portfolio, including works by Roy Lichtenstein, Andy Warhol, and Henri Matisse, is up for auction.", "The collection was housed at his New York townhouse and includes furniture and other artworks.", "Estimated prices range from £1.8m to £9m ($3.4m to $17m)."], "hermes3:3b": ["Giaci from Gianni Versace, up to $17M, including works by Lichtenstein, Warhol, Matisse, auctioned in NY and London."], "stablelm-zephyr:3b": ["Gianni Versace's art collection, including pieces by Roy Lichtenstein, Andy Warhol, and Henri Matisse, is set to be auctioned in New York and London later this year for up to £9m ($17m).", "The collection was housed at Versace's six-storey New York townhouse before his murder in 1997.", "Sotheby's will be selling 45 contemporary, impressionist, and 19th Century paintings, with highlights being Lichtenstein's Blue Nude estimated at £1.8m.", "The sale reflects Versace's wide-ranging taste and includes artists such as Jean-Michel Basquiat and Francesco Clemente."], "stablelm2:1.6b": ["Gianni Versace's art collection is set to sell for up to £9 million ($18 million) at auction in New York and London later this year, featuring works by Roy Lichtenstein, Andy Warhol, and Henri Matisse among others.", "The six-storey townhouse in New York was Versace's residence, while the artwork was housed there.", "The collection, which includes contemporary, impressionist, and 19th Century paintings, will be auctioned at Sotheby's with highlights including Roy Lichtenstein's Blue Nude, estimated at £1.8 million ($3.4 million)."], "granite3.1-dense:2b": ["Gianni Versace's extensive art collection, valued at up to £9m ($17m), will be auctioned by Sotheby's in New York and London this year.", "The collection, housed in the designer's six-story New York townhouse, includes works from renowned artists like Roy Lichtenstein, Andy Warhol, Henri Matisse, Jean-Michel Basquiat, and Francesco Clemente.", "Notable pieces are expected to reach significant prices, such as Roy Lichtenstein's Blue Nude estimated at £1.8m ($3.4m).", "The auction will consist of 45 contemporary, impressionist, and 19th Century paintings, reflecting Versace's diverse taste and commissioned directly from artists.", "A portion of the collection was sold in 2001 for £5.5m ($10.3m).", "The auctions will span three days in New York (June) and two days in London."], "chatgpt-4o-latest": ["The art collection of late fashion designer Gianni Versace is set to be auctioned in New York and London, potentially fetching up to £9m ($17m).", "The collection, previously housed in his New York townhouse, includes works by Roy Lichtenstein, Andy Warhol, and Henri Matisse.", "Sotheby's will auction 45 contemporary, impressionist, and 19th-century paintings, with Lichtenstein's *Blue Nude* estimated at £1.8m ($3.4m).", "Tobias Meyer of Sotheby’s highlighted Versace’s refined taste, featuring pieces from Pop artists like Lichtenstein and collaborations between Basquiat and Warhol.", "The auctions will take place in June, with smaller contemporary works sold in London on 22-23 June.", "A previous sale of Versace’s furniture and artworks in 2001 raised £5.5m ($10.3m)."]}