{"raw_text": "Slater to star in Broadway play\n \n Actor Christian Slater is stepping into the role of Tom in the Broadway revival of The Glass Menagerie.\n \n Slater, 35, is replacing actor Dallas Roberts in the Tennessee Williams drama, which opens next month. No reason was given for Roberts' departure. The role will be played by understudy Joey Collins until Slater joins the show. Slater won rave reviews for his recent performance in One Flew Over the Cuckoo's Nest in London's West End.\n \n He has also starred in a number of films, including Heathers, Robin Hood: Prince of Thieves and more recently Churchill: The Hollywood Years. Preview performances of The Glass Menagerie will begin at New York's Ethel Barrymore Theatre on Thursday. Philip Rinaldi, a spokesman for the show, said the play's 15 March opening date remains unchanged. The revival, directed by David Leveaux, will also star Jessica Lange as the domineering mother, Amanda Wingfield.\n", "llama3.2:1b": ["Christian Slater to star in Broadway revival of Glass Menagerie"], "llama3.2:3b": ["Christian Slater to star in Broadway revival of The Glass Menagerie, replacing Dallas Roberts, with preview performances starting at New York's Ethel Barrymore Theatre on Thursday, and opening March 15."], "gemma2:2b": ["Christian Slater replaces Dallas Roberts in the Broadway revival of \"The Glass Menagerie.\"", "Preview performances begin at the Ethel Barrymore Theatre on Thursday and the official opening date remains 15 March.", "Jessica Lange stars as Amanda Wingfield."], "qwen2.5:0.5b": ["Christian Slater is stepping into the role of Tom in the Broadway revival of \"The Glass Menagerie.\"", "He will replace actor Dallas Roberts in the production, which opens next month.", "Slater won rave reviews for his performance in \"One Flew Over the Cuckoo's Nest\" and has been starring in films including \"Heathers,\" \"Robin Hood: Prince of Thieves,\" and \"Churchill: The Hollywood Years.\"", "Preview performances of \"The Glass Menagerie\" will begin at New York's Ethel Barrymore Theatre on Thursday."], "qwen2.5:1.5b": ["Christian Slater to headline Broadway production of The Glass Menagerie; replaces Dallas Roberts; plays Tom in upcoming run starting April 14 at New York's Ethel Barrymore Theatre under supervision of director David Leveaux and featuring Jessica Lange as Amanda Wingfield."], "qwen2.5:3b": ["Christian Slater will star in the Broadway revival of The Glass Menagerie replacing Dallas Roberts.", "Slater, known for roles in One Flew Over the Cuckoo's Nest and films like Heathers, Robin Hood: Prince of Thieves, and Churchill: The Hollywood Years, will join previews at New York’s Ethel Barrymore Theatre on Thursday.", "Jessica Lange will play Amanda Wingfield in the production directed by David Leveaux, which opens March 15th."], "opencoder:1.5b": ["Christian Slater is stepping into the role of Tom in The Glass Menagerie (Broadway revival).", "Slater, a 35-year-old male actor, has replaced the iconic actor Dallas Roberts in Tennessee Williams drama.", "He won rave reviews for his performances, including One Flew Over the Cuckoo's Nest in London's West End.", "He also starred in numerous films, including Heathers and various novels, with special feature credits such as Churchill: The Hollywood Years.", "The revival will take place on Thursday at New York's Ethel Barrymore Theatre and features a preview of The Glass Menagerie from Philip Rinaldi, who has given press permission to change the opening date."], "smollm:1.7b": ["Slater to star in Broadway play\nChristian Slater is stepping into the role of Tom in the Broadway revival of The Glass Menagerie.", "No reason was given for Roberts' departure.", "The role will be played by understudy Joey Collins until Slater joins the show.", "Slater won rave reviews for his recent performance in One Flew Over the Cuckoo's Nest in London's West End.", "Slater has also starred in a number of films, including Heathers, Robin Hood: Prince of Thieves and more recently Churchill: The Hollywood Years.", "Preview performances of The Glass Menagerie will begin at New York's Ethel Barrymore Theatre on Thursday.", "Philip Rinaldi, a spokesman for the show, said the play's 15 March opening date remains unchanged.", "The revival, directed by David Leveaux, will also star Jessica Lange as the domineering mother, Amanda Wingfield."], "deepseek-r1:1.5b": ["Christian Slater is stepping into the role of Tom in the Broadway revival of *The Glass Menagerie*.", "He replaces actor Dallas Roberts and will play until he joins the show.", "Slater has a recent performance in *One Flew Over the Cuckoo's Nest* in London and stars in several films, including *Heathers*, *Robin Hood: Prince of Thieves*, and *Churchill: The Hollywood Years*.", "The play opens on March 15 at New York's Ethel Barrymore Theatre with Jessica Lange as the domineering mother."], "tinyllama:1.1b": ["Actress Christian Slater is set to play the role of Tom in the Broadway revival of \"The Glas Menagerie,\" replacing actor Dallas Roberts who previously appeared in it.", "The role will be played by underscreen John Collins until Slater joins the production.", "Slater has received critical acclaim for his recent performance in \"One Flew Over the Cucko's Neck\" at the West End, while his previous film and television work includes appearances in \"Heathers,\" \"Robin Hood: Prince of Thieves,\" and more recently, \"Churchill: The Hollywood Years.\"", "The play is set to begin preview performances at New York's Ethel Barrymore Theatre on March 13th.", "Philip Riinaldi, the play's director, stated that the opening date remains unchanged."], "tinydolphin:1.1b": [" Slater is set to play the role of Tom in the Broadway revival of \"The Glass Menagerie\".", "In this new rendition of Tennessee Williams' play, Christian Slater will be replacing Dallas Roberts and taking on the lead role.", "This comes as a surprise move, as Roberts had been playing the part since it opened in London's West End in 2017.", "Before his tenure at the Ethel Barryore Theatre, Slater starred in several acclaimed films such as \"Heathers\", \"Robin Hood: Prince of Thieves\", and more recently, \"Churchill: The Hollywood Years\".", "His performance as Tom will be showcased in New York's Ethel Barryore Theatre on Thursday, with performances beginning at the theatre on 15 March."], "phi:2.7b": [" Actor Christian Slater will play Tom in the Broadway revival of The Glass Menagerie, succeeding Dallas Roberts in the role.", "Preview performances begin at New York' Ethel Barrymore Theatre on Thursday, and the show's opening date remains unchanged.", "The play also features Jessica Lange as the domineering mother."], "orca-mini:3b": [" Christian Slater will star in the Broadway play The Glass Menagerie as Tom.", "He replaces Dallas Roberts and will join the show later.", "No reason was given for Roberts' departure.", "Slater has won rave reviews for his performance in One Flew Over the Cuckoo's Nest in London's West End.", "Preview performances of the show begin at New York's Ethel Barrymore Theatre on March 15th.", "The revival will be directed by David Leveaux and stars Jessica Lange as Amanda Wingfield."], "hermes3:3b": ["Christian Slater to replace Dallas Roberts as Tom in Broadway's The Glass Menagerie, directed by David Leveux, opening on 15th March."], "stablelm-zephyr:3b": ["Christian Slater is set to star in the Broadway revival of The Glass Menagerie, replacing Dallas Roberts in the lead role of Tom.", "Slater's debut performance will be until an understudy joins the show.", "His recent performance in One Flew Over the Cuckoo's Nest earned him rave reviews.", "Preview performances for The Glass Menagerie will begin at New York's Ethel Barrymore Theatre on Thursday, with a planned opening date of 15 March.", "Directed by David Leveaux, the revival also stars Jessica Lange as the domineering mother, Amanda Wingfield."], "stablelm2:1.6b": ["Actor Christian Slater will replace Dallas Roberts in the Broadway revival of The Glass Menagerie, set to open next month.", "Slater's casting was announced following Roberts' departure, with Joey Collins serving as understudy until Slater joins the show.", "This is Slater's first major Broadway role; he received critical acclaim for his recent performance in One Flew Over the Cuckoo's Nest.", "Preview performances will begin at New York's Ethel Barrymore Theatre on Thursday, and the play remains set to open on its original March date.", "The revival, directed by David Leveaux, also features Jessica Lange as the domineering mother, Amanda Wingfield."], "granite3.1-dense:2b": ["Christian Slater, 35, has been cast to play Tom in the Broadway revival of The Glass Menagerie, replacing Dallas Roberts due to an undisclosed reason.", "Slater, known for roles in films like Heathers and Churchill: The Hollywood Years, received acclaim for his recent performance in One Flew Over the Cuckoo's Nest at London's West End.", "Joey Collins will initially serve as understudy until Slater assumes the role.", "The play, directed by David Leveaux and set to open on March 15 at New York's Ethel Barrymore Theatre, features Jessica Lange as Amanda Wingfield, Tom's domineering mother."], "chatgpt-4o-latest": ["Christian Slater will star as Tom in the Broadway revival of *The Glass Menagerie*, replacing Dallas Roberts, whose departure was unexplained.", "Until Slater joins, the role will be played by understudy Joey Collins.", "Slater recently received praise for his performance in *One Flew Over the Cuckoo's Nest* in London's West End and has starred in films like *Heathers* and *Robin Hood: Prince of Thieves*.", "Preview performances begin at the Ethel Barrymore Theatre, with the official opening on March 15.", "The revival, directed by David Leveaux, also features Jessica Lange as Amanda Wingfield."]}