{"raw_text": "Obituary: Dame Alicia Markova\n \n Dame Alicia Markova, who has died in Bath aged 94, was the UK's first prima ballerina of the modern age, and, in her heyday, the greatest in the western world.\n \n She was born Lilian Alicia Marks in London in 1910. Her parents were comfortably off - her father, a mining engineer, drove a Rolls Royce. When she was eight, her mother took a decision which changed her life. Fearing that she had flat feet and weak legs, she arranged for her to have ballet lessons. Very quickly it became apparent that she was something special. She was spotted by the Russian artistic impresario, Sergei Diaghilev, who wanted her to dance for his company, Ballets Russes. She became ill with diphtheria but kept in touch, and, eventually, with a governess in tow, joined Diaghilev in Monte Carlo when she was 14.\n \n From here, she toured Europe, playing in all the top venues. It was Diaghilev who changed her name without even consulting her. Her life was one of great excitement. People such as Matisse and Stravinsky became like uncles to her, the latter put in charge of her musical education. Soon after Diaghilev's death in 1929, Alicia Markova returned to England and became Britain's first international ballerina. She helped launch the Ballet Club at the Mercury Theatre (later the Ballet Rambert), the Vic Wells Ballet, and then, with Anton Dolin, the Markova-Dolin Ballet of 1935-37. She also began working with young choreographers such as Anthony Tudor and Frederick Ashton who became huge influences on the direction of ballet in the west.\n \n Her version of Giselle, all lightness and grace, is still considered to be among the finest ever. She was also outstanding in The Dying Swan. She was one of the first British ballerinas to take a major part in Les Sylphides. She, above all, helped popularise ballet both in Britain and in America.\n \n Alicia Markova spent World War II in the United States where, in a re-formed Ballets Russes, she played to huge audiences. She even appeared in Hollywood movies. In 1950, back in England, she and Anton Dolin jointly established the Festival Ballet. She retired in 1963, an \"instant decision\" she said, \"largely because of a leg injury\". Created a Dame, she made a new career for herself as a teacher. She also travelled the world directing ballet companies and putting on shows. She became director of ballet for the Metropolitan Opera Ballet in New York, and for some years was full-time Professor of Ballet and Performing Arts in the University of Cincinnati. A critic once said of Dame Alicia Markova's dancing: \"She gave the illusion of moving as if she had no weight to get off the ground.\"\n", "llama3.2:1b": ["Dame Alicia Markova died at 94 in Bath.", "Born Lilian Alicia Marks in London in 1910, she was a prima ballerina and the UK's first modern age dancer.", "She toured Europe with Diaghilev before returning to England, where she helped establish the Ballet Club and other companies.", "Her version of Giselle is still considered finest, and The Dying Swan is notable.", "Markova spent World War II in the US, working for Ballets Russes, appeared in Hollywood films, and was a teacher and director of ballet companies before retiring in 1963."], "llama3.2:3b": ["Dame Alicia Markova died at 94, born Lilian Marks in London in 1910.", "She was spotted by Sergei Diaghilev and joined Ballets Russes at 14.", "After Diaghilev's death, she became Britain's first international ballerina, launching several ballet companies and helping popularize ballet worldwide."], "gemma2:2b": ["Dame Alicia Markova was a pioneering ballerina who, during her career, became the greatest in the western world.", "She began ballet lessons at age eight and joined Diaghilev's Ballets Russes, touring Europe and later working with influential choreographers.", "After World War II, she returned to England and established the Festival Ballet, retiring in 1963.", "A Dame, she became a renowned teacher and director of ballet companies worldwide.", "She was lauded for her grace and lightness of movement."], "qwen2.5:0.5b": ["Dame Alicia Markova, born Lilian Marks in 1910, was a renowned prima ballerina of the modern age.", "She began her career at age 8 when her mother arranged for her to attend ballet lessons.", "Her life was filled with excitement and success, including her role as Matisse and Stravinsky's uncles, and her collaboration with Anton Dolin on the Markova-Dolin Ballet.", "A former British ballerina known for her version of Giselle, she also played in The Dying Swan.", "She helped popularize ballet worldwide during World War II in the United States.", "Although in her later years, Dame Alicia Markova retired due to leg injuries, she is remembered as a pioneering figure who made significant contributions to ballet and dance education both locally and internationally."], "qwen2.5:1.5b": ["Alicia Markova, born Lilian Alicia Marks in London, was Britain's first prima ballerina of modern times and one of the greatest ballet dancers worldwide.", "Born to a wealthy family, she was spotted by Sergei Diaghilev for Ballets Russes at age 14 after Diphtheria left her with flat feet and weak legs.", "Markova toured Europe, danced in top venues, and became Britain's first international ballerina before establishing the Markova-Dolin Ballet of 1935-37.", "She helped popularize ballet both in Britain and America, appearing in Hollywood movies during World War II.", "Markova also retired from dancing, teaching, and directing ballet companies around the world, becoming a professor at the University of Cincinnati."], "qwen2.5:3b": ["Dame Alicia Markova, born Lilian Alicia Marks in 1910, was a UK ballet dancer who became the first prima ballerina of the modern age and the greatest in the Western world during her heyday.", "She began her career at eight with ballet lessons after her mother feared she had flat feet and weak legs.", "At fourteen, she joined Sergei Diaghilev's Ballets Russes company where she adopted her new name.", "Her accomplishments include touring Europe and founding several ballet companies such as Ballet Club and the Markova-Dolin Ballet.", "Known for her performances in Giselle and The Dying Swan, she popularized ballet both domestically and internationally.", "During World War II, she performed in the U.S., appearing in Hollywood films.", "She retired from dancing at 40 but continued her career as a teacher and director of ballet companies worldwide."], "opencoder:1.5b": ["Dame Alicia Markova, who has died aged 94, was the UK's first ballerina of the modern age and lived up to her birthright.", "Her parents had a charming marriage where she left a lasting impression on her father while avoiding any feelings of jealousy or resentment.", "Her mother, however, took an unexpected decision which changed her life drastically.", "She felt that she was no longer just a ballerine but also the embodiment of the human spirit and the spirit of her birthright.", "Facing the constant threat of diphtheria, she kept her dance lessons to keep them pure and healthy.", "Diaghilev, who wanted her to dance for his company, Ballets Russes, was introduced by her father, a renowned mining engineer in London.", "Diaghilev helped Markova develop her musical acumen and dexterity, becoming an integral part of her musical education.", "After Diaghilev's death, Markova returned to England to become the first global ballerina.", "She helped launch the Ballet Club at the Mercury Theatre and became a major influencer on the stage.", "Her mother, Anton Dolin, played a critical role in shaping the direction of ballet and provided inspiration for Markova's musical vision.", "It later became known as The Dancing Giselle, which she also called as Giselle.", "Markova spent World War II in America where he was an influential figure in the world of ballet.", "He appeared in Hollywood movies and directed a number of films, including The Rambert Ballet, which Markova played for.", "His retirement, in 1963, marked the end of her career as a teacher.", "She also travelled the world directing ballet companies, and continued to do so for years.", "She became director of ballet at Metropolitan Opera Ballet in New York and continued to play with some years.", "Her dancing style, however, was not without controversy.", "A critic once said of Markova's dancing: \"She gave the illusion of moving as if she had no weight to get off the ground.\"", "Despite her injuries during World War II, Markova continued to make a significant impact on the stage, playing for numerous audiences."], "smollm:1.7b": ["Dame Alicia Markova, who has died in Bath aged 94, was the UK's first prima ballerina of the modern age, and, in her heyday, the greatest in the western world.", "She was born Lilian Alicia Marks in London in 1910.", "Her parents were comfortably off - her father, a mining engineer, drove a Rolls Royce.", "When she was eight, her mother took a decision which changed her life.", "Fearing that she had flat feet and weak legs, she arranged for her to have ballet lessons.", "Very quickly it became apparent that she was something special.", "She was spotted by the Russian artistic impresario, Sergei Diaghilev, who wanted her to dance for his company, Ballets Russes.", "She returned to England and became Britain's first international ballerina when she was 14.", "She helped launch the Ballet Club at the Mercury Theatre (later the Ballet Rambert), the Vic Wells Ballet, and then, with Anton Dolin, the Markova-Dolin Ballet of 1935-37.", "She also began working with young choreographers such as Anthony Tudor and Frederick Ashton who became huge influences on the direction of ballet in the west.", "Her version of Giselle, all lightness and grace, is still considered to be among the finest ever.", "She was also outstanding in The Dying Swan.", "She was one of the first British ballerinas to take a major part in Les Sylphides.", "She, above all, helped popularise ballet both in Britain and in America.", "Alicia Markova spent World War II in the United States where, in a re-formed Ballets Russes, she played to huge audiences.", "She even appeared in Hollywood movies.", "In 1950, back in England, she and Anton Dolin jointly established the Festival Ballet.", "She retired in 1963, an \"instant decision\" she said, \"largely because of a leg injury\".", "Created a Dame, she made a new career for herself as a teacher.", "She also travelled the world directing ballet companies and putting on shows.", "A critic once said of Dame Alicia Markova's dancing: \"She gave the illusion of moving as if she had no weight to get off the ground.\""], "deepseek-r1:1.5b": ["Ladies Alicia Markova, born in 1910, became the UK's first modern prima ballerina and one of the greatest Western ballerinas.", "She learned ballet at a young age after overcoming challenges, met Russian artist Sergei Diaghilev who helped change her name.", "From there, she traveled extensively and opened major Ballet Clubs.", "Her work was recognized by top artists like Matisse and Stravinsky.", "After his death in 1929, she returned to England and co-founded the Markova-Dolin ballet club.", "She also directed other clubs, becoming a pioneer in British ballet.", "She helped launch clubs like the Mercury Theatre's Ballet Rambert.", "Her work \"Giselle\" is still masterful, recognized for its grace and lightness.", "During WWII, she played in the U.S., but returned to England afterward.", "In 1950, she co-founded the Festival Ballet.", "She retired due to a leg injury and continues her career as a teacher, director of international ballet, professor, and globally traveled for shows."], "tinyllama:1.1b": ["Obituary: Damé Alicia Markova\n\nDame Alicia Markova, who has died in Bath aged 94, was considered one of the world's greatest ballerinas in her heyday as a prima ballerina of the modern age.", "Her achievements include performing in some of the most prestigious venues of Europe, touring with Sergei Diahilev and helping launch the Ballet Club at the Mercury Theatre, later known as the Markova-Doin Ballet, as well as appearing in works by Anton Dolin, Frederick Ashton, Anthony Tuor and others.", "In her reimagined version of Giesselle, she is considered among the finest ballerinas to ever perform.", "Alicia Markova retired from performing in 1963 and went on to become a director and teacher.", "She became director of ballet for the Metropolitan Opera Ballet in New York and was professor of balllet and performing arts at the University of Cinque-cinni, where she also traveled the world directing ballets and putting on shows.", "Her contributions to ballerina education and performance were notable, earning her a reputation as one of the world's greatest."], "tinydolphin:1.1b": [" Dame Alicia Markova, born Lilian Alicia Marks in London in 1910, was one of the first British ballerinas.", "Her career spanned more than two decades and she was known as the greatest in the western world, performing with some of the most prominent ballet companies in Europe and the United States.", "Markova's success was largely due to her collaboration with Anton Dolin, who was one of the first to take a leading role in contemporary ballet.", "Together, they created works that have become iconic parts of ballet history.", "Markova was also known for her dedication to education and helping new choreographers, like Anthony Tudor, Frederick Ashton, and Anton Dolin, gain a strong influence on the direction of ballet.", "She is often remembered as the muse who inspired Giselle, Les Sylphides, and The Dying Swan.", "Despite facing challenges throughout her career, Markova remained devoted to ballet and continued to perform for decades.", "Markova was honored with a lifetime achievement award in 1963, becoming the first British ballerina to achieve that distinction.", "She retired in 1963 at the age of 48, but she never lost her passion for dance.", "Markova later went on to establish the Festival Ballet in the United States and spent time there directing American ballet companies.", "Her legacy continues to live on through her performances and the many people she inspired throughout her life."], "phi:2.7b": [" Dame Alicia Markova (1910–1995) was a British prima ballerina, known for being the UK's first modern-age prima ballerina and the greatest in western ballet.", "She began her career at a young age after a parent recognized her talent and arranged for ballet lessons when she was eight years old.", "She became associated with Russian artistic impresario Sergei Diaghilev and toured Europe, playing in top venues.", "After Diaghilev's death, Alicia Markova returned to England and became the first international ballerina of Britain.", "She helped popularize ballet and worked with young choreographers such as Anthony Tudor and Frederick Ashton.", "She also appeared in Hollywood movies and established the Festival Ballet.", "In"], "orca-mini:3b": [" Dame Alicia Markova was the UK's first prima ballerina of modern age, who was considered the greatest in the western world.", "She was born into a comfortable family and her parents wanted her to have ballet lessons.", "She became ill with diphtheria but still managed to go on tour across Europe.", "She worked with many great artists such as Matisse and Stravinsky, becoming like an uncle to her.", "She returned to England and helped launch the Mercury Theatre's Ballet Rambert, the Vic Wells Ballet, and then formed the Markova-Dolin Ballet of 1935-37 with Anton Dolin.", "She played in many movies, including Les Sylphides.", "In 1950, she and Anton Dolin established the Festival Ballet, and she retired in 1963."], "hermes3:3b": ["Dame Alicia Markova, UK first modern prima ballerina, greatest in western world, died 94.", "Born Lilian Marks 1910, mining engineer parents.", "Began ballet at age 8.", "Joined Ballets Russes at 14, toured Europe.", "Changed name to Markova by Diaghilev.", "Returned England after Diaghilev's death, established Ballet Club, Vic Wells Ballet, Markova-Dolin Ballet, influencing choreographers like Ashton & Tudor.", "Considered finest Giselle & Dying Swan performances.", "Helped popularize ballet in Britain and America during WWII.", "Retired 1963 due to leg injury but continued teaching and directing worldwide."], "stablelm-zephyr:3b": ["Dame Alicia Markova, the UK's first prima ballerina of the modern age, passed away at 94.", "Born as Lilian Alicia Marks in London in 1910, her mother initially insisted on ballet lessons due to fears about weak legs.", "Soon after being discovered by Sergei Diaghilev, she became ill with diphtheria but continued performing under his guidance.", "Markova toured Europe and changed her name without consent from Diaghilev.", "She launched various ballet companies in Britain and helped popularize ballet in both Britain and America.", "During World War II, she performed in the United States as part of a reformed Ballets Russes.", "After retiring in 1963 due to a leg injury, Markova became a respected teacher and director of ballet companies worldwide."], "stablelm2:1.6b": ["Dame Alicia Markova, born Lilian Alicia Marks, was UK's first prima ballerina of the modern age and the greatest in Western Europe.", "She began ballet lessons due to her mother's concern about flat feet and weak legs; marked success soon led her to dance for Ballets Russes with Sergei Diaghilev.", "Tours Europe, played top venues, later joined Ballet Rambert, Vic Wells Ballet, & Markova-Dolin Ballet after Diaghilev's death.", "Influenced by choreographers Anthony Tudor & Frederick Ashton.", "Known for Giselle and The Dying Swan performances.", "Helped popularize ballet in Britain and America.", "World War II saw her return to US where she joined Ballets Russes, Hollywood appearances, & created new roles.", "Retired due to leg injury, becoming a teacher and director of ballet companies worldwide.", "Became director of ballet for Metropolitan Opera Ballet in New York & University of Cincinnati's full-time Professor of Ballet & Performing Arts."], "granite3.1-dense:2b": ["Dame Alicia Markova, born Lilian Alicia Marks in 1910, was a pioneering British prima ballerina who revolutionized ballet in the western world.", "Her parents' support led her to professional ballet training at age eight.", "Diagnosed with diphtheria at 14, she joined Sergei Diaghilev's Ballets Russes and toured Europe, meeting influential figures like Henri Matisse and Igor Stravinsky.", "After Diaghilev's death in 1929, Markova returned to England and founded several notable British ballet companies: the Mercury Theatre Ballet (now Ballet Rambert), Vic Wells Ballet, and the Markova-Dolin Ballet.", "She collaborated with young choreographers Anthony Tudor and Frederick Ashton, significantly impacting modern ballet techniques.", "Her performances in Giselle and The Dying Swan are celebrated for their elegance and grace.", "Markova was one of the first British ballerinas to take major roles in Les Sylphides and popularized ballet both in Britain and America during World War II, including appearances in Hollywood films.", "Post-WWII, she established the Festival Ballet in 1950 before retiring due to a leg injury.", "She later became a renowned teacher and director, leading ballet companies worldwide, including roles at the Metropolitan Opera Ballet in New York and as full-time Professor of Ballet and Performing Arts at the University of Cincinnati.", "Critics praised her dancing for its effortlessness, making her one of the greatest ballet dancers of all time."], "chatgpt-4o-latest": ["Dame Alicia Markova, born Lilian Alicia Marks in 1910, was the UK's first prima ballerina of the modern age and one of the greatest in the western world.", "Encouraged to take ballet lessons as a child, she was discovered by Sergei Diaghilev and joined his Ballets Russes at 14.", "After Diaghilev's death, she became Britain's first international ballerina, helping to establish key ballet institutions and working with influential choreographers.", "Her performances in Giselle and The Dying Swan were legendary, and she played a major role in popularizing ballet in Britain and America.", "During World War II, she performed in the U.S. and even appeared in Hollywood films.", "In 1950, she co-founded the Festival Ballet with Anton Dolin and retired in 1963 due to a leg injury.", "She later became a teacher, directed ballet companies worldwide, and held academic positions.", "Renowned for her ethereal dancing, she was made a Dame and left a lasting impact on the ballet world."]}