{"raw_text": "Fears raised over ballet future\n \n Fewer children in the UK are following in the dainty footsteps of dancers like Darcey Bussell, and carving out potential careers as ballet dancers.\n \n New research from the Royal Academy of Dance (RAD) has found fewer children over the age of 10 are attending ballet classes and taking exams in the discipline. The organisation blames the growing popularity of computer games and other changes in lifestyle. And there are fears that if the trend is not reversed, there could be fewer British ballet stars in the future. The RAD found that the number of youngsters taking their ballet exams drops by almost 70% after the age of 10 or 11. Dance teacher Eve Trew, who has taught ballet for over 48 years, told BBC News she had seen a \"vast\" change over the years. She blamed modern lifestyles for the fall in ballet attendance. \"I think the children of many years ago did not have as many hobbies,\" she said. \"The trouble now is that they are wide open to computers, Gameboys and everything else children have got. \"As a result, there is less time being spent on ballet lessons.\"\n \n Hazel Gilbert, 23, an information manager from Newcastle, gave up ballet at the age of 10 and is typical of the problem. \"It's not a very cool thing to do when you go to 'big' school and I think you have to be very focused on ballet to want to carry on doing it,\" she said. \"I used to love it, but after a certain age it becomes much more disciplined and I didn't want that. \"I started getting into other things, like swimming and kickboxing, and ballet just wasn't something I wanted to do any more.\" Ms Trew, who runs a dance school in Gateshead, admitted it would be \"very difficult\" to reverse the trend and said many young ballet dancers were no longer willing to make the sacrifices to succeed. \"You have to be very dedicated and you have to be very disciplined. \"It is a career that you have got to really want to do because it is such hard work. \"Children these days have not got the time to spend perfecting it... that is very sad.\"\n \n Currently, only two out of 16 principal dancers at the Royal Ballet - Darcey Bussell and Jonathan Cope - are British, compared to 16 of the 21 principals in 1985. But a spokesman for the English National Ballet told BBC News that although only two out of their 12 principal dancers were British, around a quarter of the company's dancers were from the UK. He said competition at open auditions in London was \"fierce\" between talented dancers from all over the world. The RAD have launched a new competition to try and reverse the decline in British ballet. Dame Antoinette Sibley, president of the RAD, launched the Fonteyn Nureyev Young Dancers competition earlier this week.\n \n Aimed at children aged 10 to 13, it is hoped the contest will help keep British ballet evolving. A spokeswoman for the RAD said: \"It is our responsibility to re-ignite the passion and nurture young dancers for the long-term future of ballet. \"We need to provide them with a framework and a goal to work towards, with constant support and coaching in an environment where they can work with their peers and possibly leading artists and choreographers. \"Perhaps more importantly provide them with the opportunity to experience 'performance' themselves. \"What better way to reignite a passion for ballet than to let them experience the thrill of performance?\"\n", "llama3.2:1b": ["Fewer children are taking ballet classes, with only two out of 16 principal dancers at the Royal Ballet being British, compared to 16 in 1985.", "A new competition, the Fonteyn Nureyev Young Dancers contest, aims to reverse this trend and nurture young British ballet talent.", "Research has found a decline in children's interest in ballet after age 10 or 11."], "llama3.2:3b": ["UK children are attending fewer ballet classes and exams, especially after age 10 or 11, due to growing popularity of computer games and other lifestyle changes.", "Experts blame modern lifestyles for the decline in attendance, saying it requires dedication and discipline that many young people no longer have time for.", "A new competition launched by the Royal Academy of Dance aims to reverse the trend and nurture young dancers to keep British ballet evolving."], "gemma2:2b": ["Fewer children in the UK are pursuing ballet as a career, with the number of youngsters taking exams dropping by almost 70% after age 10.", "This decline is attributed to popular computer games and changes in lifestyles that compete for children's time.", "Dance teachers believe this trend will negatively affect future British ballet stars.", "To combat this decline, the Royal Academy of Dance has launched a new competition aimed at young dancers aged 10-13.", "The competition aims to rekindle interest in ballet and provide support for aspiring dancers."], "qwen2.5:0.5b": ["Fears are growing among dancers worldwide, particularly those in the UK, that fewer children are attending ballet classes and taking exams as they grow up, citing computer games and lifestyle changes.", "Ballet star Hazel Gilbert is quoted saying her interest in ballet declined after a certain age due to computers and competition from talented dancers from around the world.", "The Royal Academy of Dance blamed the growing popularity of computer games for declining attendance at ballet classes."], "qwen2.5:1.5b": ["Fewer children in the UK are pursuing ballet as a career, blaming modern lifestyles for reducing time spent on dance classes after age 10.", "The Royal Academy of Dance reports that attendance has dropped by almost 70% among youngsters taking exams at that age or older.", "Critics say dedication and discipline have declined with today's kids who lack time to perfect their skills.", "Only two out of every 16 leading ballet dancers in the UK are British, compared to 16 in 1985.", "A new competition is being launched to encourage more young British ballet talents."], "qwen2.5:3b": ["Fears exist that the UK's future in ballet may be at risk as fewer children, especially after age 10, are taking ballet classes and exams.", "Research by the Royal Academy of Dance (RAD) indicates a significant decline, with nearly half of young dancers quitting after age 11 due to modern lifestyles favoring computer games over dance.", "Teachers like Eve Trew blame this on children having fewer hobbies and becoming more inclined towards digital entertainment.", "Hazel Gilbert quit ballet at 10 because it became too focused and disciplined for her liking.", "Currently, only two out of sixteen principal Royal Ballet dancers are British.", "To counteract this trend, the RAD launched a new competition targeting young children aged 10 to 13 to rekindle interest in ballet."], "opencoder:1.5b": ["The key ideas in this text are focusing on the growth and decline in British ballet attendance, which is related to the popularity of computer games and other changes in lifestyle.", "It also explores the concerns about how the trend will reverse in the future.", "The focus on children aged 10-13, and their potential for continuous exposure to the theatre, aims to create an environment that encourages their growth and success in ballet."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details from the original text.", "The main points are:\n\n1.", "Fewer children in the UK are following in the dainty footsteps of dancers like Darcey Bussell, and carving out potential careers as ballet dancers.", "2.", "New research from the Royal Academy of Dance (RAD) has found fewer children over the age of 10 or 11 are attending ballet classes and taking exams in the discipline.", "3.", "The RAD blames modern lifestyles for the fall in ballet attendance, citing the widespread availability of computer games and other activities as contributing factors.", "4.", "There is a fear that if the trend is not reversed, there could be fewer British ballet stars in the future.", "5.", "Eve Trew, an information manager from Newcastle, gave up ballet at the age of 10 and is typical of the problem.", "She said it was very difficult to get back into ballet after dropping out.", "6.", "Hazel Gilbert, 23, an information manager from Newcastle, also gave up ballet at the age of 10 and is typical of the problem.", "She said she used to love it but after a certain age it became too much work.", "7.", "The RAD has launched a new competition to try and reverse the decline in British ballet.", "A spokeswoman for the RAD said: \"It is our responsibility to re-ignite the passion and nurture young dancers for the long-term future of ballet.\"", "8.", "The competition aims to provide children with a framework and goal to work towards, with constant support and coaching in an environment where they can experience 'performance' themselves.", "9.", "The summary does not include any additional information or context about the specific research findings or the impact of modern lifestyles on ballet attendance."], "deepseek-r1:1.5b": ["Fewer children in the UK are following in the elegant footsteps of ballet dancers like Darcey Bussell, as fewer attend classes and exams beyond age 10.", "Recent RAD research shows a 70% drop in such attendance, with Hilal Gilbert highlighting why young dancers might choose to stay in dancing despite changing lifestyles.", "Eve Trew criticized how modern trends have freed children from pursuing dance, while Hilal noted that British ballet stars are falling short of the potential.", "The English National Ballet introduced a Fonteyn Nureyev competition aimed at encouraging younger talent.", "Aimed at inspiring young dancers aged 10-13, it seeks to reconnect passion with the art form."], "tinyllama:1.1b": ["A survey by the Royal Academy of Dance (RAD) found that fewer children over the age of 10 are attending balllet classes and taking exams in the discipline, suggesting that there could be a decline in British ballet stars in the future.", "The trend is believed to be rooted in changes in life style brought about by modernization, which has resulted in fewer young people dedicating their time and resources to ballet lessons.", "This decline has been attributed to competition between dance teachers, as well as a lack of commitment from some children.", "The RAW has launched a new competition to try and reverse the trend, promising support, guidance, and performance opportunities to inspire young balllet dancers.", "The survey also found that children's attendance at balllet lessons is down by almost 70%, despite the age at which they started ballet being the same as it was in the past."], "tinydolphin:1.1b": [" The Royal Ballet, home to Britain's most prominent ballet dancers, has expressed concerns over a trend of fewer children attending ballet classes and taking exams in the discipline.", "The RAD, the body that oversees British ballet, has found that fewer British children are following in the footsteps of dancers like Darcey Bussell, who made a lasting impact on the country's dance scene.", "The trend is blamed on an increase in computer games and other lifestyle changes among young people, as well as the potential loss of British talent if that trend isn't reversed.", "The Royal Ballet has introduced a new competition to try and reverse this decline in British ballet.", "Launching this week, the Fonteyn Nureyev Young Dancers competition will be open to children aged 10-13, aimed at nurturing young dancers for the long-term future of ballet.", "As a result of this initiative, the RAD hopes to re-ignite the passion and nurture British talent to continue evolving the art form in Britain."], "phi:2.7b": [" New research from the Royal Academy of Dance found that fewer children in the UK are taking ballet exams after age 10, which could lead to fewer British ballet stars in the future.", "The decline is due to growing popularity of computer games and other changes in lifestyle.", "The RAD has launched a competition called Fonteyn Nureyev Young Dancers to try to reverse the trend and nurture young dancers for the long-term future of ballet."], "orca-mini:3b": [" Fewer children in the UK are following in the footsteps of dancers like Darcey Bussell and carving out potential careers as ballet dancers.", "New research from the Royal Academy of Dance (RAD) found fewer children over the age of 10 attending ballet classes and taking exams in the discipline.", "The RAD found that the number of youngsters taking their ballet exams drops by almost 70% after the age of 10 or 11.", "Dance teacher Eve Trew blames modern lifestyles for the fall in ballet attendance, and there are fears that if the trend is not reversed, there could be fewer British ballet stars in the future.", "However, the English National Ballet spokesman said that although only two out of their 12 principal dancers were British, around a quarter of the company's dancers were from the UK, and the RAD launched a new competition to try and reverse the decline in British ballet."], "hermes3:3b": ["Ballet declining in UK; fewer children taking classes after age 10, fearing modern lifestyles take time from discipline"], "stablelm-zephyr:3b": ["New research from the Royal Academy of Dance (RAD) shows that fewer children in the UK are taking up ballet, with the number of youngsters taking their exams dropping by almost 70% after the age of 10 or 11.", "The RAD attributes this decline to growing popularity of computer games and other modern interests.", "If the trend continues, there could be a shortage of British ballet stars in the future.", "To address this issue, the RAD has launched a new competition for young dancers aged 10-13 called the Fonteyn Nureyev Young Dancers competition, aiming to nurture and support future British ballet talent."], "stablelm2:1.6b": ["Fewer UK children are taking ballet classes, with new research from the Royal Academy of Dance (RAD) revealing that only two out of principal dancers at the Royal Ballet are British.", "The RAD blames changes in lifestyle and the growing popularity of computer games for a decline in attendance among young students.", "There is concern about fewer future British ballet stars due to this trend not being reversed."], "granite3.1-dense:2b": ["The Royal Academy of Dance (RAD) reports a decline in British children's interest in ballet, particularly after age 10 or 11.", "Factors contributing to this trend include increased popularity of video games and altered lifestyles.", "Dance teacher Eve Trew attributes the decrease to modern distractions like computers and other hobbies, while Hazel Gilbert, a former ballet participant, found that societal pressures and disciplined nature of ballet made it less appealing as she grew older.", "This decline has implications for British ballet's future talent pool; currently, only two out of 16 principal dancers at the Royal Ballet are British (compared to 16 in 1985).", "The English National Ballet has a quarter of its dancers from the UK.", "To reverse this trend, the RAD launched the Fonteyn Nureyev Young Dancers competition for children aged 10-13.", "This initiative aims to inspire and nurture young ballet talent by providing support, coaching, and opportunities for performance.", "The goal is to reignite passion for ballet in British children and ensure the discipline's continued growth and success."], "chatgpt-4o-latest": ["Fewer children in the UK are pursuing ballet, with a significant drop in participation after age 10, according to research from the Royal Academy of Dance (RAD).", "The decline is attributed to modern lifestyles and the growing popularity of computer games.", "Dance teacher Eve Trew noted that children today have more distractions and are less willing to commit to the discipline required for ballet.", "The number of British principal dancers at the Royal Ballet has also decreased over the years.", "In response, the RAD has launched the Fonteyn Nureyev Young Dancers competition to encourage young dancers and sustain British ballet by providing support, coaching, and performance opportunities."]}