{"raw_text": "No ads for Passion Oscar campaign\n \n Producer Mel Gibson will not be using paid advertisements to promote The Passion of the Christ to voters in next year's Academy Awards.\n \n Gibson and his Icon Productions partner Bruce Davey said they would not be campaigning in print, radio or TV for success at the Oscars in February. \"This film should be judged on its artistic merit, not who spends more money on advertising,\" Davey said. But DVDs will be sent to Oscar voters, who will be invited to screenings. Icon spent very little on advertising the film, which deals with the last hours of Jesus Christ's life, when it was released earlier this year - instead, it made the film available for special screenings at churches. It went on to gross over $600m (£322m) in ticket sales worldwide. Over recent years, marketing films to the members of the Academy of Motion Picture Arts and Sciences has become a multi-million dollar industry. Last year, the academy formed a committee to tighten the rules after the campaigns spilled over into personal attacks between studios. Academy president Frank Pierson praised Gibson's move for working to restore the Oscars as a \"celebration and appreciation of excellence,\" and resisting the \"crass commercialisation that was threatening the integrity of the award\".\n", "llama3.2:1b": ["Producer Mel Gibson will not use paid advertisements to promote The Passion of the Christ in next year's Academy Awards.", "Instead, DVDs will be sent to Oscar voters for screenings, despite Icon Productions spending relatively little on advertising."], "llama3.2:3b": ["Mel Gibson will not use paid ads to promote The Passion of the Christ in the Oscar campaign, citing artistic merit over advertising spend.", "Icon Productions has spent little on ads, focusing instead on special screenings at churches before the film's $600m worldwide box office success.", "Academy president Frank Pierson praised Gibson's move for restoring the Oscars' integrity and appreciating excellence, resisting commercialisation."], "gemma2:2b": ["Mel Gibson is not using paid advertisements to promote The Passion of the Christ at the upcoming Academy Awards.", "He will not campaign in traditional media channels like print, radio, or TV.", "Instead, he will send DVDs to Academy voters for screenings and hopes the film's artistic merit will be judged by viewers themselves.", "This decision aligns with a growing trend towards focusing on quality over marketing expenditures."], "qwen2.5:0.5b": ["The movie about Jesus' last hours, The Passion of the Christ, will not be released through traditional means this year.", "Instead, it will be made available for special screenings at churches and DVDs will be sent to Oscar voters who are invited to screenings."], "qwen2.5:1.5b": ["Producer Mel Gibson will not use paid ads for The Passion of the Christ, focusing on artistic merit instead.", "DVDs for Oscar voters will be provided instead.", "Icon Productions spent minimal advertising budget promoting the film, which grossed over $600 million at the box office and was screened in churches afterward.", "This decision aims to restore the Oscars' reputation by avoiding commercial campaigns."], "qwen2.5:3b": ["Producer Mel Gibson will not use paid advertisements to promote The Passion of the Christ at the next Academy Awards.", "Icon Productions partner Bruce Davey stated it should be judged on artistic merit, not advertising spend.", "They did not advertise heavily when released earlier this year; instead, they made it available for special church screenings.", "Despite spending little on marketing, the film grossed over $600m worldwide.", "The Academy of Motion Picture Arts and Sciences has tightened rules after excessive campaigning in recent years.", "Gibson’s decision is praised for helping to maintain the awards' integrity."], "opencoder:1.5b": ["No ads for Passion Oscar campaign.", "Producer Mel Gibson will not be using paid advertisements to promote The Passion of the Christ to voters in next year's Academy Awards.", "Gibson and his Icon Productions partner Bruce Davey said they would not be campaigning in print, radio or TV for success at the Oscars in February.", "\"This film should be judged on its artistic merit, not who spends more money on advertising,\" Davey said.", "But DVDs will be sent to Oscar voters, who will be invited to screenings.", "Icon spent very little on advertising the film, which deals with the last hours of Jesus Christ's life, when it was released earlier this year - instead, it made the film available for special screenings at churches.", "It went on to gross over $600m (£322m) in ticket sales worldwide.", "Over recent years, marketing films to the members of the Academy of Motion Picture Arts and Sciences has become a multi-million dollar industry.", "Last year, the academy formed a committee to tighten the rules after the campaigns spilled over into personal attacks between studios.", "Academy president Frank Pierson praised Gibson's move for working to restore the Oscars as a \"celebration and appreciation of excellence,\" and resisting the \"crass commercialisation that was threatening the integrity of the award\"."], "smollm:1.7b": ["Producer Mel Gibson will not be using paid advertisements to promote The Passion of the Christ to voters in next year's Academy Awards."], "deepseek-r1:1.5b": ["Producers Mel Gibson and hisIcon Productions will not promote The Passion of the Christ through printed materials, radio ads, or TV promotions at the Academy Awards.", "They will instead send DVDs to Oscar voters, who will attend screenings.", "Icon spent minimal on advertising since the film was released, using special church screenings instead.", "Icon grossed over $600m worldwide, surpassing films like \"Inception.\"", "The Oscars have emerged as a multi-billion dollar industry supported by strong support for their promotion of excellence."], "tinyllama:1.1b": ["Mel Gibson will not be using paid advertiseements in the promotion for The Passion of the Christ to voteers in next year's Academy Awards.", "The filmmaker and Icon Production's partner Bruce Davey said they would not be campaigning in print, radio or TV ads for success at the awards ceremony, instead sending DVDs to Oscar voteers who will screenings.", "Icon distributed little advertising in favor of special screenings at churches, generating $600m worldwide sales.", "The Academy formed a committee to tighten rules after marketing films to members of the Academy of Motion Picture Arts and Sciences spilled into personal attacks between studios."], "tinydolphin:1.1b": [" In recent years, marketing films to the members of the Academy of Motion Picture Arts and Sciences has become a multi-million dollar industry.", "However, Mel Gibson is steering clear of paid advertisements for his film, \"The Passion of the Christ,\" which deals with Jesus's death on Good Friday.", "Instead, Icon Productions will send DVD copies of the movie to Oscar voters who wish to screen it during the February voting period."], "phi:2.7b": [" Mel Gibson will not be using paid advertisements to promote The Passion of the Christ to voters in the Academy Awards.", "They believe the film should be judged on its artistic merit, not who spends more money on advertising.", "Icon Productions partnered with Bruce Davey and did not spend a lot on marketing, instead making the movie available for special screenings at churches.", "They have already spent over $600m on ticket sales worldwide."], "orca-mini:3b": [" Producer Mel Gibson will not be using paid advertisements to promote The Passion of the Christ to voters in the upcoming Academy Awards.", "They instead plan to send DVDs to Oscar voters for screenings, although the film still plans to make its way into theaters next year.", "It is a move to restore the credibility of the Oscars and promote The Passion of the Christ as a work of art rather than just a commercial product."], "hermes3:3b": ["Mel Gibson not using ads for Oscar promotion, preferring artistic merit judgment over advertising for The Passion of the Christ."], "stablelm-zephyr:3b": ["Mel Gibson won't use paid ads for The Passion of the Christ in next year's Academy Awards.", "Instead, Icon Productions plans to invite DVDs to Oscar voters for screenings, following their earlier strategy of making the film available for special church screenings.", "The film, which sold over $600 million in ticket sales worldwide, highlights the shift towards marketing films to the members of the Academy of Motion Picture Arts and Sciences as a lucrative industry.", "Academy president Frank Pierson praised Gibson's decision to avoid \"crass commercialization\" and celebrate excellence in filmmaking."], "stablelm2:1.6b": ["Producer Mel Gibson will not use paid advertising for The Passion of the Christ at the Academy Awards, as suggested by partner Bruce Davey.", "Icon Productions is sending DVDs to Oscar voters with invitations to screenings instead.", "Despite spending little on advertising and making the film available in churches, it grossed over $20 million worldwide.", "Marketing films targeting members of the Academy has become a multi-million dollar industry with increased scrutiny after committee formed last year due to excessive campaigning."], "granite3.1-dense:2b": ["Mel Gibson, producer of The Passion of the Christ, has decided not to use paid advertisements for the film's Oscar campaign.", "Instead, he and his partner Bruce Davey plan to send DVDs to Academy voters, offering invitations to screenings at churches.", "Icon Productions spent minimal funds on promotion, opting for free screenings rather than expensive advertising.", "The film, depicting Jesus's last days, grossed over $600 million globally.", "This decision aligns with the Academy's efforts to curb extravagant campaign spending and personal attacks between studios, as highlighted by former Academy president Frank Pierson."], "chatgpt-4o-latest": ["Mel Gibson and his Icon Productions partner Bruce Davey will not use paid advertisements to promote *The Passion of the Christ* for the Academy Awards.", "Instead, they will send DVDs to Oscar voters and invite them to screenings, emphasizing the film's artistic merit over marketing spend.", "The film, which depicts the last hours of Jesus Christ, was previously promoted through church screenings rather than traditional advertising and grossed over $600 million worldwide.", "Academy president Frank Pierson praised Gibson's decision, seeing it as a step toward preserving the Oscars' integrity amid increasing commercialization."]}