{"raw_text": "US TV cuts nudity from BBC film\n \n A US TV network is editing BBC Films' Dirty War to avoid showing the front of a nude woman being scrubbed down after a fictional chemical attack.\n \n It is not worth showing \"non-essential\" nude scenes when indecency complaints are \"aggressively pursued\" by US TV watchdogs, said PBS' Jacoba Atlas. Dirty War - screened uncut on BBC One last September - depicts a dirty bomb attack on the City of London. It is also being screened uncut on US cable channel HBO on 24 January. PBS said it will use extra footage for its broadcast, showing the woman \"from a more discreet angle\" instead.\n \n The US Federal Communications Commission fined CBS $550,000 (£306,814) last autumn for singer Janet Jackson's \"wardrobe malfunction\", during which her breast was exposed during a dance routine with Justin Timberlake. Many US networks and broadcasters are now more nervous about airing nudity, violence or bad language. Ms Atlas said PBS could put itself financially at risk if it showed the uncut version of Dirty War, and it could also deter many of its 170 individual stations from airing \"an important film\". \"You want to pick your battles,\" she said. She added that PBS, which is a private, non-profit media enterprise owned and operated by the nation's 349 public television stations, is bolder about screening non-fiction or historical programming. PBS is seen in virtually all US homes with TV, and describes itself as a \"trusted community resource\" serving nearly 100 million people each week.\n", "llama3.2:1b": ["US TV network edits BBC Films' Dirty War to avoid showing nude scenes due to indecency complaints from US watchdogs.", "The edited version will be broadcast uncut on PBS, showing the woman from a more discreet angle instead."], "llama3.2:3b": ["US TV network PBS will edit BBC film Dirty War to avoid showing nudity due to indecency complaints from US watchdogs, despite it being shown uncut on HBO.", "The decision is due to the financial risk of airing the uncut version and the potential impact on individual stations that may not air the film with nudity."], "gemma2:2b": ["PBS is editing its broadcast of BBC Films' \"Dirty War\" to avoid showing the front of a nude woman being scrubbed down after a fictional chemical attack.", "This decision was made due to the increased pressure from US TV watchdogs regarding nudity, violence, and bad language which can result in financial penalties or even program cancellation."], "qwen2.5:0.5b": ["A US TV network is editing BBC Films' Dirty War to avoid showing the front of a nude woman being scrubbed down after a fictional chemical attack, citing concerns about indecency complaints from US TV watchdogs.", "PBS' Jacoba Atlas said it will use extra footage for its broadcast instead.", "While some US networks and broadcasters are more nervous about airing nudity or violence, many public media organizations like PBS have taken a bold stance in recent years.", "PBS is owned by public television stations and serves millions of viewers each week while being seen virtually everywhere in the United States."], "qwen2.5:1.5b": ["US network changes BBC film featuring naked woman scrubbed down due to indecency concerns.", "Dirty War uncut on HBO but will show woman from behind instead on PBS.", "US networks are becoming more cautious about nudity, violence, and bad language in programming."], "qwen2.5:3b": ["US TV network edits BBC Films' Dirty War to avoid showing nudity from a front-nude scene after indecency complaints are aggressively pursued by the FCC.", "PBS will show the woman depicted in a more discreet angle instead.", "The $550,000 fine CBS received for Janet Jackson's breast exposure highlights US networks' cautious approach towards airing nudity.", "PBS could risk financial stability and deter airings of important films like Dirty War if they show the uncut version.", "As a private non-profit media enterprise, PBS is bolder about screening non-fiction or historical programming, serving nearly 100 million people weekly in virtually all US homes."], "opencoder:1.5b": ["A US TV network is editing BBC Films' Dirty War to avoid showing the front of a nude woman being scrubbed down after a fictional chemical attack.", "It is not worth showing \"non-essential\" nude scenes when indecency complaints are \"aggressively pursued\" by US TV watchdogs, said PBS' Jacoba Atlas.", "The US Federal Communications Commission fined CBS $550,000 (£306,814) last autumn for singer Janet Jackson's \"wardrobe malfunction\".", "Many US networks and broadcasters are now more nervous about airing nudity, violence or bad language."], "smollm:1.7b": ["The summary should preserve the key ideas and details of the original text:\n\n1.", "The US TV network is editing BBC Films' Dirty War to avoid showing the front of a nude woman being scrubbed down after a fictional chemical attack.", "2.", "It is not worth showing \"non-essential\" nude scenes when indecency complaints are \"aggressively pursued\" by US TV watchdogs, said PBS' Jacoba Atlas.", "Dirty War - screened uncut on BBC One last September - depicts a dirty bomb attack on the City of London.", "It is also being screened uncut on US cable channel HBO on 24 January.", "3.", "The US Federal Communications Commission fined CBS $550,000 (£306,814) last autumn for Janet Jackson's \"wardrobe malfunction\", during which her breast was exposed during a dance routine with Justin Timberlake.", "Many US networks and broadcasters are now more nervous about airing nudity, violence or bad language.", "Ms Atlas said PBS could put itself financially at risk if it showed the uncut version of Dirty War, and it could also deter many of its 170 individual stations from airing \"an important film\".", "4.", "PBS is seen in virtually all US homes with TV, and describes itself as a \"trusted community resource\" serving nearly 100 million people each week."], "deepseek-r1:1.5b": ["The UK is cutting the film \"Dirty War\" from BBC One due to concerns over explicit content, citing legal issues raised by a US TV network.", "Janet Jackson's incident, where her breast was exposed during a dance routine, and the film itself are central examples.", "If \"Dirty War\" isn't cut, it could cost the production team $550,000, leading to financial risk.", "Networks worldwide are increasingly cautious about displaying explicit content.", "The UK sees \"Dirty War\" in virtually all homes with TV, serving over 100 million people weekly as a trusted community resource."], "tinyllama:1.1b": ["US TV network PBS will edit its BBC Film's Dirty War to avoid showing the front of a non-essential nuke attack scene when indecent complaints are aggressively pursued by US TV watchdogs, according to PBS Head Jacoba Atlas.", "The uncut version of the movie depicting a dirty bomb attack on London will be shown on BBC One in February, and PBS plans to use extra footage for its broadcast.", "This is not an isolated incident as many American networks and broadcasters are now less willing or able to show nuctuary scenes or bad language.", "ABC's \"Jurassic Park\" made headlines last year when it showed a nude woman being scrubbed down after a fictional chemical attack, resulting in an FCC fine of $550,000.", "However, PBS is seen as more robust about airing uncut versions of nuctuary films."], "tinydolphin:1.1b": [" The U.S. TV network is cutting out nudity from the BBC film Dirty War to avoid further complaints about indecency.", "A PBS executive claims the decision was made after US watchdogs were aggressively pursuing complaints about the nudity in the movie.", "The film depicts a dirty bomb attack on London's city center, with the front of a woman being scrubbed down after an attack by a fictional chemical weapon.", "The uncut version is set to be broadcasted on US cable channel HBO on 24th January, and PBS will use extra footage for its broadcast.", "The decision has come at a time when many networks are now more reluctant to air nudity, violence or bad language."], "phi:2.7b": [" A summary of the text in plain text is:\n\nUS TV network edits BBC film Dirty War to avoid showing the front of a nude woman being scrubbed down after a fictional chemical attack.", "PBS says it will use extra footage for its broadcast, but risks financial and reputational harm by doing so.", "PBS has more freedom to show non-fiction or historical programming than other networks."], "orca-mini:3b": [" The BBC film Dirty War, which depicts a fictional chemical attack on the City of London, will not show any nude scenes when it is shown uncut on US cable channel HBO in January.", "The US Federal Communications Commission fined CBS $550,000 for Janet Jackson's \"wardrobe malfunction\" in 2001, and many networks and broadcasters are now more nervous about airing nudity, violence or bad language.", "PBS is worried about the financial risks of showing an important film and may have to choose its battles carefully.", "However, it is still a trusted community resource serving over 100 million people each week."], "hermes3:3b": ["US TV network edits BBC film Dirty War to avoid showing nude scenes due to indecency complaints by watchdogs."], "stablelm-zephyr:3b": ["A US TV network, PBS, has decided to edit BBC Films' Dirty War due to the risk of incurring fines for airing \"non-essential\" nude scenes.", "The federal Communications Commission previously fined CBS $550,000 for Janet Jackson's \"wardrobe malfunction.\"", "The edited version will show the woman from a more discreet angle instead of displaying her body.", "This decision aims to avoid potential financial risks and deter individual stations from airing the film."], "stablelm2:1.6b": ["US network edits BBC film \"Dirty War\" to avoid showing a nude woman due to indecency complaints; PBS will show her from a more discreet angle.", "The decision is based on increased US TV networks' concern about airing nudity, violence, or bad language after the FCC fined CBS for Janet Jackson's wardrobe malfunction.", "This highlights that PBS could face financial risks and potential loss of individual stations airing important films if it screens the uncut version."], "granite3.1-dense:2b": ["US television network PBS will edit BBC Films' uncut film Dirty War for its broadcast on PBS due to strict indecency regulations enforced by the US Federal Communications Commission (FCC).", "The edited version will omit a nude scene depicting a woman being scrubbed after a chemical attack, showing her from a more discreet angle instead.", "This decision stems from PBS' risk-averse approach to potential financial penalties and the desire to maintain its reputation as a trusted community resource.", "The film, originally screened uncut on BBC One and HBO, depicts a dirty bomb attack in London.", "Despite these edits, PBS remains committed to broadcasting important non-fiction or historical content."], "chatgpt-4o-latest": ["A US TV network, PBS, is editing BBC Films' Dirty War to remove a nude scene depicting a woman being scrubbed down after a fictional chemical attack.", "PBS' Jacoba Atlas stated that avoiding \"non-essential\" nudity is necessary due to aggressive indecency complaints pursued by US TV watchdogs.", "The film, which aired uncut on BBC One, will also be shown uncut on HBO.", "PBS will replace the scene with extra footage showing the woman from a more discreet angle.", "The decision follows increased caution among US broadcasters after CBS was fined $550,000 for Janet Jackson's 2004 Super Bowl \"wardrobe malfunction.\"", "Atlas noted that airing the uncut version could financially risk PBS and deter its 170 stations from showing the film.", "While PBS is more willing to air bold non-fiction or historical content, it prioritizes maintaining its reputation as a \"trusted community resource\" serving nearly 100 million viewers weekly."]}