{"raw_text": "Oscar nominees gear up for lunch\n \n Leonardo DiCaprio, Jamie Foxx and Hilary Swank are among those due to attend this year's Oscar nominees luncheon on Monday.\n \n They will join more than 100 nominees from the 24 Oscar categories at the annual event, which will take place at the Beverly Hilton hotel, Los Angeles. British hopefuls, including Kate Winslet, Imelda Staunton and Sophie Okonedo are also expected to attend. This year's Oscar ceremony will be held on Sunday 27 February.\n \n Martin Scorsese's The Aviator is leading the field at this year's Oscars with 11 nominations, while other multiple nominees include Million Dollar Baby and Sideways. Oscar nominees Swank and Foxx were among the winners at the Screen Actors Guild awards at the weekend, one of the many ceremonies held in the run-up to the Oscars. Swank won Best Actress for Million Dollar Baby while Foxx triumphed for his performance as Ray Charles in the biopic Ray. Sideways was also among the winners, taking the prize for best cast performance. The next major film award ceremony of the season is the Bafta awards, which take place at London's Odeon Leicester Square on 12 February. Many of those nominated for Oscars including DiCaprio, Foxx and Staunton - an Oscar nominee for her performance in Vera Drake - have also been nominated for Baftas.\n", "llama3.2:1b": ["Oscar nominees gear up for lunch, attending a luncheon at the Beverly Hilton hotel in Los Angeles.", "The event will take place on Monday and feature over 100 nominees from 24 categories.", "Attendees include Leonardo DiCaprio, Jamie Foxx, Hilary Swank, Kate Winslet, Imelda Staunton, and Sophie Okonedo."], "llama3.2:3b": ["Oscar nominees will attend a luncheon at the Beverly Hilton hotel on Monday, with Leonardo DiCaprio, Jamie Foxx, Hilary Swank among expected attendees.", "British hopefuls Kate Winslet, Imelda Staunton, and Sophie Okonedo are also expected to attend.", "Martin Scorsese's The Aviator leads nominations with 11, while Million Dollar Baby and Sideways have multiple nominations."], "gemma2:2b": ["Leonardo DiCaprio, Jamie Foxx, Hilary Swank, and other Oscar nominees will attend the annual luncheon before the ceremony on February 27th.", "The event takes place at the Beverly Hilton hotel in Los Angeles, with nominees from various categories expected to be present.", "British actors Kate Winslet, Imelda Staunton, and Sophie Okonedo are also expected to attend.", "The Aviator leads with 11 nominations, followed by Million Dollar Baby and Sideways.", "Swank and Foxx won awards at the Screen Actors Guild Awards, while Sideways took the Best Cast Performance award.", "The next major film award ceremony is the Bafta awards on February 12th in London.", "Many nominees for Oscars are also nominated for Baftas."], "qwen2.5:0.5b": ["Oscar nominees attend a luncheon featuring Leonardo DiCaprio, Jamie Foxx, and Hilary Swank, with other multiple nominees expected to attend as well.", "The nominations are led by Martin Scorsese's The Aviator with 11 nominations while other contenders include Million Dollar Baby and Sideways.", "The next major film award ceremony of the season is the Bafta awards in London at Odeon Leicester Square on 12 February, where many Oscar nominees have also been nominated."], "qwen2.5:1.5b": ["Oscar nominees gather for luncheon on Monday at the Beverly Hilton hotel.", "The event includes 100+ nominations across various categories, with Leonardo DiCaprio, Jamie Foxx, and Hilary Swank among notable attendees.", "Leading nominees include Martin Scorsese's \"The Aviator\" with 11 nominations.", "Other multiple nominees are Million Dollar Baby and Sideways.", "The ceremony is held on Sunday, February 27th.", "Bafta awards follow at the Odeon Leicester Square on February 12th."], "qwen2.5:3b": ["Leonardo DiCaprio, Jamie Foxx, Hilary Swank, Kate Winslet, Imelda Staunton, and Sophie Okonedo are expected to attend the Oscar nominees luncheon on Monday at the Beverly Hilton hotel.", "The event features over 100 nominees from 24 categories for the Oscars scheduled for February 27th.", "Martin Scorsese's \"The Aviator\" leads with 11 nominations.", "Swank and Foxx won Screen Actors Guild awards, with Swank for Best Actress in \"Million Dollar Baby\" and Foxx for his Ray Charles role in \"Ray\".", "Sideways also won a Bafta award.", "Many nominees are dual recipients of Oscar and Bafta nominations."], "opencoder:1.5b": ["Oscar nominees gear up for lunch at the annual event held at The Beverly Hilton hotel on Sunday 27 February.", "They will join more than 100 nominees from the 24 Oscar categories, including multiple award winners such as DiCaprio, Foxx and Staunton."], "smollm:1.7b": ["Oscar nominees gear up for lunch"], "deepseek-r1:1.5b": ["Leonardo DiCaprio, Jamie Foxx, and Hilary Swank are attending an Oscar nominees luncheon on Monday at the Beverly Hilton hotel in Los Angeles, with more than 100 nominees from various categories participating.", "British hopefuls such as Kate Winslet, Imelda Staunton, and Sophie Okonedo are also expected to attend.", "This year's Oscars ceremony will take place on February 27th, leading a competition that includes Martin Scorsese's *The Aviator* with 11 nominations, alongside others like *Million Dollar Baby* and *Sideways*.", "DiCaprio, Foxx, and Staunton have also been nominated for the Bafta awards."], "tinyllama:1.1b": ["Osco Nominees Gear Up For Luncheon\n24 Oscars categories to attend annual luncheon, which will take place at Beverly Hilton hotel on Monday.", "British hopefuls, including Kate Winsholt and Sophie Okonedo are also expected to attend the event.", "Martin Scorsese's The Aviator is leading the nominations with 11, while other multiple nominees include Million Dollar Baby and Sideways.", "Oscar Nominates Swank and Foxx were among the winners at the Screen Actors Guild awards earlier this month, one of the many ceremonies held in the run-up to the Academy Awards.", "The following week, London's Bafta awards are taking place on 12 February with many Oscar Nominates nominated for the ceremony including DiCaprio, Foxx and Stauntoon - who has also been nominated for Baftas in previous years."], "tinydolphin:1.1b": [" The Academy of Motion Picture Arts and Sciences (Oscars) is the prestigious organization responsible for honoring outstanding achievements in the motion picture industry throughout the year.", "This past week, several important milestones were reached during the announcement of nominations.", "Among these was the inclusion of Leonardo DiCaprio, Jamie Foxx, Hilary Swank, and Imelda Staunton, among others, at this year's Oscar nominees luncheon on Monday.", "This event takes place at the Beverly Hilton hotel in Los Angeles, where some 100 Academy Award candidates from each of the 24 categories will attend to celebrate their nominations.", "British actresses, including Kate Winslet and Imelda Staunton, are also set to be present at this year's Oscars ceremony on Sunday, February 27th.", "The leading contender for Best Picture at the Oscars is Martin Scorsese's The Aviator, which boasts an impressive list of nominations.", "Other multiple nominees in this year's race include Clint Eastwood's Million Dollar Baby and Martin Scorsese's Sideways.", "Another notable contender is DiCaprio himself, who won Best Actor at the Screen Actors Guild Awards earlier this month for his performance in The Revenant.", "The next major film award ceremony of the season will be held on February 12th, when the Bafta Awards are held at London's Odeon Leicester Square.", "Many of those nominated for Oscars, including DiCaprio, Foxx, and Staunton - an Oscar nominee for her performance in Vera Drake - have also been nominated for Baftas."], "phi:2.7b": [" This year's Oscar nominees luncheon will be held at the Beverly Hilton hotel in Los Angeles on Monday.", "The event features more than 100 nominees from 24 categories.", "British hopefuls Kate Winslet, Imelda Staunton, and Sophie Okonedo are expected to attend.", "Martin Scorsese' The Aviator is leading the field with 11 nominations, while other multiple nominees include Million Dollar Baby and Sideways.", "Oscar nominees Swank and Foxx won awards at the Screen Actors Guild awards, one of many ceremonies before the Oscars ceremony on Sunday 27 February.", "Many Oscar nominees including DiCaprio, Foxx, Staunton, and Winslet have also been nominated for Baftas.", "The next major award ceremony is Bafta awards, which take place on 12 February at London' s Odeon Leicester Square."], "orca-mini:3b": [" Leonardo DiCaprio, Jamie Foxx, and Hilary Swank are among the Oscar nominees expected to attend this year's luncheon.", "The annual event is held at the Beverly Hilton hotel in Los Angeles.", "Kate Winslet, Imelda Staunton, and Sophie Okonedo are also expected to attend.", "Martin Scorsese's The Aviator has the most nominations this year, while other multiple nominees include Million Dollar Baby and Sideways.", "Swank and Foxx won at the Screen Actors Guild awards earlier in the week, one of many ceremonies held before the Oscars.", "Sideways was among the winners, taking the prize for Best Cast Performance.", "The Bafta awards, which are held in London next month, are also major film award ceremonies."], "hermes3:3b": ["Oscar nominees meet for lunch, incl.", "Leonardo DiCaprio, Jamie Foxx, Hilary Swank & more."], "stablelm-zephyr:3b": ["Several Oscar nominees are preparing for the annual Oscar nominees lunch at the Beverly Hilton hotel in Los Angeles on Monday.", "Around 100 nominees from 24 categories will attend, including Leonardo DiCaprio, Jamie Foxx, Hilary Swank, Kate Winslet, Imelda Staunton, and Sophie Okonedo.", "The event comes ahead of the Oscar ceremony held on Sunday 27 February.", "Martin Scorsese's \"The Aviator\" leads with 11 nominations, followed by \"Million Dollar Baby\" and \"Sideways.\"", "Both Swank and Foxx won awards at the Screen Actors Guild ceremonies over the weekend.", "Many Oscar nominees, including DiCaprio, Foxx, and Staunton nominated for her performance in \"Vera Drake,\" are also Bafta-nominated."], "stablelm2:1.6b": ["Oscar nominees, including Leonardo DiCaprio, Jamie Foxx, and Hilary Swank, will attend the annual event at Beverly Hilton hotel where they'll join more than 200 nominees from various Oscar categories.", "British contenders, Kate Winslet, Imelda Staunton, and Sophie Okonedo are also expected to attend.", "Martin Scorsese's The Aviator leads with nominations, while Million Dollar Baby and Sideways have multiple nominations too.", "Oscars will be held on February 23, whereas the previous event was the Screen Actors Guild Awards where Swank won Best Actress for her role in Million Dollar Baby and Foxx won Best Actor for Ray Charles.", "Both these actors were also nominated for Baftas along with Oscar nominee Hilary Swank."], "granite3.1-dense:2b": ["Leonardo DiCaprio, Jamie Foxx, Hilary Swank, Kate Winslet, Imelda Staunton, and Sophie Okonedo are among 100+ Oscar nominees attending the annual luncheon on Monday at the Beverly Hilton.", "The event precedes this year's Oscars, set for February 27.", "Martin Scorsese's \"The Aviator\" leads with 11 nominations, while other notable contenders include \"Million Dollar Baby\" and \"Sideways.\"", "Swank and Foxx recently won at the Screen Actors Guild awards, with Swank for Best Actress in \"Million Dollar Baby\" and Foxx for his role as Ray Charles in \"Ray.\"", "\"Sideways\" also took the best cast performance prize.", "The Bafta awards will follow on February 12 in London, with many Oscar nominees also competing there."], "chatgpt-4o-latest": ["Leonardo DiCaprio, Jamie Foxx, and Hilary Swank are among the more than 100 Oscar nominees attending the annual luncheon at the Beverly Hilton in Los Angeles.", "British nominees like Kate Winslet, Imelda Staunton, and Sophie Okonedo are also expected.", "The Oscars will be held on 27 February, with Martin Scorsese's The Aviator leading with 11 nominations.", "Swank and Foxx recently won Screen Actors Guild awards for their roles in Million Dollar Baby and Ray, respectively, while Sideways won Best Cast Performance.", "The next major awards event is the Baftas on 12 February, where several Oscar nominees, including DiCaprio, Foxx, and Staunton, are also nominated."]}