{"raw_text": "Global release for Japan hit film\n \n Oscar-winning animator Hayao Miyazaki's latest film, Howl's Moving Castle, is to be released in 50 countries around the world, its distributor has said.\n \n Howl's Moving Castle set a Japanese box office record last week, taking 1.5bn yen (£7.7m) in its first two days. Miyazaki won an Oscar earlier this year for Spirited Away, Japan's first Academy Award for nearly 50 years. Howl's Moving Castle is based on a children's fantasy novel by UK author Diana Wynne Jones. It tells the story of an 18-year-old woman who ages dramatically after falling under a witch's spell. She heads to a moving castle kept by Howl, a wizard, and searches for a way to become normal again. A spokesman for distributor Toho said the film \"has received strong interest from domestic audiences and foreign media and viewers alike\". \"We have a good feeling about this film. We saw very good viewer response,\" he added. The film's worldwide release will start in South Korea on 24 December, and France on 12 January.\n", "llama3.2:1b": ["Hayao Miyazaki's latest film, Howl's Moving Castle, is set to be released globally in 50 countries around the world, with a distributor releasing it internationally, including in South Korea by December 24th and France by January 12th."], "llama3.2:3b": ["Hayao Miyazaki's Howl's Moving Castle to be released globally; the film broke a Japanese box office record taking £7.7m in its first two days.", "It is based on Diana Wynne Jones' children's fantasy novel and tells the story of an 18-year-old woman under a witch's spell."], "gemma2:2b": ["Hayao Miyazaki's \"Howl's Moving Castle\" is set for global release in 50 countries.", "The film broke Japanese box office records upon its opening week and follows an aging woman who seeks to reverse the spell imposed by a witch.", "The film has received positive reviews, with Toho, the distributor, expressing confidence in its worldwide success."], "qwen2.5:0.5b": ["Oscar-winning animator Hayao Miyazaki’s Howl's Moving Castle is set to be released in 50 countries around the world, with its distributor Toho saying it \"has received strong interest from domestic audiences and foreign media and viewers alike.\"", "The film received a box office success last week, breaking the previous record of 1.", "5 billion yen (£7.", "7 million) for Japanese box offices.", "It follows Howl's Moving Castle, which is based on a children's fantasy novel by British author Diana Wynne Jones, with a 18-year-old woman falling under a witch's spell and traveling to a moving castle kept by a wizard where she searches for a way to become normal again."], "qwen2.5:1.5b": ["The Oscar-winning anime director Hayao Miyazaki is releasing his latest film globally, including Japan, with a projected $7.7 million in its first two days of screenings.", "The movie, based on Diana Wynne Jones' children's fantasy novel and inspired by Spirited Away, tells the story of an 18-year-old woman who ages after being cursed into becoming 20 years old."], "qwen2.5:3b": ["Oscar-winning animator Hayao Miyazaki’s Howl's Moving Castle, which set a Japanese box office record with 1.5bn yen (£7.7m) in its first two days, will be released globally in over 50 countries.", "Based on Diana Wynne Jones' novel, the film tells of an aging woman who seeks to reverse her fate at a wizard's moving castle.", "Toho’s distributor expects strong reception internationally and plans early releases in South Korea and France."], "opencoder:1.5b": ["Global release for Japan hit film Oscar-winning animator Hayao Miyazaki's latest film Howl's Moving Castle is to be released in 50 countries around the world its distributor has said.", "The film set a Japanese box office record last week taking $1.5bn (£7.7m) in its first two days.", "Miyazaki won an Oscar earlier this year for Spirited Away, Japan's first Academy Award for nearly 50 years.", "Howl's Moving Castle is based on a children's fantasy novel by UK author Diana Wynne Jones.", "It tells the story of an 18-year-old woman who ages dramatically after falling under a witch's spell and she heads to a moving castle kept by Howl, a wizard, and searches for a way to become normal again.", "The film has \"received strong interest from domestic audiences and foreign media and viewers alike\" and it is expected to start worldwide on 24 December, and France on 12 January."], "smollm:1.7b": ["The summary is concise and to the point, capturing the main ideas and key details of the text.", "It does not include any explanations or justifications for the claims made in the text.", "The summary only presents the facts as they are stated in the original text."], "deepseek-r1:1.5b": ["Howl's Moving Castle, Miyazaki's latest film, will be released globally in 50 countries, setting a box office record.", "Based on Diana Wynne Jones' children's fantasy novel, the film tells a dramatic tale of a 18-year-old girl who ages after being cast under a witch's spell while exploring a moving castle.", "distributor Toho has praised the film's reception from audiences and media, with positive reviews indicating strong audience interest.", "The film will start in South Korea on December 24 and France on January 12."], "tinyllama:1.1b": ["The acclaimed Japanese animator Hayao Miyazaki has announced that his latest film Howl's Moving Castle will be released in 50 countries, including Japan, for a two-day release on 12 and 13 January.", "The film's box office record last week set a Japanese box office record, and it was based on the children's fantasy novel by Diana Wynne Jones.", "Howl's Moving Castle is a story about an 18-year-old woman who ages dramatically after being under a witch's spell.", "She heads to a moving castle where she encounters a wise talking bird, Howl, and his magical staff, and tries to become normal again.", "The film has received strong interest from domestic audiences and foreign media and viewers alike, and will start its release in South Korea on 24 December and France on 12 January."], "tinydolphin:1.1b": [" In summary, the global release of Hayao Miyazaki's Howl's Moving Castle, based on the children's fantasy novel by Diana Wynne Jones, will span across several countries in Europe, Asia, and Oceania.", "This highly anticipated film has been well-received among both domestic and international audiences, with strong interest from viewers in Japan and South Korea, where it was a massive box office success last week.", "The movie's worldwide release will start on 24 December in South Korea and France, with further European countries set to follow suit."], "phi:2.7b": [" Howl's Moving Castle, directed by Hayao Miyazaki and based on a children's fantasy novel, is to be released in 50 countries around the world, including Japan where it made a record-breaking 1.5bn yen (£7.7m) in its first two days of release.", "The film tells the story of an 18-year-old woman who ages dramatically after falling under a witch's spell and searches for a way to become normal again.", "Toho, the film's distributor, has received strong interest from domestic audiences and foreign media and viewers alike."], "orca-mini:3b": [" Hayao Miyazaki's latest film, Howl's Moving Castle, is set to be released in 50 countries around the world.", "The film has set a Japanese box office record and won an Oscar earlier this year for Spirited Away.", "The story follows an 18-year-old woman who ages dramatically after falling under a witch's spell.", "She heads to a moving castle kept by Howl, a wizard, and searches for a way to become normal again.", "The film will be released in South Korea and France starting in December."], "hermes3:3b": ["Hayao Miyazaki's \"Howl's Moving Castle\" released globally, set Japanese box office record; based on Diana Wynne Jones novel."], "stablelm-zephyr:3b": ["Oscar-winning animator Hayao Miyazaki's latest film, Howl's Moving Castle, is set for global release in 50 countries after breaking a Japanese box office record with its first two days of sales totaling ¥1.5 billion ($14.3 million).", "Based on the children's fantasy novel by UK author Diana Wynne Jones, the film tells the story of an 18-year-old woman who ages rapidly after falling under a witch's spell and seeks help from a moving castle belonging to wizard Howl.", "The worldwide release is scheduled to begin in South Korea on December 24th and France on January 12th."], "stablelm2:1.6b": ["Oscar-winning animator Hayao Miyazaki's latest film, Howl's Moving Castle, set a Japanese box office record with its global release starting in South Korea in December and France in January.", "The movie, based on a children's fantasy novel by UK author Diana Wynne Jones, follows the story of an aging woman who ages after falling under a witch's spell."], "granite3.1-dense:2b": ["Howl's Moving Castle, directed by Oscar-winning animator Hayao Miyazaki and based on Diana Wynne Jones' UK novel, is set to be released in 50 countries worldwide.", "The Japanese film broke box office records, earning 1.5 billion yen (£7.7m) in its first two days.", "Miyazaki previously won an Oscar for Spirited Away, Japan's maiden Academy Award in nearly half a century.", "The film's global premiere will commence in South Korea on December 24 and in France on January 12, with strong interest anticipated from both domestic audiences and international viewers."], "chatgpt-4o-latest": ["Oscar-winning animator Hayao Miyazaki's film Howl's Moving Castle will be released in 50 countries.", "It set a Japanese box office record, earning 1.5 billion yen in its first two days.", "Based on a novel by Diana Wynne Jones, the story follows an 18-year-old woman cursed to age dramatically who seeks help from a wizard named Howl.", "Distributor Toho reported strong interest from both domestic and international audiences.", "The global release begins in South Korea on 24 December and in France on 12 January."]}