{"raw_text": "Downloads enter US singles chart\n \n Digital music downloads are being included in the main US singles chart for the first time.\n \n Billboard's Hot 100 chart now incorporates data from sales of music downloads, previously only assigned to a separate download chart. Green Day's Boulevard of Broken Dreams is currently number two in Billboard's pop chart, and tops its digital chart. Download sales are due to be incorporated into the UK singles chart later this year.\n \n Digital sales in the US are already used to compile Billboard's Hot Digital Sales chart. They will now be tallied with sales of physical singles and airplay information to make up its new Hot 100 chart. Its second new chart - the Pop 100 - also combines airplay, digital and physical sales but confines its airplay information to US radio stations which play chart music. In addition to Green Day, other artists in the current US digital sales top 10 include Kelly Clarkson, The Game and the Killers.\n \n Sales of legally downloaded songs shot up more than tenfold in 2004, with 200 million track purchased online in the US and Europe in 12 months, the International Federation of the Phonographic Industry (IFPI) reported last month. In the UK sales of song downloads overtook those for physical singles for the first time at the end of last year. The last week of December 2004 saw download sales of 312,000 compared with 282,000 physical singles, according to the British Phonographic Industry. The UK's first official music download chart was launched last September, compiling the most popular tracks downloaded from legal UK sites - including iTunes, OD2, mycokemusic.com and Napster. Westlife's Flying Without Wings - a 1999 track reissued for the occasion - was the first number one of the UK download chart.\n \n A spokesman for the British Phonographic Industry (BPI) said the first combined UK download and sales chart was due to be compiled \"within the first half of this year\". \"Work is going on across the music business right now to make sure the new chart works to plan,\" he said. The BPI spokesman described the UK music download chart, compiled by the Official Charts Company, as having been \"a great success\" since its launch. \"It has provided a focus for the industry and has really driven interest in downloads among music fans,\" he said.\n", "llama3.2:1b": ["Digital downloads are being included in US singles charts starting with the Billboard Hot 100 chart.", "Green Day's Boulevard of Broken Dreams is currently number two, while download sales contribute to UK Singles Chart rankings later this year."], "llama3.2:3b": ["Digital music downloads are being included in US singles charts for the first time, with Billboard's Hot 100 chart now incorporating data from sales of music downloads.", "The UK is set to follow suit later this year.", "Sales of digitally downloaded songs have increased significantly, with over 10 times more sales reported in 2004 compared to the previous year.", "The first combined US and UK charts will also be compiled, with the UK's download chart having been successful since its launch last September."], "gemma2:2b": ["Digital music downloads are being included in the US Billboard Hot 100 chart, alongside physical sales and airplay information, to create the new Hot 100 chart.", "This change follows a significant increase in digital song sales, which now surpass physical singles sales in some markets like the UK.", "The UK is launching its own combined download and sales chart later this year."], "qwen2.5:0.5b": ["Digital music sales are now part of Billboard's new US singles chart; Green Day's Boulevard of Broken Dreams is currently number two in the Pop 100, following The Killers' debut.", "Other artists such as Kelly Clarkson, The Game, and Westlife also entered the charts.", "Digital sales data from downloads will be incorporated into the UK Singles Chart later this year."], "qwen2.5:1.5b": ["Digital music downloads are now included in Billboard's Hot 100 singles chart, incorporating sales data previously used only on a separate download chart.", "Billboard is expanding its charts to include both physical sales and digital download information starting with the UK singles chart.", "This marks a significant shift as sales of legally downloaded songs increased by more than tenfold worldwide in 2004, particularly in Europe and North America.", "The inclusion of digital downloads will be used for the Hot 100 chart alongside physical sales and airplay data from US radio stations to create a comprehensive chart format.", "Additionally, new charts combining all three sources (physical sales, digital download, and airplay) are being developed for pop music, focusing on American radio stations only."], "qwen2.5:3b": ["Downloads enter US singles chart for first time.", "Billboard's Hot 100 now includes digital sales data previously only on separate chart.", "Green Day's Boulevard of Broken Dreams is top two on both pop and digital charts.", "Digital sales are integrated with physical singles and airplay to form new Pop 100, excluding non-US radio.", "In the US, download sales have increased tenfold since 2004 (200 million tracks sold).", "In UK, downloads surpassed physical singles for first time at end of 2004, with Westlife's Flying Without Wings leading UK download chart.", "A combined music download and sales chart is planned for release in early 2005."], "opencoder:1.5b": ["Downloads enter US singles chart\n\nDigital music downloads are being included in the main US singles chart for the first time.", "Billboard's Hot 100 chart now incorporates data from sales of music downloads, previously only assigned to a separate download chart.", "Green Day's Boulevard of Broken Dreams is currently number two in Billboard's pop chart, and tops its digital chart.", "Sales of legally downloaded songs shot up more than tenfold in 2004, with 200 million track purchased online in the US and Europe in 12 months.", "The International Federation of the Phonographic Industry (IFPI) reported last month.", "In the UK sales of song downloads overtook those for physical singles for the first time at the end of last year.", "First combined UK download and sales chart was due to be compiled \"within the first half of this year\".", "Work is going on across the music business right now to make sure the new chart works to plan.", "The British Phonographic Industry (BPI) said the first combined UK download and sales chart was due to be compiled \"within the first half of this year\"."], "smollm:1.7b": ["The summary is concise because it only includes the main points of the text without including any supporting details or examples.", "The summary also uses plain language, avoiding technical jargon and complex explanations."], "deepseek-r1:1.5b": ["The US singles chart now includes data from digital downloads for the first time.", "The Hot 100 chart incorporates both sales data from digital downloads and physical singles, with Green Day leading in its pop chart and being number two.", "Digital sales will be part of the UK singles chart later this year.", "In the US, digital sales are added to the Hot 100, combining them with physical sales and airplay information for U.S. radio stations.", "This transition is significant as the UK's first official music download chart is set to launch in late December.", "The Hot 100 now includes both digital and physical sales, while the Pop 100 focuses on U.S. radio play data.", "Examples include Green Day and Kelly Clarkson, who top the US digital sales charts.", "Download numbers in the US grew nearly tenfold faster than physical sales, with a record set in 2004."], "tinyllama:1.1b": ["The US singles chart incorporates data from sales of digital music downloads, which are already used to compile Billboard's Hot Digital Sales chart.", "The second new chart, the Pop 100, also combines airplay, digital and physical sales but confines its airplay information to US radio stations that play chart music.", "In 2004, sales of legally downloaded songs shot up more than tenfold in the US, with 200 million track purchases over the year.", "A British Phonographic Industry speaker stated that the first combined UK download and sales chart will be compiled within \"the first half of this year\", and that it was a great success since its launch."], "tinydolphin:1.1b": [" Based on the text, here are the main points:\n1.", "The US singles chart will include data from digital sales starting in 2005.", "2.", "Download sales are used to make up the Pop 100 chart.", "3.", "Airplay information is combined with digital and physical sales to make up the UK Singles Top 100 chart, which combines airplay, downloads, and streaming data.", "4.", "The first combined UK download and sales chart is expected to be compiled within the first half of this year.", "5.", "Digital music downloads continue to grow in popularity, with more than tenfold growth over 2004.", "6.", "Sales of legally downloaded songs have surpassed purchases of physical singles for the first time in history, according to the International Federation of the Phonographic Industry (IFPI)."], "phi:2.7b": [" Digital music downloads have become part of Billboard's Hot 100 chart for the first time, which now includes data on both physical sales and digital downloads.", "The UK will also be incorporating digital sales into their singles chart later this year.", "Downloads have seen a tenfold increase in the US in 2004, with 200 million tracks purchased online in 12 months.", "In the UK, song downloads overtook physical singles for the first time at the end of last year.", "A combined download and sales chart is due to be launched within the next half of the year, with a focus on promoting interest in downloads among music fans."], "orca-mini:3b": [" Digital music downloads are being included in the main US singles chart for the first time, with sales of music downloads shot up more than tenfold in 2004.", "The last week of December 2004 saw download sales of 312,000 compared with 282,000 physical singles, according to the British Phonographic Industry.", "The UK's first official music download chart was launched last September, compiling the most popular tracks downloaded from legal UK sites - including iTunes, OD2, mycokemusic.com and Napster.", "Westlife's Flying Without Wings was the first number one of the UK download chart.", "The BPI spokesman described the UK music download chart, compiled by the Official Charts Company, as having been \"a great success\" since its launch."], "hermes3:3b": ["Digital downloads enter main US singles chart, incorporating sales data to Billboard's Hot 100 & Pop 100 charts.", "Green Day's Boulevard of Broken Dreams leads digital sales."], "stablelm-zephyr:3b": ["Digital music downloads are now included in the main US singles chart, following their integration into Billboard's Hot 100 chart.", "Green Day's \"Boulevard of Broken Dreams\" topped the digital chart.", "In the UK, sales of song downloads surpassed physical singles for the first time in December 2004.", "The International Federation of the Phonographic Industry reported a tenfold increase in download sales in 2004.", "A combined UK download and sales chart is expected to be compiled within the first half of the year, with the Official Charts Company compiling it."], "chatgpt-4o-latest": ["Digital music downloads are now included in the US Billboard Hot 100 chart, which previously only tracked physical sales and airplay.", "Green Day's \"Boulevard of Broken Dreams\" is currently number two on the pop chart and tops the digital chart.", "The UK will also integrate download sales into its singles chart later this year.", "Digital music sales surged in 2004, with 200 million tracks purchased online in the US and Europe.", "In the UK, downloads surpassed physical singles sales for the first time in late 2004.", "The UK launched its official download chart in September 2004, with Westlife's \"Flying Without Wings\" as its first number one.", "A combined UK download and sales chart is expected within the first half of the year, with industry efforts ensuring its success."], "stablelm2:1.6b": ["Billboard's Hot Chart adds digital music downloads to their pop chart for the first time, with Green Day's Boulevard of Broken Dreams at number two.", "Digital sales in the US are used to create Billboard's Hot Digital Sales chart, which will now include physical singles and airplay data.", "The new Hot Chart combines airplay, digital, and physical sales for its second chart, Pop.", "Other artists like Kelly Clarkson, The Game, and the Killers also have significant download sales.", "In 2014, legally downloaded song sales increased tenfold in US and Europe, with a million track purchased online in the US and UK.", "The first official music download chart in the UK was launched last year, featuring popular tracks downloaded from legal sites like iTunes, OD2, mycokemusic.com, and Napster."], "granite3.1-dense:2b": ["Digital music download sales will be integrated into Billboard's Hot 100 chart in the US, replacing a separate download chart.", "This change reflects a significant increase in digital purchases, with 200 million tracks bought online in 2004, according to the International Federation of the Phonographic Industry (IFPI).", "The UK's first official music download chart was launched in September 2005, with Westlife's \"Flying Without Wings\" as its first number one.", "A combined UK digital and sales chart is expected by the end of 2006.", "Other top digital US artists include Green Day, Kelly Clarkson, The Game, and the Killers."]}