{"raw_text": "Glasgow hosts tsunami benefit gig\n \n The top names in Scottish music are taking part in a benefit concert in aid of the victims of the Asian tsunami.\n \n All 10,000 tickets for Saturday's concert, featuring Franz Ferdinand, Belle and Sebastian and Travis, at Glasgow's SECC sold out in 36 hours. Mull Historical Society, Deacon Blue, Idlewild, Texas, Mogwai and Teenage Fanclub are among the other acts performing at the concert. Organisers hope to raise at least £250,000 from the show.\n \n It follows a Cardiff gig starring Eric Clapton, Keane and Jools Holland, which raised more than £1.25m. And it is taking place on the same night as a tsunami benefit show in Bristol, which will see Massive Attack and Portishead share a stage for the first time. Colin MacIntyre, of Mull Historical Society, was playing another gig on the same day but said he was determined to make the Glasgow benefit. He said: \"I think we were all affected by seeing the reports coming from the Far East. \"We all know somebody who was there, but more than that it was that we had never seen a wave of destruction, a natural disaster, like this in my generation. \"I'm lucky as an artist to be able to perform at something like this.\"\n", "llama3.2:1b": ["Glasgow hosts benefit concert for tsunami victims featuring top Scottish musicians and raising money for aid efforts.", "The event, held on the same night as another tsunami benefit show in Bristol, features bands such as Franz Ferdinand, Belle and Sebastian, and Travis.", "Tickets sold out in 36 hours, with an estimated £250,000 raised from the Glasgow concert."], "llama3.2:3b": ["Glasgow hosts a tsunami benefit concert featuring Franz Ferdinand, Belle and Sebastian, Travis, and other Scottish musicians, with 10,000 tickets sold out in 36 hours.", "The event aims to raise £250,000 for victims of the Asian tsunami, following a similar benefit show in Cardiff that raised over £1.25m on the same night, as well as another benefit concert planned for Bristol featuring Massive Attack and Portishead."], "gemma2:2b": ["A benefit concert in Glasgow raised over £250,000 for victims of the Asian tsunami after all 10,000 tickets sold out within 36 hours.", "The event featured Franz Ferdinand, Belle and Sebastian, Travis, as well as a number of other Scottish musical acts, including Mull Historical Society, Deacon Blue, Idlewild, Texas, Mogwai and Teenage Fanclub.", "This concert follows similar efforts in Cardiff and Bristol.", "Colin MacIntyre made the decision to participate despite performing elsewhere on the same night."], "qwen2.5:0.5b": ["Glasgow hosts a benefit concert for tsunami victims with 10, 000 tickets available, featuring acts including Franz Ferdinand, Belle and Sebastian and Travis.", "The concert is taking place on the same night as a Cardiff gig starring Eric Clapton, Keane, Jools Holland, Massive Attack and Portishead sharing a stage for the first time in Bristol.", "Colin MacIntyre of Mull Historical Society played another gig in Cardiff but was determined to make the Glasgow benefit."], "qwen2.5:1.5b": ["Scottish music stars participate in tsunami benefit concert, selling out tickets within hours and raising £250, 000 for Asian tsunami victims on the same night as a Bristol show featuring Massive Attack and Portishead."], "qwen2.5:3b": ["Glasgow hosts a benefit concert featuring top Scottish acts including Franz Ferdinand, Belle and Sebastian, Travis, Mull Historical Society, Deacon Blue, Idlewild, Texas, Mogwai, Teenage Fanclub for tsunami relief.", "All 10,000 tickets sold out within 36 hours.", "The event aims to raise at least £250,000.", "Similar benefit gigs took place in Cardiff and Bristol raising over £1.25m and featuring Massive Attack and Portishead respectively.", "Colin MacIntyre from Mull Historical Society participated due to shared emotional impact of the disaster."], "opencoder:1.5b": ["Glasgow hosts tsunami benefit gig\n\nThe top names in Scotland are taking part in a benefit concert in aid of the victims of the Asian tsunami.", "Franz Ferdinand, Belle and Sebastian and Travis at Glasgow's SECC sold out in 36 hours.", "Mull Historical Society, Deacon Blue, Idlewild, Texas, Mogwai and Teenage Fanclub are among the other acts performing at the concert.", "Organisers hope to raise at least £250,000 from the show.", "It follows a Cardiff gig starring Eric Clapton, Keane and Jools Holland, which raised more than £1.25m.", "And it is taking place on the same night as a tsunami benefit show in Bristol, which will see Massive Attack and Portishead share a stage for the first time.", "Colin MacIntyre, of Mull Historical Society, was playing another gig on the same day but said he was determined to make the Glasgow benefit.", "He said: \"I think we were all affected by seeing the reports coming from the Far East.", "We all know somebody who was there, but more than that it was that we had never seen a wave of destruction, a natural disaster, like this in my generation.", "I'm lucky as an artist to be able to perform at something like this.", "\"."], "smollm:1.7b": ["The top names in Scottish music are taking part in a benefit concert in aid of the victims of the Asian tsunami.", "The event is expected to raise at least £250,000 from the show.", "Organisers hope to raise more than £250,000 from the concert, which will be performed on the same night as a tsunami benefit show in Bristol.", "The two events are taking place simultaneously and will feature multiple acts performing together.", "The top names in Scottish music are taking part in a benefit concert in aid of the victims of the Asian tsunami.", "The event is expected to raise at least £250,000 from the show.", "Organisers hope to raise more than £250,000 from the concert, which will be performed on the same night as a tsunami benefit show in Bristol.", "The two events are taking place simultaneously and will feature multiple acts performing together.", "The top names in Scottish music are taking part in a benefit concert in aid of the victims of the Asian tsunami.", "The event is expected to raise at least £250,000 from the show.", "Organisers hope to raise more than £250,000 from the concert, which will be performed on the same night as a tsunami benefit show in Bristol.", "The two events are taking place simultaneously and will feature multiple acts performing together.", "The top names in Scottish music are taking part in a benefit concert in aid of the victims of the Asian tsunami.", "The event is expected to raise at least £250,000 from the show.", "Organisers hope to raise more than £250,000 from the concert, which will be performed on the same night as a tsunami benefit show in Bristol.", "The two events are taking place simultaneously and will feature multiple acts performing together."], "deepseek-r1:1.5b": ["Glasgow is hosting a tsunami benefit concert for Scottish music stars, with performances featuring Franz Ferdinand, Belle, Sebastian, Travis, Mull Historical Society, Deacon Blue, Idlewild, Texas, Mogwai, and Teenage Fanclub.", "All 10,000 tickets sold out in just 36 hours, aiming to raise £250,000.", "It's also the same night as a Bristol tsunami benefit show featuring Massive Attack and Portishead for the first time.", "Colin MacIntyre of Mull Historical Society is performing on Friday but has high hopes of making Glasgow's event a success, influenced by the tragic nature of the Asian tsunami."], "tinyllama:1.1b": ["Glasgow hosts a benefit concert featuring top names in Scottish music, including Franz Ferdinand, Belle and Sebastian, Travis, Mulli Historical Society (MHS), Deacon Blue, Idlewið, Texas, Moogwai & Teena Ge FaNCubo.", "The show is part of the ongoing fundraising effort for victims of the Asian tsunaim disaster.", "MHS will perform in tandem with other notable artists such as Eric Clapton, Keane, Joools Holland, and Portishead.", "The Glasgow benefit is taking place on the same night as a Bristol show that saw Massive Attack and Portishead share a stage for the first time.", "MHS member Colin MacIntyre said he wanted to make the Scottish event and was determined to ensure it went well despite the natural disaster in Japan.", "He shared his thoughts about witnessing the aftermath of the disaster, saying \"I feel lucky as an artist because we can perform, but I'm also lucky that my family is safe.\""], "tinydolphin:1.1b": [" The tsunami benefit gig in Glasgow is being hosted by the top names in Scottish music, including Franz Ferdinand, Belle and Sebastian, Travis, Mogwai, and Teenage Fanclub.", "The event will take place on Saturday, February 10th, and tickets have already sold out in just three days.", "Organizers hope to raise at least £250,000 from the show, with an additional benefit concert taking place in Bristol on the same night featuring Massive Attack and Portishead.", "Colin MacIntyre of Mull Historical Society was playing another gig on February 1st but felt compelled to participate in the Glasgow benefit due to the devastation caused by the tsunami.", "He emphasized that he hopes others will join him, noting that it's \"not just about saving money for the charity, but also showcasing our talent and unity in this situation.\""], "phi:2.7b": [" A benefit concert in Glasgow featuring top Scottish musicians is taking place to raise funds for tsunami victims, following successful charity events in Cardiff and Bristol.", "The show aims to raise at least £250,000."], "orca-mini:3b": [" Glasgow hosts tsunami benefit gig featuring Franz Ferdinand, Belle and Sebastian, and Travis, with support from Scottish music legends like Mull Historical Society, Deacon Blue, Idlewild, Texas, Mogwai, and Teenage Fanclub.", "The event aims to raise at least £250,000 and follows a Cardiff gig featuring Eric Clapton, Keane, and Jools Holland which raised more than £1.25m.", "It is taking place on the same night as a tsunami benefit show in Bristol."], "hermes3:3b": [" Scottish music benefit concert in Glasgow for tsunami victims, featuring top artists; aims to raise £250k."], "stablelm-zephyr:3b": ["A benefit concert in Glasgow featuring top Scottish acts such as Franz Ferdinand, Belle and Sebastian, Travis, Mull Historical Society, Deacon Blue, Idlewild, Texas, Mogwai, and Teenage Fanclub raised £250,000 for the victims of the Asian tsunami.", "The event sold out with 10,000 tickets in 36 hours.", "It took place on the same night as a tsunami benefit show in Bristol featuring Massive Attack and Portishead.", "All artists expressed their determination to support the cause, highlighting the impact of the disaster on their generation."], "chatgpt-4o-latest": ["Scottish musicians, including Franz Ferdinand, Belle and Sebastian, and Travis, are performing at a sold-out benefit concert in Glasgow's SECC to aid Asian tsunami victims.", "Other acts include Mull Historical Society, Deacon Blue, Idlewild, Texas, Mogwai, and Teenage Fanclub.", "Organizers aim to raise at least £250,000.", "The event follows a Cardiff concert featuring Eric Clapton and coincides with a Bristol benefit show with Massive Attack and Portishead.", "Colin MacIntyre of Mull Historical Society emphasized the disaster's impact and the importance of contributing through music."], "stablelm2:1.6b": ["Glasgow will host a benefit concert for Asian tsunami victims featuring top Scottish musicians such as Franz Ferdinand, Belle & Sebastian, and Travis at Glasgow's SECC.", "The event sold out within hours, with proceeds going towards raising funds.", "Among other acts performing are Mull Historical Society, Deacon Blue, Idlewild, Texas, Mogwai, and Teenage Fanclub.", "This follows a Cardiff gig that raised over £1 million for tsunami relief efforts."], "granite3.1-dense:2b": ["Scottish musicians Franz Ferdinand, Belle and Sebastian, Travis, Mull Historical Society, Deacon Blue, Idlewild, Texas, Mogwai, and Teenage Fanclub are performing a benefit concert in Glasgow's SECC on Saturday.", "All 10,000 tickets were sold out within 36 hours.", "The event aims to raise £250,000 for Asian tsunami victims.", "This concert follows a Cardiff gig that raised over £1.25 million and coincides with another show in Bristol, featuring Massive Attack and Portishead.", "Colin MacIntyre of Mull Historical Society, despite having an earlier engagement on the same day, decided to participate due to his connection to those affected by the tsunami."]}