{"raw_text": "Wal-Mart is sued over rude lyrics\n \n The parents of a 13-year-old girl are suing US supermarket giant Wal-Mart over a CD by rock group Evanescence that contains swear words.\n \n The lawsuit, filed in Washington County, alleges Wal-Mart deceived customers by not putting warning labels on the cover. Trevin Skeens alleges Wal-Mart knew of the offending word because it had censored it on its music sales website. Wal-Mart said it was investigating the claims but had no plans to pull the CD. Wal-Mart has a policy of not stocking CDs which carry parental advisory labels. Mr Skeens said he bought the Anywhere But Home CD for his daughter and was shocked to hear the swearing when it was played in their car.\n \n \"I don't want any other families to get this, expecting it to be clean. It needs to be removed from the shelves to prevent other children from hearing it,\" said Mr Skeens of Brownsville. The lawsuit seeks to force Wal-Mart to censor the music or remove it from its stores in Maryland. It also seeks damages of up to $74,500 (£38,660) for every customer who bought the CD at Maryland Wal-Marts, and also naming record label Wind-Up Records and distributor BMG Entertainment in the legal action. \"While Wal-Mart sets high standards, it would not be possible to eliminate every image, word or topic that an individual might find objectionable,\" Wal-Mart spokesman Guy Whitcomb told the Herald-Mail of Hagerstown.\n", "llama3.2:1b": ["Wal-Mart is sued by a 13-year-old girl's parents over lyrics in Evanescence's \"Anywhere But Home\" CD, which they claim were censored on the company's website.", "The lawsuit alleges that Wal-Mart knew about the word and failed to label the CD properly, despite having a policy against CDs with parental advisory labels."], "llama3.2:3b": ["Parents of a 13-year-old girl sue Wal-Mart over Evanescence CD with swear words, alleging they were deceived by lack of warning labels, with lawsuit seeking removal from shelves and damages for customers who bought the CD in Maryland."], "gemma2:2b": ["Parents are suing Walmart for allegedly deceiving customers by selling a CD with offensive lyrics despite warnings about parental advisory content on its website.", "The lawsuit demands the removal of the CD from stores or a censorship order and seeks damages from all who purchased the album at Maryland Walmart locations."], "qwen2.5:0.5b": ["A 13-year-old girl's parents sued Walmart for allegedly covering up a CD with \"Rage\" by Evanescence that contains swearing lyrics.", "The lawsuit claims Walmart deceived customers and had no plans to remove the CD.", "Wal-Mart denies its claims and has a policy not stocking CDs with parental advisory labels.", "The CD, which Carola bought for her daughter, was sold at Maryland stores but is still available online."], "qwen2.5:1.5b": ["A lawsuit has been filed against Wal-Mart over a CD containing crude lyrics by Evanescence, alleging the retailer failed to properly warn customers about the offensive content.", "The parents claim this violated their rights and demand that Wal-Mart either remove or censor the offending songs or cease selling them entirely."], "qwen2.5:3b": ["Wal-Mart is sued over a CD by rock group Evanescence with swear words after its 13-year-old customer's parents bought it for their daughter and heard offensive language when playing in the car.", "The lawsuit alleges Wal-Mart failed to put warning labels on the cover, as they had censored it online previously.", "The plaintiff seeks removal of the CD from stores and potential damages.", "Wal-Mart has a policy against stocking parental advisory CDs but disagrees with the claims and intends to continue selling the product.", "The suit also names record label Wind-Up Records and distributor BMG Entertainment."], "opencoder:1.5b": ["Wal-Mart is sued over inappropriate content on its CD by a rock group known as Evanescence.", "The lawsuit alleges that Wal-Mart misled customers into posting inappropriate language or words, which is censored on their music sales website.", "The complainant bought the Anywhere But Home CD for his daughter and was shocked to hear the offending words in their car.", "However, it did not affect the investigation by Wal-Mart.", "Despite significant damage from customer dissatisfaction, lawsuits range from $74,500 to several billions if not a few trillions depending on the extent of the misuse.", "The lawsuits also involved names such as Wind-Up Records and distributor BMG Entertainment."], "smollm:1.7b": ["The parents of a 13-year-old girl sue US supermarket giant Wal-Mart over a CD by rock band Evanescence that contains swear words.", "The lawsuit, filed in Washington County alleges Wal-Mart deceived customers by not putting warning labels on the cover.", "Trevin Skeens alleges Wal-Mart knew of the offending word because it had censored it on its music sales website.", "Wal-Mart said it was investigating the claims but had no plans to pull the CD.", "Wal-Mart has a policy of not stocking CDs which carry parental advisory labels.", "Mr Skeens said he bought the Anywhere But Home CD for his daughter and was shocked to hear the swearing when it was played in their car.", "The lawsuit seeks to force Wal-Mart to censor the music or remove it from its stores in Maryland.", "It also seeks damages of up to $74,500 (£38,660) for every customer who bought the CD at Maryland Wal-Marts, and also naming record label Wind-Up Records and distributor BMG Entertainment in the legal action.", "\"While Wal-Mart sets high standards, it would not be possible to eliminate every image, word or topic that an individual might find objectionable,\" Wal-Mart spokesman Guy Whitcomb told the Herald-Mail of Hagerstown."], "deepseek-r1:1.5b": ["The parents of a 13-year-old girl are suing Wal-Mart over a CD by Evanescence containing swear words.", "They claim the CD containsuvad labels on its cover, which Wal-Mart asserts aren’t present.", "The lawsuit alleges that they knew about the offending word due to it being censored on their music sales website.", "Wal-Mart states it investigates claims but hasn't pulled the CD.", "The policy prohibits CDs with parental advisory labels from selling, and the parents bought the CD for their daughter.", "They are seeking damages for affected customers and names of Wind-Up Records and BMG Entertainment.", "Wal-Mart's spokesman warns that eliminating every objectionable image is impossible."], "tinyllama:1.1b": ["Wal-Mart is sued over offending lyrics on CD by EvaNescence, claiming that the retail giant deceived customers by not putting warning labels on its cover despite censoring certain words.", "The lawsuit alleges Wal-Mart knew of the offending word because it had removed it from its music sales website, and they are seeking to pull the controversial CD from Maryland stores.", "The legal action seeks $74,500 in damages for each customer who boughed the CD and names both Wal-Mart and record label Wind-Up Records and distributor BMG Entertainment as defendants."], "tinydolphin:1.1b": [" The lawsuit involves Evanescence's CD Anywhere But Home, which contains swear words on its cover and is meant for adults.", "Parents claim that Wal-Mart deceived customers by not displaying warning labels on the CD's cover.", "The lawsuit alleges that Wal-Mart knew of the offending word because it had censored it on its music sales website.", "In response, Wal-Mart stated that they have a policy against stocking CDs which contain parental advisory labels.", "This case is being investigated by Wal-Mart's legal team and could potentially lead to the removal of the offending song from shelves in Maryland stores."], "phi:2.7b": [" Parents are suing Wal-Mart over a rock group's CD which contains swear words, claiming they were deceived by the absence of warning labels on its cover.", "The lawsuit also seeks to have the CD censored or removed from stores in Maryland and demands compensation for other customers who bought it at Wal-Marts."], "orca-mini:3b": [" Wal-Mart is being sued by parents who allege they were shocked to hear swearing when their daughter listened to a CD by rock group Evanescence.", "The lawsuit claims that Wal-Mart knew of the offending word but failed to put warning labels on the cover.", "Wal-Mart has a policy of not stocking CDs with parental advisory labels, but the lawsuit seeks to force the company to censor the music or remove it from its stores in Maryland.", "The suit also names record label Wind-Up Records and distributor BMG Entertainment."], "hermes3:3b": ["Wal-Mart sued over Evanescence CD with swear words, parental advisory lack."], "stablelm-zephyr:3b": ["Parents of a 13-year-old girl are suing Wal-Mart for selling Evanescence's CD \"Anywhere But Home\" containing swear words, claiming deception without warning labels.", "Wal-Mart says it is investigating and has no plans to pull the CD.", "The lawsuit seeks either censoring the music or removal from stores, as well as damages for customers who bought it at Maryland Wal-Marts and naming record label Wind-Up Records and distributor BMG Entertainment in the legal action."], "chatgpt-4o-latest": ["The parents of a 13-year-old girl are suing Wal-Mart for selling an Evanescence CD with swear words without a warning label.", "The lawsuit claims Wal-Mart deceived customers, as it had censored the lyrics on its website but did not label the physical CD.", "Wal-Mart, which has a policy against stocking CDs with parental advisory labels, is investigating but has no plans to remove the album.", "The lawsuit seeks to force Wal-Mart to censor or remove the CD in Maryland and demands up to $74,500 in damages per customer.", "The record label and distributor are also named in the suit.", "A Wal-Mart spokesman stated that the company cannot eliminate all content that some may find objectionable."], "stablelm2:1.6b": ["US supermarket giant Wal-Mart is being sued by the parents of a 5-year-old girl for stocking a CD by rock group Evanescence with swear words, despite having censored it on its music sales website.", "The lawsuit alleges that Wal-Mart deceived customers by not putting warning labels on the cover and seeks to force Wal-Mart to censor or remove the music from its stores in Maryland.", "In addition to seeking damages of up to $1 million (approximately £100,0 \"It needs to be removed from the shelves to prevent other children from hearing it,\" said Mr Skeens of Brownsville."], "granite3.1-dense:2b": ["Parents of a 13-year-old girl are suing Wal-Mart over Evanescence's CD, \"Anywhere But Home,\" which includes swear words and lacks parental advisory labels.", "The father, Trevin Skeens, claims Wal-Mart was aware of the profanity as they censored it on their music sales website but failed to warn customers.", "Wal-Mart has not removed the CD from its Maryland stores or altered its content.", "The lawsuit, filed in Washington County, seeks damages up to $74,500 per customer and demands Wal-Mart censor the music or remove it from shelves to prevent other children from hearing the offensive content.", "The suit also names record label Wind-Up Records and distributor BMG Entertainment.", "Wal-Mart maintains a policy of not stocking parental advisory-labeled CDs but acknowledges high standards are difficult to achieve in eliminating objectionable content."]}