{"raw_text": "Pete Doherty misses bail deadline\n \n Singer Pete Doherty will have to spend the weekend in jail because he could not come up with £150,000 bond money for his bail on time.\n \n The former Libertines singer had been granted bail with curfew restrictions at Highbury Corner Magistrates Court on charges of robbery and blackmail. But his lawyer said the money could not be raised on time. Mr Doherty, 25, was arrested following an alleged incident in a London hotel on Wednesday evening. Musician Alan Wass, 23, also of north London, appeared in court accused of the same offences.\n \n Magistrates imposed a range of bail conditions on Mr Doherty including a curfew between 2200 and 0700, except when he attends a drug rehabilitation centre. He was told he would not be able to leave his home without being accompanied by a security firm. He must also surrender his passport and report daily to a local police station. Mr Wass was also given a curfew and told to surrender his passport. Mr Doherty left The Libertines at the end of June 2004, but continued performing with his band Babyshambles. The singer, who has been linked to supermodel Kate Moss, was arrested after police were called to the Islington hotel in response to claims that a man had been assaulted. A man in his 30s was later taken to University College Hospital, London, with facial injuries, before being discharged. A lawyer representing Mr Doherty and Mr Wass said outside court the pair strenuously denied the charges.\n", "llama3.2:1b": ["Pete Doherty missed bail deadline due to inability to raise £150,000 bond money on time.", "He had been granted bail with curfew restrictions at Highbury Corner Magistrates Court for robbery and blackmail charges, but his lawyer said he could not come up with the required funds within the timeframe."], "llama3.2:3b": ["Pete Doherty missed his £150,000 bail deadline, resulting in a weekend stay in jail due to charges of robbery and blackmail.", "He was granted bail with restrictions including curfew, home confinement without accompaniment, passport surrender, and daily police reporting.", "Musician Alan Wass also appeared in court charged with the same offences."], "gemma2:2b": ["Pete Doherty missed the deadline for posting bail money, resulting in a weekend jail sentence.", "He was arrested on robbery and blackmail charges following an alleged incident at a London hotel.", "His lawyer cited difficulties raising the £150,000 bond.", "Mr. Doherty's bail conditions included a curfew, surrendering his passport, and reporting daily to a police station.", "Alan Wass, also facing similar charges, was granted similar bail conditions.", "Both deny the allegations."], "qwen2.5:0.5b": ["Pete Doherty faces a bail deadline of next weekend due to missing £150, 000 in bond money for his bail.", "He had been granted bail with curfew restrictions at Highbury Corner Magistrates Court on charges of robbery and blackmail but could not come up with the funds before the weekend.", "Mr Doherty is also under criminal investigation for attempted assault of a man in London hotel, while Alan Wass faces charges of robbery and blackmail."], "qwen2.5:1.5b": ["Pete Doherty, formerly of Libertines, faces £150, 000 bond money for bail as he fails to meet deadline.", "Arrested after alleged incident in hotel.", "Bails imposed including curfew and passport surrender with security presence.", "Linked to supermodel Kate Moss."], "qwen2.5:3b": ["Pete Doherty missed bail deadline for robbery and blackmail charges due to inability to provide £150,000 bond money.", "Former Libertines singer faces curfew restrictions including 2200-0700 hours except when attending a drug rehab centre.", "He must also surrender his passport and report daily to a police station.", "Doherty was arrested following an alleged assault in a London hotel incident where another man sustained facial injuries.", "His lawyer stated that the pair denies the charges."], "opencoder:1.5b": ["Pete Doherty will have to spend the weekend in jail because he could not come up with £150,000 bond money for his bail on time.", "The former Libertines singer had been granted bail with curfew restrictions at Highbury Corner Magistrates Court on charges of robbery and blackmail.", "Mr Doherty was stopped after an alleged incident in a London hotel on Wednesday evening.", "Musician Alan Wass, 23, also attended court accused of the same offences.", "Magistrate Issyko provided a range of bail conditions including a curfew between 2,200 and 7,000 except when he attends a drug rehabilitation centre.", "He was told he would not be able to leave his home without being accompanied by a security firm.", "He must also surrender his passport and report daily to a local police station.", "Mr Wass, 23, also had a curfew and told him to surrender his passport.", "Mr Doherty left The Libertines at the end of June 2004, but continued playing with his band Babyshambles.", "The singer, who is linked to supermodel Kate Moss, was arrested after beingCalled in response to claims that a man had been assaulted.", "A man from his 30s was later taken to University College Hospital, London, with facial injuries and he was discharged."], "smollm:1.7b": ["Pete Doherty misses bail deadline because he could not come up with £150,000 bond money for his bail on time.", "The former Libertines singer had been granted bail with curfew restrictions at Highbury Corner Magistrates Court on charges of robbery and blackmail.", "But his lawyer said the money could not be raised on time.", "Mr Doherty, 25, was arrested following an alleged incident in a London hotel on Wednesday evening.", "Musician Alan Wass, 23, also of north London, appeared in court accused of the same offences.", "Magistrates imposed a range of bail conditions on Mr Doherty including a curfew between 2200 and 0700, except when he attends a drug rehabilitation centre.", "He was told he would not be able to leave his home without being accompanied by a security firm.", "He must also surrender his passport and report daily to a local police station.", "Mr Wass was also given a curfew and told to surrender his passport.", "Mr Doherty left The Libertines at the end of June 2004, but continued performing with his band Babyshambles.", "The singer, who has been linked to supermodel Kate Moss, was arrested after police were called to the Islington hotel in response to claims that a man had been assaulted.", "A man in his 30s was later taken to University College Hospital, London, with facial injuries, before being discharged.", "A lawyer representing Mr Doherty and Mr Wass said outside court the pair strenuously denied the charges."], "deepseek-r1:1.5b": ["Pete Doherty will spend the weekend in jail due to missing £150,000 bond money for bail.", "He was granted bail at Highbury Corner Magistrates Court but faced failure to raise funds on time.", "Both he and his brother Alan Wass were charged with robbery and blackmail, each receiving curfew restrictions without leaving their homes or entering a drug rehab center unless specified otherwise.", "Doherty continued performing after leaving The Libertines, while his brother was arrested for assault at an Islington hotel."], "tinyllama:1.1b": ["Pete Doherty is missing bail deadline due to failure to submit $150,000 bond money on time for robbery and blackmail charges.", "His lawyer claimed that the amount could not be raised by the curfew restrictions imposed at Highbury Corners Magistrates Court.", "In addition, Mr Doherty's musician friend Alan Wass also appeared in court facing similar charges and was given a range of bail conditions including a curfew between 2200 and 0700, excused except when attending drug rehabiliation centre.", "The duo was both ordered to surrender their passports upon entering the local police station daily.", "Mr Doherty left The Libertines in June 2004, but has been linked to supermodel Kate Moshbale.", "The singer, who had been arrested after an alleged incident at a London hotel, claimed the charges against him were unfounded.", "A man in his 30s was later taken to hospital with injuries before being discharged."], "tinydolphin:1.1b": [" In summary, the text is about Pete Doherty missing his bail deadline due to not having enough money to post a $150,000 bond for his release from jail.", "He had been charged with robbery and blackmail, and was arrested after an incident in London.", "His lawyer claims that funds cannot be raised in time, so his bail has been denied.", "The two suspects are Alan Wass, 23, and Babyshambles frontman Pete Doherty."], "phi:2.7b": [" Pete Doherty missed his bail deadline for robbery and blackmail in London.", "He could not raise the necessary £150,000 bond money on time, resulting in him spending the weekend in jail with curfew restrictions at Highbury Corner Magistrates Court.", "A man named Alan Wass was also arrested for the same offences.", "Mr Doherty's lawyer said he had been trying to raise the bond funds but was unsuccessful."], "orca-mini:3b": [" Pete Doherty missed the bail deadline and will spend the weekend in jail for failing to come up with £150,000 bond money.", "He had been granted bail with curfew restrictions but could not raise the bond amount on time.", "The singer was arrested following an alleged incident in a London hotel and his lawyer said the money could not be raised on time.", "A man in his 30s was later taken to University College Hospital, London, with facial injuries before being discharged.", "Both Doherty and Wass deny the charges."], "hermes3:3b": ["Pete Doherty fails to provide £150k bail, spends weekend in jail."], "stablelm-zephyr:3b": ["Singer Pete Doherty faces spending weekend in jail due to missing the bail deadline.", "He was granted bail with curfew restrictions at Highbury Corner Magistrates Court for charges of robbery and blackmail.", "His lawyer informed that raising £150,000 on time wasn't possible.", "Pete Doherty, 25, was arrested after an incident in a London hotel involving musician Alan Wass, 23, also accused of the same offences.", "Both Doherty and Wass deny the allegations."], "chatgpt-4o-latest": ["Pete Doherty will spend the weekend in jail after failing to raise £150,000 bail on time.", "The former Libertines singer was granted bail with curfew restrictions on charges of robbery and blackmail but could not meet the financial requirement.", "Doherty, 25, and musician Alan Wass, 23, were arrested following an alleged incident at a London hotel.", "Bail conditions included a curfew, passport surrender, and security firm accompaniment.", "Doherty, linked to Kate Moss, was arrested after police responded to an assault claim.", "Both men deny the charges."], "stablelm2:1.6b": ["Pete Doherty cannot pay bail bond, so he will spend a weekend in jail.", "He missed his deadline for £x bond money while facing robbery and blackmail charges at Highbury Corner Magistrates Court.", "His lawyer could not raise enough cash.", "Bail conditions include wearing an electronic tag with exceptions when attending drug rehab center; surrendering passport without needing security firm's help; and reporting daily to a local police station.", "Alan Wass, a musician also facing the same charges, was given similar bail conditions.", "Doherty left his band after June 4 but continued performing; Kate Moss is linked to him.", "Both deny the accusations."], "granite3.1-dense:2b": ["Pete Doherty, former Libertines singer (25), missed his bail deadline of £150,000 due to unmet financial requirements.", "He was arrested in London for alleged robbery and blackmail following an incident at a hotel on Wednesday evening.", "Accomplice Alan Wass, 23, also faced similar charges.", "The court imposed stringent bail conditions on Doherty: curfew between 10 PM and 7 AM, except for drug rehab attendance; daily police station visits with security escort; and passport surrender.", "Mr Wass received equivalent restrictions.", "Both men deny the accusations.", "The incident led to a man in his 30s being taken to hospital with facial injuries, later discharged."]}