{"raw_text": "Franz man seeks government help\n \n Franz Ferdinand frontman Alex Kapranos has called for more government help for musicians, while taking part in an Edinburgh Lectures discussion.\n \n \"For any cultural output to thrive there needs to be some kind of state input to that as well,\" he said. But Kapranos warned against musicians being too closely linked with MPs, at the University of Edinburgh event. \"I think the role of musicians is to question politicians rather than to go to bed with them,\" he said.\n \n Kapranos joined the prestigious lecture series to discuss Scotland's role in making 21st Century music. \"There are elements of our musical output which require sustenance because they aren't self-sufficient,\" he said. \"But so-called commercial music would benefit from investment as well.\" He warned musicians against being allied to a particular party, however. \"I don't know if having tea with politicians is always a good idea.\"\n \n Kapranos and his Glasgow four-piece band have been nominated for five prizes at next week's Brit Awards, including best group and best album. Their self-titled debut album won last year's Mercury Music Prize and spawned three top 20 singles. He told the 300-strong audience at the University's Reid Hall that musicians should listen to a wide range of music and should not be restricted by stereotypes. \"We say 'I like this'. Because I listen to Nirvana and Korn I am a troubled individual, I'm riddled with angst because I listen to Chopin and Debussy, I listen to Kylie Minogue and Scissor Sisters because I'm upbeat and I like to party, I listen to Wagner because I like the smell of napalm in the morning.\" Kapranos said there was a general \"hostility\" towards classical music, adding: \"There is very little done to break that hostility other than Classic FM.\"\n \n He concluded: \"We define ourselves as a nation by the way we encourage our creativity.\" Fellow speaker and classical composer James MacMillan agreed: \"We need to rediscover our ability to listen.\" Previous speakers at the Edinburgh Lectures series have included former Soviet leader Mikhail Gorbachev and author Professor Stephen Hawking. Kapranos described his appearance on Wednesday as \"more daunting by a long way\" than their upcoming Brits performance. \"I don't really care about the Brits,\" he said. \"It's going to be great to go down but I have actually had to exercise part of my brain tonight.\"\n \n I think the government should do more to help up-and-coming artists be discovered by scrapping the entertainment licences for live venues. Also they should do more to help independent record labels have a louder voice within an industry dominated by commercialised major labels.\n \n Rather than expecting the government - i.e. the taxpayer - to fork out, why don't some of the megastars put something back in? Some of Britain's wealthiest people are musicians who have raked it in from albums, concerts etc. There are far more important demands on government funds.\n \n If they can fund football, why not fund music?\n \n Areas of the arts are funded by government and lottery grants, so why not music? We already have the opera receiving huge grants and it would clearly be beneficial for diversity in music to have the same opportunities in other areas of the music. The only problem would be how to judge what merits state cash.\n \n The government has enough problems funding schools and health services. If Alex Kapranos genuinely thinks a multi-billion pound industry should also have government funding then his own education was seriously lacking and more money should be put into that.\n \n As a Scot living in England, I appreciate the value of Scottish music and culture being a success, so I can see no problem with it! Franz Ferdinand, Travis and Snow Patrol are just recent examples of the success Scottish music can have in the world, so we should do what we Scots are good at and support our own goods!\n \n I think the issue is more fundamental: should the government be spending money on subsidising a multi-million pound industry when health and education are in such a sorry state? The answer is most definitely no. Those people who are lucky enough to pursue their passion to get their pay cheque shouldn't be looking for government subsidies. I know that if I was lucky enough to be able to pursue my dream of show jumping I would want to finance myself until I was in a position to pursue corporate sponsorship.\n \n Yes the government should fund music - it brings joy to the masses.\n \n There are already thousands of state-funded musicians out there sitting around, twiddling their thumbs on the \"new deal\". Getting the government even more involved would only waste money that could be put to better use.\n \n As long as the Government was funding real talent it would be a great move. I would hate to see more Pop Idol-type funding of music though, as it would only serve to reinforce the stereotypes that Alex talked about.\n \n Only if the proposals make financial sense. Franz Ferdinand must be paying serious amounts of tax on their record sales - if they'd had a government grant to get started they'd have more than paid it back by now, so the Treasury would be making far more than it paid out. However, the government has better things to spend its money on than to give charity to everyone who decides they're a musician. The government shouldn't \"fund\" music - it should \"invest\" in music and those investments should be treated like any other investment.\n \n I think the government needs to provide facilities and for young groups and bands to form and practise. The equipment is not cheap and can be well beyond the means of many people. However, I do feel this should be the extent of their role, to provide the conditions for the talent to flourish and let it go from there.\n \n I do agree that the government should help to fund music but there is also a responsibility held by record companies! They generally always opt for the tried and tested and tend not to want to break any moulds or risk losing any money which ultimately, the directors are in the business for! If labels were more willing to put money forward towards smaller breakthrough acts then the government wouldn't have to fork out a great deal.\n \n Yeah, why not? Music should be government funded, particularly the work of modern composers and veteran bands/artists and stuff. Pop music pretty much rules the earth, so more attention should go to the other fraternities\n \n I agree with funding the arts to make it more accessible to the public but I am not convinced that pop music requires financial support from the taxpayer. There is a great deal of money generated through pop music - perhaps a tax on pop could be ploughed into the public performance of other forms of music for everyone to enjoy. Perhaps we could financially penalise really bad Pop Idol-style music - that is, the music industry sector without any artistic merit or originality whatsoever and that which is specifically designed to line the pockets of music producers. Call it a tax on music \"pollution\", if you like.\n \n Though I really like Franz Ferdinand, I have to disagree with Mr Kapranos. Once government gets their hand into the private sector, it will destroy the creative and possibly controversial avenues the artist pursues. Many years ago, this was the case with the US NEA, when the government started to question what was considered art for the money they were allotting. The solution Mr Kapranos should pursue would be privately-funded organizations, like Save the Music in the US.\n", "llama3.2:1b": ["Franz Ferdinand's Alex Kapranos calls for more government help for musicians, saying they need state input to create a thriving music industry.", "He warns against being too closely linked with politicians and advises not to invest in commercial music that benefits big labels over independent artists.", "Kapranos joins a lecture series on Scotland's role in making 21st-century music at the University of Edinburgh, where he discusses the importance of investment in music education and support for up-and-coming bands."], "llama3.2:3b": ["Franz Ferdinand frontman Alex Kapranos calls for more government help for musicians, citing a need for state input to support cultural output and questioning politicians rather than aligning with them.", "Kapranos believes that funding for independent record labels would benefit the industry as well.", "He argues that some megastars should also contribute to funding, as there are already funds available for other arts sectors like opera."], "gemma2:2b": ["Franz Ferdinand's Alex Kapranos advocates for increased government support for musicians, arguing that it is needed for their growth and success.", "He proposes scrapping entertainment licenses for live venues and increasing funding for independent record labels.", "He contends that government should focus on supporting emerging artists rather than subsidizing a large-scale industry like music."], "qwen2.5:0.5b": ["Franz Ferdinand, a musician, is calling on the government to provide more help and funding for Scottish musicians.", "He believes that the arts should be supported not through subsidies or tax breaks, but instead by private sector organizations such as music charities.", "Franz Ferdinand also criticizes traditional entertainment licensing regulations, arguing that they hinder the growth of independent record labels and the flourishing of Scottish music.", "He suggests that the government invest in funding for smaller breakthrough acts rather than funding major commercialized artists like Pop Idol-style music.", "He agrees with funding the arts to make them more accessible to the public, though he is not convinced that pop music requires financial support from the taxpayer and believes that a tax on pop could be used as a way to fund other forms of music for everyone to enjoy."], "qwen2.5:1.5b": ["Franz Ferdinand frontman Alex Kapranos calls for more government help for musicians, warning against too-close links with MPs and opposing party involvement.", "He advocates funding to benefit \"sustained\" music output and commercialized genres while criticizing hostility towards classical music.", "Kapranos is nominated for Brit Awards but disagrees with the Brits performance's daunting nature."], "qwen2.5:3b": ["Franz Ferdinand's Alex Kapranos advocates for more government support for musicians but also warns against musicians becoming too reliant on politicians.", "He suggests the state should provide resources to underfunded cultural outputs and supports independent record labels gaining a louder voice over major labels.", "However, he criticizes government funding of music as a multi-billion pound industry and argues that it would be better spent elsewhere.", "Kapranos also proposes providing facilities for young musicians to form and practice, emphasizing the need for investment rather than direct funding.", "He believes in private-sector support through organizations like Save the Music, rather than state-provided subsidies for music."], "opencoder:1.5b": ["Franz Ferdinand man seeks government help\n\nFranz Ferdinand, frontman Alex Kapranos has called for more government help for musicians, while taking part in an Edinburgh Lectures discussion.", "\"For any cultural output to thrive there needs to be some kind of state input to that as well,\" he said.", "But Kapranos warned against musicians being too closely linked with MPs, at the University of Edinburgh event.", "\"I think the role of musicians is to question politicians rather than to go to bed with them,\" he said.", "Kapranos joined the prestigious lecture series to discuss Scotland's role in making 21st Century music.", "\"There are elements of our musical output which require sustenance because they aren't self-sufficient,\" he said.", "\"But so-called commercial music would benefit from investment as well.\"", "He warned musicians against being allied to a particular party, however.", "\"I don't know if having tea with politicians is always a good idea.\"", "He told the 300-strong audience at the University's Reid Hall that musicians should listen to a wide range of music and should not be restricted by stereotypes.", "\"We say 'I like this'.", "Because I listen to Nirvana and Korn I am a troubled individual, I'm riddled with angst because I listen to Chopin and Debussy, I listen to Kylie Minogue and Scissor Sisters because I'm upbeat and I like to party, I listen to Wagner because I like the smell of napalm in the morning.\"", "Kapranos said there was a general \"hostility\" towards classical music, adding: \"There is very little done to break that hostility other than Classic FM.\"", "He concluded: \"We define ourselves as a nation by the way we encourage our creativity.\"", "Fellow speaker and classical composer James MacMillan agreed: \"We need to rediscover our ability to listen.\"", "Previous speakers at the Edinburgh Lectures series have included former Soviet leader Mikhail Gorbachev and author Professor Stephen Hawking.", "Kapranos described his appearance on Wednesday, 5 December 2021, 17:30 (UTC+1), as a man who has always sought out ideas from the heart.", "As long as the Government was funding real talent it would be a great move.", "I would hate to see more Pop Idol-type funding of music though, as it would only serve to reinforce the stereotypes that Alex talked about."], "smollm:1.7b": ["I agree that the government should provide funding for music education and support for musicians, but I think there are some important caveats to consider.", "While it's true that the music industry generates significant revenue, it also has a number of negative consequences that can be addressed through targeted funding initiatives.", "For example:\n\n1.", "**Taxation**: As you mentioned, taxing pop music could help fund public performances and support emerging artists who may not have access to traditional funding sources.", "2.", "**Creative freedom**: By providing funding for musicians, the government can help ensure that artists are able to pursue their creative vision without worrying about financial constraints.", "This is particularly important for artists who may be pushing boundaries or challenging societal norms through their work.", "3.", "**Reducing commercialization**: The music industry has become increasingly commercialized in recent years, which can lead to a lack of artistic integrity and a focus on profit over creativity.", "By providing funding for musicians, the government can help ensure that the music remains true to its artistic roots.", "4.", "**Supporting emerging artists**: Many emerging artists struggle to make ends meet, and funding can provide them with the resources they need to develop their craft and reach a wider audience.", "5.", "**Encouraging innovation**: By providing funding for musicians, the government can help encourage innovation in the music industry, which is essential for driving cultural progress and economic growth.", "That being said, there are also important considerations that should be taken into account when it comes to government funding of music:\n\n1.", "**Balancing public and private interests**: While the government has a role to play in supporting musicians, it's also important to ensure that this support is balanced with other public interests, such as ensuring that artists are not exploited or taken advantage of by wealthy benefactors.", "2.", "**Setting clear guidelines and criteria**: To avoid creating an uneven playing field, the government should establish clear guidelines and criteria for funding applications, including requirements around artistic merit, cultural significance, and community engagement.", "3.", "**Encouraging transparency and accountability**: The government should ensure that funding is used transparently and accountably, with clear lines of responsibility and mechanisms in place to monitor the impact of funding on the music industry.", "4.", "**Addressing issues of diversity and equity**: The government should take steps to address issues of diversity and equity within the music industry, including ensuring that funding is distributed fairly and that opportunities are available to underrepresented groups.", "5.", "**Monitoring and evaluating impact**: Finally, the government should establish mechanisms for monitoring and evaluating the impact of funding on the music industry, including tracking metrics such as artist development, audience engagement, and economic growth.", "Overall, while there are important caveats to consider, I believe that providing funding for musicians can be a valuable way to support the creative and cultural industries, while also promoting artistic innovation and community engagement."], "deepseek-r1:1.5b": ["Alex Kapranos advocates for musician and band leaders like himself to draw support from the government, particularly in the context of the Edinburgh Lectures event.", "He calls for musicians to link their creativity with politicians, avoiding party alignment, and emphasizes his career's diverse musical output.", "Kapranos discusses the role of musicians in cultural contributions, especially Scotland's work in 21st-century music.", "His debut album won a Mercury Music Prize, and he lists examples like his own music as indicators of creative output.", "He warns against being invested by stereotypes and advises against government funding solely for entertainment.", "However, Kapranos advocates for alternative funding models that recognize artistic merit, such as supporting independent record labels or scrapping entertainment licenses.", "He contrasts the UK's Big Bang projects with others funded through lottery grants but argues arts funding should be a broader investment strategy.", "He points out that the government currently spends too much on schools and health services, leaving little for arts, calling it \"fundamentally flawed\" to do so.", "Kapranos agrees, emphasizing financial investment in music rather than just tax."], "tinyllama:1.1b": ["Summary: Franz Ferdinand frontman Alex Kaprano is calling for more government help for musician's while warning against selling music as a means to an end.", "The Scottish star, who won the prestigious Rock or Bust award in Edinburgh, spoke about the government's role in supporting and funding music.", "He also criticized the idea of commercial music being self-sufficient and said it would benefit from having tea with politicians.", "In terms of the government helping musician's, Kaprano said they should listen to a wider range of music and not be restricted by specific genres.", "However, he acknowledged that there is also an issue of funding in the music industry.", "The author also expressed concerns over the idea of more taxpayer money being poured into pop music, as well as criticizing certain types of music like Pop Idol-style pop music that is designed to line the pockets of producers.", "The author also suggested that government should penalize bad pop music to encourage originality and to keep the creative and controversial avaruene of artists afloat."], "tinydolphin:1.1b": [" The musicians mentioned by Franz Ferdinand, Travis and Snow Patrol, are not just artists but also entrepreneurs, business owners, or even successful business people.", "Their music is a major source of revenue for these companies.", "Therefore, it doesn't make sense to think that the government should subsidize their work in any way.", "The money they receive from sales and streaming services goes directly into their pockets rather than being taxed by the government.", "This is why Franz Ferdinand, Travis, and Snow Patrol refuse to be part of any government-funded music initiatives.", "Instead, they believe that their success should be celebrated and rewarded through proper financial means."], "phi:2.7b": [" Franz Ferdinand frontman Alex Kapranos has called for more government help for musicians, while taking part in an Edinburgh Lectures discussion."], "orca-mini:3b": [" I'm sorry, but it seems that you have not provided a summary of the text or any key ideas or details.", "Please provide more information so I can assist you better."], "hermes3:3b": ["Franz Ferdinand's Alex Kapranos calls for government help for musicians and believes state input is necessary for cultural output to thrive."], "stablelm-zephyr:3b": ["Alex Kapranos, Franz Ferdinand frontman, called for government help for musicians during an Edinburgh Lectures discussion.", "He argued that for cultural output to thrive, there needs to be some kind of state input.", "Kapranos warned against musicians being too closely linked with politicians and suggested that a better approach would be privately-funded organizations, like Save the Music in the US.", "He expressed disagreement with the idea of government funding music, arguing that it might destroy creative and potentially controversial avenues pursued by artists."], "chatgpt-4o-latest": ["Franz Ferdinand frontman Alex Kapranos called for more government support for musicians during an Edinburgh Lectures discussion, arguing that cultural output needs state input.", "However, he cautioned against musicians becoming too closely aligned with politicians.", "Kapranos emphasized the need for investment in both commercial and non-commercial music and criticized the general hostility towards classical music.", "His remarks sparked debate, with some supporting government funding for music as it benefits culture and diversity, while others argued that taxpayer money should prioritize essential services like health and education.", "Some suggested alternative solutions, such as private funding or industry investment, while others proposed government support in the form of facilities and resources rather than direct subsidies.", "Critics warned that government involvement could stifle creativity, while supporters believed strategic investment could yield financial returns."], "stablelm2:1.6b": ["Alex Kapranos, lead singer of Franz Ferdinand, called for more government support for musicians during an Edinburgh Lecture discussion.", "He advocated state investment to encourage cultural output but cautioned against musicians being too closely linked with their MPs.", "Kapranos and his band have been nominated for five prizes at the upcoming Brit Awards, including best group and best album.", "Kapranos believes that music needs funding to thrive and encourages artists to question politicians rather than become too closely aligned with them.", "He expressed concerns about hostility towards classical music in society, despite efforts by Classic FM to counteract this.", "The speaker's panel also included James MacMillan, a composer who agreed that the UK government should help fund music.", "Kapranos argued that only if proposals make financial sense should the government invest in music; instead..\nhe suggested that record companies should be more willing to support breakthrough acts and less inclined towards breaking mold and losing money.", "He also believed that pop music required taxpayer funding since it generates a great deal of revenue.", "Despite his views on funding, Kapranos acknowledged that many years ago the US NEA destroyed creative avenues for artists when government started questioning what was considered art for the amount of money allocated.", "Therefore, he suggested privately-funded organizations like Save the Music in the US as alternatives to government involvement."], "granite3.1-dense:2b": ["Alex Kapranos, lead singer of Franz Ferdinand, advocated for increased government support for musicians during an Edinburgh Lectures discussion.", "He emphasized that state input is necessary for cultural output to thrive and highlighted that both independent and commercial music could benefit from investment.", "Kapranos urged caution against musicians becoming too closely associated with political parties, suggesting that their role should be questioning rather than allying themselves with specific party members.", "Kapranos also called for the government to eliminate entertainment licences for live venues and help independent record labels gain a stronger voice within an industry dominated by commercial majors.", "He believed that funding music could bring joy to people, but critics argued that the government should prioritize essential services like healthcare and education before allocating funds to the multi-billion-dollar music industry.", "Some participants supported government funding for music, provided it was targeted at real talent and not Pop Idol-style acts.", "They proposed treating such investments as any other business venture.", "Others suggested that the government should focus on providing facilities for young groups to form and practice, with minimal involvement beyond that point.", "A few participants emphasized the need for improved access to music resources for emerging artists due to high equipment costs.", "They argued that record labels have a responsibility in this regard, as they often favor established acts over nurturing new talent.", "Some proposed a tax on pop music to fund other forms of artistic expression.", "Ultimately, the consensus among participants was that while government funding for music should ideally be targeted and focused, it is generally supported, provided it targets real talent and avoids diluting creative avenues or fostering controversial content without artistic merit."]}