{"raw_text": "Glastonbury fans to get ID cards\n \n Fans who buy tickets for this year's Glastonbury festival will be issued with photo ID cards in an attempt to beat touts, it has been confirmed.\n \n The cards will include a photograph of the ticket-holder plus an electronic chip with their details to prevent tickets being sold on or forged. Tickets for the June event are expected to go on sale in April. \"There is only one place in the world where you will be able to get tickets,\" festival organiser Michael Eavis said. \"That will be the official source. If you get them anywhere else, you won't get in.\" Fans not wanting to carry the entrance card could present their passport or driving licence instead, he added.\n \n More than 153,000 people are expected to travel to Mr Eavis' Somerset farm from 24-26 June, but the event's rising popularity has meant an extremely high demand for tickets in recent years. When the ID card idea was floated, Mr Eavis' daughter Emily said it would be \"quite a big step in terms of ticketing for events\" if implemented and they were \"going as far as we can\" to cut touting. \"As long as it's approached in the right way, it might really work, it might really change the system,\" she said. In 2004, all 112,000 tickets for the public sold out in 24 hours. They were personalised with the names of purchasers, who were asked to bring identification, such as a driving licence, passport or household bill. But some forgot to take the right information while some touts simply offered to supply their own bills along with the ticket bearing their name. No details of this year's line-up have been confirmed but rumours have suggested U2 and Coldplay may be among the headliners.\n", "llama3.2:1b": ["Glastonbury fans will receive photo ID cards that include a photograph and an electronic chip with their details to prevent touting.", "Tickets for Glastonbury are expected in April, while the official source of tickets is the festival itself.", "Fans not wanting to carry a card can use a passport or driving licence instead."], "llama3.2:3b": ["Glastonbury festival fans will receive photo ID cards with electronic chips containing their details, aiming to combat touts, as tickets are expected to sell out in under 24 hours.", "The cards include a photograph of the ticket-holder and will be used at the official ticket sales source.", "Fans can also present an alternative form of identification."], "gemma2:2b": ["Glastonbury festival will issue photo ID cards to all ticket buyers to combat ticket touting.", "The cards include a photograph and an electronic chip, preventing unauthorized ticket resale or forgery.", "More than 153,000 people are expected at the June event, and this year's tickets will only be available through official channels."], "qwen2.5:0.5b": ["Fans buying Glastonbury tickets will get ID cards, which include a photograph plus an electronic chip to prevent forgery.", "More than 153,000 people are expected to travel, with the event's popularity leading to high demand for tickets.", "The organizers are considering implementing this idea if it's approached in the right way."], "qwen2.5:1.5b": ["Glastonbury festival fans will receive photo ID cards featuring a photograph of the holder and an electronic chip containing their information to prevent resale or forgery, with tickets available through official means beginning in April.", "Approximately 153,000 attendees expect to attend the event next month.", "The festival's popularity has led to increased demand for ticket sales."], "qwen2.5:3b": ["Glastonbury fans will receive photo ID cards for 2019 tickets to prevent touts and forgery.", "These cards include a photograph and electronic chip with details.", "Tickets are expected to go on sale in April, with only official sources providing them.", "Michael Eavis expects the festival's popularity to demand measures against ticket scalping.", "Last year, all 112,000 public tickets sold out within 24 hours due to personalised IDs requiring identification; this year, Emily Eavis suggests a broader approach including passports and driving licenses but may involve stricter enforcement.", "Details of this year’s lineup have not been confirmed but rumors include U2 and Coldplay as potential headliners."], "opencoder:1.5b": ["Glastonbury fans, get ID cards\n\nFans who buy tickets for this year's Glastonbury festival will receive photo ID cards to try to win them.", "The cards include a photograph of the ticket holder plus an electronic chip with their details to prevent sales on or during the process.", "Expected to be sold in April, the June event is expected to go on sale.", "\"There is only one place where you can get tickets,\" the festival organiser said.", "If not shown, your source for tickets won't attract you.", "Fans who don't want to carry an entrance card could present their passport or driving license instead, he added.", "The introduction of ID cards in the 2000s has sparked numerous interest from the general public.", "They seem to be using them as a means to boost sales and ensure their tickets are not compromised during sales.", "In recent years, there's been a surge in demand for this type of event, so it may well take place."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details:\n\n1.", "Glastonbury fans will get ID cards to beat touts.", "2.", "The ID card will include a photograph of the ticket-holder plus an electronic chip with their details.", "3.", "Tickets for the June event are expected to go on sale in April.", "4.", "There is only one place in the world where you can get tickets, but if you don't get them there, you won't get in.", "5.", "More than 153,000 people will travel to Mr Eavis' Somerset farm from June 24-26.", "6.", "The ID card idea was floated and they were \"going as far as we can\" to cut touting.", "7.", "If implemented, the ID card would be quite a big step in terms of ticketing for events.", "8.", "As long as it's approached in the right way, it might really work, it might really change the system.", "9.", "In 2004, all 112,000 tickets sold out in 24 hours.", "They were personalised with the names of purchasers, who were asked to bring identification, such as a driving license, passport or household bill.", "But some forgot to take the right information while some touts simply offered to supply their own bills along with the ticket bearing their name.", "No details of this year's line-up have been confirmed but rumors suggest U2 and Coldplay may be among the headliners."], "deepseek-r1:1.5b": ["fans will be issued with photo ID cards at Glastonbury festival in April.", "The cards include a photograph of the ticket holder and an electronic chip to prevent fake sales.", "The event is expected to sell out quickly, but details about ticketliners like U2 and Coldplay remain uncertain.", "Fans without ID may use their passport or driving license instead."], "tinyllama:1.1b": ["The Glastonbury Festival organizers are planning to introduce a photo ID card in an attempt to prevent touts from selling tickets, with fans receiving the electronic chip with their personal information to avoid being duped.", "The festival's official source will be selling tickets during the June event, but people not wanting to carry a paper ticket could present their passport or driving license instead, as more than 153,000 people are expected to attend this year.", "However, the ID card idea was floated by Glastonbury's daughter Emilie as a way of tackling the high demand for tickets and \"going as far as we can\" to reduce touting.", "In 2004, all ticket sales were personalized with names, but touts offered their own identity documents in order to get tickets.", "Rumors have suggested that U2 and Coldplay may be headliners of this year's festival."], "tinydolphin:1.1b": [" Glastonbury fans will soon be able to get ID cards for the popular music festival, allowing them to purchase tickets without worrying about being scammed by touts.", "The cards will include a photograph of the ticket-holder along with an electronic chip with their details, preventing fraudulent ticket sales.", "This system is part of a larger plan to increase ticket security at Glastonbury, which has seen its attendance increase in recent years due to the event's popularity.", "The cards are expected to go on sale in April and will be available from authorized sources only.", "If fans do not present their ID cards when checking in, they risk missing out on entry.", "Glastonbury is one of the world's most iconic music festivals, attracting millions of visitors each year."], "phi:2.7b": [" The organizers of Glastonbury festival in Somerset, England plan to issue photo ID cards to ticket holders as a measure against touting.", "Fans will receive electronic chip tickets with their details to prevent forgery or resale.", "Ticket sales are expected to start in April, and around 153,000 people are predicted to attend the event from June 24-26.", "Emily Eavis, Michael Eavis' daughter, believes that implementing ID cards could revolutionize ticketing systems if done correctly, especially as ticket demand has been high in recent years.", "In 2004, all tickets sold out within 24 hours of sale and were personalized with the purchaser's name and identification.", "However, some fans forgot their information or touts simply offered their bills along with the tickets."], "orca-mini:3b": [" Glastonbury fans will need photo ID cards to enter the festival this year.", "The cards will contain a photograph, an electronic chip with their details, and organizers hope it will prevent tickets from being sold on or forged.", "Traveling fans can also bring a passport or driving license if they don't want to carry the entrance card.", "Emily Eavis, Michael Eavis' daughter, supports the idea of ID cards but hopes they are approached in the right way to avoid touts and improve security at the event."], "hermes3:3b": ["Glastonbury festival tickets to have ID cards; fans who buy them will receive photo ID cards with electronic chips for preventing touting and ticket forgery."], "stablelm-zephyr:3b": ["Glastonbury festival will issue photo ID cards to ticket buyers to combat touts and prevent ticket sales or forgery.", "Festival organizer Michael Eavis emphasizes there is only one official source for tickets, which could be carried as a passport or driving license alternative.", "This measure follows rising demand and popularity of the event, with more than 153,000 people expected to attend from June 24-26.", "The ID card idea was also considered a significant step in ticketing practices, and if implemented properly, might change the system."], "chatgpt-4o-latest": ["Glastonbury festival ticket buyers will receive photo ID cards with an electronic chip to prevent resale and forgery.", "Organiser Michael Eavis confirmed tickets will only be available from an official source, and alternative identification like passports or driving licences will be accepted.", "With over 153,000 attendees expected, the move aims to curb ticket touting, which has been a growing issue.", "In 2004, personalised tickets required ID, but some touts bypassed the system.", "No official lineup has been announced, though U2 and Coldplay are rumored headliners."], "stablelm2:1.6b": ["Fans attending Glastonbury festival in June will receive photo ID cards from official sources to prevent touting for tickets, while those without ID can present their passport or driving license.", "Over 10,0..", "The text discusses the implementation of ID card system for Glastonbury festival ticket buyers, aimed at curbing touting practices.", "Fans needing IDs should bring a passport, driving license, or household bill; unprepared examples may lead to potential issues with identification.", "Rumors suggest U2 and Coldplay could be among headliners at this year's event with no confirmed lineup information."], "granite3.1-dense:2b": ["Glastonbury Festival organizers, led by Michael Eavis, are introducing photo ID cards for ticket holders to combat touting.", "These cards will feature a ticket holder's photograph and an electronic chip with their details, preventing ticket resales or forgery.", "Tickets for the 2023 event (24-26 June) will go on sale in April through the official source only.", "Fans can also present alternative identification like passports or driving licenses if they prefer not to carry the ID card.", "In 2004, all 112,000 tickets sold out within 24 hours, with some attendees providing personalized information and others using false documents.", "This year's lineup remains under wraps, but rumors suggest U2 or Coldplay as potential headliners."]}