{"raw_text": "Sir Paul rocks Super Bowl crowds\n \n Sir Paul McCartney wowed fans with a live mini-concert at American football's Super Bowl - and avoided any Janet Jackson-style controversies.\n \n The 62-year-old sang Hey Jude and other Beatles songs in a 12-minute set at half-time during the game in Florida. Last year, Jackson exposed a breast during a dance routine, causing outrage among millions of TV viewers and landing the CBS TV network a fine. Sir Paul, however, did nothing more racy than remove his jacket as he sang. Organisers were widely considered to be playing it safe this year by booking 62-year-old Sir Paul for his second Super Bowl show.\n \n Three years ago, he was invited to perform at the first Super Bowl after the September 11 attacks and performed his specially-written song Freedom. This time, he started off the show, at the Alltel Stadium in Jacksonville, Florida, with the Beatles numbers Drive My Car and Get Back. He then performed a mellow version of Live And Let Die, the James Bond theme he recorded with the band Wings. Finally, he closed the show with a rousing version of Hey Jude. The former Beatle resisted any temptation to refer to Janet Jackson's headline-grabbing performance last year, instead keeping banter between songs to a minimum in order to squeeze as much music as he could into his slot. The singer removed his black jacket halfway through the show - but any fans hoping for a second \"Nipple-gate\" were to be disappointed as he kept his red sweatshirt on underneath.\n \n Earlier, the Black Eyed Peas and Alicia Keys had provided the night's other high-profile entertainment by performing in a pre-game show. Black Eyed Peas singer Fergie was dressed in a tight orange top and purple hotpants, but nothing in her performance was likely to upset TV watchdogs. After the controversy last year - which saw CBS fined a record $550,000 (£292,000) by federal regulators - Super Bowl organisers had turned to producer Don Mischer to oversee this year's half-time show. His previous production credits included Olympic opening and closing ceremonies. The Super Bowl is watched by an audience of 144.4 million in the US, with many of the people watching are said to tune in specifically to see the entertainment put on around the event. Michael Jackson, Aerosmith, Diana Ross, Gloria Estefan and Phil Collins are among the stars who have previously graced the Super Bowl stage.\n", "llama3.2:1b": ["Sir Paul McCartney performed a 12-minute live mini-concert at Super Bowl half-time during American football's game in Florida.", "He sang Beatles songs including \"Hey Jude\" and performed three songs from his own music, \"Drive My Car\", \"Get Back\", and \"Live And Let Die\".", "McCartney did not perform any explicit content, instead using banter between songs to fit as much music into the slot."], "llama3.2:3b": ["Sir Paul McCartney performed a 12-minute mini-concert at the Super Bowl, singing Beatles songs like Hey Jude and Drive My Car without controversy.", "He was booked to avoid any incidents similar to last year's Janet Jackson performance.", "The show also featured the Black Eyed Peas and Alicia Keys before McCartney's set, which included a version of Live And Let Die."], "gemma2:2b": ["Sir Paul McCartney performed a 12-minute set at the halftime show of the Super Bowl, featuring Beatles classics like \"Hey Jude\" and \"Live And Let Die.\"", "He kept his performance tame, avoiding any controversy or racy moves, unlike Janet Jackson's incident in previous years.", "Organizers chose him as he was familiar with performing on this stage and to ensure safety for a large audience."], "qwen2.5:0.5b": ["Sir Paul McCartney performed a mini-concert at halftime during Super Bowl XXV in Jacksonville, Florida, to avoid controversy, but continued to sing his Beatles songs without any hints of Janet Jackson's breast, instead keeping it as close to his own style as possible.", "The event was well-received by fans, with over 140 million people tuning in for the performance."], "qwen2.5:1.5b": ["Sir Paul McCartney performed a live mini-concert at Super Bowl, singing Hey Jude and other Beatles songs in 12 minutes without any controversy like Janet Jackson's during her performance last year."], "qwen2.5:3b": ["Sir Paul McCartney performed a 12-minute set of Beatles songs during halftime of the Super Bowl in Florida without causing controversies like Janet Jackson did last year.", "The event was organized to be safe after CBS faced a fine for Janet's nipple exposure incident.", "McCartney sang \"Hey Jude\" and other hits, avoiding any provocative behavior.", "This was his second Super Bowl appearance since 2011, when he performed \"Freedom.\"", "The show featured other high-profile acts such as the Black Eyed Peas and Alicia Keys."], "opencoder:1.5b": ["\"Sir Paul rocks Super Bowl crowds.", "The 62-year-old sang Hey Jude and other Beatles songs in a 12-minute set at half-time during the game in Florida.", "The former Beatle resisted any temptation to refer to Janet Jackson's headline-grabbing performance last year, instead keeping banter between songs to a minimum in order to squeeze as much music as he could into his slot.", "Earlier, the Black Eyed Peas and Alicia Keys had provided the night's other high-profile entertainment by performing in a pre-game show.\""], "smollm:1.7b": ["Sir Paul McCartney performed a live concert at the Super Bowl - but avoided any controversy by not singing about Janet Jackson's performance last year."], "deepseek-r1:1.5b": ["Sir Paul performed for the US Super Bowl in Florida this year as his second appearance, avoiding controversy by staying under tight circumference while keeping a sweatshirt.", "He performed \"Hey Jude\" and other Beatles songs, with \"Drive My Car\" with The Beatles and \"Live And Let Die\" with Wings.", "He ended midway through the show with a rousing \"Hey Jude.\"", "Previous controversies aside, the organizers relied on Don Mischer for last year's half-time performance at a major artist's event.", "Earlier performers like Black Eyed Peas and Alicia Keys had their own costumes but didn't cause big trouble.", "This year, Sir Paul was the longest-running performer in a Super Bowl game and drew an audience of 144 million across the country."], "tinyllama:1.1b": ["After a first-time appearance at Super Bowl XXVIII, the legendary singer Sir Paul McCartney pulled out all stops for his second Super Bowl performance in 2014, impressing the audience with his unique brand of musical style, which included a rendition of the Beatles' classic \"Drive My Car\" and a live and let-die performance of the James Bond theme song \"Hey Judy\".", "Sir Paul also performed a number of Beatles songs, including \"Freeform\", \"Live & Let Die\", and his own composition, \"Get Back\".", "Despite facing controversy during the pre-game show last year, Sir Paul managed to avoid any headline-grabbing incidents this time around.", "The event was marked by a record $550,000 fine imposed on CBS TV network for airing an explicit dance routine in their Super Bowl XXVIII halftime show."], "tinydolphin:1.1b": [" The Beatles' Sir Paul McCartney is set to perform at this year's Super Bowl in Florida, playing during the halftime show.", "He will avoid any controversies by removing his jacket, and fans can expect a mellow performance of their classic song \"Hey Jude.\"", "The event took place on February 7th and featured Black Eyed Peas and Alicia Keys, who performed before Fergie in a pre-game show.", "The Super Bowl is typically watched by an audience of around 144 million people in the US, with many fans tuning in specifically to see the entertainment put on during the event."], "phi:2.7b": [" In a 12-minute mini-concert at half-time during Super Bowl LII, Sir Paul McCartney sang Hey Jude and other Beatles songs, avoiding any controversies like Janet Jackson's breast-baring incident that occurred last year during the same event.", "The singer performed in a pre-game show with the Black Eyed Peas and Alicia Keys and was dressed appropriately to not offend TV watchdogs.", "Don Mischer oversaw this year' s half-time show, which was watched by 144.4 million people in the US, with many tuning in specifically for the entertainment."], "orca-mini:3b": [" Sir Paul McCartney performed a mini-concert at Super Bowl 2005, with hits from his Beatles days and some solo songs.", "He removed his jacket halfway through the show, avoiding any controversies like those faced by Janet Jackson."], "hermes3:3b": ["Paul McCartney performs mini-concert at Super Bowl, avoiding controversies like Janet Jackson's exposure during half-time show."], "stablelm-zephyr:3b": ["Sir Paul McCartney performed a 12-minute live mini-concert at the Super Bowl in Florida, singing Beatles songs such as Hey Jude and Drive My Car.", "He started off the show with the Beatles' Get Back and later performed Live And Let Die, closing with a rousing version of Hey Jude.", "This year's performance followed last year's controversy involving Janet Jackson's breast exposure during her performance, which led to CBS being fined $550,000 by federal regulators.", "The Super Bowl is watched by an audience of 144.4 million in the US and has previously featured entertainment from Michael Jackson, Aerosmith, Diana Ross, Gloria Estefan, and Phil Collins."], "chatgpt-4o-latest": ["Sir Paul McCartney delivered a crowd-pleasing 12-minute performance at the Super Bowl halftime show in Florida, avoiding any controversy following Janet Jackson's infamous incident the previous year.", "The 62-year-old performed Beatles classics like Hey Jude, Drive My Car, and Get Back, along with Live And Let Die.", "Unlike Jackson’s performance, McCartney kept his show family-friendly, only removing his jacket mid-set.", "The event also featured pre-game performances by the Black Eyed Peas and Alicia Keys.", "Organizers, aiming for a safe and controversy-free show, enlisted producer Don Mischer to oversee the event, which was watched by 144.4 million viewers in the US."], "stablelm2:1.6b": ["Sir Paul McCartney performed at the Super Bowl for the second time, avoiding any Janet Jackson-style controversies.", "He sang Beatles songs in a 5-minute set during half-time, without any racy content.", "Sir Paul avoided repeating last year's incident involving Janet Jackson by keeping banter minimal and playing it safe with his choice of songs.", "He started off with Beatles' numbers followed by a mellow version of \"Live and Let Die,\" closing the show with \"Hey Jude.\"", "Despite removing his jacket halfway through, Sir Paul wore a red sweatshirt underneath to avoid any potential issues.", "The Super Bowl attracts 100 million viewers worldwide."], "granite3.1-dense:2b": ["Sir Paul McCartney, 62, delivered a 12-minute live set at the 2007 Super Bowl half-time show in Florida, performing Beatles hits like \"Hey Jude,\" \"Drive My Car,\" and \"Live And Let Die.\"", "He remained modest, keeping his red sweatshirt on under his jacket.", "Unlike Janet Jackson's 2004 controversy, Paul avoided any explicit moments, ensuring a safe performance for the 144.4 million US viewers.", "Organizers chose him over the Black Eyed Peas and Alicia Keys, who had performed in a pre-game show, to maintain a clean bill of entertainment.", "Producer Don Mischer, known for Olympic ceremonies, oversaw Paul's performance, ensuring no repeat of last year's FCC fines."]}