{"raw_text": "Beatles suits sell for $110,000\n \n Four suits worn by the Beatles on their Please Please Me album cover have sold for $110,00 (£59,000) at a US auction.\n \n But some of Elvis Presley's earliest recordings - including takes of All Shook Up - failed to sell at the Bonhams and Butterfields two-day sale. A private collection of six tape recordings of Presley valued at between $30,000 (£16,000) and $50,000 (£27,000) did not meet their reserve price. A signed Presley photograph managed to fetch $2,115 (£1,140).\n \n Auction spokesman Erik Simon said the Presley tapes were withdrawn because \"they did not meet the minimum price set by the owners\".\n \n He said the family of sound engineer Thorne Nogar did not want to divulge the price they had set or the offers they had received. The RCA tapes date from September 1956 to September 1957. The \"pre-masters\" include a take of Jailhouse Rock, religious songs, material for his first Christmas album, and banter between Presley, members of his band and Mr Nogar.\n \n \"We've had them for a lot of years, and I think the people should enjoy them. And frankly, we could use the money,\" Mr Nogar's son Stephen, 57, said before the auction. Mr Nogar, who died in 1994 aged 72, always used to make two tapes of sessions as a back-up in case RCA producers wanted to make late changes to songs. \"He called them his 'ass-saver' tapes,\" his son said. The quality is said to be noticeably crisper than that of a new vinyl record. Because the family does not own the copyright to the music, the tapes could only be sold for \"personal enjoyment\" and cannot be copied for commercial gain. The auction made a total of $1.1m (£600,000).\n", "llama3.2:1b": ["Here is a concise summary of the text:\n\n* Four Beatles suits on their Please Please Me album cover sold at an auction for £59,000 ($110,000).", "* Some Elvis Presley's earliest recordings failed to sell at a Bonhams and Butterfields sale.", "* A signed Presley photograph sold for £1,140.", "* The Presley tapes were withdrawn due to not meeting the minimum price set by the owner.", "* The RCA tapes date from September 1956-September 1957 and include sessions of Jailhouse Rock, Christmas album material, and banter between Presley and his band."], "llama3.2:3b": ["Four Beatles suits sold for $110,000 at US auction.", "Elvis Presley's early recordings including All Shook Up failed to sell but a signed photograph fetched $2,115.", "A private collection of six Presley tape recordings valued between $30,000 and $50,000 did not meet reserve price."], "gemma2:2b": ["Four Beatles suits sold for $110,000 at an auction.", "Elvis Presley's early recordings failed to sell, while a signed Presley photograph did achieve a sale price.", "A collection of the sound engineer Thorne Nogar's pre-master recordings from Elvis' sessions fetched $1.1 million in total."], "qwen2.5:0.5b": ["Four Beatles albums with US auction prices reached $110, 000 each: Please Please Me, All Shook Up, Jailhouse Rock, and Christmas Musician's Delight."], "qwen2.5:1.5b": ["Four Beatles suits from Please Please Me album cover sold at $110,000 US auction; Presley's earliest recordings failed to sell due to low prices set by owners.", "RCA tapes of Elvis Nogar for Christmas and Jailhouse Rock albums fetched high bids.", "Thorne Nogar's \"ass-saver\" tapes were withdrawn because they did not meet price targets."], "qwen2.5:3b": ["Four Beatles suits sold for $110,000 at an auction.", "Elvis Presley's early recordings including \"All Shook Up\" failed to meet their reserve price during a Bonhams and Butterfields two-day sale.", "A private collection of six Presley tape recordings valued between $30,000 and $50,000 did not sell due to owners setting the minimum price.", "RCA's pre-masters including \"Jailhouse Rock\" and religious songs fetched around $2,115 for a signed photograph.", "The auction made a total of $1.1m (£600,000)."], "opencoder:1.5b": ["The Beatles suits sell for $110,000.", "Four suits worn by the Beatles on their Please Please Me album cover have sold for $59,000 at a US auction, but some Elvis Presley's earliest recordings fetched a reserve price of $16,000 and $27,000.", "A private collection of six tape recordings of Presley was valued at between $30,000 and $50,000.", "The auction spokesman said the Presley tapes were withdrawn because they did not meet the minimum price set by the owners.", "The family of sound engineer Thorne Nogar did not want to divulge the price they had set or the offers they had received.", "The RCA tapes date from September 19th, 1956 to September 19th, 1957.", "The \"pre-masters\" include a take of Jailhouse Rock and religious songs for Presley's first Christmas album.", "The people should enjoy them, and I think the people should enjoy them, Mr Nogar's son Stephen said before the auction."], "smollm:1.7b": ["The summary is concise and preserves key ideas and details.", "It includes:\n\n1.", "The Beatles suits sell for $110,000 at a US auction.", "2.", "Four suits worn by the Beatles on their Please Please Me album cover have sold for $110,000 (£59,000) at a US auction.", "3.", "But some of Elvis Presley's earliest recordings - including takes of All Shook Up - failed to sell at the Bonhams and Butterfields two-day sale.", "A private collection of six tape recordings of Presley valued at between $30,000 (£16,000) and $50,000 (£27,000) did not meet their reserve price.", "4.", "Auction spokesman Erik Simon said the Presley tapes were withdrawn because \"they did not meet the minimum price set by the owners\".", "5.", "The family of sound engineer Thorne Nogar did not want to divulge the price they had set or the offers they had received.", "The RCA tapes date from September 1956 to September 1957.", "The \"pre-masters\" include a take of Jailhouse Rock, religious songs, material for his first Christmas album, and banter between Presley, members of his band and Mr Nogar.", "6.", "We've had them for a lot of years, and I think the people should enjoy them.", "And frankly, we could use the money.", "- Erik Simon"], "deepseek-r1:1.5b": ["The Beatles suits were sold at an auction for $110,000 each.", "Four songs on their album cover fetched approximately $59,000 in total (about a fifth of the suit price) at a US auction.", "Elvis Presley's recordings did not sell at Bonhams and Butterfields during a two-day sale, with some tapes worth around $20k to $45k each meeting reserve prices of $25k to $35k.", "A signed photograph fetched $2,115.", "The family owning Thorne Nogar avoided selling the tapes because reserve prices were higher than offers, and they had six crisper-quality RCA recordings from 1956-1957."], "tinyllama:1.1b": ["The Beatles' suits worn on the Please Please Me album cover have sold for a combined price of $110,000 (US dollars) at an auction in the US.", "Four of the band members' earliest recordings were also sold at the same event, which took place over two days.", "One signed photograph, featuring Eric Simon, the auctioneer who spoke on behalf of the family of sound engineer Thorne Nogar, managed to fetch $2,115 (£1,140).", "The auction was held by Bonham's and Butterfield's, both in New York.", "It is unclear whether or not the Presley tapes sold at the auction, as Erik Simon, their speaker, stated that the family does not own copyright to the music and only has access to tapes made for them."], "tinydolphin:1.1b": [" Beatles suits, made famous by the band in their 1963 recording sessions on the Please Please Me album cover, sold for a record-breaking $110,000 at an auction in California.", "The iconic ensembles were purchased at a US auction by a private collector and are now owned by the consortium of institutions known as The Beatles Fund.", "The tape recordings of the original recording sessions were also sold during the same event, though they did not reach the highest bid possible.", "This marked the first successful sale of any preservation-worthy recording sessions involving the Beatles.", "The collection of six tape recordings that were part of the group's extensive recordings were purchased by a collector at an auction in London."], "phi:2.7b": [" On January 30th, 2020, four Beatles suits from their Please Please Me album cover sold at a US auction for $110,000 each.", "However, Elvis Presley's earlier recordings and some of his tape collections did not sell, with one tape worth between $30,000-$50,000.", "A signed photo managed to fetch $2,115.", "The Nogar family withdrew the Presley tapes due to the price set by them.", "They are from September-October 1956 and include Jailhouse Rock and religious songs."], "orca-mini:3b": [" Four Beatles suits worn on their Please Please Me album cover have been sold for $110,000 at a US auction.", "However, some Elvis Presley recordings failed to sell at the Bonhams and Butterfields two-day sale.", "A private collection of six tape recordings of Presley valued between $30,000 and $50,000 did not meet their reserve price.", "A signed Presley photograph managed to fetch $2,115.", "The Presley tapes were withdrawn because they did not meet the minimum price set by the owners.", "The family of sound engineer Thorne Nogar did not want to divulge the price they had set or the offers they had received.", "The RCA tapes date from September 1956 to September 1957.", "The \"pre-masters\" include a take of Jailhouse Rock, religious songs, material for his first Christmas album, and banter between Presley, members of his band and Mr Nogar.", "The auction made a total of $1.1 million."], "hermes3:3b": ["Beatles suits sell for $110,000; Presley tape recordings fail to meet reserve price."], "stablelm-zephyr:3b": ["Four Beatles suits from their Please Please Me album cover sold for $110,000 at a US auction.", "Elvis Presley's earliest recordings, including a take of \"All Shook Up,\" didn't sell at the same event.", "A signed photograph fetched $2,115.", "The rare RCA tapes, dating from September 1956 to September 1957, were withdrawn as they didn't meet their reserve price; the family set the price but declined to reveal offers received.", "Presley's sound engineer, Thorne Nogar, created \"ass-saver\" tapes for backup purposes.", "Due to copyright issues, the tapes could only be sold for personal enjoyment and not copied for commercial gain.", "The auction generated a total of $1.1 million (£600,000)."], "chatgpt-4o-latest": ["Four suits worn by the Beatles on their Please Please Me album cover sold for $110,000 at a US auction.", "However, six early Elvis Presley recordings, valued between $30,000 and $50,000, failed to meet their reserve price and were withdrawn.", "A signed Presley photograph sold for $2,115.", "The Presley tapes, dating from 1956-1957, belonged to the family of sound engineer Thorne Nogar and included alternate takes and banter.", "The tapes, known for their high quality, could only be sold for personal enjoyment due to copyright restrictions.", "The auction raised a total of $1.1 million."], "stablelm2:1.6b": ["Four Beatles suits sold for £x at an American auction while some Elvis Presley recordings did not sell, including his earliest recordings.", "A signed Presley photograph sold for £2.", "RCA tapes from September 1960 to 1970 failed to meet their reserve price; however, the family of sound engineer Thorne Nogar withdrew the tapes due to confidentiality reasons.", "The Presley tapes originally valued at between £x and £x were not sold because they did not meet the minimum price set by the owners.", "The RCA tapes include takes from \"Jailhouse Rock,\" religious songs, Christmas material, and banter between Presley, members of his band, and Nogar.", "They have been owned by the family for many years, with Nogar always making backup tapes as a precaution against late changes in song recordings.", "The auction made a total of £1.1m (£x)."], "granite3.1-dense:2b": ["Four Beatles suits from the Please Please Me album cover auctioned in the US fetched $110,000 (£59,000).", "In contrast, Elvis Presley's early recordings and a signed photograph did not meet their reserve prices.", "The Presley tapes, valued between $30,000 to $50,000, were withdrawn without being sold due to the family's unwillingness to disclose the set price or received offers.", "These recordings, dating from 1956 to 1957, include pre-masters of songs like Jailhouse Rock and religious pieces.", "The family, heirs to sound engineer Thorne Nogar, kept the tapes for personal enjoyment, as they lack copyright ownership for commercial use.", "The total auction earnings amounted to $1.1 million (£600,000)."]}