{"raw_text": "Disputed Nirvana box set on sale\n \n A box set featuring 68 unreleased Nirvana tracks has gone on sale in the US, after years of legal wrangles.\n \n With the Lights Out was intended to be released in 2001, to mark the 10th anniversary of the album Nevermind. It was blocked by Courtney Love, the widow of Nirvana frontman Kurt Cobain, who did not want unreleased song You Know You're Right on the box set. The dispute between Love and surviving band members Krist Novoselic and drummer Dave Grohl was settled in 2002. Work began on the box set in 1998, but legal battles put the project on hold. The legal fight centred on a studio recording of the unreleased track You Know You're Right, regarded by fans as one of the unreleased gems of Nirvana. The set, released on Tuesday, features three CDs and a DVD of rare performance and rehearsal footage. The DVD also includes the first performance of Smells Like Teen Spirit, the track that launched Nirvana on to the international stage in 1991. \"The band wasn't always pretty, or always in tune. This is not Nirvana unplugged. It's Nirvana unedited,\" said Cobain biographer Charles Cross. The band's development ended tragically when songwriter Kurt Cobain committed suicide in April 1994.\n", "llama3.2:1b": ["A box set of unreleased Nirvana tracks has been released, after years of legal disputes between Courtney Love and surviving members over the song \"You Know You're Right\".", "Work began on the project in 1998 but was put on hold due to legal battles over a studio recording.", "The set includes rare performance and rehearsal footage, including the first performance of Smells Like Teen Spirit."], "llama3.2:3b": ["A box set featuring 68 unreleased Nirvana tracks, \"With the Lights Out\", has gone on sale after years of legal wrangles with Courtney Love.", "Work began in 1998 but was put on hold due to disputes over an unreleased track, You Know You're Right.", "The set includes three CDs and a DVD with rare performance footage, including the first live performance of \"Smells Like Teen Spirit\"."], "gemma2:2b": ["A new box set featuring 68 unreleased Nirvana tracks went on sale.", "The dispute over the release was resolved in 2002, allowing the project to proceed after years of legal battles.", "The set includes three CDs and a DVD with rare footage and the song \"Smells Like Teen Spirit,\" which launched their international fame."], "qwen2.5:0.5b": ["A box set featuring unreleased Nirvana tracks has gone on sale in the US, with the Lights Out album being released in 2001.", "Legal battles led to a delay in the project and a new recording of You Know You're Right, which became one of Nirvana's most important songs.", "The DVD contains footage of Smells Like Teen Spirit, but it is not intended as an unplugged recording, but rather as a showcase for unreleased music."], "qwen2.5:1.5b": ["A box set featuring 68 unreleased Nirvana tracks, including \"You Know You're Right\" and the first performance of Smells Like Teen Spirit, was released after a legal dispute with Courtney Love over an intended release for the 20th anniversary of Nevermind in 2001.", "The project began in 1998 but stalled due to disputes between Cobain's widow and surviving band members.", "The set includes three CDs and a DVD featuring rare performances and rehearsals, as well as the studio recording of \"You Know You're Right\"."], "qwen2.5:3b": ["A box set featuring 68 unreleased Nirvana tracks, originally intended for a 2001 release to mark Nevermind's tenth anniversary, went on sale after years of legal disputes.", "The main conflict involved Courtney Love, Kurt Cobain’s widow, who objected to including the song You Know You're Right.", "Legal issues centered around a studio recording of this track, which fans considered an unreleased gem by Nirvana.", "Work began in 1998 but was halted due to these conflicts.", "The set released on Tuesday includes three CDs and a DVD featuring rare performance and rehearsal footage, including the first performance of Smells Like Teen Spirit.", "Cobain biographer Charles Cross described it as \"not Nirvana unplugged; it's Nirvana unedited,\" highlighting the band’s less polished nature from its earlier days.", "The tragic end came when Cobain committed suicide in 1994."], "opencoder:1.5b": ["A box set featuring unreleased tracks from the Nirvana album has gone on sale in the US, after years of legal wrangles with the intended release in 2001.", "The dispute between Love and surviving band members Novoselic and Grohl was settled in 2002, and work began on the project in 1998 but were put on hold due to legal battles.", "A studio recording of You Know You're Right, marked by fans as one of unreleased gems of Nirvana, is included on the box set, with a DVD containing rare performance footage and the first performance of Smells Like Teen Spirit, launched into the international stage in 1991.", "The band's development ended unexpectedly due to Kurt Cobain's suicide in April 1994."], "smollm:1.7b": ["The dispute between Kurt Cobain and Krist Novoselic over the unreleased track \"You Know You're Right\" on the box set was a significant factor in the project's delay.", "The legal wrangling, which included court battles and negotiations with music industry lawyers, lasted for several years before the project could be completed.", "The legal fight centered on a studio recording of the unreleased track, which was seen as one of the unreleased gems of Nirvana.", "The box set features three CDs and a DVD of rare performance and rehearsal footage.", "It also includes the first performance of Smells Like Teen Spirit, the track that launched Nirvana on to the international stage in 1991."], "deepseek-r1:1.5b": ["A box set featuring unreleased Nirvana tracks went on sale in the US after years of legal wrangles.", "\"With the Lights Out\" was intended to be released in 2001 as a 10th-anniversary album for \"Nevermind,\" but it was blocked by Courtney Love, the band's late manager, in 2002.", "Legal battles centered on a recording dispute over \"You Know You're Right.\"", "The box set started in 1998 but faced legal issues until 2002 when the conflict resolved.", "It features CDs and a DVD with rare footage, including the first performance of Smells Like Teen Spirit and an expanded interview with members.", "A biographer noted how the band evolved despite the disorganized times."], "tinyllama:1.1b": ["A box set featuring unrelaxed tracks from the album Nevermind, originally slated to be releaased ten years after its release, has been released in the US following a legal dispute between Courtney Love and surviving band members Dave Grohl, Krist Novoselic, and Cobain's widow, Lisa Bonus.", "The box set includes three CDs and a DVD of rare performance and rehearsal footage from the recording process of the album.", "NiVana's debut track You Know You're Right, regarded by fans as one of the unrelaxed gems, is included on all three discs, along with the first live performance of Smells Like Teen Spirit that made the group a global phenomenon.", "The box set, which was intended for release in 2001, was blocked by Love and surviving band members in order to celebrate NiVana's 10th anniversary.", "The dispute centered on an unrellaxed track that became a cult classic among fans - You Know You're Right."], "tinydolphin:1.1b": [" A box set featuring 68 unreleased Nirvana tracks has gone on sale in the US after years of legal battles.", "The box set was planned to be released in 2001, but Love and the surviving band members wanted to keep some of the tracks, including You Know You're Right, unreleased.", "This led to a legal dispute that went on for several years, with the court finally settling in 2002.", "The set includes three CDs and a DVD featuring rare performance and rehearsal footage from the Nirvana session studio in 1998."], "phi:2.7b": [" A box set of 68 unreleased Nirvana tracks has been released after years of legal battles, containing three CDs and a DVD of rare performance and rehearsal footage.", "The release was delayed by legal disputes over the inclusion of a studio recording of an unreleased track called You Know You're Right."], "orca-mini:3b": [" A disputed Nirvana box set with 68 unreleased songs is on sale after years of legal wrangles.", "It was intended to be released in 2001 and was blocked by Courtney Love, the widow of Nirvana frontman Kurt Cobain, who did not want the unreleased song You Know You're Right on the set.", "The box set includes three CDs and a DVD of rare performance and rehearsal footage.", "The DVD also includes the first performance of Smells Like Teen Spirit, the track that launched Nirvana on to the international stage in 1991."], "hermes3:3b": ["Nirvana \"With the Lights Out\" box set (68 unreleased tracks) sold, after legal disputes over track inclusion; includes 3 CDs, DVD with rare footage, first live performance of Smells Like Teen Spirit."], "stablelm-zephyr:3b": ["A disputed Nirvana box set, including 68 unreleased tracks, went on sale in the US after legal battles over a decade.", "The disputes centered around including a song, \"You Know You're Right,\" originally intended to be part of \"With the Lights Out\" which was meant to celebrate Nirvana's 10th anniversary of \"Nevermind.\"", "The final release features three CDs and a DVD with rare performance and rehearsal footage, including the first performance of \"Smells Like Teen Spirit.\""], "chatgpt-4o-latest": ["A Nirvana box set, *With the Lights Out*, featuring 68 unreleased tracks, has been released in the US after years of legal disputes.", "Originally planned for 2001 to mark *Nevermind*'s 10th anniversary, it was delayed by a legal battle between Courtney Love and surviving band members over the inclusion of *You Know You're Right*.", "The dispute was settled in 2002.", "The set includes three CDs and a DVD with rare performances, including the first performance of *Smells Like Teen Spirit*.", "Biographer Charles Cross described it as an unedited portrayal of the band.", "Nirvana's journey ended with Kurt Cobain's suicide in 1994."], "stablelm2:1.6b": ["A box set containing unreleased Nirvana tracks, including \"You Know You're Right\", has gone on sale in the US after years of legal disputes involving Courtney Love and surviving members Krist Novosilk and Dave Grohl.", "The project was halted due to lawsuits centered around an unreleased track.", "Despite Love's objections, the set includes three CDs and a DVD with rare performance footage.", "Originally intended for release in 1998 to mark the 10th anniversary of \"Nevermind,\" it was not released until recently."], "granite3.1-dense:2b": ["A controversial Nirvana box set, \"With the Lights Out,\" featuring 68 unreleased tracks, was released in the US after years of legal disputes between Courtney Love (Kurt Cobain's widow), surviving band members Krist Novoselic and Dave Grohl.", "The set, intended for Nevermind's 10th anniversary in 2001, faced opposition due to Love's reluctance to include the highly sought-after track \"You Know You're Right.\"", "The legal battle concluded in 2002.", "Despite delays, the box set comprises three CDs and a DVD with rare performance and rehearsal footage, including Nirvana's first Smells Like Teen Spirit performance.", "Cobain biographer Charles Cross described it as \"Nirvana unedited,\" emphasizing their raw, unpolished sound.", "The band's formation marked the beginning of their global success, culminating in Cobain's 1994 suicide."]}