{"raw_text": "Queen recruit singer for new tour\n \n The remaining members of rock band Queen are to go on tour next year with former Free and Bad Company singer Paul Rodgers taking Freddie Mercury's place.\n \n Guitarist Brian May has said he expects to be on the road with Rodgers and drummer Roger Taylor from April. May said: \"Suddenly the Queen Phoenix is rising again from the ashes and will take precedence over... our lives.\" Queen have played with many different singers since Mercury's death in 1991 but have reportedly not toured. May performed with Rodgers at a concert to celebrate the 50th anniversary of the Fender Stratocaster guitar in London in September.\n \n \"We were both so amazed at the chemistry that was going on in [Free hit] All Right Now, that suddenly it seems blindingly obvious that there was 'something happening here,'\" May wrote on his website. They teamed up again for a concert to mark their induction into the UK Music Hall of Fame, and were joined by Taylor. \"The show went so incredibly well from our point of view, and we got so many rave reactions from out there, we decided almost then and there that we would look at a tour together,\" May wrote.\n \n Queen went to number one in 2000 with a version of We Will Rock You sung by boy band 5ive and they have also played with Robbie Williams, Will Young and Bob Geldof. Queen bassist John Deacon has currently retired from the stage. Rodgers was singer with early 1970s rockers Free, who had a global hit with All Right Now, before forming Bad Company, a successful \"supergroup\" with members of King Crimson and Mott the Hoople. He has also been in The Firm with Led Zeppelin's Jimmy Page and The Law with The Small Faces and The Who drummer Kenny Jones.\n", "llama3.2:1b": ["Queen will tour next year with Paul Rodgers replacing Freddie Mercury.", "Brian May is expected to join Taylor on the road starting April, after a concert featuring Rodgers was held in September.", "May had previously performed with Rodgers at a Fender Stratocaster induction concert in London."], "llama3.2:3b": ["Queen to go on tour next year with Paul Rodgers replacing Freddie Mercury, guitarist Brian May and drummer Roger Taylor to perform alongside him starting April 2024."], "gemma2:2b": ["Queen will tour next year with former Free and Bad Company singer Paul Rodgers replacing Freddie Mercury.", "The tour is expected to begin in April, and guitarist Brian May collaborated with Rodgers at a concert to celebrate the Fender Stratocaster's 50th anniversary.", "They have previously enjoyed success performing together, prompting them to consider a full tour."], "qwen2.5:0.5b": ["Queen plans to tour with Paul Rodgers as Freddie Mercury's replacement, and guitarist Brian May performs with Rodgers for the first time at a concert marking Queen's induction into the UK Music Hall of Fame.", "John Deacon is currently retired from stage work but has been in the band since 1970s rockers Free formed.", "The other members have not toured together as they were initially not selected by Queen."], "qwen2.5:1.5b": ["Queen singer Paul Rodgers will join rock band Queen for tours next year following Mercury's death, replacing original lead vocalist Freddie.", "May plans to perform alongside Rogers and Taylor from April 2016 onwards.", "Queen previously played with other notable singers, including Robbie Williams and Will Young, in the past, making this reunion a historic event."], "qwen2.5:3b": ["Queen are to embark on a new tour next year featuring Paul Rodgers, who replaced Freddie Mercury as lead singer.", "Guitarist Brian May expects to join the tour from April alongside Roger Taylor.", "Both May and Rodgers were impressed by their chemistry in Free's hit \"All Right Now.\"", "They performed together at the Fender Stratocaster anniversary concert in London and received positive reactions.", "Queen have previously toured with various singers, but this will be their first since Freddie Mercury’s death.", "Rodgers was a member of Free and Bad Company before forming his own supergroup.", "John Deacon retired from touring recently."], "opencoder:1.5b": ["The remaining members of rock band Queen are to go on tour next year with former Free and Bad Company singer Paul Rodgers taking Freddie Mercury's place.", "They have also played with Robbie Williams, Will Young and Bob Geldof.", "The band has been in the UK Music Hall of Fame since 5ive's We Will Rock You concert.", "In 2,000 years, Queen had won numerous \"We Are the Champions\" singles and was signed to Rolling Stone for her Grammy Nominee.", "Today, they have retired from the stage."], "smollm:1.7b": ["The Queen will go on tour next year with Paul Rodgers taking Freddie Mercury's place, according to a statement from the band.", "The remaining members of the rock band are expected to take their places at the helm of the tour as well.", "Queen have played with many different singers since Mercury's death in 1991 but have reportedly not toured.", "However, they did perform with Freddie Mercury for a concert celebrating the 50th anniversary of the Fender Stratocaster guitar in London last September.", "\"We were both so amazed at the chemistry that was going on in [Free hit] All Right Now, that suddenly it seems blindingly obvious that there was 'something happening here,'\" said Brian May, Queen's lead guitarist and one of their most popular members.", "They teamed up again for a concert to mark their induction into the UK Music Hall of Fame, and were joined by Paul Taylor from the rock band 50 Cent.", "The show went so incredibly well from our point of view, and we got so many rave reactions from out there, we decided almost then and there that we would look at a tour together,\" said Queen bassist John Deacon.", "\"Queen have also played with early 1970s rockers Free, who had a global hit with All Right Now before forming Bad Company, a successful 'supergroup' with members of King Crimson and Mott the Hoople.\"", "The band has also been in The Firm with Led Zeppelin's Jimmy Page and The Law with The Small Faces and The Who drummer Kenny Jones."], "deepseek-r1:1.5b": ["Queen are setting up a tour for next year, replacing Freddie Mercury with Paul Rodgers.", "Brian May is excited to join him in April.", "They performed together at a Fender concert, planning a show for induction.", "They've played numerous times since Mercury's death, with prior members forming various groups like Free and Bad Company.", "They have tours, including 2000 with We Will Rock You by 5ive.", "Paul has been in bands like Free, Bad Company, The Firm, and The Law.", "Roger Taylor was a drummer for The Who and The Law.", "Queen Phoenix is rising again from the ashes after Freddie Mercury's death, planning a tour this year.", "They've performed together at a concert celebrating the Fender Stratocaster anniversary.", "They have tours and a lineup history since Mercury's death."], "tinyllama:1.1b": ["Queen to tour with Paul Rodgers and Former Free Singer Freddie Mercury Replaced by Bad Company Member, Roger Taylor"], "tinydolphin:1.1b": [" Queen have announced that they will be taking former Free and Bad Company singer Paul Rodgers on tour to replace Freddie Mercury, who passed away in 1991.", "The band's current members—guitarist Brian May, drummer Roger Taylor, and lead vocalist David Gilmore—will be joined by Rodgers for the new tour which is expected to take place in April 2022.", "The remaining members of Queen, including guitarist-bassist John Deacon, have not played together since Mercury's death but are excited about the prospect of taking the stage again with someone who knows and loves the music they created together.", "May wrote on his website that he was amazed at the chemistry that seemed to be \"blindingly obvious\" during a recent concert to celebrate the 50th anniversary of Fender Stratocaster guitars.", "The band will induct themselves into the UK Music Hall of Fame and perform together for the first time in over 20 years at a concert celebrating their induction.", "They will also be joined by Robbie Williams, Will Young, and Bob Geldof for a performance of We Will Rock You.", "The show was an incredible success for Queen, who have played with some significant acts over the years.", "Queen's bassist John Deacon has retired from performing, but has had an illustrious career in the music industry, both as a solo artist and with his current bandmates.", "Deacon played drums on some of Queen's most popular songs, including the iconic song, \"We Will Rock You.\""], "phi:2.7b": [" Queen are going on tour next year with former Free and Bad Company singer Paul Rodgers taking Freddie Mercury's place, as guitarist Brian May expects to be on the road from April.", "They played a concert together in September 2009 and later teamed up again for a Hall of Fame show, which led them to consider touring.", "They previously had hits with a version of We Will Rock You sung by boy band 5ive and have also performed with Robbie Williams, Will Young, and Bob Geldof."], "orca-mini:3b": [" Queen will embark on a new tour with former Free and Bad Company singer Paul Rodgers, replacing their late frontman Freddie Mercury.", "Guitarist Brian May has said he expects to be on the road with Rodgers and drummer Roger Taylor from April."], "hermes3:3b": ["Queen takes Brian May, Roger Taylor on tour with Paul Rodgers as singer."], "stablelm-zephyr:3b": ["Queen will go on tour next year with former Free and Bad Company singer Paul Rodgers, who will replace Freddie Mercury.", "Guitarist Brian May has mentioned that he expects to be on the road with Rodgers and drummer Roger Taylor from April.", "This tour marks Queen's first time touring with a new lead singer since Mercury's death in 1991.", "The band had previously collaborated with several different singers, including boy bands 5ive and Robbie Williams, as well as Will Young and Bob Geldof."], "chatgpt-4o-latest": ["Queen will tour next year with former Free and Bad Company singer Paul Rodgers replacing Freddie Mercury.", "Guitarist Brian May and drummer Roger Taylor will join Rodgers, with the tour starting in April.", "May and Rodgers first performed together at a Fender Stratocaster anniversary concert and later reunited for the UK Music Hall of Fame, where their chemistry led to the decision to tour.", "Queen has collaborated with various artists since Mercury's death but has not toured extensively.", "Bassist John Deacon remains retired.", "Rodgers, known for his work with Free, Bad Company, The Firm, and The Law, brings extensive rock experience to the collaboration."], "stablelm2:1.6b": ["Queen will tour next year with Brian May, Roger Taylor, and former Free singer Paul Rodgers replacing Freddie Mercury.", "The remaining members have previously played with many singers since Mercury's death but haven..\n####Summary: Queen and Paul Rodgers to form new supergroup for tour after playing together in the past.", "Guitarist Brian May expects to be on the road with them from April."], "granite3.1-dense:2b": ["Queen, the iconic rock band, is planning a tour for next year with Paul Rodgers as their lead singer, filling the void left by the late Freddie Mercury.", "Guitarist Brian May and drummer Roger Taylor are expected to join the tour from April.", "This marks the first time Queen will tour since Mercury's death in 1991.", "May and Rodgers previously collaborated on concerts celebrating the Fender Stratocaster anniversary and Queen's UK Music Hall of Fame induction, showcasing strong on-stage chemistry that led to their decision to tour together.", "Paul Rodgers, known for his tenure with Free and later Bad Company, has a diverse musical background, having also performed with Led Zeppelin's Jimmy Page, The Small Faces, and The Who drummer Kenny Jones in various bands like The Firm and The Law.", "Queen bassist John Deacon is currently retired from live performances.", "Since 2000, the band has had a unique collaboration with boy band 5ive for \"We Will Rock You,\" and has also performed with Robbie Williams, Will Young, and Bob Geldof."]}