{"raw_text": "Court halts Mark Morrison album\n \n Premiership footballer and record company boss Kevin Campbell has gained a court injunction stopping R&B singer Mark Morrison from releasing an album.\n \n The Everton striker signed Morrison to his fledging 2 Wikid Records label and claims he spent thousands of pounds producing his album Innocent Man. Now he is attempting to prevent Morrison releasing the album on Monday through another label. But Morrison vowed to ignore the order, saying \"no judge is gonna stop me\".\n \n Morrison, who is now as well known for his brushes with the law than his music career, rose to fame with the 1996 single Return of the Mack.\n \n But the Leicester singer has struggled to repeat its success following two spells in jail. One was for hiring a stand-in to complete his community service for possession of a stun gun and three-months following a nightclub fracas. He signed to Mr Campbell's label a year ago and has released one single, with the label saying the album was due for release on 24 January. But Mr Campbell said he learned that Morrison planned to release the album through Jet Star, which is advertising it on its website. Mr Campbell said: \"I'm glad we were granted the injunction but I'm completely gutted that we have had to go that far. \"Mark Morrison was given everything he asked for by 2 Wikid but it seems that he couldn't help but return to his old ways.\n \n \"I've worked hard to realise my ambition in football but had hoped that my future career would be in the music business. \"I have always dreamt of starting a record label but now Mark Morrison has spoilt that dream for me. There is no loyalty in this business - just greed.\"\n \n But Morrison is determined the album will be released on Monday. He said: \"The injunction is ludicrous. \"I signed a new deal with a new record company because I was not getting the support I needed from 2 Wikid. \"I was with that label for a year and in that time released just one record, which was not properly promoted. He added: \"The whole world is waiting for this album and it will come out on December 27. No injunction or judge will stop it. The Mack will return.\" The case is set to be heard in the High Court on 20 December.\n", "llama3.2:1b": ["Kevin Campbell, a footballer and record company boss, has obtained an injunction from a court to halt R&B singer Mark Morrison's release of his album Innocent Man.", "Campbell signed Morrison to his fledgling label 2 Wikid Records but claims he spent thousands producing the album before releasing it through another label, Jet Star.", "Morrison refuses to comply with the order and vows to release the album on December 27 despite Campbell's efforts to block it."], "llama3.2:3b": ["Kevin Campbell, a footballer and record company boss, gained a court injunction stopping R&B singer Mark Morrison from releasing an album through his label 2 Wikid Records.", "Morrison vowed to ignore the order, saying he would release the album on January 24 despite plans to do so through another label, Jet Star."], "gemma2:2b": ["Kevin Campbell obtained a court injunction preventing Mark Morrison from releasing his new R&B album.", "Morrison claims he signed a deal with Campbell and spent time working on the album, but then sought to release it through a different label.", "He vows to continue releasing the album despite the injunction.", "The case is set to be heard in the High Court on December 20th."], "qwen2.5:0.5b": ["Mark Morrison was ordered by a court to stop releasing an album signed with a fledgling record label he used to manage, saying it would cause a disruption for his future endeavors.", "He stated that although he had struggled in the music business due to past mistakes and legal troubles, the injunction prevents him from releasing the album before 24 January.", "This has led him to express frustration about the court's decision and his disappointment with Morrison's sudden return to the football world.", "The court is set to decide if the injunction should be upheld on 20 December at a hearing in the High Court."], "qwen2.5:1.5b": ["Kevin Campbell orders R&B singer Mark Morrison to halt Innocent Man album release, despite being granted a court injunction.", "Morrison plans to ignore the order and release the album anyway on Monday."], "qwen2.5:3b": ["Premiership footballer Kevin Campbell, who runs 2 Wikid Records, obtained a court injunction against R&B singer Mark Morrison to prevent him from releasing his album \"Innocent Man\" due to unpaid production costs.", "However, Morrison ignored the order and vowed to release it on Monday through another label, Jet Star.", "Morrison previously rose to fame with \"Return of the Mack,\" but has faced legal issues, including a stint in jail.", "Campbell claims Morrison betrayed his trust by returning to old ways after signing with his label.", "The case will be heard in the High Court on December 20."], "opencoder:1.5b": ["Court halts Mark Morrison album\n\nPremiership footballer and record company boss Kevin Campbell has gained a court injunction stopping R&B singer Mark Morrison from releasing an album.", "Morrison, who is now as well known for his brushes with the law than his music career, rose to fame with the 1996 single Return of the Mack.", "But the Leicester singer has struggled to repeat its success following two spells in jail.", "One was for hiring a stand-in to complete his community service for possession of a stun gun and three-months following a nightclub fracas.", "He signed to Mr Campbell's label a year ago and has released one single, with the label saying the album was due for release on 24 January.", "But Mr Campbell said he learned that Morrison planned to release the album through Jet Star, which is advertising it on its website.", "\"I've worked hard to realise my ambition in football but had hoped that my future career would be in the music business.", "I have always dreamt of starting a record label but now Mark Morrison has spoilt that dream for me.", "There is no loyalty in this business - just greed.\"", "But Morrison is determined the album will be released on Monday.", "He said: \"The injunction is ludicrous.", "I signed a new deal with a new record company because I was not getting the support I needed from 2 Wikid.", "I was with that label for a year and in that time released just one record, which was not properly promoted.", "He added: \"The whole world is waiting for this album and it will come out on December 27.", "No injunction or judge will stop it.", "The Mack will return.\"", "The case is set to be heard in the High Court on 20 December."], "smollm:1.7b": ["Mark Morrison's album Innocent Man was released on 24 January 2013, but it failed to generate significant interest and sales.", "This summary highlights the key points of the text:\n\n1.", "The court injunction halts Mark Morrison from releasing an album.", "2.", "Premiership footballer Kevin Campbell signed Morrison to his label and claims he spent thousands of pounds producing the album.", "3.", "Morrison now vows to ignore the order, saying \"no judge is gonna stop me\".", "4.", "Morrison, who is known for his brushes with the law than his music career, rose to fame with the 1996 single Return of the Mack.", "5.", "But the Leicester singer has struggled to repeat its success following two spells in jail.", "One was for hiring a stand-in to complete his community service for possession of a stun gun and three-months following a nightclub fracas.", "He signed to Mr Campbell's label a year ago and has released one single, with the label saying the album was due for release on 24 January.", "But Mr Campbell said he learned that Morrison planned to release the album through Jet Star, which is advertising it on its website.", "6.", "The injunction is ludicrous because Mark Morrison had worked hard to realize his ambition in football but had hoped that his future career would be in the music business.", "He has always dreamedt of starting a record label but now Morrison has spoilt that dream for him.", "There is no loyalty in this business - just greed.", "7.", "The court case is set to be heard on 20 December."], "deepseek-r1:1.5b": ["Kevin Campbell has a court injunction stopping R&B singer Mark Morrison from releasing his album \"Innocent Man.\"", "Everton striker Vicid Records was involved in his signing, but Morrison is now released by another label on Monday.", "Morrison attempted to avoid the injunction due to legal issues but kept trying, calling the court judgment \"guts\" and hoping the album would come out on December 27 despite the court hearing scheduled for December 20th.", "Morrison's career path was split—he hoped in music but now he's in football.", "The case centers on his failed attempts to secure a new deal with Vicid and the business model issues related to his previous label, which failed to succeed after Morrison repeated his success."], "tinyllama:1.1b": ["Court halts Mark Morrison's album release, citing injunction from Everton footballer and record label boss Kevin Campbell, who claimed Morrison had spent thousands of pounds producing the singer's previous album.", "Morrison has since released another single but the label is now appealing against the injunction and will relase his forthcoming debut album on 27 December, with Morrison saying he will not stop it despite the court order.", "The case is set to be heard in the High Court on 20 December."], "tinydolphin:1.1b": [" This text provides a brief overview of an event where a musician named Mark Morrison was prevented from releasing an album by a record label and a court injunction was granted for him.", "He had signed a deal with Everton striker Kevin Campbell's new company, 2 Wikid Records.", "The injunction stated that if Mark Morrison released the album before December 27, no injunction would be issued.", "His attorney, Mr. Campbell, said he is \"completely gutted\" and plans to file an appeal in a bid to overturn the decision."], "phi:2.7b": [" A court has temporarily halted Mark Morrison's planned release of his debut album due to a legal dispute with Kevin Campbell, who had signed him to 2 Wikid Records and spent thousands on its production.", "Morrison, known for his brushes with the law as well as his music career, aims to ignore the injunction and go ahead with the release through Jet Star instead.", "Campbell regrets not having enough loyalty in the music industry."], "orca-mini:3b": [" Kevin Campbell, a footballer and record company boss, has obtained a court injunction stopping Mark Morrison from releasing an album.", "Morrison signed to Campbell's label but plans to release the album through another label.", "Morrison has a history of brushes with the law, including hiring a stand-in for community service and being sentenced to three months in jail following a nightclub fracas."], "hermes3:3b": ["Mark Morrison's album release halted by court; Premiership footballer Kevin Campbell gains injunction against singer's new album."], "stablelm-zephyr:3b": ["A court has granted a temporary injunction to Premiership footballer Kevin Campbell's 2 Wikid Records label, halting the release of R&B singer Mark Morrison's album, \"Innocent Man.\"", "The Everton striker signed Morrison to the label and claims he spent thousands producing the album.", "Morrison, known for his single \"Return of the Mack\" from 1996, has faced legal issues and struggled to replicate his past success.", "2 Wikid had advertised the album for release on January 24th but discovered plans to release it through Jet Star.", "The case will be heard in the High Court on December 20th."], "chatgpt-4o-latest": ["Kevin Campbell, Everton footballer and head of 2 Wikid Records, obtained a court injunction to stop R&B singer Mark Morrison from releasing his album *Innocent Man* through another label.", "Campbell claims he invested heavily in the album's production and was blindsided by Morrison's deal with Jet Star.", "Morrison, known for legal troubles and his 1996 hit *Return of the Mack*, insists the injunction is invalid and vows to release the album as planned.", "He argues 2 Wikid did not support him adequately.", "Campbell expressed disappointment, saying Morrison's actions have shattered his music industry ambitions.", "The case will be heard in the High Court on 20 December."], "stablelm2:1.6b": ["Record company boss Kevin Campbell has obtained a court injunction blocking R&B singer Mark Morrison from releasing his album through another label, following a disagreement between the two parties.", "Despite this setback, Morrison vowed to release the album as planned on December 1st.", "This case is set to be heard in the High Court on December 1st."], "granite3.1-dense:2b": ["Premier League footballer Kevin Campbell, who founded record label 2 Wikid Records, obtained a court injunction to prevent R&B singer Mark Morrison from releasing his album Innocent Man on Jet Star.", "Morrison, known for the hit \"Return of the Mack,\" signed with Campbell a year ago but released only one single due to perceived lack of support from 2 Wikid Records.", "Despite the injunction, Morrison vowed to proceed with the album release on December 27, stating he was with Jet Star because it offered better promotion and support for his music.", "The case will be heard in the High Court on December 20."]}