{"raw_text": "Early Elvis recordings go on sale\n \n Some of Elvis Presley's earliest recordings - including takes of All Shook Up - are going under the hammer on Sunday at a Los Angeles auction.\n \n The six unedited reel-to-reel tapes - which were owned by the engineer who recorded them - are valued at up to $50,000 (£29,000). Highlights of the two hour-long collection will get their public debut at Bonhams auction house on Saturday. The RCA tapes date from September 1956 to September 1957. The \"pre-masters\" include a take of Jailhouse Rock, religious songs, material for his first Christmas album, and banter between Presley, members of his band and engineer Thorne Nogar.\n \n \"We've had them for a lot of years, and I think the people should enjoy them,\" Nogar's son Stephen, 57, said. \"And frankly, we could use the money.\" Nogar, who died in 1994 aged 72, always used to make two tapes of sessions as a back-up in case RCA producers wanted to make late changes to songs. \"He called them his ass-saver tapes,\" his son said. The quality is said to be noticeably crisper than that of a new vinyl record. Because the family does not own the copyright to the music, the tapes can only be sold for \"personal enjoyment\" and they cannot be copied for commercial gain.\n", "llama3.2:1b": ["Elvis Presley's early recordings are being sold at an auction in Los Angeles on Sunday for up to $50,000.", "The six unedited reel-to-reel tapes date back to 1956-57 and include takes from songs such as \"All Shook Up\" and \"Jailhouse Rock\"."], "llama3.2:3b": ["Elvis Presley's early recordings, including unedited reel-to-reel tapes from 1956-1957, are up for sale at a Los Angeles auction valued at up to $50,000.", "The collection, which includes takes of \"All Shook Up\" and other songs, will be sold as personal enjoyment only due to copyright restrictions."], "gemma2:2b": ["Elvis Presley's early recordings from 1956-1957, including unreleased takes of \"All Shook Up\" and other material, are being auctioned in Los Angeles.", "Six unedited reel-to-reel tapes are expected to fetch up to $50,000.", "The tapes include snippets of songs, banter between Elvis and his band members, and parts for his first Christmas album."], "qwen2.5:0.5b": ["Elvis Presley's early recordings have recently been auctioned off at Bonhams, valued at up to $50, 000 (£29, 000).", "Highlights from the tapes include material from his first Christmas album, Jailhouse Rock, a take of All Shook Up, religious songs, banter between Presley and members of his band, and a recording of him singing \"All I Can Do Is Talk.\"", "The tapes date back to September 1956 to September 1957, and are unedited reel-to-reel reels.", "They feature material such as Jailhouse Rock, religious songs, the lyrics for \"Saturday Night Fever,\" and a take of \"Just like That.\"", "The quality is said to be noticeably crisp compared to new vinyl records.", "Because the tapes are not owned by the original copyright holders, they cannot be copied for commercial gain."], "qwen2.5:1.5b": ["Elvis Presley's earliest recordings go on sale at auction in Los Angeles; six unedited reel-to-reel tapes valued at up to $50, 000 are being offered; includes takes of All Shook Up, Jailhouse Rock, religious songs, and banter between Presley, members of his band, and engineer Thorne Nogar."], "qwen2.5:3b": ["Early Elvis recordings, including takes of All Shook Up, are going up for auction at Bonhams in Los Angeles.", "Six unedited reel-to-reel tapes valued up to $50,000 were owned by engineer Thorne Nogar, who recorded them between 1956 and 1957.", "The collection includes a take of Jailhouse Rock, religious songs, material for Presley's first Christmas album, and banter with his band members.", "The family can only sell the tapes for personal enjoyment as they do not own the copyright to the music."], "opencoder:1.5b": ["Early Elvis recordings go on sale.", "Some of Elvis Presley's earliest recordings - including takes of All Shook Up - are valued at up to $50,000 (£29,000).", "Highlights of the two hour-long collection will get their public debut at Bonhams auction house on Saturday."], "smollm:1.7b": ["Early Elvis recordings go on sale at auction house"], "deepseek-r1:1.5b": ["Early Elvis Presley recordings are on sale at a Los Angeles auction, featuring six unedited reel-to-reel tapes from 1956 to 1957.", "These tapes, owned by an engineer, are valued up to $50,000 or £29,000 and include tracks like \"Jailhouse Rock,\" religious songs, early Christmas album covers, and interactions between Presley, band members, and Thorne Nogar.", "Stephen Nogar's son remembers the tapes as a family memory and believes they remain personal works.", "The collection will be debut at Bonhams auction house on Saturday, featuring two hours of material."], "tinyllama:1.1b": ["Fans can bid on Elvis Presley's early recording sessions, including takes of All Shook Up, as they come under the hammer at Bonham Auctions.", "The six reel-to-reel tapes, which were recorded by engineer Thorne Nogar, are worth up to $50,000 ($34,127.69) and include rare gems like a take of Jaishanar Rock, religious songs, material for his first Christmas album, and banter between Presley and members of his band and engineer Thorne Nogar.", "The family does not own the copyright to the music, so the tapes can only be sold for personal enjoyment and cannot be used commercially."], "tinydolphin:1.1b": [" Early Elvis recordings are going on sale at an auction in Los Angeles.", "The six unedited reel-to-reel tapes include takes of All Shook Up, a song he wrote with his manager, Colonel Tom Parker, and members of his band.", "These rare recordings show Elvis' early work, valued at up to $50,000 (£29,000) each.", "The family is selling the tapes as a way to enjoy the music and keep some of their memories alive.", "The auction will take place on Saturday at Bonhams, an auction house in London."], "phi:2.7b": [" Elvis Presley's early recordings, including takes of All Shook Up, are going under the hammer on Sunday at an auction in Los Angeles.", "The engineer who recorded them is selling six unedited reel-to-reel tapes valued at up to $50,000.", "Highlights from the collection will be debuted at a Bonhams auction house on Saturday and include material for his first Christmas album.", "Nogar's son Stephen said the family could use the money and that they always made two tapes as backups in case of late changes to songs.", "The quality is crisper than new vinyl records, but the music cannot be sold or copied commercially due to lack of copyright ownership."], "orca-mini:3b": [" The early recordings of Elvis Presley, including takes of his hit song All Shook Up, are going on sale at an auction in Los Angeles.", "The six unedited reel-to-reel tapes were owned by the engineer who recorded them and are valued at up to $50,000.", "Highlights of the collection will get their public debut at Bonhams auction house on Saturday.", "The \"pre-masters\" include Jailhouse Rock religious songs, material for his first Christmas album, and banter between Presley, members of his band and engineer Thorne Nogar."], "hermes3:3b": ["Elvis Presley's early unreleased recordings, including \"All Shook Up\", on unedited reel-to-reel tapes owned by engineer Thorne Nogar, going up to $50k at LA auction; dating from Sep 1956-Sep 1957 and including takes of Jailhouse Rock & religious songs."], "stablelm-zephyr:3b": ["Elvis Presley's early recordings, including a take of \"All Shook Up\", are being auctioned in Los Angeles.", "The six unedited reel-to-reel tapes, owned by the engineer who recorded them, are valued at up to $50,000.", "Highlights from the collection will make their public debut at Bonhams auction house.", "The RCA tapes date from September 1956 to September 1957 and include a take of \"Jailhouse Rock\", religious songs, material for his first Christmas album, and banter between Presley and engineer Thorne Nogar.", "Because the family does not own the copyright to the music, the tapes can only be sold for personal enjoyment and cannot be copied for commercial gain."], "chatgpt-4o-latest": ["Some of Elvis Presley's earliest recordings, including takes of \"All Shook Up\" and \"Jailhouse Rock,\" are being auctioned in Los Angeles on Sunday.", "The six reel-to-reel tapes, recorded between 1956 and 1957 and owned by engineer Thorne Nogar, are valued at up to $50,000.", "Highlights will debut at Bonhams auction house on Saturday.", "The tapes contain religious songs, material for his first Christmas album, and studio banter.", "Nogar's son, Stephen, is selling them for financial reasons.", "The recordings, known for their high quality, can only be sold for personal enjoyment as the family does not own the copyright."], "stablelm2:1.6b": ["Elvis Presley's early recordings, including All Shook Up takes, will be auctioned off with six unedited reel-to-reel tapes valued at up to $100,0.", "The RCA tapes date from September 6-7 and include pre-mastered material for his first Christmas album, banter between Presley and band members, as well as religious songs.", "Since the family does not own the copyright to the music, the auction can only provide personal enjoyment, and they cannot copy the recordings for commercial gain."], "granite3.1-dense:2b": ["Elvis Presley's earliest recorded materials, including unedited takes from 1956-1957, are being auctioned off by Bonhams in Los Angeles on Saturday.", "The collection comprises two hours of material on six reel-to-reel tapes, owned by the engineer who recorded them.", "Highlights include a take of \"Jailhouse Rock,\" religious songs, parts for his first Christmas album, and candid moments between Presley, his band, and Nogar, the engineer.", "The family is selling these \"pre-masters\" for up to $50,000 (£29,000) for personal enjoyment, as they lack copyright ownership and cannot be commercially duplicated.", "The tapes' superior quality to new vinyl records makes this a significant historical find."]}