{"raw_text": "TV station refuses adoption show\n \n A TV station in the US has refused to show a controversial new series where adopted children try and pick their birth father - and win a cash prize.\n \n The WRAZ-TV Fox affiliate in North Carolina was the only one of 182 stations to refuse Monday's show. Who's Your Daddy promises $100,000 (£52,000) to the contestant if she correctly identifies her father. It was met with protests by the National Council for Adoption, which said it \"exploits\" sensitive emotions. \"It exploits the sensitive emotions of adoption,\" said Thomas Atwood, president of the National Council for Adoption. \"It trivialises them. Adoption is a very personal, meaningful experience and it should not be commercialised like this.\" On the pre-taped programme, the contestant is presented with eight men who may or may not be her natural father.\n \n If she picks the correct man from the line-up, the contestant wins the jackpot prize of US$100,000 (£52,590). However, if she picks the wrong man, then the impostor takes the money. Fox producers defended the show, saying it was a \"positive experience\". They have made six specials, though only one episode has so far been broadcast.\n \n \"The special was thoroughly vetted by our standards and practices department to ensure that it was appropriate for broadcast,\" said a Fox spokesman. \"However, any network affiliate that feels the programming may be inappropriate for their individual market has the right to pre-empt the schedule.\" WRAZ-TV instead chose to air an independently-produced film, I Have Roots and Branches... Personal Reflections on Adoption, a documentary about families with adopted children. \"We just don't think adoption is a game show,\" said Tommy Schenck, WRAZ-TV's general manager, though he said his decision had not been influenced by public protests.\n", "llama3.2:1b": ["The TV station WRAZ-TV in North Carolina refused to air the controversial new series Who's Your Daddy due to concerns that it exploits sensitive emotions and trivializes adoption.", "The show features adopted children trying to pick their birth father and win a cash prize, which was met with protests from the National Council for Adoption."], "llama3.2:3b": ["A US TV station refused to air the show \"Who's Your Daddy\" which promised $100,000 to contestants who correctly identified their birth father, citing it as a \"sensitive emotional experience\".", "The National Council for Adoption condemned it as an \"exploitation\" of adoption emotions."], "gemma2:2b": ["A US TV station in North Carolina refused to air a show where adopted children try to find their birth fathers and win cash.", "The show, \"Who's Your Daddy,\" was met with criticism from adoption advocacy groups who felt it exploited the sensitive nature of adoption and trivialized the experience.", "Fox defended the show as a positive experience and maintained that their decision had been made based on internal review standards.", "A separate documentary about families with adopted children aired instead."], "qwen2.5:0.5b": ["A TV station in North Carolina refused to air a controversial new series where adoptive children try and pick their birth father - who wins a cash prize of $100, 000 (£52, 000) if correct identification is made.", "The programme was presented as positive but Fox producers defended it saying the programming was appropriate for broadcast."], "qwen2.5:1.5b": ["A US TV station in North Carolina refused to air an adoption-themed game show because it was considered exploitative of adoptees' feelings and emotions.", "The network chose instead to show a documentary about families with adopted children instead.", "Fox producers defended the show, stating that while they had thoroughly vetted it for appropriateness, some stations felt differently and could preempt its broadcast if necessary."], "qwen2.5:3b": ["A TV station in North Carolina refused to broadcast 'Who's Your Daddy', a show where adopted children try to identify their birth father with a cash prize, due to concerns it exploits sensitive adoption emotions.", "The National Council for Adoption protested, arguing the program trivializes personal and meaningful experiences of adoption.", "However, Fox defended the show, stating it was vetted appropriately but some affiliates may pre-empt inappropriate content.", "Instead, WRAZ-TV chose to air 'I Have Roots and Branches...", "Personal Reflections on Adoption', a documentary about families with adopted children."], "opencoder:1.5b": ["The TV station refuses the adoption show.", "A TV station in the US has refused to show a controversial series where adopted children try and pick their birth father - and win a cash prize.", "The WRAZ-TV Fox affiliate in North Carolina was the only one of 182 stations to refuse Monday's show.", "Who's Your Daddy promises $100,000 (£52,000) to the contestant if she correctly identifies her father.", "It was met with protests by the National Council for Adoption, which said it \"exploits\" sensitive emotions.", "The National Council for Adoption says it \"trivialises\" them by exploiting their sensitivities.", "The show was a positive experience for Fox producers and made six specials, though only one episode has so far been broadcast.", "It is a \"positive experience\" that defends the show's appropriateness to its individual market.", "The decision has not been influenced by public protests."], "smollm:1.7b": ["The summary should be concise and to the point, focusing on the main ideas and key details of the text.", "Here are some tips for writing a good summary:\n\n1.", "**Focus on the main idea**: Identify the central argument or claim made in the text and summarize it in your own words.", "2.", "**Use simple language**: Avoid using technical jargon or complex terminology that may be unfamiliar to readers.", "3.", "**Keep it concise**: Aim for a length of 10% to 20% of the original text, depending on the complexity of the material.", "4.", "**Leave out supporting details**: The summary should focus on the main ideas and key points, rather than including additional information or examples.", "5.", "**Use active voice**: Write in the active voice, as it is more direct and easier to read than the passive voice.", "6.", "**Avoid opinions and biases**: Stick to the facts and avoid expressing your own opinions or biases about the topic.", "7.", "**Use transitional phrases**: Use transitional phrases like \"In addition,\" \"Furthermore,\" and \"On the other hand\" to connect your ideas and create a smooth flow.", "Here's an example of a summary in response to the provided text:\n\nTV station refuses adoption show"], "deepseek-r1:1.5b": ["A TV station in the US refuses an adoption-themed series \"Who's Your Daddy,\" featuring a contestant identifying her father to win $100,000.", "The WRAZ affiliate in North Carolina was the only one of 182 stations to refuse Monday's show.", "The National Council for Adoption opposed, calling it exploititizing sensitive emotions.", "Fox producers defended with specials, while WRAZ chose an independently-produced documentary about adopted families."], "tinyllama:1.1b": ["A TV station in the US has refused to broadcast a new series where adopted children try and pick their birth father - and win a cash prize.", "The WRAZ-TV Fox affiliate in North Carolina was the only one of 182 stations to refuse the show.", "This show is being presented as a \"positive experience\" but has met opposition from the National Council for Adoption, who claim it exploits sensitive emotions and should not be commercialized like this.", "The show is a \"game show\", with contestants picking the correct man from a line-up to win US$100,000 (£52,590).", "However, if they pick the wrong one, they have to pay the impositor money."], "tinydolphin:1.1b": [" WRAZ-TV, the North Carolina TV station that refused to air \"Any Given Child,\" a TV show promoting adoption as a commercial enterprise, is facing backlash for its refusal to broadcast a similar series.", "This decision has been met with condemnation from various organizations and individuals.", "The National Council for Adoption, which opposes the show, has called it exploitative and trivializes adoption by implying that a contestant might win money if they choose the wrong dad.", "The special in question is \"Any Given Child: Adoption Journeys,\" which was aired on Fox's WRAZ-TV channel but was later pre-empted for an independently-produced documentary, \"I Have Roots and Branches...", "Personal Reflections on Adoption.\"", "This documentary explores the lives of families with adopted children and provides personal reflections on their experiences.", "The show has been met with mixed reviews, though it is not scheduled to air again in North Carolina as a result of WRAZ-TV's decision."], "phi:2.7b": [" A TV station in the US has refused to air a controversial new series where adopted children try and pick their birth father for a cash prize.", "The National Council for Adoption protested against the show's commercialisation of sensitive emotions surrounding adoption.", "However, the station instead chose to air an independently-produced film about families with adopted children."], "orca-mini:3b": [" A TV station in the US refused to air a controversial new series that promised $100,000 to the contestant if she correctly identified her father.", "The show, Who's Your Daddy, was met with protests from the National Council for Adoption which said it \"exploits\" sensitive emotions.", "The only TV station to refuse the show was WRAZ-TV Fox affiliate in North Carolina, which aired an independent documentary instead.", "The producer of the show defended its contents as appropriate for broadcast despite the objections of some viewers and TV stations."], "hermes3:3b": ["TV station refuses show about adopted kids trying to identify birth father for cash prize.", "WRAZ-TV Fox affiliate in NC rejected the series due to potential exploitation of adoption emotions and objections from National Council for Adoption."], "stablelm-zephyr:3b": ["A TV station in North Carolina, WRAZ-TV Fox affiliate, refused to air a show called \"Who's Your Daddy\" where adopted children try to identify their birth father and win $100,000.", "The National Council for Adoption protested that the show exploites sensitive emotions of adoption.", "Fox producers defended the show as a positive experience, but WRAZ-TV decided to air an independently produced documentary instead about families with adopted children."], "chatgpt-4o-latest": ["A US TV station, WRAZ-TV in North Carolina, refused to air the controversial Fox show *Who's Your Daddy*, where adopted children try to identify their birth father for a $100,000 prize.", "The show faced criticism from the National Council for Adoption, which argued it exploited sensitive emotions.", "Fox defended the program as a \"positive experience\" and had produced six specials, though only one had aired.", "WRAZ-TV opted instead to broadcast a documentary on adoption, stating that adoption should not be treated as a game show."], "stablelm2:1.6b": ["A TV station in North Carolina refused to air the show \"Who's Your Daddy,\" which promotes adoption and involves contestants trying to identify their birth father for a cash prize.", "The National Council for Adoption criticized the show as it exploits sensitive emotions, while some critics argued that adoption is a meaningful experience that should not be commercialized.", "However, Fox producers said the show was positive and appropriate for broadcast.", "Only one episode has been aired, but WRAZ-TV chose to air an independent documentary instead."], "granite3.1-dense:2b": ["WRAZ-TV, an affiliate of Fox in North Carolina, refused to broadcast \"Who's Your Daddy,\" a controversial series where adopted children attempt to identify their biological fathers for a $100,000 prize.", "The National Council for Adoption criticized the show as exploitative and trivializing sensitive emotions related to adoption.", "WRAZ-TV opted instead to air an independently produced documentary, \"I Have Roots and Branches...", "Personal Reflections on Adoption,\" emphasizing that they view adoption as a personal journey, not a game show.", "This decision was influenced by their belief in the show's potential to trivialize adoption rather than public protests."]}