{"raw_text": "A-listers flock to Gervais sitcom\n \n Hollywood actors Samuel L Jackson and Ben Stiller have signed up for Ricky Gervais' new sitcom, the comedian has told BBC News.\n \n He said they had both seen the scripts and had agreed to appear in an episode each of the sitcom Extras. They join British stars Jude Law and Kate Winslet who have been booked for guest roles. The comic and actor said he had drawn up an A-list of stars he wanted and all had agreed to be in it. \"We wanted actors who had iconic status but that we could also deconstruct,\" Gervais told BBC News.\n \n \"It's not about the zeitgeist. We wanted people who would still be around in 20 years, not just the winner of Big Brother to take part.\" Gervais admitted he was cautious about revealing who would be taking part until they had all signed on the dotted line. But he has met with Stiller and Jackson and they enjoyed the scripts enough to commit to it.\n \n \"I didn't want to start revealing names until it was all sorted because people just mention people who haven't even been asked. \"I have been linked with ridiculous stories recently such as I'm going to be in a remake of 10 taking Dudley Moore's part. I haven't been approached and I wouldn't take it anyway.\"\n \n He said Stiller and Jackson would be playing \"twisted\" versions of themselves in Extras and that the jokes about them \"would sail pretty close to the bone\". Gervais and his writing partner Stephen Merchant are currently refining the scripts for the six-part series, in which Gervais plays a struggling actor who bitches about the stars. Meanwhile, Gervais is gearing up to promote his cartoon book Flanimals which is released in the US in March, around the same time as NBC begin showing the US version of The Office. The film rights to Flanimals have already been snapped up but Gervais is keen for the project to be taken slowly. \"A film will happen over the next three years but I don't want it to be a $50m movie straight away because it is not well enough known and it wouldn't be another Spider-Man or Batman. I would like to do something small on TV with it first.\"\n", "llama3.2:1b": ["Samuel L Jackson and Ben Stiller have signed up for Ricky Gervais' new sitcom Extras, along with Jude Law and Kate Winslet.", "The cast includes A-listers who fit Gervais' criteria of being iconic but not currently relevant to the zeitgeist.", "They will play twisted versions of themselves in a six-part series.", "Gervais has been cautious about revealing names until all parties agree to participate."], "llama3.2:3b": ["Ricky Gervais' new sitcom Extras will feature A-list actors Samuel L Jackson, Ben Stiller, Jude Law, and Kate Winslet in guest roles.", "The show's format involves a struggling actor who bitches about the stars.", "Gervais had to secure commitments from his chosen actors after receiving false rumors about him working on remakes or projects with low budgets."], "gemma2:2b": ["Samuel L. Jackson and Ben Stiller have joined Ricky Gervais' new sitcom, \"Extras\".", "Jude Law and Kate Winslet are also appearing as guest stars.", "The show will feature iconic actors played in a twisted way.", "The series focuses on a struggling actor who complains about famous people."], "qwen2.5:0.5b": ["The A-listers, including Samuel L Jackson and Ben Stiller, have signed up for Ricky Gervais' new sitcom Extras, a project that involves guest appearances by British stars Jude Law and Kate Winslet.", "The comic actor drew up an \"A-list\" of stars he wanted to include in the series, with all actors being selected through a process of agreement and commitment to participate.", "Gervais has met with Jackson, Stiller, and other cast members, enjoying the scripts they agreed on.", "He plans to refine the scripts for Extras before releasing the show, aiming to release it around March 2019."], "qwen2.5:1.5b": ["Hollywood actors Samuel L. Jackson, Ben Stiller, Jude Law, and Kate Winslet have signed up for Ricky Gervais' new sitcom \"Extras\".", "The series features deconstructed versions of their iconic roles, aiming for enduring relevance in 20 years rather than current trends.", "The writers are refining scripts for a six-part show about a struggling actor who bickers with celebrities, set to premiere alongside NBC's \"The Office\" on March 16."], "qwen2.5:3b": ["Hollywood actors Samuel L Jackson and Ben Stiller have joined Gervais's new sitcom Extras, following stars Jude Law, Kate Winslet, and those of the A-list.", "The show features deconstructed versions of iconic personalities from present day.", "Gervais is cautious about revealing cast details until all are signed.", "Extras explores a struggling actor’s complaints towards famous individuals, with Gervais and Merchant refining scripts for six episodes.", "Gervais also promotes his cartoon book Flanimals in the US, emphasizing he prefers a gradual rollout before investing in a $50m film adaptation."], "opencoder:1.5b": ["Gervais flock, who has signed up for Ricky Gervais' new sitcom, watched the scripts as they were being made.", "They agreed to appear in an episode each of the sitcom Extras, with actors Jude Law and Kate Winslet both booked roles.", "The comic and actor told BBC News that they had drawn up a list of stars who had previously expressed excitement about them.", "Gervais explained that he wanted a cast who remained around in 20 years, as long as they signed on the dotted line.", "He pointed out that they enjoyed the scripts enough to commit to it and met with Stiller and Jackson.", "The comic suggested that they would play \"twisted\" versions of themselves in Extras about the jokes about them having \"sail pretty close to the bone\".", "The scriptwriters of Flanimals, which was released in the US, had already been snapped up.", "They are aiming for a small-scale movie with Gervais and his writing partner Stephen Merchant."], "smollm:1.7b": ["The summary should preserve key ideas and details from the original text, while omitting unnecessary information such as explanations, formatting, and reasoning processes.", "The main points of the original text are:\n\n1.", "A-listers flock to Gervais sitcom\n2.", "Hollywood actors Samuel L Jackson and Ben Stiller have signed up for Ricky Gervais' new sitcom\n3.", "They join British stars Jude Law and Kate Winslet who have been booked for guest roles\n4.", "The comic and actor said they wanted actors who had iconic status but that they could also deconstruct\n5.", "They want to sign up with people who would still be around in 20 years, not just the winner of Big Brother to take part\n6.", "They are cautious about revealing names until it was all sorted because people just mention people who haven't been asked\n7.", "The jokes about them \"would sail pretty close to the bone\"\n8.", "Gervais and his writing partner Stephen Merchant are currently refining the scripts for the six-part series, in which Gervais plays a struggling actor who bites about the stars\n9.", "Gervais is gearing up to promote his cartoon book Flanimals, which is released in the US in March, around the same time as NBC begin showing the US version of The Office\n10.", "The film rights to Flanimals have already been snapped up but Gervais is keen for the project to be taken slowly.", "He would like to do something small on TV with it first"], "deepseek-r1:1.5b": ["Samuel L Jackson and Ben Stiller signed up as guest stars in Ricky Gervais' new sitcom, with Gervais expressing cautious plans but aiming for lasting fame.", "He wanted actors who could still thrive in 20 years, not just the big star of Big Brother.", "He linked with some absurd stories and hinted at twisted roles for Extras.", "Gervais is working on Flanimals film rights, which he wants to promote by first developing a TV project instead of a big movie."], "tinyllama:1.1b": ["Hollywood actors Samuel L Jackson and Ben Stiller have signed up for Ricky Gervais' new sitcom Extras, which stars them in an episode each.", "The comic and actor has been seeking out A-list stars to appear in the sitcom, drawing up a list of iconic actors but cautioning against revealing who will be taking part until they have all signed on the dotted line.", "Despite being linked with \"ridiculous stories\", Gervais hasn't been approached for any roles and is hesitant about revealing names before they are confirmed, citing \"twisted\" versions of themselves as a spoiler.", "The six-part series will release in March before Gervais promotes his cartoon book Flanimals in the US in March.", "Gervais wants to take a more cautious approach to revealing potential stars and is keen for The Office to be taken slowly, citing its well-known popularity as an inspiration for his TV debut."], "tinydolphin:1.1b": [" Actor Ricky Gervais has signed up stars Samuel L Jackson, Ben Stiller, Jude Law, Kate Winslet, and British actor Jake Gyllen to join him in a new sitcom.", "The comedy series will be called Extras, and all the actors are expected to appear in an episode each.", "Gervais has met with both actors to discuss their participation in the show, which he hopes will not only have memorable comedic moments but also iconic status for those involved.", "The sitcom is set to premiere on NBC in March."], "phi:2.7b": [" Ricky Gervais has signed Hollywood actors Samuel L Jackson and Ben Stiller for his new sitcom Extras, which will include guest roles from British stars Jude Law and Kate Winslet.", "The comedy features iconic actors who will still be around in 20 years and was developed to have a unique set of characters.", "However, the names of the actors have not been revealed until they all sign on, as Gervais does not want anyone's name mentioned until then.", "Stiller and Jackson will play \"twisted\" versions of themselves in the show and the jokes about them will be edgy but not offensive.", "Gervais is also promoting his book Flanimals which will be released in March and has already sold film rights to it."], "orca-mini:3b": [" Ricky Gervais has signed up Samuel L. Jackson and Ben Stiller for his new sitcom, Extras, along with Jude Law and Kate Winslet.", "The comic and actors have agreed to appear in an episode each of the sitcom, which features Gervais as a struggling actor who bitches about the stars.", "The show will air on BBC3 and is due to be released in 2005."], "hermes3:3b": ["Hollywood stars Samuel L Jackson, Ben Stiller join Ricky Gervais' sitcom Extras; aim for iconic actors who can still be deconstructed in the show."], "stablelm-zephyr:3b": ["Hollywood actors Samuel L Jackson and Ben Stiller have joined Ricky Gervais' new sitcom, Extras, along with British stars Jude Law and Kate Winslet for guest roles.", "Gervais wanted iconic status actors who would still be around in 20 years, not just reality TV winners.", "The six-part series focuses on a struggling actor who bitches about the stars, with Gervais playing that character and Merchant assisting in script refinements.", "Additionally, Gervais is preparing for the US release of his cartoon book Flanimals in March, and aims to do a smaller TV project featuring the characters instead of a big film adaptation."], "chatgpt-4o-latest": ["Hollywood stars Samuel L. Jackson and Ben Stiller have joined Ricky Gervais' new sitcom, Extras, each appearing in an episode.", "They join British actors Jude Law and Kate Winslet in guest roles.", "Gervais sought iconic actors who could be humorously deconstructed and confirmed their participation only after securing commitments.", "Stiller and Jackson will play exaggerated versions of themselves, with jokes pushing boundaries.", "Gervais and co-writer Stephen Merchant are refining the scripts for the six-part series, where Gervais plays a struggling actor.", "Meanwhile, Gervais is promoting his cartoon book Flanimals, set for a U.S. release in March, alongside NBC's launch of the American version of The Office.", "Film rights for Flanimals have been acquired, but Gervais prefers a gradual development rather than an immediate big-budget production."], "stablelm2:1.6b": ["Hollywood actors Samuel L Jackson and Ben Stiller will join Ricky Gervais in his new sitcom \"Extras,\" alongside British stars Jude Law and Kate Winslet, after both read the scripts.", "A-list guests were chosen for their iconic status rather than current fame.", "Filming is set to begin in 2007.", "Gervais and Merchant are currently developing the six-part series, with Gervais playing a struggling actor who bitches about the stars."], "granite3.1-dense:2b": ["A-list Hollywood actors, including Samuel L. Jackson and Ben Stiller, have agreed to appear in Ricky Gervais' new sitcom, Extras.", "This comes as part of an A-list cast also featuring British stars Jude Law and Kate Winslet.", "Gervais aims to deconstruct the iconic status of these celebrities, ensuring they remain influential figures by 2024.", "Stiller and Jackson will portray \"twisted\" versions of themselves in the series, with jokes approaching the bone-crushing level.", "The six-part sitcom follows Gervais' character, a struggling actor who frequently criticizes his famous counterparts.", "Meanwhile, Gervais is promoting his cartoon book, Flanimals, set to release in the US in March alongside the US version of The Office on NBC.", "He plans for a gradual film adaptation over three years, prioritizing small-scale TV production first due to the project's current unknown status."]}