{"raw_text": "EastEnders 'is set for US remake'\n \n Plans to create a US soap based on the BBC's EastEnders have reportedly been drawn up by the Fox TV network.\n \n EastEnders' head writer Tony Jordan and music mogul Simon Fuller are involved in the project, according to reports in the Hollywood Reporter trade newspaper. It said scripts have been commissioned for a series about a community of working class people in of Chicago. The original EastEnders was pulled from BBC America last year after it proved a failure in the ratings. US versions of other British hits have proved less successful across the Atlantic.\n \n BBC comedy Coupling was remade with a US cast, but lost its primetime slot on the NBC network due to disappointing ratings. At home, EastEnders has been facing its own ratings battle, recently losing out to rival ITV soap Emmer dale. Primetime soaps on US television have made a recent comeback, following the success of ABC serial Desperate Housewives. The series takes a \"darkly comedic\" look at the goings-on of a group of characters living in the suburbs.\n", "llama3.2:1b": ["EastEnders is set for a US remake and will feature scripts commissioned by Fox TV network's head writer Tony Jordan and music mogul Simon Fuller, based on the BBC original series featuring a working-class community in Chicago."], "llama3.2:3b": ["BBC's EastEnders is reportedly being remade as a US soap by Fox TV with Tony Jordan and Simon Fuller involved, scripts commissioned for a show about working-class people in Chicago, despite previous UK adaptations failing in the US and similar British shows experiencing low ratings."], "gemma2:2b": ["Fox TV plans a US remake of the British soap opera EastEnders, involving writer Tony Jordan and music mogul Simon Fuller.", "The show will center on working class people in Chicago and follows the original's themes.", "Past attempts to adapt British shows for American audiences, like Coupling, haven't been as successful."], "qwen2.5:0.5b": ["EastEnders is set for a US remake and has reportedly been drawn up by Fox TV to create a soap based on the BBC's EastEnders.", "Tony Jordan and Simon Fuller are involved, with scripts having been commissioned for a series about working-class people in Chicago.", "BBC comedy \"Coupling\" was remade with a US cast but struggled for a prime-time slot on NBC due to low ratings.", "EastEnders is facing its own ratings battle at home and has seen renewed interest in US television following the success of Desperate Housewives."], "qwen2.5:1.5b": ["Fox TV plans to remake EastEnders into a US soap opera based on Chicago's working-class community, citing similar dark comedy and primetime success as models for their new project.", "The original version struggled with ratings but could potentially capitalize on recent US soaps' resurgence.", "This would be the first major British series remade in America since Coupling, which faced similar issues."], "qwen2.5:3b": ["Plans for a US remake of BBC's EastEnders are being developed by Fox TV.", "Head writer Tony Jordan and music mogul Simon Fuller are involved.", "Scripts have been commissioned for a Chicago-set drama about working-class people, inspired by EastEnders.", "Previous US versions of British soaps like Coupling failed to retain their slots due to poor ratings.", "EastEnders has struggled in the US market, facing competition from rival soap Emmerdale.", "Recent success with shows like ABC's Desperate Housewives suggests renewed interest in primetime soaps on US TV."], "opencoder:1.5b": ["EastEnders has been set for a remake by Fox TV network and reportedly involved in the project with Tony Jordan and Simon Fuller.", "It is reported that the project includes commissioned scripts for a community of working-class people in Chicago, and it was pulled from BBC America last year due to its failure in ratings.", "US versions of other British hits have proved less successful across the Atlantic, but they have made recent comeback at home, facing its own ratings battle after it failed.", "At ITV soap Emmerdale has lost a disappointing rating, while Coupling has been losing again on the NBC network.", "Primetime soaps on US television have made a recent comeback following ABC series Desperate Housewives.", "The project is set to create a US soap based on BBC's EastEnders and it takes a \"comedic\" look at the goings-on of a group of characters living in the suburbs.", "The soap, due to its comedic nature, is likely to have similar themes as EastEnders."], "smollm:1.7b": ["EastEnders is set for a US remake.", "Plans to create a US soap based on the BBC's EastEnders have reportedly been drawn up by the Fox TV network.", "The original EastEnders was pulled from BBC America last year after it proved a failure in the ratings.", "US versions of other British hits have proven less successful across the Atlantic.", "BBC comedy Coupling was remade with a US cast, but lost its primetime slot on the NBC network due to disappointing ratings.", "At home, EastEnders has been facing its own ratings battle, recently losing out to rival ITV soap Emmer dale.", "Primetime soaps on US television have made a recent comeback, following the success of ABC serial Desperate Housewives.", "The series takes a \"darkly comedic\" look at the goings-on of a group of characters living in the suburbs."], "deepseek-r1:1.5b": ["EastEnders 's US remake plans involve Fox TV with writer Tony Jordan and music mogul Simon Fuller.", "The project draws inspiration from the BBC's EastEnders series, focusing on a working-class community in Chicago.", "The original BBC show was pulled by BBC America due to poor ratings.", "The US comedy series BBC comedy Coupling faced disappointment but remains home-based.", "Meanwhile, primetime soaps have seen a resurgence with shows like Desperate Housewives, and EastEnders is facing its own ratings battle on the US TV scene."], "tinyllama:1.1b": ["EastEnders is set for US remaking, according to reports in Hollywood Reporter trade newspaper.", "Tony Jordan and Simon Fuller are involved in the project, with scripts commissioned for a series about a community of working class people in Chicago.", "The original EastEnders was pulled from BBC America last year due to low ratings, but the remaking has attracted US interest despite its own battles at home.", "Despite losing prime time to rival shows, American soap Desperate Housewives has had success with darkly comedic serials and similar plots have gained popularity on US television."], "tinydolphin:1.1b": [" The EastEnders soap is set to receive a US remake with plans for a new, darker version of the story set in the suburbs.", "The head writer and music mogul Tony Jordan and Simon Fuller are involved in this project, which may or may not see its way onto primetime on the NBC network."], "phi:2.7b": [" Plans for an EastEnders remake are in the works with Tony Jordan and Simon Fuller involved in creating a US version set in Chicago, set to air on Fox TV network.", "Despite previous failures in ratings, there is hope that this new version will be successful after other British shows such as Desperate Housewives have made a comeback."], "orca-mini:3b": [" The text reports that plans have been made to create a US soap based on the BBC's EastEnders, with head writer Tony Jordan and music mogul Simon Fuller involved in the project.", "The series will be set in Chicago and take a \"darkly comedic\" look at the goings-on of a group of characters living in the suburbs.", "The text also mentions other British hits that have been remade in the US, such as Coupling, but notes that those shows have not been as successful as expected.", "Finally, the text notes that primetime soaps on US television are making a comeback following the success of ABC's Desperate Housewives."], "hermes3:3b": ["EastEnders US remake planned by Fox TV, involving Tony Jordan & Simon Fuller; Chicago-set series based on BBC's failed BBC America version."], "stablelm-zephyr:3b": ["Fox TV network plans to create a US version of EastEnders, with involvement from head writer Tony Jordan and music mogul Simon Fuller.", "This follows the unsuccessful NBC adaptation of BBC comedy Coupling.", "The success of ABC's Desperate Housewives has led to a renewed interest in primetime soaps in the US."], "chatgpt-4o-latest": ["Fox TV is reportedly planning a US remake of the BBC soap EastEnders, with head writer Tony Jordan and music mogul Simon Fuller involved.", "Scripts have been commissioned for a series about a working-class community in Chicago.", "The original EastEnders was pulled from BBC America due to low ratings, and past US adaptations of British shows, like Coupling, have struggled.", "Meanwhile, EastEnders faces competition from ITV's Emmerdale in the UK.", "The revival of primetime US soaps, spurred by the success of Desperate Housewives, may influence the remake's prospects."], "stablelm2:1.6b": ["The BBC's \"EastEnders\" is reportedly set for a US remake by Fox TV network, with head writer Tony Jordan and music mogul Simon Fuller involved.", "The project will focus on a community of working-class people in Chicago, with scripts commissioned for a show about them.", "This follows the failure of previous attempts to make a US version of \"EastEnders\" and other British hits like \"Coupling.\"", "However, primetime soaps on US television have recently seen a revival due to shows like \"Desperate Housewives.\""], "granite3.1-dense:2b": ["Fox TV is reportedly developing a US remake of EastEnders, based on the BBC's popular British soap set in London's East End.", "The project involves head writer Tony Jordan and music executive Simon Fuller.", "The series will feature a working-class community in Chicago, mirroring the original's focus on a diverse ensemble.", "Despite initial plans to air it on BBC America, the show was cancelled due to poor ratings.", "Previous US remakes of British hits, such as Coupling and Desperate Housewives, have also faced challenges in maintaining their primetime spots.", "EastEnders itself has been experiencing domestic viewership struggles against rival ITV soap Emmerdale.", "The new EastEnders aims to adopt a darkly comedic tone similar to Desperate Housewives, which has recently seen a resurgence in US primetime soaps."]}