{"raw_text": "US 'to raise TV indecency fines'\n \n US politicians are proposing a tough new law aimed at cracking down on indecency and bad language on US TV.\n \n Fines of up to $500,000 (£266,582) could be imposed each time broadcasters transmit nudity or profanities. The proposal, unveiled in the House of Representatives, also seeks to revoke a broadcaster's licence after three violations have been committed. The exposure of Janet Jackson's breast at last year's Superbowl landed CBS with a $550,000 (£293,264) fine. Entertainers could also be liable for fines under the proposed legisation from both US politcians and officials from the Federal Communications Commission (FCC). A Republican senator from Kansas, Sam Brownbeck, is set to call for a maximum $3 million (£1.6 million) fine for repeated violations.\n \n The current maximum fine stands at $32,500 (£17,320) - 20 of the stations in the CBS network were each penalised these lesser amounts for the Jackson incident. Republican politician Fred Upton, who chairs the committee responsible for broadcasting, said current fines are \"more of a cost of doing business rather than a deterrent\". Last year's Janet Jackson 'wardrobe malfunction' encouraged the FCC to impose tougher rules, but the US Congress adjourned last year without agreeing on a new level of fines. New figures have to be decided before new legislation can be put before President Bush. Certain broadcasters, like Fox, claim the material they carry does not violate indecency laws and is protected under the right to free speech.\n", "llama3.2:1b": ["US politicians are proposing new TV indecency fines, up to $500,000 per transmission of nudity or profanity.", "The proposal includes a maximum fine of $3 million for repeated violations.", "Janet Jackson's Super Bowl exposure in 2004 led to CBS receiving a $550,000 fine, and Republican Senator Sam Brownbeck plans to propose a maximum fine of $3 million.", "The current maximum fine is $32,500."], "llama3.2:3b": ["US politicians propose law to increase TV indecency fines up to $500,000 for nudity or profanities, with revocation of licenses after 3 violations; current maximum fine is $32,500."], "gemma2:2b": ["The US House of Representatives is proposing to raise TV indecency fines up to $500,000 per incident, with potential license revocation after three violations.", "This follows a Janet Jackson 'wardrobe malfunction' incident in 2004 which led to a fine of $550,000 for CBS.", "Entertainers could also be liable under the proposed law, with fines reaching up to $3 million in some cases.", "Current fines are relatively low and considered ineffective as a deterrent by many politicians, and new legislation has to be decided before implementation can take place."], "qwen2.5:0.5b": ["US lawmakers are considering tough TV regulations aimed at punishing bad language and nudity.", "Fines could reach up to $500, 000 (£266, 582) for each violation, revoking a broadcaster's licence after three violations.", "Fox believes their content does not violate indecency laws but claims it is protected by free speech.", "New TV regulations must be decided before President Bush can put them before him."], "qwen2.5:1.5b": ["US lawmakers propose stiff penalties for indecency on TV, aiming to revoke licenses upon three violations; Janet Jackson's Super Bowl incident led to a $550,000 fine, with potential maximum fines of $3 million (£1.6 million) and up to $500,000 (£266,582) for repeat offenses."], "qwen2.5:3b": ["US politicians are proposing stricter regulations against TV indecency and profanity, including fines of up to $500,000 (£266,582) per violation for nudity or obscenity.", "The proposal aims to revoke a broadcaster's license after three violations and is aimed at both broadcasters and entertainers, with some proposing a maximum $3 million (£1.6 million) fine for repeated offenses.", "Current fines are minimal ($32,500/£17,320), and critics argue they do not act as deterrents.", "The FCC imposed the largest fine of $550,000 (£293,264) after Janet Jackson's Superbowl incident.", "Some broadcasters claim their content is protected by free speech rights."], "opencoder:1.5b": ["US 'to raise TV indecency fines' \n\nProposed law aimed at cracking down on indecency and bad language on US TV seeks a $500,000 (£266,582) fine each time broadcasters transmit nudity or profanities.", "Proposal unveiled in the House of Representatives also seeks to revoke a broadcaster's licence after three violations have been committed.", "Exposure of Janet Jackson's breast at last year's Superbowl landed with a $550,000 (£293,264) fine.", "Entertainers could be liable for fines under the proposed legisation from both US politicians and officials from the Federal Communications Commission (FCC).", "Republican senator from Kansas, Sam Brownbeck is set to call for a maximum $3 million (£1.6 million) fine for repeated violations."], "smollm:1.7b": ["The summary should include:\n\n1.", "The main idea: The US politicians are proposing a tough new law aimed at cracking down on indecency and bad language on US TV.", "2.", "Key details: The proposal seeks to revoke a broadcaster's licence after three violations have been committed, and fines of up to $500,000 (£266,582) could be imposed each time broadcasters transmit nudity or profanities.", "3.", "Important information: The proposed legislation from both US politicians and officials from the Federal Communications Commission (FCC) aims to increase the fines for repeated violations.", "A Republican senator from Kansas is set to call for a maximum fine of $3 million (£1.6 million).", "4.", "Supporting details: The current maximum fine stands at $32,500 (£17,320), 20 of the stations in the CBS network were each penalised these lesser amounts for the Jackson incident.", "The proposed legislation encourages the FCC to impose tougher rules, but the US Congress adjourned last year without agreeing on a new level of fines.", "5.", "Conclusion: Certain broadcasters claim the material they carry does not violate indecency laws and is protected under the right to free speech."], "deepseek-r1:1.5b": ["US politicians propose a law to crack down on TV indecency and bad language, with fines potentially up to $500k and licence revocation for three violations.", "Janet Jackson was fined $550k last year for her breast at Super Bowl.", "Entertainment could also face similar fines under proposed legisations from US politicians and FCC officials.", "A senator (Sam Brownbeck) calls for a maximum fine of $3 million for repeated violations, while Upton, chairing broadcasting committee, views fines as business costs rather than deterrents.", "Current max fines are $32,500 in CBS stations, with some penalized less due to Janet's incident.", "The FCC changed rules but wasn't on Congress's docket last year.", "New laws require new legislation before Bush's taking action.", "Some broadcasters argue their content isn't indecency or FCC-protected."], "tinyllama:1.1b": ["US politicians are proposing a law aimed at cracking down on TV indecent language and bad grammar, proposing that fine amounts range from $500,000 (£266,582) for up to three violations to $3 million (£1.6 million) for repeated offenses.", "The proposed law would also revise the license of a broadcast station after three violations have been committed, and allow for fines ranging from $32,500 (£17,320) to $550,000 (£293,264).", "The current maximum fine stands at $32,500 (£17,320), and Republican senator Sam Brownbeck plans to call for a maximum of $3 million (£1.6 million) in fines for repeated violations.", "Fox claims that their programming does not violate indecent laws, but the FCC has declared that such language is protected under the right to free speech."], "tinydolphin:1.1b": [" US politicians are planning to introduce a tough new law aimed at cracking down on TV broadcasts that contain nudity or profanity.", "These fines could range from $500,000 (£266,582) for broadcasters who commit one violation each time to $3 million (£1.6 million) for repeat offenders.", "The proposal is aimed at preventing TV shows and movies from becoming too risqué or vulgar, especially during scenes involving nudity or profanity.", "It was first proposed in the House of Representatives earlier this year and now seeks to revoke a broadcaster's licence after three violations have been committed.", "The penalty for breaking the rules will be higher if it happens multiple times at the same network or channel."], "phi:2.7b": [" The text discusses proposed legislation in the US House of Representatives that would increase the maximum fine for TV broadcasters from  $32,500 to up to $500,000, with a three-strikes rule.", "The new law aims to crack down on indecency and profanity on US TV, including revoking licenses after three violations.", "A similar proposal in the Senate proposes a maximum fine of $3 million.", "The text also mentions how the exposure of Janet Jackson' breast at last year's Superbowl landed CBS with a"], "orca-mini:3b": [" The US government is planning to increase fines for TV broadcasters who show nudity or profanity, up to $500,000 and revoking their licence after three violations.", "Republican senator from Kansas, Sam Brownbeck, wants a maximum fine of $3 million for repeated violations.", "The current maximum fine is $32,500.", "Broadcasters like Fox argue that their material does not violate indecency laws and is protected under the right to free speech."], "hermes3:3b": ["US raising TV indecency fines to $500K, potential license revocation after 3 violations, up from current max of $32.5k."], "stablelm-zephyr:3b": ["US politicians are proposing a new law aimed at increasing fines for TV broadcasters found guilty of transmitting nudity or profanities.", "The House of Representatives has suggested fines of up to $500,000, with possible revocation of a broadcaster's license after three violations.", "The maximum fine currently stands at $32,500, and some argue that current fines are not enough of a deterrent.", "This proposal follows the FCC's imposition of tougher rules following the Janet Jackson 'wardrobe malfunction' incident during last year's Superbowl.", "However, agreement on new legislation has yet to be reached between the US Congress."], "chatgpt-4o-latest": ["US politicians are proposing stricter laws to curb indecency and bad language on TV, with fines of up to $500,000 per violation and potential license revocation after three offenses.", "The move follows the Janet Jackson Superbowl incident, which led to a $550,000 fine for CBS.", "Entertainers could also face penalties, and Senator Sam Brownback is pushing for a maximum $3 million fine for repeat violations.", "The current maximum fine is $32,500, which critics argue is insufficient as a deterrent.", "The FCC has sought tougher rules, but Congress has yet to finalize new fine levels before presenting legislation to President Bush.", "Some broadcasters, like Fox, argue their content is protected under free speech laws."], "stablelm2:1.6b": ["US politicians are proposing a law that could fine TV broadcasters up to $3 million for transmitting nudity or profanity.", "This proposed legislation also aims to revoke licenses after three violations.", "Last year's Super Bowl incident with Janet Jackson's breast resulted in a $1 million ($250,0..", "This is the direct summary of the given text.", "The text discusses US politicians proposing new laws targeting indecency and bad language on TV with fines of up to £1 million or €1.3 million (for non-US currency users) as penalties for broadcasting nudity or profanity.", "This proposal also intends to revoke a broadcaster's license after three violations have been committed.", "The current maximum fine is around $250,000 ($1 million for US currency usage).", "Several entertainers and media companies could be subject to the fines under the new proposed legislation from both politicians and officials from the Federal Communications Commission (FCC).", "A Republican senator from Kansas, Sam Brownbeck, plans to propose a maximum fine of $3 million (£1.6 million) for repeated violations.", "Critics argue that current fines are not enough as deterrents and could be viewed more like costs incurred during business operations."], "granite3.1-dense:2b": ["US politicians propose a new law to intensify penalties for TV indecency, with fines potentially reaching $500,000 per incident of nudity or profanities.", "This includes broadcasters' licence revocation after three such violations.", "Previously, the maximum fine was $32,500.", "The proposal follows the 2004 Superbowl \"wardrobe malfunction\" incident involving Janet Jackson, which led to a $550,000 CBS fine.", "Senator Sam Brownback advocates for a $3 million cap on repeated violations.", "Chair of the broadcasting committee, Fred Upton, deems current fines as mere costs rather than deterrents.", "The FCC implemented stricter rules post-Jackson incident, but new fine figures are needed before President Bush can review the legislation.", "Some networks argue their content complies with indecency laws and is protected by free speech rights."]}