{"raw_text": "Eurovision 'greats' to do battle\n \n Stars of the Eurovision Song Contest from the show's 50-year history are to compete against each other to celebrate the contest's anniversary.\n \n Viewers will choose 14 past songs to be performed by the original artists or others in the spirit of the originals. Past Eurovision performers include Abba, Celine Dion, Bucks Fizz, Nana Mouskouri, Lulu and Julio Iglesias. Fans will then vote as usual to pick the all-time best Eurovision song during the show in Denmark in October. The first contest was organised by the European Broadcasting Union, or EBU, in 1956, and has become an annual event pitting pop giants against musical minnows - with often surprising results.\n \n While some regard it as an essential celebration of continental talent, others see it as an equally unmissable parade of the reasons some countries do not normally produce international stars. The 50th annual contest will be held in Kiev, Ukraine, in May, after Ukrainian singer Ruslana won last year. The 50th anniversary special will be held in Denmark later this year because the Danish Broadcasting Corporation came up with the idea for the all-time contest. A plan to hold it in London was scrapped because of problems finding a suitable venue. Ireland has been the most successful country in the show's history with seven victories, followed by the UK, France and Luxembourg with five each.\n", "llama3.2:1b": ["Eurovision 'greats' will compete against past contestants for an all-time Eurovision song in Denmark, with viewers voting to choose the best performance.", "Past performances include Abba, Celine Dion, Bucks Fizz, Nana Mouskouri, Lulu, and Julio Iglesias.", "The 50th anniversary contest will be held in Kiev, Ukraine, as it was not held in London due to venue issues."], "llama3.2:3b": ["Past Eurovision performers such as Abba and Celine Dion will compete against each other to choose the all-time best song during the 50th anniversary special in Denmark this year, following a contest held in Ukraine last May."], "gemma2:2b": ["Eurovision Song Contest greats will compete to celebrate its 50th anniversary.", "Viewers will vote on 14 past songs to be performed, while fans ultimately decide the all-time best song.", "Past performers include Abba, Celine Dion, and Julio Iglesias.", "The competition will feature performances from original artists or others in the spirit of the originals.", "The event will take place in Denmark later this year."], "qwen2.5:0.5b": ["The 50th annual Eurovision Song Contest will take place in May in Kiev, Ukraine.", "The contest will be organised by the European Broadcasting Union (EBU) and will pit pop giants against musical minnows, with fans voting to choose the all-time best Eurovision song during the show in Denmark.", "Some regard it as an essential celebration of continental talent, while others see it as a parade of reasons some countries do not typically produce international stars.", "The contest has been held annually since 1956 and will become increasingly competitive over time due to problems finding suitable venues."], "qwen2.5:1.5b": ["Eurovision Song Contest stars from 50-year history compete for all-time best song celebration in Denmark in October, following plans to hold annual contest since 1956."], "qwen2.5:3b": ["Eurovision 'greats' will compete this October to mark 50 years since the first contest.", "Past Eurovision performers including Abba, Celine Dion, and Lulu will perform original songs or similar versions chosen by fans who will vote for their all-time favorite song.", "The first Eurovision in 1956 was organized by EBU; it's an annual event featuring pop stars against less established artists with often unexpected outcomes.", "While some view it as a celebration of continental talent, others see it as highlighting countries' lack of international star producers.", "Ukraine's Ruslana won last year, and the 50th anniversary special will be held in Denmark this fall.", "Ireland leads Eurovision history with seven victories followed by UK, France, and Luxembourg with five each."], "opencoder:1.5b": ["Stars of the Eurovision Song Contest from the show's 50-year history are to compete against each other to celebrate the contest's anniversary.", "Viewers will choose 14 past songs to be performed by the original artists or others in the spirit of the originals.", "Past Eurovision performers include Abba, Celine Dion, Bucks Fizz, Nana Mouskouri, Lulu and Julio Iglesias.", "Fans will then vote as usual to pick the all-time best Eurovision song during the show in Denmark in October.", "The first contest was organised by the European Broadcasting Union, or EBU, in 1956."], "smollm:1.7b": ["The Eurovision Song Contest is an annual event that celebrates the best music from across Europe.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world.", "The contestants are chosen based on their past performances at the Eurovision Song Contest, which has been held every year since 1956.", "The contest is also known as the \"Eurovision of the Year\" because it features a wide range of popular and critically acclaimed songs from different countries around the world."], "deepseek-r1:1.5b": ["The Eurovision 'greats' competition will celebrate its 50th anniversary with original performers and historical stars.", "Viewers vote for the best song, with a special event in Denmark.", "The first contest was organized by EBU in 1956.", "Ruslana won last year's contest.", "The 50th annual show in Kiev will be held after London's cancellation due to venue issues.", "Ireland and the UK lead with seven wins each."], "tinyllama:1.1b": ["The Eurovision Song Contest is set to return to its roots as viewers will vote on past songs performed by artists who appeared in the contest's history.", "The contest celebrates 50 years of music competition, and stars from the show's past will compete against each other to select the all-time best Eurovision song.", "This year's contest will be held in Denmark due to the Danish Broadcasting Corporation's proposal, while Ukrainians won last year's finale.", "The most successful countries in the show's history have been Ireland with seven victories, followed by the UK, France and Luxembourg with five each."], "tinydolphin:1.1b": [" This information provides a brief overview of the Eurovision Song Contest, an annual event where countries perform music-based songs to compete for victory.", "The contest started in 1956 and has been held annually since its inception, with some variations.", "The 50th anniversary special will be broadcasted in Denmark later this year, while the all-time best contest will be hosted in Kiev, Ukraine, in May.", "In recent years, winning countries have faced criticism for not producing international stars."], "phi:2.7b": [" The Eurovision Song Contest is celebrating its 50th anniversary by having past winners perform original songs while viewers vote for their favorite all-time best song.", "The first contest was organized by the European Broadcasting Union in 1956 and has become an annual event featuring pop giants competing against musical minnows.", "Some see it as a celebration of continental talent, while others view it as a parade of why some countries do not usually produce international stars.", "The 50th anniversary will be held in Ukraine in May after Ukrainian singer Ruslana won last year."], "orca-mini:3b": [" Eurovision stars from its 50-year history will compete against each other to celebrate the contest's anniversary.", "Viewers will choose 14 past songs to be performed by the original artists or others in the spirit of the originals.", "The first Eurovision song competition was organized by the European Broadcasting Union in 1956, and it has become an annual event pitting pop giants against musical minnows.", "The contest's 50th anniversary special will be held in Denmark later this year because the Danish Broadcasting Corporation came up with the idea for the all-time contest."], "hermes3:3b": ["Eurovision 50-year anniversary: past stars compete, voted on by viewers."], "stablelm-zephyr:3b": ["Stars from Eurovision Song Contest's 50-year history will compete against each other to celebrate the anniversary, with 14 past songs chosen by viewers to be performed by original artists or imitations.", "The best Eurovision song will be voted on during the show in Denmark in October.", "The event, organized by the European Broadcasting Union since 1956, pits pop giants against musical acts every year.", "Ukraine's Ruslana won last year's contest, and Ireland has the most victories with seven wins.", "The 50th anniversary special will take place in Denmark due to a planned London venue being problematic."], "chatgpt-4o-latest": ["Stars from Eurovision's 50-year history will compete in a special anniversary event where viewers select 14 past songs to be performed by original artists or others.", "Fans will vote for the all-time best Eurovision song during the show in Denmark in October.", "The contest, organized by the EBU since 1956, has showcased both pop giants and lesser-known acts.", "While some celebrate it as a display of continental talent, others see it as highlighting why some countries lack global music stars.", "The 50th annual contest will be in Kiev, Ukraine, in May, while the anniversary special will be in Denmark, as the Danish Broadcasting Corporation proposed the idea.", "Ireland holds the record with seven wins, followed by the UK, France, and Luxembourg with five each."], "stablelm2:1.6b": ["Eurovision stars compete for anniversary celebration: Fans choose past songs performed by original artists, while viewers vote for the all-time best Eurovision song during October's Denmark show.", "Originally organized by EBU in 1964 and annual event since then, featuring pop giants vs. regional talents with occasional surprising results; next contest held in May in Ukraine after Ruslana won 2016.", "Irish and UK victories lead the way among successful countries."], "granite3.1-dense:2b": ["In 2023, Eurovision 'greats' from its 50-year history will compete in a special anniversary event, hosted in Denmark, to determine the all-time best Eurovision song.", "Past performers include Abba, Celine Dion, and other renowned artists like Bucks Fizz, Nana Mouskouri, Lulu, and Julio Iglesias.", "Fans will vote for their favorite in a traditional Eurovision format during the May 2023 contest in Kiev, Ukraine.", "This 50th-anniversary special was planned by Denmark's Broadcasting Corporation due to logistical challenges in London.", "The competition aims to celebrate both the show's success and its occasional peculiar outcomes, where some countries perform exceptionally well despite their usual underrepresentation in international music.", "Ireland leads with seven victories, followed by the UK, France, and Luxembourg with five each."]}