{"raw_text": "UK TV channel rapped for CSI ad\n \n TV channel Five has been criticised for sending \"offensive\" and \"threatening\" advertising material to viewers for a new show about murder scene scientists.\n \n Five mailed thousands of fake dossiers including photos of murder victims and an e-mail suggesting the recipient was being stalked by a serial killer. Following complaints, the Advertising Standards Authority contacted Five to cease promotion of crime show CSI:NY. Five admitted it had sent out 55,000 promotion packs but had now stopped. The promotion material was sent in brown envelope of the type used by investigators in the series, a spin-off from the highly successful CSI: Crime Scene Investigation series, which also runs on Five. The pack also features pictures of forensic evidence from a crime scene and a wanted poster, which did have a CSI:NY logo printed in large at the bottom.\n \n Five said it had received 100 complaints but that it had been surprised at the reaction because it was \"obvious this material is promoting a drama\". A Five spokesman said: \"In light of the efforts we have made to make the nature of the contents so transparent we are surprised a very small minority of recipients have mistaken it as anything else. \"Everyone who was sent this promotion has expressed an interest in receiving details about this particular genre of programming on various websites. \"We have also received emails and calls from recipients praising the originality and imagination of the campaign.\"\n", "llama3.2:1b": ["UK TV channel Five has been criticised for sending fake dossiers to viewers for a new show about murder scene scientists, despite being clearly labelled as promoting a crime drama.", "The promotion packs included photos of murder victims, an email suggesting the recipient was being stalked by a serial killer, and a wanted poster with a CSI:NY logo."], "llama3.2:3b": ["Five sent 55,000 CSI:NY promotional packs with fake dossiers featuring murder victims and forensic evidence to viewers, sparking 100 complaints to the Advertising Standards Authority."], "gemma2:2b": ["TV channel Five sent out fake dossiers to viewers promoting a new show \"CSI:NY\", featuring murder scene photos, threatening emails, and a CSI logo.", "The channel admitted sending 55,000 packs but has ceased promotion after complaints were lodged.", "The Advertising Standards Authority was notified and the promotion material was deemed offensive by many.", "Five claims it had a \"transparent\" intention to promote the show and some viewers praised its originality."], "qwen2.5:0.5b": ["TV channel Five's ads included fake dossiers, photos of murder victims, and a spin-off CSI:NY series promoting crime scenes.", "They sent out 55,000 promotion packs but stopped once complaints were raised.", "The ad used a similar format to the highly successful CSI: Crime Scene Investigation, which also ran on Five."], "qwen2.5:1.5b": ["Five TV channel criticized for sending CSI-themed promotional material that included photos of murder victims, wanted posters, and forensic evidence to viewers of its own show, leading to complaints and an Advertising Standards Authority inquiry.", "The promotional materials were sent in brown envelopes used by crime scene investigators, featuring a CS:NY logo.", "Despite admitting to mailing 55,000 packages, Five has since stopped the promotion following complaints."], "qwen2.5:3b": ["UK TV channel Five criticized for sending fake dossiers, including photos of murder victims and a threatening email to viewers promoting crime show CSI:NY.", "Over 100 complaints led to its cessation of promotion after admitting sending out 55,000 packs in investigator-themed envelopes with forensic evidence pictures and wanted posters featuring the show's logo.", "Five defended itself by claiming recipients saw it as promotional material for a drama series, though some received emails praising the originality of the campaign."], "opencoder:1.5b": ["The UK TV channel rapped for CSI ad promoted a new murder investigation show that it posted fake dossiers with photographs of the murder victims and an email suggesting they were being stalked.", "The Advertising Standards Authority contacted Five to cease promotion, which was later confirmed by Five stopping after a series of complaints.", "The evidence included thousands of fake dossiers containing forensic evidence from a crime scene and a wanted poster that did have a CSI:NY logo printed in large at the bottom.", "Five, however, had received 100 complaints but also praised the originality and imagination of the promotion campaign."], "smollm:1.7b": ["The UK TV channel Five has been criticized for sending \"offensive\" and \"threatening\" advertising material to viewers for a new show about murder scene scientists, which is based on the popular CSI:NY series.", "The channel mailed thousands of fake dossiers including photos of murder victims and an e-mail suggesting that the recipient was being stalked by a serial killer.", "Following complaints, the Advertising Standards Authority contacted Five to cease promotion of crime show CSI:NY.", "Five admitted it had sent out 55,000 promotion packs but had now stopped.", "The promotion material was sent in brown envelope of the type used by investigators in the series, a spin-off from the highly successful CSI:Crime Scene Investigation series, which also runs on Five.", "The pack also features pictures of forensic evidence from a crime scene and a wanted poster, which did have a CSI:NY logo printed in large at the bottom.", "The channel said it had received 100 complaints but that it was \"surprised at the reaction\" because it was \"obvious this material is promoting a drama\".", "A Five spokesman said: \"In light of the efforts we have made to make the nature of the contents so transparent we are surprised a very small minority of recipients have mistaken it as anything else.\"", "Everyone who was sent this promotion has expressed an interest in receiving details about this particular genre of programming on various websites.", "\"We have also received emails and calls from recipients praising the originality and imagination of the campaign,\" said a spokesperson for Five.", "The channel's apology came after complaints that its promotional material was misleading and potentially harmful to viewers, particularly those who are vulnerable or sensitive.", "Five has since apologized for any harm caused by its promotion and promised to take steps to prevent similar incidents in the future."], "deepseek-r1:1.5b": ["UK TV channel Five criticized its new show, CSI:NY, for sending offensive materials to viewers.", "The ad featured fake dossiers with victim photos, a stalked serial killer email, and promotional items including forensic evidence pictures and a wanted poster.", "Five sent out 55,000 promotion packs but stopped after complaints.", "They noted the material's clear crime drama nature despite their efforts to make it transparent."], "tinyllama:1.1b": ["UK TV channel Five has been criticized for sending \"offensive\" and \"threatening\" advertising material to viewers for a new show about murder scene scientists.", "The promotion material, including fake dossiers with photos of murder victims and an email suggesting the recipient was being stalked by a serial killer, sparked complaints from viewers who were \"surprised\" at its promotional tactics.", "Five received 100 complaints but insisted that it had not sent any other similar materials to other channels.", "The channel apologized and stopped the promotion of crime show CSI:NY.", "Despite criticism, Five's campaign did not violate the Advertising Standard Authority's guidelines."], "tinydolphin:1.1b": [" UK TV channel Five has faced criticism for sending \"offensive\" and \"threatening\" advertising material to viewers for a new show about murder scene scientists, which includes promotional packs featuring photos of murder victims and an e-mail suggesting the recipient was being stalked by a serial killer.", "Following complaints from the Advertising Standards Authority (ASA), Five admitted that it had sent out 55,000 promotion packs but has now stopped promoting the crime show CSI:NY.", "The pack also features pictures of forensic evidence and a wanted poster and did have a CSI:NY logo printed in large at the bottom."], "phi:2.7b": [" The text discusses criticism from viewers for UK TV channel Five's use of offensive advertising material to promote a new show about murder scene scientists.", "The material included fake dossiers, photos of murder victims, and an e-mail suggesting the recipient was being stalked by a serial killer.", "After receiving complaints, Five stopped promotion of CSI:NY and removed all promotional materials from circulation."], "orca-mini:3b": [" The UK TV channel Five was criticized for sending offensive and threatening advertising material to viewers for a new show about murder scene scientists, including fake dossiers with photos of murder victims and an email suggesting the recipient was being stalked by a serial killer.", "The promotion material included a brown envelope used by investigators in the series, a CSI:NY logo printed at the bottom, and photos of forensic evidence from a crime scene."], "hermes3:3b": ["UK TV channel Five rapped for sending offensive CSI:NY promo material, including photos of murder victims & brown envelope resembling investigator envelopes."], "stablelm-zephyr:3b": ["TV channel Five faced criticism for sending out promotional material featuring photos of murder victims and suggesting recipients were being stalked by a serial killer for their new show, CSI:NY.", "The Advertising Standards Authority contacted Five to halt the promotion.", "Although the channel admitted to mailing 55,000 promotion packs, they have since stopped.", "Some viewers mistook the materials as actual threats or promoting another violent series, leading to confusion and complaints.", "However, a Five spokesman stated that most recipients expressed an interest in receiving details about the show and praised its originality."], "chatgpt-4o-latest": ["UK TV channel Five was criticised for sending \"offensive\" and \"threatening\" promotional material for CSI:NY, including fake dossiers with murder victim photos and an email suggesting recipients were being stalked.", "Following complaints, the Advertising Standards Authority ordered Five to stop the campaign.", "Five admitted to sending 55,000 packs but was surprised by the backlash, arguing the materials clearly promoted a drama.", "While 100 complaints were received, some recipients praised the campaign's originality."], "stablelm2:1.6b": ["UK TV channel Five faced criticism for sending \"offensive\" and \"threatening\" advertising material to viewers for their new show focused on murder scene scientists.", "They mailed fake dossiers including photos of murder victims, an email suggesting stalking by a serial killer, and stopped promoting the crime show CSI:NY after receiving complaints.", "The Advertising Standards Authority contacted Five to cease promotion of the show, but they admitted sending out promotion packs and have now stopped.", "The material was transparent in nature and featured forensic evidence from a crime scene, with a small percentage of recipients mistaking it for promoting drama.", "Many who received the promotion showed interest on various websites, while others praised the campaign's originality and imagination."], "granite3.1-dense:2b": ["UK's Five TV channel faced criticism for promoting its crime show CSI:NY through controversial, offensive marketing materials.", "The station mailed 55,000 fake dossiers to viewers, featuring photos of murder victims and a false stalking claim from a serial killer.", "Upon receiving complaints, the Advertising Standards Authority instructed Five to halt CSI:NY promotions.", "Five acknowledged sending these packets but ceased the practice post-complaint.", "Despite 100 complaints, Five defended the campaign as transparent and praised for its originality.", "Recipients reported interest in similar programming on other websites, and many expressed admiration for the campaign's creativity."]}