{"raw_text": "Alicia Keys to open US Super Bowl\n \n R&B star Alicia Keys is to open February's Super Bowl singing a song only previously performed there by Ray Charles and Vicki Carr.\n \n Keys, who will sing America the Beautiful, will be accompanied by 150 students from the Florida School for the Deaf and the Blind. Charles, who died last year, attended the school as a child in 1937. Keys said she was \"very excited\", describing Charles as \"an artist I admire, miss and respect\". \"I know that this is going to be a very touching and memorable moment,\" she said.\n \n It will be her first performance at the Super Bowl, which will be watched by millions in the US on 6 February. Sir Paul McCartney will provide the half-time entertainment in the slot filled by Janet Jackson last year. Organisers have promised there will be no repeat of her nipple-baring incident that sparked thousands of complaints on US TV's most-watched broadcast. A National Football League spokesman said they were \"comfortable\" this show would be acceptable to a mass audience. The game and show were watched by 144 million people in the US in 2003.\n \n Twenty CBS-owned TV stations were fined $550,000 (£300,000) by the country's TV regulatory agency after more than 542,000 complaints were made about Janet Jackson's \"wardrobe malfunction\". Sir Paul said: \"There's nothing bigger than being asked to perform at the Super Bowl. \"We're looking forward to rocking the millions at home and in the stadium.\"\n", "llama3.2:1b": ["Alicia Keys will open the US Super Bowl with a song previously performed by Ray Charles and Vicki Carr, accompanied by 150 students from the Florida School for the Deaf and the Blind.", "Keys is a first-time performer at the Super Bowl, which will be watched by millions in the US on February 6."], "llama3.2:3b": ["Alicia Keys will open February's Super Bowl with a performance of America the Beautiful, accompanied by 150 students from the Florida School for the Deaf and the Blind.", "The event will be her first at the Super Bowl and marks a nod to past performer Ray Charles.", "Sir Paul McCartney will provide half-time entertainment in place of Janet Jackson, who faced backlash after a controversial performance in 2003."], "gemma2:2b": ["Alicia Keys will open the Super Bowl with a performance of \"America the Beautiful\" accompanied by 150 students from the Florida School for the Deaf and the Blind.", "Sir Paul McCartney will perform during halftime.", "Organisers are expecting no repeat of Janet Jackson's wardrobe malfunction at last year's event.", "The Super Bowl was watched by 144 million viewers in 2003."], "qwen2.5:0.5b": ["Alicia Keys is scheduled to open the US Super Bowl by singing a song only previously performed there by Ray Charles and Vicki Carr.", "The singer will be accompanied by 150 students from the Florida School for the Deaf and the Blind, as Charles died last year.", "She has said she was \"very excited\" about this performance, describing Charles as an artist she admired and respected.", "The song is called America the Beautiful and it will feature Janet Jackson, who was involved in a scandal that led to thousands of complaints on US TV's most-watched broadcast.", "Organizers have promised no repeat of the incident that sparked millions of complaints on their show."], "qwen2.5:1.5b": ["Alicia Keys will open this year’s Super Bowl by singing America the Beautiful, accompanied by 150 deafblind students.", "It marks her first performance there since Ray Charles performed in 1937, with Keys calling Charles a \"master artist\" she admires and misses.", "The event is expected to be watched by millions of people, despite concerns over past incidents like Janet Jackson's wardrobe malfunction during halftime in 2009."], "qwen2.5:3b": ["Alicia Keys will open February's Super Bowl by singing a song previously performed only by Ray Charles and Vicki Carr, accompanied by 150 students from the Florida School for the Deaf and the Blind.", "The performance is set for 6 February when the game and show were watched by 144 million people in the US in 2003.", "Keys, who will perform America the Beautiful, expresses excitement about the historic moment.", "Sir Paul McCartney will provide half-time entertainment, replacing Janet Jackson whose previous performance led to a fine of $550,000 and over 542,000 complaints from viewers."], "opencoder:1.5b": ["Alicia Keys will open the US Super Bowl singing a song that was previously performed by Ray Charles and Vicki Carr.", "It is said that the group, who attended Florida School for Deaf and Blind students, will sing America the Beautiful, excited about the music and with a vision to make people feel connected in their lives.", "With 150 students, the show is filled with millions of spectators watching it on February 6.", "Paul McCartney will provide half-time entertainment at the US Super Bowl, while Janet Jackson was seen wearing clothes that were not properly repaired, which caused an incident that sparked several complaints on US TV's most-watched broadcasts.", "The National Football League said they are \"comfortable\" with this show but still plans to make it acceptable."], "smollm:1.7b": ["Alicia Keys will open February's Super Bowl singing a song only previously performed there by Ray Charles and Vicki Carr.", "She will be accompanied by 150 students from the Florida School for the Deaf and the Blind.", "Charles, who died last year, attended the school as a child in 1937.", "Keys said she was \"very excited\", describing Charles as \"an artist I admire, miss and respect\".", "\"I know that this is going to be a very touching and memorable moment,\" she said.", "It will be her first performance at the Super Bowl, which will be watched by millions in the US on 6 February.", "Sir Paul McCartney will provide the half-time entertainment in the slot filled by Janet Jackson last year.", "Organisers have promised there will be no repeat of her nipple-baring incident that sparked thousands of complaints on US TV's most-watched broadcast.", "A National Football League spokesman said they were \"comfortable\" this show would be acceptable to a mass audience.", "Twenty CBS-owned TV stations were fined $550,000 (£300,000) by the country's TV regulatory agency after more than 542,000 complaints were made about Janet Jackson's \"wardrobe malfunction\".", "Sir Paul said: \"There's nothing bigger than being asked to perform at the Super Bowl.", "\"We're looking forward to rocking the millions at home and in the stadium.\""], "deepseek-r1:1.5b": ["Alicia Keys will open February 6th Super Bowl singing America the Beautiful, her first performance at the event, with 150 deaf and blind students from the Florida School for the Deaf and the Blind accompanying her.", "Charles, who attended school as a child in 1937, is described by Keys as an artist she admires but respects.", "She'll perform America the Beautiful, which had only been done by Ray Charles and Vicki Carr before.", "The event will watch millions on February 6th.", "Sir Paul McCartney will provide half-time entertainment, replacing Janet Jackson from last year.", "A National Football League spokesperson noted CBS is \"comfortable\" with the show being acceptable to a mass audience.", "The event drew 144 million viewers in 2003, with complaints about Janet Jackson's wardrobe issues totaling 542,000."], "tinyllama:1.1b": ["Key, R&B star Alicia, will open US Super Bowl with a performance of America the Beautiful accompanied by 150 students from Florida School for the Deaf and Blind.", "Key will be the first artist to perform at the Super Bowl since Ray Charles and Vicki Carr sang it in 2003.", "The game and show were watched by 144 million people in the US in 2003, making it the most-watched broadcast of all time.", "Twenty CBS-owned TV stations were fined $550,000 by the country's TV regulator after more than 542,000 complaints were made about Janeet Jackson's \"wardrobemalfunction\".", "Sir Paul said he was excited and looking forward to rocking the masses in the Super Bowl."], "tinydolphin:1.1b": [" Alicia Keys is set to open the Super Bowl, which will feature a performance by R&B star Alicia Keys.", "The event is scheduled for February 6th, and it will be live on television networks across the US.", "This will be Alicia's first time performing at the Super Bowl.", "During her entrance, she will be accompanied by 150 students from the Florida School for the Deaf and the Blind, who were selected based on their auditions.", "The performance will be a rendition of America the Beautiful, which Ray Charles and Vicki Carr performed during an earlier Super Bowl appearance.", "Alicia Keys's rendition is expected to evoke emotion in the audience as well as touch upon her admiration for the late Ray Charles, who attended the school when he was a child.", "The show will be hosted by actor and comedian Sir Paul McCartney, while the halftime entertainment will be provided by former Beatles member Paul McCartney.", "The National Football League (NFL) has announced that it is comfortable with the performance being acceptable to a mass audience, as long as it is not \"over-the-top\".", "CBS-owned TV stations were fined $550,000 ($300,000) by the TV regulator for complaints about Janet Jackson's wardrobe malfunction during the Super Bowl in 2003."], "phi:2.7b": [" Alicia Keys will sing Ray Charles' \"America the Beautiful\" at the Super Bowl with 150 students from Florida School for the Deaf and Blind, who were also accompanied by Charles when he attended the school as a child.", "It is her first performance at the Super Bowl, which is watched by millions in the US on 6 February.", "Sir Paul McCartney will provide entertainment during halftime.", "Organisers have promised that there will be no repeat of Janet Jackson's controversial performance in 2003.", "The Super Bowl is a widely-watched event in the United States and Alicia Keys' performance promises to be memorable, especially for fans of Ray Charles and Janet Jackson.", "Despite a previous controversy involving a wardrobe malfunction by Janet Jackson, CBS has promised that this show will be acceptable to a mass audience.", "The game was watched by 144 million people in 2003 and is expected to draw even larger audiences this year.", "Sir Paul McCartney's performance at the Super Bowl with Alicia Keys marks an exciting collaboration between two legendary artists.", "As one of the most-watched broadcasts in American history, the Super Bowl serves as a platform for artists to showcase their talents to millions of viewers across the country.", "With such a high level of exposure, it is no surprise that the event attracts both positive and negative attention."], "orca-mini:3b": [" Alicia Keys, a R&B star, will open February's Super Bowl by singing America the Beautiful, accompanied by 150 students from the Florida School for the Deaf and the Blind.", "This will be Keys' first performance at the Super Bowl, and she will be watched by millions in the US on 6 February.", "Sir Paul McCartney will provide the half-time entertainment in the slot filled by Janet Jackson last year.", "The National Football League spokesman stated that they were \"comfortable\" this show would be acceptable to a mass audience."], "hermes3:3b": ["Alicia Keys to open US Super Bowl, singing America the Beautiful; attended by 150 students from Florida School for the Deaf and Blind."], "stablelm-zephyr:3b": ["Alicia Keys will open the US Super Bowl on February 6th, performing America the Beautiful, previously performed by Ray Charles at the same event in 1937.", "She'll be accompanied by 150 students from the Florida School for the Deaf and the Blind.", "This will be her first time performing at the Super Bowl, which is watched by millions in the US.", "Sir Paul McCartney will provide half-time entertainment.", "The organizers promise no repeat of Janet Jackson's \"wardrobe malfunction\" incident that sparked thousands of complaints in 2003.", "Twenty CBS-owned TV stations were fined for over 542,000 complaints."], "chatgpt-4o-latest": ["Alicia Keys will open the Super Bowl on February 6 by singing \"America the Beautiful,\" a song previously performed there only by Ray Charles and Vicki Carr.", "She will be accompanied by 150 students from the Florida School for the Deaf and the Blind, which Charles attended as a child.", "Keys expressed excitement, calling Charles an artist she admires and respects.", "This will be her first Super Bowl performance.", "Sir Paul McCartney will provide the halftime entertainment, following last year's controversial Janet Jackson performance.", "Organizers have assured there will be no repeat of the incident.", "The 2003 Super Bowl was watched by 144 million people in the U.S., and CBS was fined $550,000 after over 542,000 complaints about Jackson's \"wardrobe malfunction.\"", "McCartney said he is excited to perform for millions at the event."], "stablelm2:1.6b": ["Alicia Keys will open February's Super Bowl performance, singing a song previously performed by Ray Charles and Vicki Carr.", "She'll be accompanied by students from the Florida School for the Deaf and Blind.", "This is her first Super Bowl appearance; she chose America the Beautiful as the song.", "The event includes Sir Paul McCartney as half-time entertainment.", "Organizers promise no repeat of last year's controversy over Janet Jackson's wardrobe malfunction.", "A total of 20 CBS-owned TV stations were fined by a US TV regulatory agency for complaints about the incident."], "granite3.1-dense:2b": ["Alicia Keys, an R&B artist, will open the 2023 US Super Bowl by performing America the Beautiful with 150 students from the Florida School for the Deaf and the Blind.", "This marks her first Super Bowl appearance.", "The event, scheduled for February 6th, will be broadcast to millions of viewers in the US.", "Alicia Keys expressed excitement about the opportunity, acknowledging Ray Charles's influence as an artist she admires and respects.", "In contrast to Janet Jackson's controversial \"wardrobe malfunction\" in 2004, which resulted in a $550,000 fine for CBS due to over 542,000 complaints, the Super Bowl organizers assure that this year's show will be acceptable to a broad audience.", "Sir Paul McCartney has been chosen as the half-time entertainment act, with the promise of a family-friendly performance."]}