{"raw_text": "Branson show flops on US screens\n \n Entrepreneur Sir Richard Branson's US TV show, The Rebel Billionaire, is proving a flop in the ratings.\n \n The programme suffered poor viewing figures on its debut on the Fox network three weeks ago, and has lost one in five of its viewers since then. The show is seen as Fox's answer to The Apprentice featuring tycoon Donald Trump, a ratings hit for rivals NBC. Sir Richard's show sees a group of young entrepreneurs compete to become the president of his business empire. The Rebel Billionaire has averaged five million viewers and is 91st in the rankings of all prime-time shows. The Apprentice, which has already completed its first season, is still managing to pull in 16 million viewers, while its prime-time ranking is number four.\n \n But Fox has said it plans to stick with Branson's show throughout its 12-episode run. \"It's going to remain on the air,\" said the network's spokesman Scott Grogin. \"Creatively we're extremely pleased with the show and hope the audience will find it,\" he added. Contestants on Sir Richard's show are confronted with business tasks to solve, similar to The Apprentice. They are also subjected to stunts like walking a plank suspended in mid-air. The Rebel Billionaire has marketed itself as a less materialistic version of The Apprentice, with Sir Richard shown jumping out of a taxi, while Trump is seen in a limousine.\n", "llama3.2:1b": ["Sir Richard Branson's US TV show \"The Rebel Billionaire\" is failing to impress viewers on Fox, with poor ratings and only 91st place in prime-time rankings.", "Despite its commercial success at home, the show has averaged only five million viewers since debuting three weeks ago, compared to The Apprentice's 16 million viewers for its first season."], "llama3.2:3b": ["Sir Richard Branson's US TV show \"The Rebel Billionaire\" has poor viewing figures on its debut and has lost one in five viewers since then.", "It averages 5 million viewers and ranks 91st in prime-time shows, behind rival \"The Apprentice\" which pulls in 16 million viewers and is ranked number four."], "gemma2:2b": ["Sir Richard Branson's US TV show \"The Rebel Billionaire\" is struggling in ratings, losing viewers and ranking 91st in primetime television.", "Despite this, Fox plans to air the show throughout its 12-episode run.", "The show features entrepreneurs competing for control of Sir Richard's business empire through tasks and challenges similar to \"The Apprentice\", but with a focus on less materialistic themes."], "qwen2.5:0.5b": ["Sir Richard Branson's US TV show \"The Rebel Billionaire\" has been criticized for not meeting the expectations set by Fox and NBC's prime-time shows like \"The Apprentice.\"", "It has had poor ratings and average viewership compared to its competitors, with only five million viewers seen so far.", "The programme focuses on young entrepreneurs competing to become the president of their business empire.", "However, Fox plans to stick with it throughout its 12-episode run."], "qwen2.5:1.5b": ["Sir Richard Branson's US TV show, The Rebel Billionaire, is underperforming due to poor ratings and has lost one-fifth of its audience since its debut on Fox three weeks ago.", "It aims to compete with NBC's The Apprentice by featuring young entrepreneurs who must run the entrepreneur's empire.", "The show, which has averaged 5 million viewers per episode, ranks as low as 91st in all prime-time shows but remains on air according to Fox."], "qwen2.5:3b": ["Entrepreneur Sir Richard Branson's US TV show, The Rebel Billionaire, has struggled in ratings since its debut on Fox three weeks ago.", "It averaged five million viewers and ranks 91st among prime-time shows; in contrast, The Apprentice, featuring Donald Trump, still attracts 16 million viewers and is ranked fourth.", "Despite poor initial performance, Fox plans to continue airing the show for its full run of 12 episodes.", "Similar to The Apprentice, Rebel Billionaire features contestants solving business challenges and participating in stunts like jumping from a taxi rather than using a limousine."], "opencoder:1.5b": ["Branson show flops on US screens\n\nEntrepreneur Sir Richard Branson's US TV show, The Rebel Billionaire, has proved a flop in the ratings.", "It suffered poor viewing figures on its debut on the Fox network three weeks ago and lost one in five of its viewers since then.", "The show is seen as Fox’s answer to The Apprentice featuring tycoon Donald Trump, it ranks 91st in the rankings of all prime-time shows.", "The Apprentice, which has already completed its first season, is still managing to pull in 16 million viewers while its prime-time ranking is number four.", "Fox has said it plans to stick with Branson’s show throughout its 12-episode run, “It's going to remain on the air,” Grogin said.", "Contestants on Sir Richard's show are confronted with business tasks to solve, similar to The Apprentice.", "They are also subjected to stunts like walking a plank suspended in mid-air."], "smollm:1.7b": ["The Rebel Billionaire is a US TV show that follows the lives of young entrepreneurs competing to become the president of Sir Richard Branson's business empire.", "The show has been shown on Fox since its debut three weeks ago and has suffered poor viewing figures, with one in five viewers lost over the past few weeks.", "The show is seen as a response to The Apprentice, which has already completed its first season and is still managing to pull in 16 million viewers.", "The Rebel Billionaire's contestants are faced with business tasks similar to those on The Apprentice, but they also have to perform stunts like walking a plank suspended in mid-air.", "The show is marketed as a less materialistic version of The Apprentice, with Sir Richard shown jumping out of a taxi and Trump being seen in a limousine.", "The Rebel Billionaire has been shown on Fox since its debut three weeks ago and has suffered poor viewing figures, with one in five viewers lost over the past few weeks.", "The show is seen as a response to The Apprentice, which has already completed its first season and is still managing to pull in 16 million viewers.", "The Rebel Billionaire's contestants are confronted with business tasks similar to those on The Apprentice, but they also have to perform stunts like walking a plank suspended in mid-air.", "The show is marketed as a less materialistic version of The Apprentice, with Sir Richard shown jumping out of a taxi and Trump being seen in a limousine.", "The Rebel Billionaire's contestants are also subjected to stunts similar to those on The Apprentice, but they also have to perform more physically demanding tasks such as walking a plank suspended in mid-air.", "The show is marketed as a response to The Apprentice, which has already completed its first season and is still managing to pull in 16 million viewers."], "deepseek-r1:1.5b": ["Branson's show flopped on US screens.", "It was Fox's answer to another ratings hit with NBC.", "Lost one out of five viewers since its debut.", "5 million viewers overall and in the top 91 rankings.", "Features young entrepreneurs competing for president, unlike The Apprentice with Trump.", "Fox plans to keep the show despite its flop, expressing praise for it and hopes viewers enjoy it.", "The competition is about business tasks and stunts like walking a plank."], "tinyllama:1.1b": ["Fox network has decided to keep The Rebel Billionaire, the US TV show hosted by entrepreneur and entrepreneur Sir Richard Branson despite low ratings during its debut on the Fox network three weeks ago.", "The show, which features young businesspeople competing for a chance to become the CEO of their company, is currently averaging 5 million viewers and remains in fourth place in prime-time show rankings.", "Despite this, Fox plans to continue the series through its 12-episode run.", "Branson's show, which offers entrepreneurs stunts like walking a suspended plank and jumping out of a taxi, has been praised for its more creative approach to The Apprentice but remains subjected to business challenges."], "tinydolphin:1.1b": [" Branson's TV show, The Rebel Billionaire, has been failing to impress its viewers on Fox network.", "With only 5 million viewers and a ranking of 91st in the prime-time shows list, it seems like the competition between The Apprentice featuring Donald Trump and Fox's answer to The Apprentice, The Rebel Billionaire, has been intense.", "Despite its poor performance on the ratings chart, Branson's show is still a significant part of Fox's line-up as they plan on airing all 12 episodes throughout the season."], "phi:2.7b": [" Sir Richard Branson's US TV show \"The Rebel Billionaire\" is flops on the ratings, with poor viewing figures compared to its competitors, but Fox network plans to stick with it throughout its 12-episode run and hopes the audience will find it creative and exciting.", "The show features young entrepreneurs competing to become the president of Sir Richard's business empire, while contestants are subjected to stunts such as walking a plank in mid-air."], "orca-mini:3b": [" The US TV show, The Rebel Billionaire, featuring Sir Richard Branson, has struggled to attract viewers and has lost one in five of its viewers since its debut.", "The show is seen as Fox's answer to The Apprentice and is rated 91st in the rankings of all prime-time shows.", "However, Fox has plans to continue airing the show throughout its 12-episode run.", "The show features contestants facing business tasks to solve, similar to The Apprentice, and also includes stunts like walking a plank suspended in mid-air."], "hermes3:3b": ["Richard Branson's TV show \"The Rebel Billionaire\" flops with ratings, at 91st place among prime-time shows."], "stablelm-zephyr:3b": ["Sir Richard Branson's US TV show, The Rebel Billionaire, is struggling in ratings, with poor viewing figures and a loss of viewers since its debut on Fox network.", "Aims to compete with NBC's The Apprentice featuring Donald Trump, averaging 5 million viewers and 91st in prime-time rankings.", "Fox plans to stick with the show throughout its 12-episode run despite lower ratings."], "chatgpt-4o-latest": ["Sir Richard Branson's US TV show, The Rebel Billionaire, has struggled with low ratings since its debut on Fox, losing one in five viewers.", "Positioned as Fox's answer to NBC's hit show The Apprentice, it features young entrepreneurs competing to lead Branson's business empire.", "The show averages five million viewers and ranks 91st in prime-time, while The Apprentice attracts 16 million and ranks fourth.", "Despite poor ratings, Fox plans to air all 12 episodes, expressing confidence in the show.", "The Rebel Billionaire differentiates itself by emphasizing experiences over materialism, incorporating business challenges and daring stunts."], "stablelm2:1.6b": ["Richard Branson's TV show, The Rebel Billionaire, experiences poor ratings on the US screens and loses one in five viewers since its debut.", "Aimed at being Fox's answer to The Apprentice featuring Donald Trump, it features young entrepreneurs competing for the position of president in Branson's business empire.", "Though averaging 5 million viewers and ranking fourth among prime-time shows, it still lags behind rivals NBC's The Apprentice in terms of viewer numbers and ratings.", "However, Fox plans to retain the show throughout its run."], "granite3.1-dense:2b": ["Sir Richard Branson's US TV show, \"The Rebel Billionaire,\" premiered on Fox to weak ratings and has since lost 20% of its audience.", "Despite being marketed as a less materialistic alternative to The Apprentice, it averages five million viewers and ranks 91st in prime-time shows, while The Apprentice, already completed for one season, garners 16 million viewers and leads the rankings at number four.", "Fox remains committed to airing the entire 12-episode run of \"The Rebel Billionaire,\" expressing satisfaction with its creative aspects and hoping viewership will improve.", "Contestants in Branson's show face business challenges and stunts, similar to those on The Apprentice, but with less ostentatious displays from the host."]}