{"raw_text": "Chris Evans back on the market\n \n Broadcaster Chris Evans has begun selling thousands of his possessions from a stall in Camden Market, London.\n \n Evans perched on a stool as shoppers wandered around the open-fronted shop packed with his furniture. Among the items from his homes in Los Angeles and London were countless sofas, chairs, pictures, beds and memorabilia from his past TV shows. Asked the reason for the sale, Evans said: \"I just want to get rid of it all, it's just a headache.\" He added: \"It feels good to be selling this stuff, it's a weight off my mind. \"Look at it all, there's so much clutter. I've enjoyed every bit of furniture and every poster but it's not important anymore.\" The normally gregarious Evans cut a peculiarly unshowbusiness-like figure as he sipped coffee and smoked cigarettes, wrapped in a big coat and scarf in front of his Aladdin's cave.\n \n However, the ostentation of some of the items on sale painted a picture of the eccentricity that endeared him to the British public in shows such as Channel 4's gameshow Don't Forget Your Toothbrush. The most striking thing about many of the pieces was their sheer size. Sofas looked like they could seat a small party and a bed seemed big enough for four. The elaborate nature of the pieces, many custom-made, had to be admired, particularly a huge red and gold upholstered \"throne\" and a stripy deckchair from the Queen Mary liner.\n \n To help people in their browsing, Evans had given the pieces labels with not only the price but a helpful, often comic, aside. \"Isn't it great\" was the comment on the £1,950 throne and \"Bob Dylan's old sofa - honest\" was written on a dark wood couch priced £4,250.\n \n The prices were steep by a lot of people's standards but Evans said it was not deterring shoppers. \"I've sold quite a lot already. Everything here is on sale for less than I bought it for but it's not really about the money. It's about getting rid of it all. We've all been bartering, that's what it's all about.\" He added that he was not going to reveal what he was going to do with the money he was making. Vintage TV and film posters also lined the walls, including a rare portrait of Raquel Welch and an original advertising print from the Benny Hill Show. And, almost hidden at the back of the lock-up, were the two giant toothbrushes from his former Channel 4 show, although these were not for sale.\n \n Despite the sheer curiosity value of the sale, there was a healthy trickle of interest from the public rather than the perhaps expected crowds. Some wandered in just to browse, as they would any of the other stalls, not knowing that it belonged to Evans.\n \n Paul Burgess said: \"I didn't realise. I thought it was just a load of junk. I should go back and have a better look.\" But local resident Francesca Detakats came specially to the stall and left happy with her purchase of an original 1960s photograph of The Who by David Wedgburg. Ms Detakats said she was a collector and did not mind paying £350 for the print. \"If you like something, you don't really count it like that,\" she said.\n \n Martin Hellewell, who had also made a point of visiting Evans' shop, said he thought it was a great idea. \"Why not, if you've got stuff to get rid of it's a good place to do it,\" said Mr Hellewell. Evans has taken out the stall with business partner Pete Winterbottom. They plan to open every day if possible, although Evans did not know how often he would be there. \"We'll stay definitely until Christmas and then maybe a week after that,\" said Evans.\n", "llama3.2:1b": ["Chris Evans is selling thousands of his possessions from a stall in Camden Market, London, including furniture, memorabilia, and vintage items.", "He has sold many of the items, stating it feels good to get rid of them due to clutter.", "The sale includes large pieces like sofas and beds, as well as smaller items like pictures and posters.", "Evans gave each item labels with prices, although he said it's not about the money but about getting rid of it all.", "Some customers, including Francesca Detakats, were attracted to the sale due to curiosity value rather than expectation of crowds."], "llama3.2:3b": ["Chris Evans has started selling his possessions from a stall at Camden Market in London.", "He is getting rid of thousands of items including furniture, posters, and memorabilia.", "The prices are steep but not deterring shoppers, who came to browse despite initial surprise.", "Evans said he wants to get rid of the clutter as it's become a headache."], "gemma2:2b": ["Chris Evans is selling furniture and memorabilia from his homes in London and Los Angeles at a stall in Camden Market.", "He cites the desire to declutter as motivation for the sale.", "Items include large, custom-made pieces, such as a throne and stripy deckchair, with prices sometimes reflecting their size or uniqueness.", "While some customers were drawn by the curiosity factor, others purchased items based on personal interest and value."], "qwen2.5:0.5b": ["Chris Evans' TV shows brought him many possessions - sofas, chairs, pictures, beds, memorabilia.", "He has gone to a Camden Market stall selling all his stuff and asked why he wanted to sell it.", "He was happy because he is no longer bothered by the clutter of his belongings.", "His clothes are so big they might seat a party and a bed seems large enough for four people.", "Evans' possessions were given him labels saying \"Isn't it great\", \"Bob Dylan's old sofa - honest\" and \"Raquel Welch's photo\".", "He plans to sell most of his stuff but says he will only keep the ones he likes.", "He also sold some vintage TV posters which included The Who's 1960s photograph and Benny Hill Show original advertising print.", "Some shoppers just came there to browse without knowing Evans owned them."], "qwen2.5:1.5b": ["Broadcaster Chris Evans sells thousands of possessions from his London stall, describing it as clutter-free.", "He uses labels with humorous comments to attract buyers.", "Prices are steep but sales have been well-received by the public due to its quirky display and offbeat items like large furniture and rare posters."], "qwen2.5:3b": ["Broadcaster Chris Evans began selling thousands of his possessions from a stall in Camden Market, London.", "Items include furniture, memorabilia, and posters from his past shows.", "He sold to get rid of clutter and described the process as relieving mental weight.", "The sale reflects his eccentricity seen on TV shows like Don't Forget Your Toothbrush.", "Prices were reasonable compared to original costs, though Evans emphasized selling for practical reasons rather than profit.", "Despite initial skepticism, visitors included collectors who valued items regardless of price tags.", "Evans plans to keep the stall open until Christmas, with a possibility extending past that date."], "opencoder:1.5b": ["Chris Evans's sale of his possessions from a stall in Camden Market, London, has been one of the most personal shopping experiences for him.", "He was so eager to sell his furniture without feeling left out or taken advantage of by his past choices.", "Despite being filled with enthusiasm, he appreciated the effort and the money involved in making these purchases.", "This purchase includes several items from his home in Los Angeles and London: sofas, chairs, pictures, beds, memorabilia from his TV shows, and a collection of vintage posters.", "The prices were steep by a lot of people's standards but Evans loved them because they were not deterring any shopping crowds.", "He also left many positive comments on the sale.", "Some mentioned the sheer size of the furniture pieces, and that they were all custom-made with a certain look and feel.", "The buyers appreciated the attention to detail and the personal touches of each item.", "To summarize, this purchase was not just about selling but also about giving back to the community through his choices."], "smollm:1.7b": ["The summary of this text is:\n\nChris Evans has begun selling thousands of his possessions from a stall in Camden Market, London.", "The stall was packed with his furniture, pictures, beds and memorabilia from his past TV shows.", "Asked the reason for the sale, Evans said: \"I just want to get rid of it all, it's just a headache.\"", "He added: \"It feels good to be selling this stuff, it's a weight off my mind.", "There are so many things here that would make me feel better if I had them in my own home.\"", "The store was packed with people looking for unique items and memorabilia from Chris Evans' past TV shows.", "The key ideas or points of the summary are:\n\n1.", "Chris Evans has started selling his possessions from a stall in Camden Market, London.", "2.", "The stall was packed with his furniture, pictures, beds and memorabilia from his past TV shows.", "3.", "Asked the reason for the sale, Evans said: \"I just want to get rid of it all, it's just a headache.\"", "4.", "He added: \"It feels good to be selling this stuff, it's a weight off my mind.\"", "5.", "The store was packed with people looking for unique items and memorabilia from Chris Evans' past TV shows."], "deepseek-r1:1.5b": ["Chris Evans sold thousands of his possessions from a Camden Market stall, using a stool and fronting an Aladdin's cave.", "He sells everything out of frustration, even getting coffee and a coat in front of an eccentric figure.", "His items were large, intricate, sometimes featuring quirky labels with prices and jokes.", "Public interest was strong as people bought valuable stuff, including a 1960s photograph by David Wedgburg for £350."], "tinyllama:1.1b": ["Chris Evans has begun selling thousands of his possessions from a market stall in Camden, London, with items ranging from sofas to bedding, autographed photographs, and memorabilia from his TV shows such as \"Don't Forget Your Toothbrush.\"", "The sale began with small numbers of items, but Evans has stated that he plans to keep the stall open daily if possible.", "He revealed that a large sofa would be on sale for less than the buyer had bid.", "Despite the curiosity value, some shoppers were unaware of the sale and some even made purchases, which Evans was happy about.", "The sale will likely continue until Christmas or after.", "Evans has partnered with fellow businessman Pete Winterbottom to open the stall every day, if possible."], "tinydolphin:1.1b": [" Summary: Chris Evans is selling his possessions from his stall in Camden Market.", "The sale has generated interest from the public as well as people who visit for a closer look at items like his old TV show posters and a rare portrait of Raquel Welch.", "Evans' decision to participate in charity auctions to raise funds for his children's cancer research also sparked interest in the event."], "phi:2.7b": [" Broadcaster Chris Evans sold thousands of his possessions from a stall in Camden Market, London, including furniture and memorabilia from his TV shows.", "He wanted to get rid of the clutter and enjoyed selling the items but was not revealing what he would do with the money.", "The prices were steep by people's standards, but shoppers were still interested.", "Paul Burgess walked away from the sale without realizing it belonged to Evans, while Francesca Detakats left happy with an original photograph of The Who by David Wedgburg.", "Martin Hellewell thought it was a great idea and encouraged Evans to keep the stall open."], "orca-mini:3b": [" Broadcaster Chris Evans is selling thousands of his possessions from a Camden Market stall in London.", "Evans is displaying his furniture, pictures, beds, and memorabilia from his past TV shows.", "He has labeled many items with humorous asides, and some items are priced higher than others.", "Despite the interest from the public, there is not a large crowd of people interested in the sale.", "Some people just happen to stroll by and take a look, while others are collectors who are willing to pay a premium for certain pieces.", "The sale helps Evans get rid of his clutter and provides some entertainment value for viewers."], "hermes3:3b": ["Chris Evans selling possessions from Camden Market, London; vast number of furniture, memorabilia from TV shows."], "stablelm-zephyr:3b": ["Chris Evans, a broadcaster known for his eccentricities in shows like \"Don't Forget Your Toothbrush\", has begun selling thousands of his possessions from his homes in London's Camden Market.", "Including furniture, memorabilia and custom-made pieces, Evans aims to rid himself of clutter and feels happy selling the items.", "Despite steep prices, interest from the public has been steady with some visitors browsing out of curiosity.", "Evans plans to open his stall every day until Christmas before possibly extending into the following week."], "chatgpt-4o-latest": ["Broadcaster Chris Evans has set up a stall in Camden Market, London, to sell thousands of his possessions, including furniture, memorabilia, and vintage posters from his homes in Los Angeles and London.", "Evans described the sale as a way to declutter, emphasizing that it was not about money but about getting rid of unnecessary items.", "The collection featured large, custom-made pieces, such as a red and gold throne and a deckchair from the Queen Mary liner, with humorous price tags.", "While some shoppers were unaware of Evans' involvement, others visited specifically for the sale, purchasing unique items like a 1960s photograph of The Who.", "Evans, along with business partner Pete Winterbottom, plans to keep the stall open until at least Christmas."], "stablelm2:1.6b": ["Broadcaster Chris Evans is selling his possessions from a stall in London's Camden Market, including furniture from Los Angeles and London homes.", "He wants to get rid of the clutter and enjoys the process, even if it doesn..", "Some shoppers came just for browsing while others found out it was Evans' sale.", "Despite the curiosity value, there were healthy numbers of interest.", "Local residents bought original artwork, like an 8\"x10\" photograph by David Wedgburg, at a price of £50.", "Chris Evans and business partner Pete Winterbottom plan to open their stall daily until Christmas and possibly one week afterward."], "granite3.1-dense:2b": ["Chris Evans, the British broadcaster, is selling his personal possessions from a stall in Camden Market, London.", "Among the items are furniture from his homes in Los Angeles and London, including numerous sofas, chairs, pictures, beds, and memorabilia from his TV shows.", "Evans described the sale as \"a headache,\" expressing relief at getting rid of clutter.", "The eclectic items on display, such as a large red and gold upholstered \"throne\" and a custom-made stripy deckchair, showcased Evans' eccentric taste.", "Prices were high, but Evans emphasized it was about getting rid of the stuff rather than making money.", "Despite the steep prices, there was consistent interest from passersby, with some purchasing vintage items like a rare photograph of The Who and an original advertising print from the Benny Hill Show.", "Evans plans to keep his stall open until Christmas, possibly extending beyond that."]}