{"raw_text": "Top stars join US tsunami TV show\n \n Brad Pitt, Robert De Niro and Hugh Grant have been added to the line-up for a two-hour US TV special to raise money for victims of the Asian tsunami.\n \n Andy Garcia, Lucy Liu, Natalie Portman and Jay Leno are also among the new names for Saturday's Tsunami Aid. They will join A-list singers Madonna, Sir Elton John, Nelly and Usher plus actors Kevin Spacey, Halle Berry and George Clooney on the NBC broadcast. Viewers will be urged to phone in to make donations throughout the night. Norah Jones, Diana Ross, Stevie Wonder, Maroon 5, Mary J Blige and Eric Clapton will give musical performances on the show described as \"A Concert of Hope\".\n \n Catherine Zeta Jones, Michael Douglas, Bruce Willis, Uma Thurman, Matt Damon, Drew Barrymore and Tim Robbins are among the other movie superstars due to put in an appearance. George Clooney recently reacted angrily to a TV host's suggestion that not all funds raised would go towards tsunami relief. Fox TV's Bill O'Reilly said he would be \"watching to see if the money gets to the tsunami victims\" and warned the celebrities taking part \"had better be involved all the way down the line\". But Clooney accused O'Reilly of creating a fuss for his own personal gain, saying viewers may now be \"afraid that their money will do no good\".\n \n He urged O'Reilly to co-present the TV special, adding in a letter: \"We're not playing games here, we're trying to save lives. It's as simple as this - you're either with this joint effort or against it.\" Organisers say all funds will go to the American Red Cross. The commercial-free benefit show will also be aired by a string of cable broadcasters and Clear Channel's radio stations across the US. In addition, performances will be available to buy on the internet as downloads from Sony's Connect music store. A similar TV benefit carried by all four primary US TV networks after the 11 September terror attacks raised more than $150m (£80m).\n \n \n  - The Bangkok International Film Festival got under way on Thursday in the Thai capital in the shadow of the country's 5,300 deaths from the tsunami. The red carpet gala opening night was ditched in favour of a more subdued first night. Six different films were shown at six cinemas, with all money from ticket sales going to charity.\n", "llama3.2:1b": ["Brad Pitt, Robert De Niro, and Hugh Grant have joined the lineup for a two-hour US TV special to raise money for victims of the Asian tsunami.", "Andy Garcia, Lucy Liu, Natalie Portman, Jay Leno, Madonna, Sir Elton John, Kevin Spacey, Halle Berry, George Clooney, Norah Jones, Diana Ross, Stevie Wonder, Maroon 5, Mary J Blige, Eric Clapton, and Catherine Zeta Jones are also set to appear.", "The show will be broadcast on NBC and air across US cable and radio stations."], "llama3.2:3b": ["Brad Pitt and Robert De Niro join Hugh Grant for US TV special Tsunami Aid to raise money for tsunami victims, alongside other stars including Andy Garcia, Lucy Liu, Natalie Portman, Jay Leno, Madonna, Elton John, Kevin Spacey, Halle Berry, George Clooney, Norah Jones, Diana Ross, Stevie Wonder, and Maroon 5.", "The show also features performances from George Clooney, Michael Douglas, Bruce Willis, Uma Thurman, Matt Damon, Drew Barrymore, Tim Robbins, among others.", "All funds will go to the American Red Cross, with a similar TV benefit after 9/11 raising over $150m."], "gemma2:2b": ["A two-hour US TV special \"Tsunami Aid\" will feature many celebrities (including Brad Pitt, Robert De Niro, Hugh Grant) and musicians to raise money for tsunami victims.", "The show's purpose is to provide hope and support amidst the tragedy.", "Funds raised will be directed to the American Red Cross."], "qwen2.5:0.5b": ["A US TV special will raise money for victims of the Asian tsunami.", "Andy Garcia and other celebrities will perform on it.", "Bill O'Reilly called on celebrities to help with tsunami relief.", "The Bangkok International Film Festival screened films instead of a TV special."], "qwen2.5:1.5b": ["Top celebrities Brad Pitt, Robert De Niro, Hugh Grant, Andy Garcia, Lucy Liu, Natalie Portman, Jay Leno, Madonna, Elton John, Usher, Kevin Spacey, Halle Berry, George Clooney, among others have joined US TV special for tsunami aid.", "The show will air on NBC and raise funds through donations by phone.", "Performers include Norah Jones, Diana Ross, Stevie Wonder, Maroon 5, Mary J Blige, Eric Clapton.", "The American Red Cross will receive all proceeds from the event."], "qwen2.5:3b": ["Top stars including Brad Pitt, Robert De Niro, Hugh Grant, Andy Garcia, Lucy Liu, Natalie Portman, Jay Leno join US TV special for tsunami aid on NBC, raising funds through phone donations and musical performances by artists like Norah Jones, Stevie Wonder, Usher, etc.", "to the American Red Cross.", "George Clooney disputes Fox host Bill O’Reilly’s skepticism about the use of funds, urging him to co-present the show instead.", "The event, free from commercials, will air on multiple channels and be available for download online.", "Meanwhile, the Bangkok International Film Festival in Thailand had a somber opening night with ticket proceeds going entirely to charity due to tsunami deaths there."], "opencoder:1.5b": ["The text provided is quite extensive and contains multiple key points.", "To simplify it, let's focus on the following:\n\n1) The US tsunami incident occurred in the capital of Thailand, which raised millions due to the destruction by the Asian Tsunami.", "2) After the event, six different films were produced with ticket sales all going towards charity.", "3) The Bangkok International Film Festival was held on Thursday and saw six films being shown at six cinemas, all raising funds for their production."], "smollm:1.7b": ["The summary is concise and easy to understand.", "It captures the main points of the text without including unnecessary details or explanations.", "The key information provided includes:\n\n1.", "Top stars join US tsunami TV show\n2.", "Andy Garcia, Lucy Liu, Natalie Portman, Jay Leno and others are among new names for Saturday's Tsunami Aid\n3.", "A-list singers will perform on the show\n4.", "Viewers will be urged to phone in to make donations throughout the night\n5.", "Norah Jones, Diana Ross, Stevie Wonder, Maroon 5, Mary J Blige and Eric Clapton are among the other movie superstars due to put in an appearance\n6.", "George Clooney reacts angrily to a TV host's suggestion that not all funds raised would go towards tsunami relief\n7.", "Fox TV's Bill O'Reilly says he will be \"watching to see if the money gets to the tsunami victims\" and warned the celebrities taking part \"had better be involved all the way down the line\"\n8.", "But Clooney accused O'Reilly of creating a fuss for his own personal gain, saying viewers may now be \"afraid that their money will do no good\"\n9.", "The concert-free benefit show will also be aired by a string of cable broadcasters and Clear Channel's radio stations across the US\n10.", "In addition, performances will be available to buy on the internet as downloads from Sony's Connect music store"], "deepseek-r1:1.5b": ["The Asian Tsunami caused millions of deaths, so this $500 million special show aims to help those affected.", "Joining are Brad Pitt, Robert De Niro, Hugh Grant, and a film industry star, along with Andy Garcia and Natalie Portman.", "The show is on NBC, viewers can call in for donations, and there are musical performances by other superstars.", "George Clooney, who recently criticized Fox's Bill O'Reilly, accused him of creating his own money but urged the celebrities to be involved all the way down.", "The film festival on Thursday was moved indoors due to the Tsunami."], "tinyllama:1.1b": ["Top stars join US TV show Tsunami Aid and a two-hour special will raise money for victims of the Asian tsunami by featuring well-known actors, musicians, filmmakers, and other celebrities.", "The celebrity participants include Hollywood megastar Brad Pitt, pop legend Madonna, pop icon Sir Elton John, actor Kevin Spacey, singer Diana Ross, pop star Nicole Kidman, actor Hugh Grant, Grammy Award winner Neil Young, and many more.", "This benefit show will be broadcast by NBC on Saturday nights at 9 pm Eastern Standard Time (EST), and will include musical performances by Cathecheter Zeita Jones, Michael Douglas, Bruce Willis, Uma Thurman, Matt Damon, and Tim Robbins among others.", "The special will also feature all profits going to victims of the tsunami, with host Bill O'Reilly accusing Fox TV's Bill O'Reilly of trying to \"save lives\" for his own personal gain."], "tinydolphin:1.1b": [" This news article provides details about an impending TV special to aid victims of the tsunami disaster in Asia.", "It mentions that some high-profile stars have joined the lineup, including Brad Pitt, Robert De Niro and Hugh Grant.", "The other actors include Andy Garcia, Lucy Liu, Natalie Portman and Jay Leno.", "The US TV special is scheduled for a two-hour broadcast on Saturday.", "In addition to raising money for relief efforts, it will feature musical performances by Norah Jones, Diana Ross, Stevie Wonder, Maroon 5, Mary J Blige, Eric Clapton, and other celebrities.", "Additionally, there are plans to offer movie superstars such as Catherine Zeta-Jones, Michael Douglas, Bruce Willis, Uma Thurman, Matt Damon, Drew Barrymore, and Tim Robbins a chance to appear in their films' trailers or promotional clips."], "phi:2.7b": [" Brad Pitt, Robert De Niro and Hugh Grant have joined US TV special Tsunami Aid to raise funds for victims of the Asian tsunami.", "A-list singers Madonna, Sir Elton John, Nelly and Usher, along with actors Kevin Spacey, Halle Berry and George Clooney will perform on Saturday' s show described as \"A Concert of Hope\".", "Viewers are urged to make donations throughout the night.", "All funds raised will go to the American Red Cross."], "orca-mini:3b": [" Top stars join US TV show to raise money for tsunami victims, including Brad Pitt, Robert De Niro, Hugh Grant, Andy Garcia, Lucy Liu, Natalie Portman, Jay Leno, and more.", "The two-hour event will air on NBC and feature musical performances from Norah Jones, Diana Ross, Stevie Wonder, Maroon 5, Mary J Blige, and Eric Clapton.", "While some celebrities expressed concerns over the use of their time and energy, George Clooney accused a TV host of creating a fuss for personal gain.", "The event will raise all funds to the American Red Cross for tsunami relief efforts."], "hermes3:3b": ["BradPitt - etc.", "* A-list actors join US Tsunami TV special\n* Names include Brad Pitt, Robert DeNiro, Hugh Grant\n* Also musicians like Madonna and Nelly, Usher, Maroon5\n* Funds will go to American Red Cross for tsunami victims\n* Benefit show also aired by cable broadcasters & Clear Channels radio stations"], "stablelm-zephyr:3b": ["Top Hollywood stars including Brad Pitt, Robert De Niro, Hugh Grant, Andy Garcia, Lucy Liu, Natalie Portman, Jay Leno, Madonna, Elton John, Nelly, Usher, Kevin Spacey, Halle Berry, George Clooney, Catherine Zeta Jones, Michael Douglas, Bruce Willis, Uma Thurman, Matt Damon, Drew Barrymore, and Tim Robbins are taking part in a two-hour US TV special, Tsunami Aid, to raise money for tsunami victims.", "The event will be aired on NBC and feature musical performances by Norah Jones, Diana Ross, Stevie Wonder, Maroon 5, Mary J Blige, and Eric Clapton.", "Proceeds from the commercial-free benefit show will go to the American Red Cross, with all ticket sales for the Bangkok International Film Festival donating to charity as well."], "chatgpt-4o-latest": ["Brad Pitt, Robert De Niro, Hugh Grant, and other top stars will participate in a two-hour US TV special, \"Tsunami Aid,\" to raise funds for Asian tsunami victims.", "The NBC broadcast will feature performances by Madonna, Sir Elton John, Nelly, Usher, and others, with viewers encouraged to donate.", "George Clooney defended the fundraiser against criticism from Fox TV's Bill O'Reilly, assuring that all proceeds will go to the American Red Cross.", "The commercial-free event will also be aired on cable and radio, with performances available for purchase online.", "Meanwhile, the Bangkok International Film Festival opened with a subdued event, donating all ticket sales to charity in light of Thailand's tsunami death toll."], "stablelm2:1.6b": ["Top stars including Brad Pitt, Robert De Niro, and Hugh Grant join a two-hour US TV special for Tsunami Aid, raising funds for Asian tsunami victims.", "New names added to the lineup include Andy Garcia, Lucy Liu, Natalie Portman, Jay Leno, Madonna, Sir Elton John, Nelly, Usher, Kevin Spacey, Halle Berry, George Clooney, and more.", "The event will also be aired by various cable broadcasters and Clear Channel's radio stations across the US.", "All funds raised will go to the American Red Cross, with performances available for purchase on the internet as downloads from Sony's Connect music store."], "granite3.1-dense:2b": ["Top celebrities, including Brad Pitt, Robert De Niro, and Hugh Grant, have joined the cast for Tsunami Aid, a two-hour NBC broadcast on Saturday to raise funds for Asian tsunami victims.", "The event will feature performances by Madonna, Elton John, Usher, Kevin Spacey, Halle Berry, George Clooney, and many more.", "Viewers are encouraged to donate over the phone during the show.", "Organizers guarantee that all proceeds will benefit the American Red Cross.", "The event will also air on cable networks and radio stations, with digital downloads available from Sony's Connect music store.", "George Clooney previously clashed with Fox TV host Bill O'Reilly over fund distribution, but insisted that all funds raised will reach tsunami victims.", "In a letter to O'Reilly, Clooney urged him to co-present the special, emphasizing their commitment to saving lives and dismissing criticism as personal gain.", "Concurrently, the Bangkok International Film Festival began in Thailand, featuring six films shown at multiple cinemas with ticket proceeds going to charity, instead of a traditional red carpet gala due to the tragic tsunami's impact on the country."]}