{"raw_text": "Star Trek fans fight to save show\n \n Star Trek fans have taken out a full-page ad in the Los Angeles Times in an attempt to persuade TV executives not to scrap Star Trek: Enterprise.\n \n Made by the UPN TV network, the latest spin-off from the hit sci-fi show is due to end in May after four series. But fans around the world have pitched in to pay for the advert, which had the headline \"Save Star Trek\". They are also asking the Sci-Fi Channel to pick it up from UPN and will stage a rally in Los Angeles on 25 February.\n \n The advert described the Star Trek franchise as a \"cultural icon\". Enterprise stars former Quantum Leap actor Scott Bakula as Captain Archer and is set before the original 1960s Star Trek series. \"Captain Archer and the crew of the NX-01 need your help to continue their journeys!\" the advert said. It also included a cut-out coupon for fans to send to UPN's parent companies Paramount and Viacom plus the Sci-Fi Channel. It also urged supporters to join the rally outside the Paramount studios.\n \n Fan website Trek United is hoping to raise $32m (£17m) from donations by the end of March to pay for a fifth series. More than $23,000 (£12,000) has been pledged so far, according to the site. The 98th and final episode of Star Trek: Enterprise will air in the US on 13 May. The fourth series has averaged 2.9 million viewers per episode - half the amount it got in its first series. Star Trek: Enterprise began in 2001 following other Star Trek spin-off series The Next Generation, Deep Space Nine and Voyager.\n", "llama3.2:1b": ["Star Trek fans are campaigning to save the TV show \"Enterprise\" by purchasing a full-page ad in the Los Angeles Times.", "Fans have also gathered money for a benefit concert and rally outside Paramount studios."], "llama3.2:3b": ["Fans of Star Trek have taken out a full-page ad in the Los Angeles Times to persuade TV executives not to scrap Star Trek: Enterprise.", "The show's fans are also staging a rally on February 25th to ask the Sci-Fi Channel to pick it up from UPN, and a fan website is trying to raise $32m by March for a fifth series."], "gemma2:2b": ["Star Trek fans are campaigning to save the TV show \"Star Trek: Enterprise\" after it was announced that it will end after four seasons.", "They have launched a full-page ad in the Los Angeles Times, raised funds through online donations, planned a rally outside Paramount studios, and hope to raise $32 million more from supporters by March to fund a fifth season."], "qwen2.5:0.5b": ["Star Trek fans are fighting for a full-page ad in the Los Angeles Times to persuade TV executives not to scrap Star Trek: Enterprise.", "The show stars former Quantum Leap actor Scott Bakula as Captain Archer and is set before the original 1960s Star Trek series.", "A $32m advertisement was planned, with donations from the fan site Trek United raising over $23,000 so far.", "Star Trek: Enterprise has been averaging 2.", "9 million viewers per episode since its debut in 2001, with half of that amount coming from the first series."], "qwen2.5:1.5b": ["Star Trek fans have rallied to save a TV show due to end after four seasons with donations totaling more than $23,000 (£12,000) so far.", "They want to pay for a fifth season of Star Trek: Enterprise on Sci-Fi Channel instead.", "A full-page ad was published in the Los Angeles Times calling for support."], "qwen2.5:3b": ["Star Trek fans have launched a full-page ad campaign in the Los Angeles Times to prevent the cancellation of Star Trek: Enterprise by UPN TV network.", "The show is set for its final episode on May 13th after four seasons.", "Fans are raising funds via donations and organizing rallies, hoping to secure funding for a potential fifth series despite lower viewership compared to its initial run."], "opencoder:1.5b": ["Star Trek fans have taken out a full-page ad in the Los Angeles Times to persuade TV executives not to scrap Star Trek: Enterprise.", "The advert described the Star Trek franchise as a \"cultural icon\".", "Enterprises like Scott Bakula, who played former Quantum Leap actor Captain Archer and is set before the original 19th century Star Trek series, need your help to continue their journeys.", "Fans also asked the Sci-Fi Channel to pick up this ad from UPN and will stage a rally in Los Angeles on 25 February.", "It urged supporters to join the rally outside the Paramount studios.", "The fan website Trek United is hoping to raise $32 million from donations by the end of March, along with more than $23,000 pledges so far."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details while omitting unnecessary information.", "It provides a brief overview of the main points without going into too much detail or providing explanations.", "The summary also includes relevant information about the Star Trek franchise, its characters, and the ad campaign.", "Finally, it highlights the efforts of fans to save the show and asks for support from the public."], "deepseek-r1:1.5b": ["The Star Trek fans are fighting over a full-page ad in The Los Angeles Times titled \"Save Star Trek,\" urging television executives not to scrap the show.", "Made by UPN TV network, the new spin-off is due to end in May with four series remaining.", "Fans have raised $32 million for the fifth episode's cost and plan to stage a rally in LA.", "The show started in 2001 as part of the Star Trek franchise, with earlier spin-offs like The Next Generation and Deep Space Nine."], "tinyllama:1.1b": ["Fans of the popular sci-fi show \"Star Trek\" have taken out a full-page ad in the Los Angeles Times to persuade TV executives to continue the series after four seasons.", "The latest spin-off, \"Star Trek: Enterprise,\" is set to end in May, and fans have pledged a total of $23,000 to support the fifth series as part of a \"Save Star Trek\" rally.", "Advertising agency Starcom MediaVest Group has helped organize the campaign, which includes an ad featuring former Quantum Leap actor Scott Bakula as Captain Archer and sets before the original 1960s Star Trek series.", "The ad calls the franchise a \"cultuural icon\" and encourages supporters to send in donations by the end of March.", "Fans have already raised more than $23,000 for the fifth season, which will air in May after four seasons.", "Despite the show's low viewership ratings, the fourth series has averaged 2.9 million viewers per episode - half as many as it got in its first series."], "tinydolphin:1.1b": [" Star Trek fans have taken out a full-page ad in the Los Angeles Times to save the beloved sci-fi show's latest spin-off, Star Trek: Enterprise.", "The ad, which was published on February 15th, reads: \"Save Star Trek\" and calls the show an \"iconic cultural phenomenon.\"", "The full-page ad has a headline that reads: \"Star Trek: Save Our Show!\"", "and features images of past Star Trek series and Captain Archer.", "It is seeking donations from fans to continue the series and eventually save it from being canceled before its final episode airs on May 13th."], "phi:2.7b": [" Star Trek fans are using a full-page ad to persuade TV executives not to cancel Star Trek: Enterprise, a sci-fi show set before the original series.", "Fans have raised over $23,000 so far in a campaign to fund a fifth series through donations on their website, hoping to raise at least $32 million by March.", "The fourth series has averaged 2.9 million viewers per episode."], "orca-mini:3b": [" Star Trek fans fight to save show with a full-page ad in the Los Angeles Times and rally in Los Angeles, urging TV executives not to scrap Star Trek: Enterprise.", "The latest spin-off from the hit sci-fi show is due to end in May after four series and has been supported by donations and rallies."], "hermes3:3b": ["Star Trek fans take full-page ad in LA Times to save 'Enterprise', ask Sci-Fi Channel to pick up series after potential cancellation."], "stablelm-zephyr:3b": ["Fans of Star Trek have taken out a full-page ad in the Los Angeles Times urging TV executives to save Star Trek: Enterprise, which is due to end in May after four series.", "They have also asked the Sci-Fi Channel to pick it up and plan a rally in Los Angeles on 25 February.", "Fan website Trek United is trying to raise $32m (£17m) to fund a fifth series, with over $23,000 pledged so far.", "The 98th and final episode of Star Trek: Enterprise will air on 13 May."], "chatgpt-4o-latest": ["Star Trek fans have launched a campaign to save Star Trek: Enterprise, which is set to end in May after four seasons on UPN.", "They funded a full-page ad in the Los Angeles Times urging executives to continue the show and are asking the Sci-Fi Channel to pick it up.", "A rally is planned outside Paramount Studios on February 25.", "The ad called Star Trek a \"cultural icon\" and included a coupon for fans to send to UPN, Paramount, Viacom, and the Sci-Fi Channel.", "Fan website Trek United aims to raise $32 million to fund a fifth season, with over $23,000 pledged so far.", "The final episode airs on May 13, with viewership having declined from its first season."], "stablelm2:1.6b": ["Star Trek fans created a full-page ad in the Los Angeles Times to save the latest spin-off show, Star Trek: Enterprise from ending in May after four seasons.", "Fans paid for the ad and are asking the Sci-Fi Channel to take it over while also planning a rally in February.", "The ad describes the franchise as a \"cultural icon\" and includes messages urging supporters to join the rally outside Paramount studios and donate funds to help cover a fifth series."], "granite3.1-dense:2b": ["Star Trek fans worldwide have banded together to combat the cancellation of the UPN TV network's Star Trek: Enterprise, a spin-off from the popular sci-fi franchise.", "They've placed a full-page ad in the Los Angeles Times titled \"Save Star Trek,\" emphasizing Enterprise as a cultural icon featuring Captain Archer and his crew.", "The fans aim to persuade the Sci-Fi Channel to take over the series from UPN, which is set to conclude on May 13, 2005.", "They've launched a fundraising campaign on fan website Trek United to gather $32 million by March, having already collected over $23,000.", "Despite lower viewership in its fourth series (averaging 2.9 million per episode), the fans are determined to secure additional seasons for the beloved show.", "A rally is planned for February 25 in Los Angeles to demonstrate support."]}