{"raw_text": "Double eviction from Big Brother\n \n Model Caprice and Holby City actor Jeremy Edwards have both left the Celebrity Big Brother house in a surprise double eviction on Friday.\n \n Caprice, who left in the scheduled fourth eviction having gained just 5% of the public vote, afterwards said: \"I am so happy, I am so glad I'm out.\" Edwards then left in a surprise eviction, with 12% of the vote. Nineteen-year-old Blazin' Squad singer Kenzie is currently favourite to win the £50,000 charity prize. Caprice had been the pre-show favourite to be voted out of the house, with bookmakers Ladbrokes offering odds of 1/5 on her departure. Ladbrokes spokesman Warren Lush had said she was \"the hottest eviction favourite so far this series\".\n \n Odds on Kenzie's victory have been slashed from 4/6 to 1/2, although bookmakers have said they are not ruling out a late rally from former Happy Mondays star Bez. The other remaining housemate is actress Brigitte Nielsen. DJ Lisa I'Anson became the third housemate to be voted out on Wednesday when she became the victim of a surprise eviction during a game of hide-and-seek on the Channel 4 show. I'Anson said she was \"glad to be out\" and predicted that Kenzie would emerge as the winner. The winner is due to be announced on Sunday night.\n", "llama3.2:1b": ["Jeremy Edwards and Caprice are both leaving Celebrity Big Brother in a double eviction, with Edwards being surprised to leave after gaining 12% of the vote, while Caprice was previously expected to be evicted.", "Blazin' Squad singer Kenzie has been favourite to win the £50,000 charity prize, but bookmakers have reduced her odds from 4/6 to 1/2 following a surprise eviction."], "llama3.2:3b": ["Jeremy Edwards and Model Caprice left Celebrity Big Brother in a surprise double eviction.", "Caprice had been the pre-show favourite but gained only 5% of the vote, while Edwards got 12%.", "Blazin' Squad singer Kenzie is now favourite to win the £50,000 charity prize."], "gemma2:2b": ["Jeremy Edwards and Caprice were both evicted from Celebrity Big Brother in a double eviction on Friday.", "Kenzie is now the favorite to win the £50,000 prize, with odds slashed after her high vote count.", "The remaining housemate is Brigitte Nielsen."], "qwen2.5:0.5b": ["A surprise double eviction from Big Brother has occurred in which actress Jeremy Edwards left with a 5% vote share, while Caprice won only 12% of the public vote.", "In contrast, Blazin' Squad singer Kenzie became the favourite to win the £50,000 charity prize.", "TV show host Jack Frost was voted out during a game on Channel 4, but his departure from the house has since been announced as a surprise eviction."], "qwen2.5:1.5b": ["Celebs Big Brother: Jeremy Edwards and Caprice have been evicted, leaving Kenzie as favourite for £50k prize.", "Bookmakers cut odds from 1/5 to 1/2 on Kenzie's victory.", "Lisa I'Anson was voted out after being caught cheating in a game show."], "qwen2.5:3b": ["Celebrity Big Brother saw model Caprice and actor Jeremy Edwards evicted in a surprise double eviction on Friday.", "Caprice, initially favoured to leave, left after gaining 5% of the public vote, while Edwards was evicted with 12%.", "Kenzie is now the favourite to win the £50,000 charity prize with odds slashed from 4/6 to 1/2, though former Happy Mondays star Bez remains a potential late entry.", "Actress Brigitte Nielsen and DJ Lisa I'Anson are the other remaining housemates; I'Anson predicted Kenzie would win after her eviction.", "The winner will be announced on Sunday night."], "opencoder:1.5b": ["Model Caprice and Holby City actor Jeremy Edwards have both left the Celebrity Big Brother house in a surprise double eviction on Friday.", "Caprice, who left in the scheduled fourth eviction having gained just 5% of the public vote, afterwards said: \"I am so happy, I am so glad I'm out.\"", "Edwards then left in a surprise eviction, with 12% of the vote.", "Nineteen-year-old Blazin' Squad singer Kenzie is currently favourite to win the £50,000 charity prize.", "Caprice had been the pre-show favourite to be voted out of the house, with bookmakers Ladbrokes offering odds of 1/5 on her departure.", "Ladbrokes spokesman Warren Lush had said she was \"the hottest eviction favourite so far this series\".", "Odds on Kenzie's victory have been slashed from 4/6 to 1/2, although bookmakers have said they are not ruling out a late rally from former Happy Mondays star Bez.", "The other remaining housemate is actress Brigitte Nielsen.", "DJ Lisa I'Anson became the third housemate to be voted out on Wednesday when she became the victim of a surprise eviction during a game of hide-and-seek on the Channel 4 show.", "I'Anson said she was \"glad to be out\" and predicted that Kenzie would emerge as the winner.", "The winner is due to be announced on Sunday night."], "smollm:1.7b": ["Double eviction from Big Brother Model Caprice and Holby City actor Jeremy Edwards have both left the Celebrity Big Brother house in a surprise double eviction on Friday.", "Model Caprice and Holby City actor Jeremy Edwards have both left the Celebrity Big Brother house in a surprise double eviction on Friday.", "Caprice, who left in the scheduled fourth eviction having gained just 5% of the public vote, afterwards said: \"I am so happy, I am so glad I'm out.\"", "Edwards then left in a surprise eviction, with 12% of the public vote.", "Nineteen-year-old Blazin' Squad singer Kenzie is currently favourite to win the £50,000 charity prize.", "Caprice had been the pre-show favourite to be voted out of the house, with bookmakers Ladbrokes offering odds of 1/5 on her departure.", "Ladbrokes spokesman Warren Lush had said she was \"the hottest eviction favourite so far this series\".", "Odds on Kenzie's victory have been slashed from 4/6 to 1/2, although bookmakers have said they are not ruling out a late rally from former Happy Mondays star Bez.", "The other remaining housemate is actress Brigitte Nielsen.", "DJ Lisa I'Anson became the third housemate to be voted out on Wednesday when she became the victim of a surprise eviction during a game of hide-and-seek on the Channel 4 show.", "I'Anson said she was \"glad to be out\" and predicted that Kenzie would emerge as the winner.", "The winner is due to be announced on Sunday night."], "deepseek-r1:1.5b": ["Double eviction at Celebrity Big Brother: Caprice and Kenzie left for £50,000 charity prize.", "Caprice was voted out with 12% of public vote, reducing her odds from 4/6 to 1/2, while Kenzie currently favorites to win with reduced odds from 4/6 to 1/2.", "Other housemates include I'Anson (already out) and Brigitte Nielsen."], "tinyllama:1.1b": ["Model Caprice and Holby City actor Jeremy Edwards have both left Big Brother in a surprise double eviction, leaving a charity prize of £50,000 up for grabs.", "In the run-up to his departure, Caprice had been the bookmakers' favourite to win the show.", "Odds on Kenzie's victory have since dropped from 4/6 to 1/2 and Ladbrokes has stated that they are not ruling out a late razzle from Bez, the last remaining housemate.", "The remaining two contestants are actress Brigitte Nielsen and former Happy Mondays star Bez, who was voted out during a game of hide-and-seek on the show.", "Kapow!"], "tinydolphin:1.1b": [" In Big Brother, double evictions took place on Friday, with Caprice, a prominent model, and Jeremy Edwards, an actor from the hit sitcom \"Holby City,\" being voted out of the house.", "Both were given the surprise eviction, leaving Kenzie as the leading contender to win the charity prize."], "phi:2.7b": [" Jeremy Edwards and Caprice, who both left Celebrity Big Brother in a double eviction, are among the housemates competing for the £50,000 charity prize.", "Despite previously being favored by bookmakers, Caprice's exit saw her leave with only 5% of the vote.", "Kenzie, Blazin' Squad singer Kenzie, is the current favorite to win, while Bez has seen his odds slashed as he was not expected to be in the top three.", "The other housemate remaining in the game is actress Brigitte Nielsen.", "DJ Lisa I'Anson was voted out during a hide-and-seek game."], "orca-mini:3b": [" Jeremy Edwards, Caprice, Kenzie, and Brigitte Nielsen are the four housemates remaining in the Celebrity Big Brother house."], "hermes3:3b": ["Caprice and Jeremy Edwards evicted from Celebrity Big Brother; Caprice happy to leave, Kenzie favored to win £50k."], "stablelm-zephyr:3b": ["Actors Caprice and Jeremy Edwards left the Celebrity Big Brother house in a surprise double eviction, with 19-year-old Blazin' Squad singer Kenzie currently favored to win the £50,000 charity prize.", "Bookmakers had previously had odds on Caprice being voted out, while Kenzie's odds were initially set at 4/6 but have since been slashed to 1/2.", "The winner will be announced on Sunday night."], "chatgpt-4o-latest": ["Model Caprice and actor Jeremy Edwards were both evicted from Celebrity Big Brother in a surprise double eviction.", "Caprice left in the scheduled fourth eviction with just 5% of the public vote and expressed happiness about leaving.", "Edwards was then evicted unexpectedly with 12% of the vote.", "Nineteen-year-old singer Kenzie is the current favorite to win the £50,000 charity prize, with bookmakers shortening his odds.", "Former Happy Mondays star Bez is also considered a contender, while actress Brigitte Nielsen remains in the house.", "DJ Lisa I'Anson was evicted earlier in a surprise elimination and predicted Kenzie would win.", "The winner will be announced on Sunday night."], "stablelm2:1.6b": ["Celebrity Big Brother participants Caprice and Jeremy Edwards were both evicted in a double eviction, with Edwards leaving first after garnering 5% of public vote and Caprice leaving next after gaining only 5%.", "Kenzie, currently favored to win the £100,0..", "Odds on Kenzie's victory have been reduced from 4/6 to 1/2, but bookmakers won't rule out a late rally by former Happy Mondays star Bez.", "The remaining housemate is actress Brigitte Nielsen."], "granite3.1-dense:2b": ["Model Caprice and Jeremy Edwards, both former contestants of Celebrity Big Brother, were unexpectedly evicted in a double eviction on Friday.", "Caprice, who initially received only 5% of the public vote, expressed relief upon her departure.", "Jeremy Edwards garnered 12% of the votes.", "Nineteen-year-old Kenzie from Blazin' Squad now holds strong odds (1/2) as the likely winner of the £50,000 charity prize, surpassing previous favorites like former Happy Mondays star Bez.", "The other housemate is actress Brigitte Nielsen.", "Previously, DJ Lisa I'Anson was evicted, followed by Caprice in a game of hide-and-seek.", "The winner will be announced on Sunday night."]}