{"raw_text": "Brookside actress Keaveney dies\n \n Actress Anna Keaveney, who appeared in Brookside, My Family and A Touch of Frost, has died of lung cancer aged 55.\n \n Keaveney, who played Brookside's Marie Jackson when the Channel 4 soap began in 1982, died on Saturday. Born in Runcorn, Cheshire, she also starred in numerous films including 1989's Shirley Valentine. She played Nellie in Mike Leigh's latest film Vera Drake, which won the Golden Lion prize for best film at this year's Venice Film Festival.\n \n And most recently she appeared alongside Richard Wilson in ITV's King of Fridges and with Martin Clunes in Doc Martin. Other TV appearances included the part of Matron in ITV drama Footballers' Wives and a cameo role as Tom Farrell's mother Sheila in BBC comedy Gimme Gimme Gimme. Keaveney's career also included stage performances in Neaptide for the National Theatre, Private Lives and The Rise and Fall of Little Voice. The actress died in hospital. Her agent Barry Brown said: \"Anna was due to have had another operation on Friday but unfortunately she was too weak.\"\n", "llama3.2:1b": ["Anna Keaveney, 55, died from lung cancer at her hospital after a battle with the illness.", "She played roles in TV shows such as King of Fridges and Doc Martin alongside Richard Wilson and Martin Clunes."], "llama3.2:3b": ["Actress Anna Keaveney, who appeared in Brookside and My Family, has died of lung cancer at 55.", "Born in Runcorn, Cheshire, she starred in numerous films including Shirley Valentine and Vera Drake, for which she played the lead role.", "Her recent TV appearances included King of Fridges and Doc Martin."], "gemma2:2b": ["Actress Anna Keaveney, known for roles in Brookside, My Family, A Touch of Frost, Shirley Valentine, and Vera Drake, has passed away at age 55 after a battle with lung cancer.", "She is survived by numerous film and TV credits and stage performances."], "qwen2.5:0.5b": ["Actor Anna Keaveney, who played Marie Jackson on Brookside, My Family and A Touch of Frost for many years, passed away at age 55 from lung cancer.", "She was also involved in numerous films including Shirley Valentine, Vera Drake, Footballers' Wives and Gimme Gimme Gimme.", "Her career also included appearances in Neaptide, Private Lives and The Rise and Fall of Little Voice."], "qwen2.5:1.5b": ["Actress Anna Keaveney, who starred in Brookside and appeared in films like Shirley Valentine and Vera Drake, has died from lung cancer at the age of 55.", "She passed away after being hospitalized."], "qwen2.5:3b": ["Actress Anna Keaveney, who starred in Brookside, My Family, and A Touch of Frost, died at the age of 55 from lung cancer.", "She played Marie Jackson in Brookside from its inception in 1982.", "Other notable roles included Nellie in Mike Leigh's Vera Drake (Golden Lion winner), Matron in Footballers' Wives, Tom Farrell's mother Sheila in Gimme Gimme Gimme, and characters in the National Theatre productions Neaptide, Private Lives, and The Rise and Fall of Little Voice.", "Keaveney died in hospital after being too weak for an upcoming operation.", "Her agent Barry Brown confirmed her death."], "opencoder:1.5b": ["Brookside actress Keaveney dies.", "Keaveney, who played Brookside's Marie Jackson when the Channel 4 soap began in 1982, died on Saturday.", "She won the Golden Lion prize for best film at this year's Venice Film Festival and made numerous films including Shirley Valentine and Vera Drake.", "She also starred in numerous films like Nellie and Mike Leigh's Vera Drake.", "She played in other shows including ITV's King of Fridges and Doc Martin as well.", "She appeared as Tom Farrell’s mother Sheila in BBC comedy Gimme Gimme Gimme.", "She won the career stage performances at Neaptide for the National Theatre, Private Lives and The Rise and Fall of Little Voice.", "The film was also a guest star on ITV drama Footballers' Wives."], "smollm:1.7b": ["Brookside actress Anna Keaveney has passed away at the age of 55, according to her family and friends.", "She appeared in several films, including My Family (1982) and A Touch of Frost (1983).", "In addition to her work on Brookside, she also starred in other TV shows, such as King of Frids (1989) and Doc Martin (1990-1996).", "She appeared in several films, including the drama Gimme Gimme Gimme (2005) and the comedy Gimme Gimme Gimme (2007).", "Keaveney's career also included stage performances in various productions, such as Neaptide for the National Theatre and Private Lives.", "She was known for her strong sense of style and her work on several TV shows, including the drama The Rise and Fall of Little Voice (1986-1987).", "Keaveney's family and friends say that she passed away suddenly after a long illness.", "Her agent Barry Brown said: \"Anna was due to have had another operation on Friday but unfortunately she was too weak.\""], "deepseek-r1:1.5b": ["Anna Keaveney, 55, who appeared on Brookside, My Family, and Vera Drake, died from lung cancer.", "Born in Runcorn, Cheshire, she also starred in Shirley Valentine.", "She acted in Mike Leigh's latest film Vera Drake, which won the Golden Lion prize for best film at this year's Venice Film Festival.", "Keaveney has other TV roles, including being in King of Fridges with Richard Wilson and in Doc Martin with Martin Clunes.", "She also appeared as Matron on ITV drama Footballers' Wives and in private lives at the National Theatre.", "She later came into screen as Tom Farrell's mother Sheila."], "tinyllama:1.1b": ["Actress Anna Keaveney, best known for her roles in Brookside and My Family and A Touch of Frost, has passed away at the age of 55.", "Keaveney starred in numerous films, including the award-winning Shirlie Valentine.", "She also appeared on TV shows such as Doc Martin, King of Fridges, and Gimmé Giommè Giummè Giummè.", "Keaveney's career included stage performances in Neaptide for the National Theatre and Private Live, The Rises & Fall of Little Voice.", "Agent Barry Brown stated that Keaveney was scheduled to undergo another operation on Friday but unfortunately, she passed away due to unforeseen circumstances."], "tinydolphin:1.1b": [" Anna Keaveney, an accomplished actress, played the role of Brookside's Marie Jackson from 1982 to 1993.", "She received critical acclaim for her portrayal of the character, which earned her a BAFTA nomination.", "In addition to acting, Keavaney was also involved in stage performances and appeared in several films throughout her career.", "Her death marks a significant loss for fans of the soap opera, and it is with great sadness that we convey our condolences to her loved ones during this difficult time."], "phi:2.7b": [" Actress Anna Keaveney, who appeared in Brookside, My Family, A Touch of Frost, Shirley Valentine, Vera Drake, King of Fridges, Doc Martin and Footballers' Wives, has died of lung cancer at the age of 55.", "She had her latest operations on Friday but was too weak to have another one due to her illness."], "orca-mini:3b": [" Anna Keaveney, a former Brookside actress who appeared in other films and TV shows, has passed away at the age of 55 from lung cancer.", "She played Marie Jackson on the soap for several years and also starred in other productions such as Shirley Valentine."], "hermes3:3b": ["Anna Keaveney, Brookside actress who played Marie Jackson, died at 55 of lung cancer.", "Appeared in films like Shirley Valentine, TV shows including A Touch of Frost, King of Fridges, Doc Martin etc."], "stablelm-zephyr:3b": ["Actress Anna Keaveney from Brookside, My Family, A Touch of Frost, and Shirley Valentine passed away at 55 due to lung cancer.", "She most recently appeared in ITV's King of Fridges, Doc Martin, and Gimme Gimme Gimme.", "Keaveney's agent confirmed she was too weak for another operation before her death."], "chatgpt-4o-latest": ["Actress Anna Keaveney has died of lung cancer at age 55.", "She was known for her role as Marie Jackson in Brookside and appeared in TV shows such as My Family, A Touch of Frost, Footballers' Wives, and Doc Martin.", "She also starred in films like Shirley Valentine and Vera Drake, which won the Golden Lion at the Venice Film Festival.", "Her stage work included performances in Neaptide, Private Lives, and The Rise and Fall of Little Voice.", "Keaveney passed away in the hospital before a scheduled operation."], "stablelm2:1.6b": ["Actress Anna Keaveney, known for roles in Brookside, My Family, and A Touch of Frost, has passed away at age 43 after battling lung cancer.", "She appeared in numerous films and TV shows, including Shirley Valentine and Vera Drake, which won the Golden Lion prize for best film at the Venice Film Festival.", "Some of her other notable appearances include King of Fridges and Doc Martin.", "Keaveney's stage work included Neaptide for the National Theatre, Private Lives, and The Rise and Fall of Little Voice."], "granite3.1-dense:2b": ["Actress Anna Keaveney, renowned for her roles in Brookside (1982-), My Family, and A Touch of Frost, died at 55 from lung cancer.", "Born in Runcorn, Cheshire, she also starred in films like Shirley Valentine (1989) and Vera Drake (2002), for which she received critical acclaim and a Golden Lion nomination at the Venice Film Festival.", "Keaveney's recent television work included King of Fridges and Doc Martin, alongside Richard Wilson and Martin Clunes, respectively.", "She also appeared in Footballers' Wives and Gimme Gimme Gimme.", "Her stage credits include Neapolitan Comedy for the National Theatre, Private Lives, and The Rise and Fall of Little Voice.", "Keaveney's career spanned over four decades.", "She was admitted to a hospital due to her condition, but unfortunately, she couldn't undergo an anticipated operation on Friday."]}