{"raw_text": "Celebrities get to stay in jungle\n \n All four contestants still remain in I'm A Celebrity ... Get Me Out Of Here as no evictions were made on the television show on Saturday.\n \n Contestants Paul Burrell, Joe Pasquale, Janet Street-Porter and Fran Cosgrave were told by hosts Ant and Dec. Natalie Appleton's decision to quit the show last Monday had given them all a stay of execution, the group were told. Model Sophie Anderton was the last person to be voted off the ITV1 show, set in the Australian jungle. The four remaining stars will do a joint Bushtucker Trial on Sunday.\n \n Former All Saints singer Natalie Appleton,31, walked out of the show after learning she would face a fifth so-called Bushtucker Trial. The celebrities are chosen by the viewers to pass trials in order to win food for the rest of the camp. Appleton had endured a torrid time during the programme, including a well-publicised row with Sophie Anderton. And on 26 November singer Brian Harvey quit as a contestant after he had a blazing row with Janet Street-Porter.\n", "llama3.2:1b": ["Celebrities who remain in I'm A Celebrity... Get Me Out Of Here despite Natalie Appleton's decision to leave, Paul Burrell, Joe Pasquale, Janet Street-Porter, and Fran Cosgrave will participate in a joint Bushtucker Trial on Sunday with former contestant Sophie Anderton."], "llama3.2:3b": ["Four contestants in I'm A Celebrity ... Get Me Out Of Here remain in the Australian jungle after no evictions were made.", "The group will do a joint Bushtucker Trial on Sunday, while former contestants Natalie Appleton and Brian Harvey quit due to their personal struggles during the show."], "gemma2:2b": ["Four celebrities remain in I'm A Celebrity... Get Me Out of Here!", "Natalie Appleton quit the show, giving other contestants a reprieve.", "The remaining four will participate in a joint Bushtucker Trial on Sunday."], "qwen2.5:0.5b": ["Celebrities are staying in an Australian jungle for their Bushtucker Trial, which is a joint event with other contestants.", "Four celebrities - Paul Burrell, Joe Pasquale, Janet Street-Porter and Fran Cosgrave - are still on the show.", "Model Natalie Appleton decided to quit after learning she would face her fifth trial as part of the Bushtucker Trial."], "qwen2.5:1.5b": ["Four celebrities remain in \"I'm A Celebrity... Get Me Out Of Here\" due to Natalie Appleton's withdrawal, and they will participate in the Bushtucker Trial on Sunday alongside Sophie Anderton."], "qwen2.5:3b": ["All four remaining contestants in I'm A Celebrity ... Get Me Out Of Here are from Paul Burrell, Joe Pasquell, Janet Street-Porter and Fran Cosgrave.", "Natalie Appleton was told to leave due to her facing a fifth Bushtucker Trial.", "Sophie Anderton was the last person voted off.", "The four will do a joint Bushtucker Trial on Sunday after Appleton's decision to quit the show last Monday gave them a reprieve.", "Former All Saints singer Natalie Appleton quit over this issue and singer Brian Harvey left due to an argument with Janet Street-Porter."], "opencoder:1.5b": ["This text contains information about Celebrities staying in jungle and remaining in I'm A Celebrity contest.", "The main point is that all four contestants are stayed in the show, no evictions were made on the television show on Saturday, and their decisions had given them all a stay of execution.", "Model Sophie Anderton was the last person to be voted off the ITV1 show, set in the jungle.", "The group were told by hosts Ant and Dec that they were staying in the show.", "The four remaining stars will do a joint Bushtucker Trial on Sunday, and they are chosen by viewers to pass trials in order to win food for the rest of the camp."], "smollm:1.7b": ["Celebrities get to stay in jungle for no evictions were made on the television show on Saturday.", "All four contestants still remain in I'm A Celebrity ... Get Me Out Of Here as no evictions were made on the television show on Saturday.", "Contestants Paul Burrell, Joe Pasquale, Janet Street-Porter and Fran Cosgrave were told by hosts Ant and Dec. Natalie Appleton's decision to quit the show last Monday had given them all a stay of execution, the group were told.", "Model Sophie Anderton was the last person to be voted off the ITV1 show, set in the Australian jungle.", "The four remaining stars will do a joint Bushtucker Trial on Sunday."], "deepseek-r1:1.5b": ["Celebrities stay in jungle for \"I'm A Celebrity...\" as no eviction made on Saturday.", "Contestants are told they'll face executions, with Sophie Anderton being the last to be voted off.", "The four remaining contestants will do a joint Bushtucker Trial on Sunday.", "Natalie Appleton, 31, left after facing another trial and had an incident with Janet Street-Porter.", "Brian Harvey quit due to a fight with Janet."], "tinyllama:1.1b": ["Celebrities get to stay in the Australian 'jungle' while being put through trials by viewers for food.", "Hosts Ant and Dec announced on Saturday that all four contestants still remain, giving them a stay of execution after Paul Burrell, Joe Pasqualé, Janet Street-Porter, and Fran Cosgrave also opted to quit the show.", "Sophie Anderton was the last one voted off, with another Bushtucker Trial set for Sunday where she'll join the others facing more rounds of food-based trials."], "tinydolphin:1.1b": [" The summary provided is:\n- Celebrities remain in jungle\n- Contestants get to stay\n- Stays of execution for four contestants; others continue in show\n- Four remaining stars will do Bushtucker Trial on Sunday\n- Former All Saints singer Natalie Appleton quit the show, leaving three remaining stars in Australia"], "phi:2.7b": [" The four contestants remained in I'm A Celebrity... Get Me Out Of Here TV show due to Natalie Appleton quitting last Monday, while the others were told they would do a joint Bushtucker Trial on Sunday.", "Brian Harvey quit as well, after an argument with Janet Street-Porter.", "##OUTPUT\nContestants Paul Burrell, Joe Pasquale, Fran Cosgrave and Natalie Appleton remained in I'm A Celebrity... Get Me Out Of Here TV show due to Natalie Appleton quitting, while they will do a joint Bushtucker Trial on Sunday.", "Brian Harvey also quit after an argument with Janet Street-Porter."], "orca-mini:3b": [" Celebrities Paul Burrell, Joe Pasquale, Janet Street-Porter, and Fran Cosgrave are still in the I'm A Celebrity... Get Me Out Of Here jungle.", "They were given a stay of execution after model Sophie Anderton was voted off the show last Monday.", "The four remaining stars will do a joint Bushtucker Trial on Sunday."], "hermes3:3b": ["I'm A Celebrity contestants remain: Burrell, Pasquale, St-Porter, Cosgrave (4 in jungle, no evictions)"], "stablelm-zephyr:3b": ["All four remaining I'm A Celebrity... Get Me Out Of Here contestants, Paul Burrell, Joe Pasquale, Janet Street-Porter and Fran Cosgrave, were granted a stay of execution after Natalie Appleton left the show due to facing a fifth Bushtucker Trial.", "They will participate in a joint Bushtucker Trial on Sunday.", "Model Sophie Anderton was voted off last week."], "chatgpt-4o-latest": ["All four contestants on *I'm A Celebrity ... Get Me Out Of Here* remained in the competition on Saturday as no evictions took place.", "Hosts Ant and Dec informed Paul Burrell, Joe Pasquale, Janet Street-Porter, and Fran Cosgrave that Natalie Appleton’s earlier decision to quit had spared them from elimination.", "Sophie Anderton was the last contestant voted off.", "The remaining four will participate in a joint Bushtucker Trial on Sunday.", "Appleton left after being selected for a fifth trial, having struggled throughout the show, including a publicized argument with Anderton.", "Brian Harvey also quit earlier following a heated dispute with Street-Porter."], "stablelm2:1.6b": ["Four contestants remain in I'm A Celebrity after no evictions were made; they'll participate in a joint Bushtucker Trial on Sunday.", "Former All Saints' singer Natalie Appleton left the show after facing her fifth Bushtucker Trial, and there have been other cast members to quit or part ways during the ITV1 reality TV show set in Australia."], "granite3.1-dense:2b": ["No evictions occurred in I'm A Celebrity... Get Me Out Of Here on Saturday, allowing four remaining contestants: Paul Burrell, Joe Pasquale, Janet Street-Porter, and Fran Cosgrave to stay.", "Previously voted off was model Sophie Anderton.", "The group will participate in a joint Bushtucker Trial on Sunday.", "Natalie Appleton, 31, the former All Saints singer, left the show due to a fifth grueling trial, following a heated argument with Sophie Anderton.", "Brian Harvey also exited as a contestant after a disagreement with Janet Street-Porter on November 26th."]}