{"raw_text": "Jungle TV show ratings drop by 4m\n \n The finale of ITV1's I'm a Celebrity... Get Me Out of Here drew an average of 10.9m viewers - about four million fewer than the previous series.\n \n The fourth series of the show peaked on Monday at 11.9m and 49.2% of the audience, just before Joe Pasquale won. This compared with a peak of 15.3m at and a record 62.2% of the TV audience when Kerry McFadden won in February. Comic Pasquale beat former Royal butler Paul Burrell who came second, nightclub owner Fran Cosgrave, who was third. Pasquale follows Kerry McFadden, Phil Tufnell and Tony Blackburn as winners of the show.\n \n Singer and TV presenter McFadden was the show's first female winner. When cricketer Phil Tufnell won in May 2003, 12.3 million people - 50% of the viewing public - tuned in to watch. And when Tony Blackburn won the first show in 2002, 10.9 million people saw the show. Pasquale had been the show's hottest ever favourite to win, and its hosts Anthony McPartlin and Declan Donnelly, known as Ant and Dec, said Monday's deciding vote was the closest in the programme's history.\n \n Pascuale has been flooded with offers of TV work, according to his management company, but one of his first jobs on his return is pantomime.\n \n Before joining I'm a Celebrity, he had signed up to play Jack in Jack and the Beanstalk in Birmingham, and tickets for the show have become increasingly popular since he joined the TV show. His manager Robert Voice said: \"We've had interest from different TV producers. Some are for comedy shows, some are new-type projects. \"There are a number of things Joe wants to do. He is very ambitious. \"He wants to play the West End and do different things other than straightforward comedy. We are talking to a couple of West End producers about a musical.\"\n", "llama3.2:1b": ["I'm a Celebrity... Get Me Out of Here ratings drop by 4m \n\n ITV1's I'm a Celebrity finale drew 10.9m viewers - four million fewer than previous series \n Fourth series peaked at 11.9m and 49.2% of the audience \n Joe Pasquale won with 15.3m viewers, beating Kerry McFadden who won in February \n\nMcFadden was the show's first female winner, following cricketer Phil Tufnell (12.3m) and Tony Blackburn (10.9m)"], "llama3.2:3b": ["I'm a Celebrity... Get Me Out of Here finale drew 10.9m viewers, down from 14.9m in the previous series, with Joe Pasquale winning and receiving offers for TV work, including pantomime and potential West End projects."], "gemma2:2b": ["I'm a Celebrity... Get Me Out of Here finale had 10.9 million viewers, down four million from the previous season peak.", "Joe Pasquale won, marking his as the show's first female winner and beating former Royal butler Paul Burrell, nightclub owner Fran Cosgrave in second and third place.", "Pasquale follows the legacy of other winners like Kerry McFadden, Phil Tufnell and Tony Blackburn.", "His popularity has led to many TV opportunities, including a role in a West End musical."], "qwen2.5:0.5b": ["The finale of ITV1's I'm a Celebrity... Get Me Out of Here attracted 10.9 million viewers in the fourth series, which was 4 million fewer than the previous year.", "The show had its peak at 15.3 million and 62% of the audience before Kerry McFadden won, but after Pasquale's win, it increased to 11.9 million with an average of 49.2% of the audience.", "Singer and TV presenter Paul Burrell came second, followed by Tony Blackburn and Fran Cosgrave.", "Pascuale has been offered TV work, but her first job on the show is pantomime."], "qwen2.5:1.5b": ["I'm a Celebrity finale draws 622k fewer viewers than previous series, with new star Joe Pasquale losing by a narrow margin; offers for future TV work include a pantomime role and potentially a Broadway musical."], "qwen2.5:3b": ["Jungle TV show ratings dropped by 4 million from the previous series, with the finale averaging 10.9m viewers this time around.", "The fourth series peaked at 11.9m and 49.2% audience share when Joe Pasquale won.", "This was a significant drop compared to peaks of 15.3m (62.2%) when Kerry McFadden won in February, Phil Tufnell in May 2003 (12.3%, 50%), and Tony Blackburn in 2002 (10.9%).", "Pasquale, who was the show's top favorite to win, had his ratings success turn into job offers, including a pantomime role.", "Prior to joining Jungle, he was part of \"Jack and the Beanstalk\" in Birmingham.", "His management company is exploring various TV projects for him, from comedy shows to new-type projects and even a potential musical in the West End."], "opencoder:1.5b": ["Jungle TV show ratings dropped by 4 million viewers, particularly those from previous series - ITV1.", "The finale of ITV1's I'm a Celebrity... Get Me Out of Here saw an average of 10.9 million viewers, four fewer than the last series.", "This was followed by a peak at 11.9 million viewers during the episode on Monday.", "Comic Pasquale beat former Royal butler Paul Burrell who came second.", "He also hosted nightclub owners Fran Cosgrave and Jerry Cocker as thirds, and showed off in concert with other guests such as the iconic singer-songwriter Nick Cave.", "McFadden's win marked a new season of the show, followed by Phil Tufnell and Tony Blackburn as winners, who saw 12.3 million viewers - about 50% of the audience.", "Pascuale had been flooded with offers of TV work and his first job was a pantomime, which he later signed up to play Jack in Jack & the Beanstalk in Birmingham.", "He has seen increasing popularity since joining the show.", "Anthony McPartlin and Declan Donnelly, known as Ant and Dec, were also included as they had been voting on the deciding vote of the programme's history."], "smollm:1.7b": ["The finale of ITV1's I'm a Celebrity... Get Me Out of Here drew an average of 10.9 million viewers - about four million fewer than the previous series.", "The fourth series of the show peaked on Monday at 11.9m and 49.2% of the audience, just before Joe Pasquale won.", "This compared with a peak of 15.3m at and a record 62.2% of the TV audience when Kerry McFadden won in February.", "Comic Pasquale beat former Royal butler Paul Burrell who came second, nightclub owner Fran Cosgrave, who was third.", "Pasquale follows Kerry McFadden, Phil Tufnell and Tony Blackburn as winners of the show.", "The singer and TV presenter McFadden was the show's first female winner.", "When cricketer Phil Tufnell won in May 2003, 12.3 million people - 50% of the viewing public - tuned in to watch.", "And when Tony Blackburn won the first show in 2002, 10.9 million people saw the show.", "Pasquale had been the show's hottest ever favourite to win, and its hosts Anthony McPartlin and Declan Donnelly said Monday's deciding vote was the closest in the programme's history.", "Pascuale has been flooded with offers of TV work, according to his management company, but one of his first jobs on his return is pantomime.", "Before joining I'm a Celebrity, he had signed up to play Jack in Jack and the Beanstalk in Birmingham, and tickets for the show have become increasingly popular since he joined the TV show.", "His manager Robert Voice said: \"We've had interest from different TV producers.", "Some are for comedy shows, some are new-type projects.", "\"There are a number of things Joe wants to do.", "He is very ambitious.", "\"He wants to play the West End and do different things other than straightforward comedy.", "We are talking to a couple of West End producers about a musical.\""], "deepseek-r1:1.5b": ["The I'm a Celebrity... Get Me Out of Here finale had 10.9 million viewers, down by four million compared to the previous season.", "Pasquale won with 49% audience share before Joe Pasquale became show's first female winner.", "McFadden was the first female winner in series history, with Tufnell winning in 2003 at 50% of viewers and Blackburn winning in 2002 at 10.9 million.", "Pasquale has strong ratings but is working a musical before returning to the show."], "tinyllama:1.1b": ["The ITV1 reality TV show I'm a Celestial Star, hosted by Ant and Dec, has drawn an average of 10.9 million viewers in the UK this past Sunday.", "The finale of the fourth season of the competition drew an impressive peak audience of 15.3 million people, but still fell short of the previous show's peak when Kerry McFaudden won for the second time with a record-breaking vote of 62.2%.", "Joe Pasqualè became the second female winner and first non-celebrities, surpassing Phil Tuftnell in May 2003 who had been the show's hottest favourite to win.", "The votes were close but Pasqualè was determined to win, even if he would be a panomime for TV work.", "Despite receiving multiple offers of film and stage work before his return to I'm a Celestial Star, Pascalle signed up for Jack and the Beanstalk in Birmingham after the show had become increasingly popular with ticket sales.", "Other shows interested in Pasqualè include comedy, musicals, and new-type projects."], "tinydolphin:1.1b": [" The Jungle TV show ratings for I'm a Celebrity... Get Me Out of Here fell by 4 million, according to an official.", "The finale of the popular reality show had an average viewership of 10.9 million, which was 4 million fewer than the previous series and its peak viewership.", "The fourth season of the show peaked on Monday at 11.9 million and 49.2% of the audience, while Kerry McFadden won with an average of 15.3 million viewers.", "Comic Joe Pasquale beat Fran Cosgrave, who was third, in the final round."], "phi:2.7b": [" A summary of the text can be written as follows:\n\n\nThe text reports that the finale of I'm a Celebrity... Get Me Out of Here had lower ratings compared to previous series, with 10.9m viewers - four million fewer than the last show.", "Singer and TV presenter Kerry McFadden was the first female winner, and her popularity led to an increase in ticket sales for Jack and the Beanstalk.", "The show's host, Joe Pasquale, has received offers for various TV projects, including playing a West End musical."], "orca-mini:3b": [" The finale of ITV1's I'm a Celebrity... Get Me Out of Here drew an average of 10.9 million viewers, which is about four million fewer than the previous series.", "The show peaked on Monday at 11.9 million and 49.2% of the audience, just before Joe Pasquale won.", "Comic Pasquale beat former Royal butler Paul Burrell who came second, nightclub owner Fran Cosgrave, who was third.", "Pasquale follows Kerry McFadden, Phil Tufnell, and Tony Blackburn as winners of the show.", "Singer and TV presenter McFadden was the show's first female winner.", "Ant and Dec, the hosts of the show, said Monday's deciding vote was the closest in the program's history.", "Pasquale has been flooded with offers of TV work since joining I'm a Celebrity but one of his first jobs on his return is pantomime."], "hermes3:3b": ["I'm a Celebrity viewerys drop by 4m\nFinale had 10.9m, less than prev series' peak (15.3m)"], "stablelm-zephyr:3b": ["The finale of ITV1's I'm a Celebrity... Get Me Out of Here drew an average of 10.9 million viewers, 4 million fewer than the previous series.", "The fourth series peaked at 11.9 million and 49.2% of the audience when Joe Pasquale won.", "This reduced the show's popularity significantly since Phil Tufnell's win in 2003 with 12.3 million viewers.", "Despite Pascuale being the show's hottest favorite to win, he has received numerous TV offers, including pantomime roles and new-type projects."], "chatgpt-4o-latest": ["The finale of ITV1's I'm a Celebrity... Get Me Out of Here drew 10.9 million viewers, about four million fewer than the previous series.", "The fourth series peaked at 11.9 million viewers, significantly lower than the 15.3 million peak when Kerry McFadden won.", "Joe Pasquale won the latest series, beating Paul Burrell and Fran Cosgrave.", "Pasquale, the show's most favored winner, has received numerous TV offers and will first perform in a pantomime.", "His manager confirmed interest from TV producers and West End projects, reflecting Pasquale's ambition beyond comedy."], "stablelm2:1.6b": ["The finale of ITV1's I'm a Celebrity... Get Me Out of Here drew 9 million viewers, a decrease from the previous series, while Comic Pasquale was the winner beating former Royal butler Paul Burrell.", "Singer Kerry McFadden was the first female winner and Phil Tufnell won previously.", "The show has seen record TV audience numbers for wins like Kerry McFadden and Tony Blackburn.", "Before joining I'm a Celebrity, Pasquale signed up to play Jack in a Birmingham production.", "His management company confirms he's received offers from TV producers for various projects, including the West End and musicals."], "granite3.1-dense:2b": ["The fourth season of ITV1's \"I'm a Celebrity... Get Me Out of Here\" saw a significant ratings drop compared to its predecessor, with the finale attracting 10.9 million viewers, approximately four million less than the previous series.", "The show, hosted by Ant and Dec, experienced peaks of 15.3 million in February 2003 and 11.9 million during Joe Pasquale's victory on Monday.", "Pasquale defeated former Royal butler Paul Burrell and nightclub owner Fran Cosgrave to become the first female winner of the show.", "Known for his popularity as a favorite to win, Pasquale has since received numerous job offers, including roles in comedy shows, new projects, and even potential West End performances as Jack in \"Jack and the Beanstalk.\""]}