{"raw_text": "US show sued for rat-eating stunt\n \n A US TV network is being sued for $2.5m (£1.3m) by a viewer who says he was disgusted by watching contestants eat dead rats in a stunt show.\n \n Austin Aitken is taking action against NBC over its programme Fear Factor. He said watching the show caused his blood pressure to rise so high that he became dizzy and light-headed. The legal assistant said NBC was \"sending the wrong message to viewers that cash can make or have people do just about anything beyond reasoning\". The hand-written, four-page lawsuit said: \"To have the individuals on the show eat and drink dead rats was crazy and from a viewer's point of view made me throw-up as well as another in the house at the same time.\" Mr Aitken, who lives in Cleveland, said that after becoming light-headed, he ran towards the bedroom and knocked his head in a doorway. A spokesman for NBC said it had no comment on the lawsuit, but confirmed the stunt show did feature a rat-eating scene in New York's Times Square on 8 November. Past shows have featured viewers eating spiders and live worms. The programme has been screened in the UK on Sky One.\n", "llama3.2:1b": ["A US TV network is being sued for $2.5m (£1.3m) by a viewer who claimed they were disgusted by watching contestants eat dead rats in a stunt show, causing their blood pressure to rise and making them dizzy and light-headed.", "The lawsuit also claims the network was sending a wrong message to viewers about the risks of extreme activities."], "llama3.2:3b": ["A US viewer is suing NBC for $2.5m over watching contestants eat dead rats on the TV show Fear Factor, claiming it made him dizzy and nauseous."], "gemma2:2b": ["A viewer is suing NBC for $2.5 million claiming their show \"Fear Factor\" caused him physical distress by depicting contestants eating dead rats, leading to dizziness and a head injury.", "The lawsuit argues this sends a wrong message about morality and human limits.", "The show has featured other controversial stunts like viewers consuming spiders and live worms as well."], "qwen2.5:0.5b": ["A US TV network sued NBC for $2.5m (£1.3m) after seeing viewer Austin Aitken say he was disgusted by watching contestants eat dead rats in a stunt show."], "qwen2.5:1.5b": ["A viewer suing US TV network NBC over $2.5m for depicting contestants eating dead rats in \"Fear Factor\" stunt show, calling it disturbingly violent and causing them to become ill."], "qwen2.5:3b": ["A US viewer Austin Aitken sues NBC for $2.5m over a $1.3m Fear Factor show where contestants ate dead rats, claiming it made him dizzy and light-headed.", "He says the stunt sent viewers the wrong message that people can do anything just for money.", "A spokesman for NBC confirmed the Times Square scene but had no comment on the lawsuit.", "Past shows featured other extreme eating challenges like spiders and live worms; the program is screened in the UK."], "opencoder:1.5b": ["US TV network is being sued for $2.5m by a viewer who says he was disgusted by watching contestants eat dead rats in a stunt show.", "Austin Aitken is taking action against NBC over its programme Fear Factor, saying watching the show caused his blood pressure to rise so high that he became dizzy and light-headed.", "The legal assistant said NBC was \"sending the wrong message to viewers that cash can make or have people do just about anything beyond reasoning\".", "After becoming light-headed, Aitken ran towards the bedroom and knocked his head in a doorway.", "The spokesman for NBC had no comment on the lawsuit, but confirmed the stunt show did feature a rat-eating scene in New York's Times Square on 8 November.", "The programme has been screened in the UK on Sky One.", "The hand-written, four-page lawsuit said \"To have the individuals on the show eat and drink dead rats was crazy and from a viewer's point of view made me throw-up as well as another in the house at the same time\".", "The viewer told Mr Aitken that after becoming light-headed, he ran towards the bedroom and knocked his head in a doorway.", "The broadcaster confirmed the stunt show did feature a rat-eating scene in New York's Times Square on 8 November.", "The programme has been screened in the UK on Sky One.", "The legal assistant explained the situation and suggested that viewers may be interested in the program if they enjoyed the entertainment rather than eating rats directly."], "smollm:1.7b": ["The US show was sued for $2.5 million (£1.3m) by a viewer who said he became dizzy and light-headed after watching the show, which featured contestants eating dead rats.", "The legal assistant said NBC was sending the wrong message to viewers that cash can make or have people do just about anything beyond reasoning.", "The hand-written, four-page lawsuit said: \"To have the individuals on the show eat and drink dead rats was crazy and from a viewer's point of view made me throw-up as well as another in the house at the same time.\"", "A spokesman for NBC said it had no comment on the lawsuit, but confirmed the stunt show did feature a rat-eating scene in New York's Times Square on 8 November.", "Past shows have featured viewers eating spiders and live worms.", "The programme has been screened in the UK on Sky One."], "deepseek-r1:1.5b": ["A US TV network is being sued for $2.5m by a viewer who said they were disgusted by contestants eating dead rats during a show, calling it \"crazy\" and causing them to throw up.", "The network, Fear Factor, has taken action against NBC, which featured a rat-eating scene in Times Square on 8 November.", "Past shows have included spider-eating and live worms."], "tinyllama:1.1b": ["US TV network NBC is being sued for $2.5m (£1.3m) by a viewer who says he suffered health issues after watching a stunt show featuring dead rats being eaten by contestants.", "Austin Aitken, an employee at Cleveland, claimed that watching the programme sent him into a state of panic and caused his blood pressure to rise so high that he became light-headed and light-headed.", "The lawsuit filed in US federal court alleges that NBC \"sent the wrong message\" to viewers by allowing individuals to consume dead rodents on the show.", "The suit was not immediately available for comment from NBC's spokesperson.", "The stunt show included a rat-eating scene in New York's Times Square in November 2018, with past shows featuring viewers eating spiders and live worms."], "tinydolphin:1.1b": [" A viewer claims that he was disgusted by watching contestants eat dead rats during a television stunt show.", "He alleges that the content of the program sent the wrong message to viewers, suggesting that it is okay to eat living things beyond thinking.", "The lawsuit accuses the network of sending out the wrong moral message and causing viewer dizziness and light-headedness.", "The statement includes information about the TV show Fear Factor and its incident involving dead rats eaten by contestants in New York's Times Square on 8 November."], "phi:2.7b": [" A viewer is suing a US TV network for $2.5m (£1.3m) over watching contestants eat dead rats in a show called Fear Factor, which he said caused his blood pressure to rise so high that he became light-headed and had to run towards the bedroom, knocking his head in a doorway.", "The lawsuit says the show sends the wrong message to viewers that cash can make or have people do just about anything beyond reasoning, and was made worse when Mr Aitken became sick and had to be taken to hospital.", "NBC has said it is not commenting on the case, but confirmed the stunt show did feature a rat-eating scene in Times Square on 8 November.", "Past shows have featured viewers eating spiders and live worms."], "orca-mini:3b": [" A viewer is suing a US TV network for $2.5m, claiming he was disgusted by watching contestants eat dead rats in a Fear Factor-style show."], "hermes3:3b": ["US TV network NBC sued for $2.5m over viewer discontent due to contest featuring contestants eating dead rats on show Fear Factor."], "stablelm-zephyr:3b": ["A TV network called NBC had a show where people ate dead rats, and one person named Austin Aitken is not happy about it.", "He got very upset watching this and his blood pressure went up, making him feel dizzy.", "So, he is taking them to court for $2.5 million because he thinks they are sending the wrong message that money can make people do bad things.", "The network didn't say anything about the lawsuit but they confirmed the rat-eating scene happened on their show.", "This kind of thing has happened before with other shows too, where people had to eat creepy crawlies like spiders and worms."], "chatgpt-4o-latest": ["A US viewer, Austin Aitken, is suing NBC for $2.5 million over a Fear Factor episode in which contestants ate dead rats.", "He claims the stunt made him so nauseous and dizzy that he hit his head while running to his bedroom.", "Aitken argues the show promotes the idea that people will do anything for money.", "NBC declined to comment but confirmed the episode aired on November 8 and featured a rat-eating scene in Times Square.", "Fear Factor has previously included stunts involving eating spiders and live worms and has been broadcast in the UK."], "stablelm2:1.6b": ["US TV network NBC is facing a $2.5m lawsuit from viewer Austin Aitken after showing contestants eating dead rats in the show Fear Factor, according to Aitken who lives in Cleveland.", "Aitken claims that watching the show led him to experience high blood pressure and dizziness.", "In his lawsuit, he states that NBC is sending the wrong message by suggesting that cash can influence people's actions beyond reason.", "The program also featured a viewer eating live spiders and worms."], "granite3.1-dense:2b": ["A US resident, Austin Aitken, is suing NBC for $2.5m over the reality TV show Fear Factor, which aired a rat-eating challenge in New York's Times Square on 8 November.", "Aitken claims the stunt caused severe physical reactions, including dizziness and a near-concussion after knocking his head in a doorway while feeling light-headed.", "He argues that NBC is sending an irresponsible message to viewers about the value of money and the willingness to do outrageous acts.", "The lawsuit highlights past Fear Factor segments involving contestants eating spiders and live worms, and mentions that the show has also aired in the UK on Sky One.", "NBC has no comment on the lawsuit but acknowledges the rat-eating incident occurred as described by Aitken."]}