{"raw_text": "Brookside creator's Channel 4 bid\n \n The creator of defunct TV soap Brookside has written to the culture minister to offer to buy Channel 4.\n \n Phil Redmond, now chairman of Mersey TV, told Tessa Jowell he would run it with its current remit intact for the next 10 years. But media watchdog Ofcom has said the the commercially funded public service broadcaster will not be privatised. A spokesman for the Department for Culture, Media and Sport said there were no plans to sell the channel.\n \n He added that primary legislation would be required for the station to be sold off, which the government was not intending to introduce. Brookside was axed in 2003 after its ratings slumped from a peak of seven million to just 1.5 million. Redmond also brought teen soap Hollyoaks to Channel 4 and created Grange Hill, the school-based drama serial which was first broadcast on BBC One in 1978. He was awarded the CBE for services to drama earlier this year.\n", "llama3.2:1b": ["Phil Redmond offers to buy Channel 4 from culture minister Tessa Jowell.", "Channel 4 will not be privatised and primary legislation is required before it can be sold off.", "The government does not intend to introduce such a law.", "Redmond was awarded the CBE for services to drama earlier this year."], "llama3.2:3b": ["Phil Redmond has written to culture minister Tessa Jowell offering to buy Channel 4, promising to run it with current remit intact for 10 years if sale is allowed; Ofcom says no plans exist for privatisation due to lack of primary legislation; Brookside was previously axed in 2003 after ratings slumped."], "gemma2:2b": ["Phil Redmond, creator of Brookside and other successful shows, has offered to buy Channel 4 but faces opposition from Ofcom and the government, who have no plans to privatize it."], "qwen2.5:0.5b": ["The creator of defunct TV soap Brookside has written a letter to the culture minister, offering to buy Channel 4.", "Redmond, now chairman of Mersey TV, said he would run it with its current remit intact for 10 years.", "Media watchdog Ofcom has said Channel 4 will not be privatised and that primary legislation is required for the station to be sold off.", "The government is not intending to introduce such legislation, and Redmond brought Hollyoaks to Channel 4 and Grange Hill as a school-based drama serial which was first broadcast on BBC One in 1978.", "He was awarded the CBE for services to drama earlier this year."], "qwen2.5:1.5b": ["Phil Redmond, Brookside creator, offers Channel 4 buy to Tessa Jowell, agreeing to keep remit intact but warns no legislation will be introduced before potentially selling off station.", "Media watchdog OFCOM opposes privatization plans.", "Hollyoaks and Grange Hill are credited with creating the teen soap industry."], "qwen2.5:3b": ["The creator of defunct TV soap Brookside has proposed buying Channel 4, offering to run it with its current mandate intact for ten years.", "However, media watchdog Ofcom stated that Channel 4 will not be privatized.", "The government has no plans to sell the broadcaster either; primary legislation is required but not under consideration as per Department for Culture, Media and Sport.", "Redmond founded Hollyoaks and Grange Hill, a school-based drama series initially broadcast on BBC One in 1978.", "He was recently awarded a CBE for services to drama."], "opencoder:1.5b": ["The Brookside creator's Channel 4 bid sparked an interest from the public broadcaster community.", "Redmond said he would run it with the current TV soap remit intact for the next ten years, but media watchdog Ofcom has indicated that the commercially funded public service broadcaster may not be privatized.", "The Department of Culture, Media and Sport added there were no plans to sell the channel.", "Brookside, which was axed in 2003 after its ratings dropped from a peak of seven million to just one-hundred thousand, attracted teens and young adults alike to sign up on Channel 4 as Hollyoaks to Grange Hill."], "smollm:1.7b": ["Brookside creator's Channel 4 bid"], "deepseek-r1:1.5b": ["Crocod creator Phil Redmond's Channel 4 bid..."], "tinyllama:1.1b": ["Brookside creator Phil Redmond has written to the culture minister regarding his offer to buy Channel 4 with its current remit intact for a period of ten years.", "However, Ofcom has stated that Channel 4 will not be privatized and the government is not planning to introduce primary legislation for sale.", "Primary legislation would require the government to grant secondary legislation, which is currently unimplemented in the UK."], "tinydolphin:1.1b": [" The creator of defunct TV soap Brookside has written a letter to Culture Minister Tessa Jowell seeking to purchase Channel 4.", "In a statement, Phil Redmond said that he would run it with its current remit intact for the next 10 years.", "However, Ofcom has expressed concerns over the commercial funding of public service broadcasters, and the Department for Culture, Media and Sport is yet to introduce primary legislation for such sales."], "phi:2.7b": [" The creator of Brookside, Phil Redmond, has written to the culture minister offering to buy Channel 4.", "However, Ofcom has stated that the commercially funded public service broadcaster will not be privatised and primary legislation would be required to sell it off."], "orca-mini:3b": [" Phil Redmond, former chairman of Mersey TV, wrote to the culture minister to offer to buy Channel 4."], "hermes3:3b": ["Brookside creator offers to buy Channel 4\nPhil Redmond offers to run Channel 4 without privatization, despite no plans for sale."], "stablelm-zephyr:3b": ["Brookside creator Phil Redmond offered to buy Channel 4, intending to run it with its current remit for 10 years; however, Ofcom stated there were no plans to privatize the commercially funded public service broadcaster.", "Primary legislation would be required for the sale, which the government did not intend to introduce.", "Redmond also created Hollyoaks and Grange Hill."], "chatgpt-4o-latest": ["Phil Redmond, creator of Brookside and chairman of Mersey TV, has offered to buy Channel 4, pledging to maintain its remit for 10 years.", "However, media regulator Ofcom and the Department for Culture, Media and Sport stated there are no plans to privatize the channel, as selling it would require legislation the government does not intend to introduce.", "Brookside was canceled in 2003 due to declining ratings.", "Redmond also created Hollyoaks and Grange Hill and was awarded a CBE for services to drama."], "stablelm2:1.6b": ["Brookside creator Phil Redman has offered to buy Channel 4 with its current structure intact for the next few years.", "However, Ofcom states that Channel 4 will not be privatized; a primary legislation would need to be enacted for any sale of the broadcaster.", "Despite media criticisms, there are currently no plans to sell Channel 4."], "granite3.1-dense:2b": ["Phil Redmond, former creator of the defunct Channel 4 soap Brookside and chairman of Mersey TV, has proposed buying Channel 4 from the government.", "Redmond, who also created Hollyoaks and Grange Hill, expressed intentions to maintain the channel's current remit for a decade.", "However, media regulator Ofcom affirms that Channel 4 will not be privatized due to primary legislation requirements, which the government does not plan to introduce.", "Brookside was cancelled in 2003 following its ratings decline from seven million to just 1.5 million viewers.", "Redmond was honored with a CBE for his contributions to drama this year."]}