{"raw_text": "US TV host Clark suffers stroke\n \n Veteran US television host Dick Clark is in hospital in Los Angeles after suffering a mild stroke.\n \n The 75-year-old presented long-running show American Bandstand from 1956-87 and has since hosted game shows and produced award ceremonies. Clark is scheduled to welcome in the New Year on the ABC network, a job he has done for 33 years. The presenter said that he is \"hopeful\" of getting better in time to lead the festivities in New York's Times Square. Clark's publicist Paul Shefrin said the television host was \"recovering\" and there was no cause for alarm. Clark, who produces the Golden Globe and American Music Awards, disclosed last year that he was suffering from diabetes.\n \n His popular music show American Bandstand was first broadcast in 1952, and attracted an audience of 20 million people after it was picked up by ABC in 1957. The long-running weekly series, which featured guests including Elvis Presley, Buddy Holly and Aretha Frankin, came to an end in 1989. Clark was inducted into the Rock and Roll Hall of Fame in 1993 for his contribution to the music industry. He has also been responsible for television series such as TV Bloopers, Celebrity Boxing and drama American Dreams. Clark is also expected to act as executive producer for the upcoming Golden Globe Awards ceremony, which is taking place on 16 January.\n", "llama3.2:1b": ["Clark hosts US TV show American Bandstand; suffers mild stroke in LA hospital; recovering; previously hosted game shows and award ceremonies; worked with Elvis Presley, Buddy Holly, and Aretha Franklin; induction into Rock and Roll Hall of Fame; also works as executive producer for Golden Globe Awards ceremony."], "llama3.2:3b": ["Dick Clark, 75, suffers mild stroke in Los Angeles hospital, hopeful of recovery, scheduled to host New Year's Eve on ABC."], "gemma2:2b": ["Dick Clark suffered a mild stroke but is recovering.", "He is currently in the hospital and will be able to host the New Year's celebration in Times Square.", "Clark has had long-lasting success as host of American Bandstand, game shows, and award ceremonies.", "He is also an executive producer for upcoming events like the Golden Globe Awards."], "qwen2.5:0.5b": ["Clark, 75-year-old US TV host, suffers from a mild stroke that has caused him to present a show for the first time in many years and lead ceremonies for awards, including the American Bandstand and ABC's Golden Globe Awards.", "He disclosed that he is recovering and not currently facing any concerns about his health or ability to perform."], "qwen2.5:1.5b": ["Veteran US television host Dick Clark, 75, has suffered a mild stroke and will be recovering in time for New Year's celebrations at Times Square, despite his hopes of hosting an ABC broadcast that has been ongoing for over three decades.", "Clark's musical shows were influential, with American Bandstand attracting up to 20 million viewers and ending in 1989.", "He was also a producer of various award ceremonies and TV series including the Golden Globe Awards."], "qwen2.5:3b": ["US TV host Dick Clark, aged 75, suffered a mild stroke while hosting shows.", "He has hosted American Bandstand since its inception in 1952 and was set to welcome in New Year's Eve for the 33rd time on ABC.", "Despite his diabetes diagnosis last year, he remains hopeful of recovery for the New York Times Square ceremony scheduled soon.", "Known for producing Golden Globe and American Music Awards, Clark is also expected to produce upcoming Golden Globes."], "opencoder:1.5b": ["US Veteran US television host Clark suffers stroke.", "Clark, who produces the Golden Globes and American Music Awards, has disclosed he is suffering from diabetes.", "He is scheduled to welcome in the New Year on the ABC network for 33 years.", "The presenter said that he is \"hopeful\" of getting better in time to lead the festivities in New York's Times Square.", "Despite being recoverable, there was no cause for alarm.", "Clark has hosted game shows and produced award ceremonies since he presented American Bandstand from 1985 to 1987.", "His publicist Paul Shefrin reported that he was recovering after ABC network broadcasted the series.", "The presenter also mentioned that he is \"not feeling well\" or \"feeling hopeless\" about getting better in time for the New Year's American Dreams and Golden Globes.", "He has also been involved in celebrity boxings, TV Bloopers, and has played an instrumental role in American Music industry contributions to the Rock and Roll Hall of Fame.", "Clark is also set to act as executive producer for the upcoming ceremony on 16 January, hosting the next annual Golden Globe Awards.", "It represents a significant event that might change lives, provide opportunities for growth, and encourage dialogue and creativity among viewers."], "smollm:1.7b": ["The US TV host Dick Clark suffered a mild stroke in hospital after suffering from diabetes.", "He was hospitalized for several days and has since been recovering at home.", "Clark's popular music show American Bandstand was first broadcast in 1952, and attracted an audience of 20 million people after it was picked up by ABC in 1957.", "The long-running weekly series featured guests including Elvis Presley, Buddy Holly and Aretha Frankin.", "Clark was inducted into the Rock and Roll Hall of Fame in 1993 for his contribution to the music industry.", "He has also been responsible for television series such as TV Bloopers, Celebrity Boxing and drama American Dreams.", "Clark is expected to act as executive producer for the upcoming Golden Globe Awards ceremony, which is taking place on 16 January."], "deepseek-r1:1.5b": ["Clark is a US TV host with over 30 years of experience, former host on American Bandstand from 1956-87, scheduled for New Year's celebration on ABC, recovering from diabetes as his condition improves.", "He has produced golden Globes and American Music Awards, with American Bandstand being the first weekly show on ABC in 1952, attracting 20 million audience members.", "Clark is also expected to act as executive producer for the upcoming Golden Globe Awards ceremony on January 16th."], "tinyllama:1.1b": ["Veteran US TV host Dick Clark has suffered a mild stroke, but he is still scheduled to bring in New Year celebrations on ABC's networks after hosting game shows and award shows for over 30 years.", "The presenter is recovering but there was no cause for alarm, with his publicist stating that the star is \"hopeful\" of making a full recovery.", "Clark is also set to host the Golden Globe Awards ceremony on January 16, which will be attended by stars such as Elvis Presley and Aretha Franklin.", "Clark's popular music show American Bandstand was first broadcast in 1952 and had an estimated audience of 20 million viewers until it ended in 1989.", "The long-running weekly series, which featured guests including Elvis, Buddy Holly and Frank Sinatra, was inducted into the Rock and Roll Hall of Fame in 1993 for its contribution to the music industry.", "Clark has also been responsible for TV shows such as TV Blooper and drama American Dreams."], "tinydolphin:1.1b": [" Clark suffers stroke.", "The 75-year-old television host, Dick Clark, is in a hospital in Los Angeles after experiencing a mild stroke.", "A public statement from his publicist Paul Shefrin reveals that Clark is \"hopeful\" of making a full recovery and will lead the celebrations in New York's Times Square ahead of the Golden Globe Awards ceremony on 16 January."], "phi:2.7b": [" Dick Clark, a veteran US television host, suffered a mild stroke in hospital after presenting long-running show American Bandstand from 1956 to 1987.", "He has since hosted game shows and produced award ceremonies.", "Clark is set to make his 33rd year as the New Year's Eve special guest on ABC, but hopes to recover in time.", "His publicist stated he was \"recovering\" with no cause for alarm.", "Clarke disclosed last year that he has diabetes.", "American Bandstand first aired in 1952 and featured guests including Elvis Presley, Buddy Holly and Aretha Franklin.", "The show ended in 1989 and the Rock and Roll Hall of Fame inducted him in 2003 for his contribution to music.", "Clark also created TV shows such as TV Bloopers, Celebrity Boxing, and drama American Dreams.", "He will be an executive producer for the upcoming Golden Globe Awards ceremony on January 16th."], "orca-mini:3b": [" Dick Clark suffered a mild stroke and is recovering in hospital.", "He has been presenting long-running shows such as American Bandstand and producing awards ceremonies for decades.", "Clark was inducted into the Rock and Roll Hall of Fame in 1993 and has also produced TV series such as TV Bloopers, Celebrity Boxing, and American Dreams.", "He is scheduled to lead the festivities in New York's Times Square for the Golden Globe Awards ceremony, which takes place on January 16th."], "hermes3:3b": ["US host Dick Clark (75) suffers mild stroke; planned New Year's ABC welcome expected to go ahead, though recoveries noted."], "stablelm-zephyr:3b": ["Dick Clark, a famous US TV host, had a mild stroke but is recovering.", "He was set to host New Year's celebration in New York but might still be able to do it.", "He hosted popular shows like American Bandstand and produced award ceremonies.", "People hope he gets better soon."], "chatgpt-4o-latest": ["Veteran US television host Dick Clark, 75, is in a Los Angeles hospital after suffering a mild stroke.", "Best known for hosting American Bandstand from 1956-87, Clark has also produced award shows and hosted game shows.", "He has welcomed the New Year on ABC for 33 years and hopes to recover in time for this year's festivities in Times Square.", "His publicist stated he is recovering and there is no cause for alarm.", "Clark, who revealed last year that he has diabetes, was inducted into the Rock and Roll Hall of Fame in 1993 for his contributions to the music industry.", "He has produced shows like TV Bloopers and Celebrity Boxing and is set to act as executive producer for the Golden Globe Awards on 16 January."], "stablelm2:1.6b": ["US TV host Dick Clark suffers mild stroke while hosting game shows and producing award ceremonies.", "At 67 years old, he was recovering from the incident and set to welcome in the New Year on ABC network after being scheduled for 15 years.", "Although it was reported that there was no cause for alarm, Clark disclosed last year that he had been suffering from diabetes.", "His popular music show, American Bandstand, first aired in 1972 and attracted over a million viewers before being discontinued in 1990.", "Despite his recent health issues, Clark is expected to act as executive producer for the upcoming Golden Globe Awards ceremony scheduled for January."], "granite3.1-dense:2b": ["Dick Clark, a renowned US television host, 75, experienced a mild stroke and is currently hospitalized in Los Angeles.", "Despite this, he remains optimistic about recovering in time to lead the New Year's celebrations on ABC's show from Times Square, a role he has held for 33 years.", "Clark, known for presenting American Bandstand (1956-87), a show that once attracted 20 million viewers, also hosts game shows and produces the Golden Globe and American Music Awards.", "He was diagnosed with diabetes last year.", "His career includes other notable series like TV Bloopers, Celebrity Boxing, and drama American Dreams.", "Clark is set to executive produce the upcoming Golden Globe Awards on 16 January."]}