{"raw_text": "Bets off after Big Brother 'leak'\n \n A bookmaker has stopped taking bets on Celebrity Big Brother after claiming \"sensitive information\" about the Channel 4 show had been leaked.\n \n William Hill made the move after four people tried to place bets on Friday's surprise double eviction. \"This is highly unlikely to have been an inspired guess,\" William Hill spokesman Rupert Adams said. However, a Big Brother spokeswoman was \"satisfied\" that sensitive information about the show remained confidential.\n \n The bookmaker said its suspicions had been aroused by betting for the last two contestant evictions, when people were still trying to place large sums despite odds as short as 1/14. But William Hill's \"overwhelming evidence\" came on Friday when four unknown callers asked to place bets on the show's surprise double eviction.\n \n Shortly afterwards model Caprice and actor Jeremy Edwards left the show. Mr Adams believed someone had gained access to figures which revealed how viewers were voting, and was using them to predict which celebrity would be evicted next. \"We think somebody somewhere has got them and has been trying very hard to take us to the cleaners,\" he said. The bets were not taken. Mr Adams did not believe anyone from Channel 4 or Big Brother producer Endemol had tried to place the queried bets. But he added: \"They need to look at how many people are privy to the sensitive information.\"\n \n Big Brother's spokeswoman said: \"Only a handful of senior production executives are privy to any sensitive information regarding eviction voting and there are strict procedures in place to keep this information strictly confidential. \"We do not feel the need to investigate this further as we are satisfied that these measures are effective.\" The show's independent adjudicator - the Electoral Reform Services - was also satisfied, she added. The current series of Celebrity Big Brother ends on Sunday, with Happy Mondays star Bez, actress Brigitte Nielsen and Blazin' Squad rapper Kenzie competing for a £50,000 charity prize.\n \n Bookmaker Ladbrokes said it would continue to accept bets on the final, with Kenzie its favourite at 2/9. \"We felt no need whatsoever to close the book,\" spokesman Warren Lush said. \"We've seen absolutely no suspicious betting patterns.\" Mr Lush added that people sometimes vote on short odds \"because they think it's like buying money\". \"You do have to risk quite a lot of money for a very small gain but if they think there's no chance of an upset they will still do it,\" he said.\n", "llama3.2:1b": ["A bookmaker, William Hill, has stopped taking bets on Celebrity Big Brother after receiving suspicions that sensitive information about the show had been leaked.", "This comes after four people tried to place large sums of money bet on Friday's surprise double eviction, and shortly afterwards model Caprice Edwards left the show.", "The bookmaker's spokesman said this was \"highly unlikely\" to be an inspired guess, while a Big Brother spokeswoman said they were \"satisfied\" that sensitive information about the show remained confidential."], "llama3.2:3b": ["A bookmaker stopped taking bets on Celebrity Big Brother after four people attempted to place large bets on the show's surprise double eviction, suggesting someone had gained access to confidential information about viewer voting patterns."], "gemma2:2b": ["William Hill stopped taking bets on Celebrity Big Brother after receiving suspicious betting activity around the show's double eviction.", "They believe someone gained access to voting information and is trying to exploit it for profit.", "Ladbrokes, however, continued accepting bets and does not see any suspicious patterns."], "qwen2.5:0.5b": ["A bookmaker stopped taking bets on Celebrity Big Brother after claiming sensitive information had been leaked about the show's double eviction surprise.", "The spokesman believed someone else had gained access to figures which revealed how viewers were voting, and was using them to predict which celebrity would be evicted next.", "No evidence of further betting was found but the bookmaker felt no need to close the book as they've seen no suspicious betting patterns."], "qwen2.5:1.5b": ["William Hill stops taking bets after Big Brother leak, citing sensitive information being leaked about the show.", "Model Caprice and actor Jeremy Edwards left the show shortly after.", "Betters were seen asking for large amounts but odds were so short that people stopped placing bets.", "Bookmaker Ladbrokes continues accepting bets on the final episode with Kenzie as favourite at 2/9."], "qwen2.5:3b": ["A bookmaker, William Hill, ceased accepting bets on Celebrity Big Brother after four people attempted placing large sums on Friday’s surprise double eviction.", "The company suspected sensitive information had been leaked and believed that someone might have gained access to voting data for the show's last few contestants.", "Despite assurances from Big Brother representatives, including a spokesperson from Electoral Reform Services, William Hill maintained its position of concern over potential unauthorized access to confidential information about voter preferences.", "Meanwhile, Ladbrokes continued accepting bets on the final episode, with Kenzie as their favorite at odds of 2/9."], "opencoder:1.5b": ["\"Bets off after Big Brother 'leak,' A bookmaker has stopped taking bets on Celebrity Big Brother after claiming sensitive information about the Channel 4 show had been leaked, The bookmaker said its suspicions had been aroused by betting for the last two contestant evictions when people were still trying to place large sums despite odds as short as 1/14.", "Shortly afterwards model Caprice and actor Jeremy Edwards left the show.", "Mr Adams believed someone had gained access to figures which revealed how viewers were voting, the bets were not taken.", "The current series of Celebrity Big Brother ends on Sunday with Happy Mondays star Bez, actingress Brigitte Nielsen and Blazin' Squad rapper Kenzie competing for a £50,000 charity prize.\""], "smollm:1.7b": ["The summary is concise and objective, capturing the main points from the original text without adding or subtracting any information.", "The key ideas include:\n\n1.", "Bets off after Big Brother 'leak' - This sentence summarizes the main point of the text, which is that a bookmaker has stopped taking bets on Celebrity Big Brother after claiming \"sensitive information\" about the Channel 4 show had been leaked.", "2.", "William Hill made the move - The second sentence provides additional context to the main idea by mentioning that William Hill was one of the people who placed bets on Friday's surprise double eviction, and that it was not taken.", "3.", "Bookmaker said its suspicions had been aroused by betting for the last two contestant evictions - This sentence adds more information about the bookmaker's actions, stating that they suspected someone had gained access to figures which revealed how viewers were voting, and that they used this information to predict which celebrity would be evicted next.", "4.", "We think somebody somewhere has got them and has been trying very hard to take us to the cleaners - This sentence provides insight into the bookmaker's perspective on the situation, suggesting that they believe someone has gained access to sensitive information about the voting process and is using it to predict which celebrity will be evicted next.", "5.", "We do not feel the need to investigate this further as we are satisfied that these measures are effective - This sentence summarizes the main point of the text by indicating that bookmakers have already taken steps to ensure the integrity of the betting process, and therefore do not need to investigate further."], "deepseek-r1:1.5b": ["A bookmaker has stopped accepting bets on \"Celebrity Big Brother\" after exposing \"sensitive information\" about the show had been leaked.", "This move was made after four people tried placing bets before the episode and William Hill took bets for Friday's surprise eviction double eviction.", "The information remained confidential, but a spokesperson from William Hill claimed it was highly unlikely to have been an inspired guess.", "However, unknown callers later placed bets on the show's surprise eviction, which were not taken.", "Mr. Adams believed someone had gained access and used voter data to predict the next celebrity eviction, though he maintained that others from Channel 4 or Big Brother didn't try placing queried bets.", "The show's independent adjudicator and production executives also approved the move.", "The series ended with viewers leaving for charity, and \"Celebrity Big Brother\" concludes on Sunday with \"Happy Mondays,\" star Bez, actress Brigitte Nielsen, and rapper Kenzie competing for a £50,000 prize.", "The bookmaker will continue accepting final bets, with Kenzie as the favorite at 2/9."], "tinyllama:1.1b": ["Based on the given text, a bookmaker has stopped taking bets on Big Brother after claims that sensitive information about the show had been leaked.", "William Hill, the speaker of William Hill, expressed scepticism about the possibility of an inspired guess by stating that four unknown caller numbers asked for bets on the double eviction.", "However, William Hill believes that due to their suspicion over betting for the last two contestant evictions and knowing how viewers were voting, they have reason to be concerned with information leaking out.", "The bookmaker's independent adjudicator was satisfied, adding that the show's procedures in place are effective to keep sensitive information strictly confidential.", "However, the bookmaker did not share any further details about their investigations or suspects."], "tinydolphin:1.1b": [" In the highly-anticipated Celebrity Big Brother, a bookmaker has decided not to accept bets following reports of sensitive information leaked on the Channel 4 show.", "William Hill claims that the leak was intentional and revealed \"sensitive\" information about the contestants, including details on their voting habits.", "The betting company's spokesman, Rupert Adams, believes that the leak could have been an inspired guess rather than an attempted sabotage.", "William Hill has suspended taking bets after a series of surprising double evictions and has not taken any action regarding the show's final contestant, Kenzie.", "William Hill claims that its suspicions were aroused by the recent attempts to place large bets despite odds as short as 1/14.", "The bookmaker claims that it received \"overwhelming evidence\" suggesting that someone had gained access to figures which revealed how viewers were voting.", "William Hill believes that a few unknown callers asked to place bets on the show's surprise double eviction, and that this information was leaked by an unidentified source.", "The bets were not taken.", "William Hill has stated that they are unsure whether any of the bets were placed using sensitive information or if they were taken by individuals who had gained access to the information.", "Big Brother's spokesperson, Endemol, confirmed that only a few senior production executives have access to such information.", "The network's independent adjudicator, the Electoral Reform Services (ERS), also deemed the measures effective in maintaining the integrity of the contestants' voting.", "In the final of Celebrity Big Brother, Kenzie, a former member of the Blazin' Squad and actor Jeremy Edwards, are both favored to win the show.", "Ladbrokes, a bookmaker who accepts bets on the final, has offered odds ranging from 1/9 to 2/9 for Kenzie.", "The show's independent adjudicator, the Electoral Reform Services (ERS), is also satisfied with the handling of sensitive information regarding voter voting and believes that no further action is needed."], "phi:2.7b": [" William Hill stopped taking bets after receiving sensitive information about Celebrity Big Brother being leaked by four unknown callers who wanted to place bets on the surprise double eviction.", "The bookmaker believed someone had gained access to voting figures and was using them to predict which celebrity would be evicted next.", "However, the show's producer Endemol denied any involvement in placing these bets.", "A spokesperson for Channel 4 expressed satisfaction that the confidential information remained protected.", "Big Brother' s spokeswoman confirmed that only senior production executives were privy to sensitive information about eviction voting and strict procedures were in place to keep it confidential.", "The independent adjudicator was also satisfied, saying that no action was necessary.", "Bookmaker Ladbrokes said they would continue taking bets on the final episode of Celebrity Big Brother with Kenzie as their favorite at 2/9."], "orca-mini:3b": [" Bookmaker William Hill stopped taking bets on Celebrity Big Brother after claiming sensitive information about the show had been leaked.", "Four unknown callers tried to place bets on Friday's surprise double eviction, but William Hill's \"overwhelming evidence\" came from betting for the last two contestant evictions, when people were still trying to place large sums despite odds as short as 1/14.", "However, the bookmaker's \"suspicion\" came after four unknown callers asked to place bets on the show's surprise double eviction.", "Caprice and Jeremy Edwards left the show and someone had gained access to figures that revealed how viewers were voting, and was using them to predict which celebrity would be evicted next.", "The bookmaker believed someone had gained access to sensitive information and tried to take bets."], "hermes3:3b": ["Bookmaker stops Celebrity Big Brother bets after people tried to place unlikely double eviction predictions, suspecting leaked sensitive information about show."], "stablelm-zephyr:3b": ["A bookmaker, William Hill, stopped taking bets on Celebrity Big Brother due to sensitive information about the show being leaked.", "Suspicious betting patterns led William Hill to believe that someone had gained access to confidential viewership data, and used it to predict which celebrities would be evicted.", "Although the company did not believe anyone from Channel 4 or Big Brother producer Endemol attempted to place the bets, they were unsure about how many people might have this information.", "Big Brother's spokeswoman confirmed that only a handful of senior production executives have access to sensitive information regarding eviction voting, and there are strict procedures in place to keep this information confidential.", "The show's independent adjudicator, Electoral Reform Services, was also satisfied with the show's security.", "Despite William Hill's concerns, bookmaker Ladbrokes continued accepting bets on the final, with Kenzie as their favorite candidate at 2/9."], "chatgpt-4o-latest": ["William Hill stopped taking bets on Celebrity Big Brother after suspecting a leak of sensitive information about evictions.", "The bookmaker noticed unusual betting patterns, particularly when four unknown callers tried to place bets on a surprise double eviction.", "Shortly after, Caprice and Jeremy Edwards were evicted, leading William Hill to believe someone had access to voting data.", "While the bets were not accepted, the bookmaker urged a review of who had access to such information.", "However, Channel 4 and Big Brother's producers insisted their security measures were effective and saw no need for an investigation.", "Meanwhile, Ladbrokes continued accepting bets, seeing no suspicious activity, with Kenzie as the favorite to win."], "stablelm2:1.6b": ["Bookmaker William Hill temporarily stopped accepting bets on Celebrity Big Brother after claims that \"sensitive information\" was leaked about the show were discovered.", "Betting stopped after four people attempted to place bets on a double eviction, but it is unlikely this was intentional.", "Bookmaker William Hill suspects someone accessed confidential viewers' voting data and used it to predict evictions.", "The spokeswoman for Big Brother said only a handful of senior production executives have access to sensitive information, and no investigation will be conducted since the measures are considered effective."], "granite3.1-dense:2b": ["After detecting suspicious betting patterns on Celebrity Big Brother, bookmaker William Hill ceased accepting bets due to concerns about sensitive information leakage.", "Four unknown callers attempted large-sum bets on a surprise double eviction, leading William Hill's spokesperson to suspect insider access to viewership data.", "However, Big Brother and its production company Endemol affirmed their strict confidentiality measures and the ineffectiveness of these suspicions.", "Ladbrokes continued accepting bets, attributing the patterns to people perceiving high-odds wagers as investments rather than upset probabilities.", "The current series concludes on Sunday with a £50,000 charity prize for competing celebrities."]}