{"raw_text": "School tribute for TV host Carson\n \n More than 1,000 people turned out on Sunday to pay tribute to late US TV presenter Johnny Carson in the Nebraska town where he grew up.\n \n Carson, who hosted the Tonight Show for 30 years, died on 23 January from respiratory disease emphysema. He lived in Norfolk, Nebraska from the age of eight until he joined the Navy, but returned regularly and donated $5m (£2.7m) to local causes. Old school friends were among the crowd at the school's Johnny Carson Theater.\n \n Carson, who was one of the best-loved TV personalities in the US, asked not to have a public memorial in Los Angeles, where he lived in later life. He began his showbusiness career in Norfolk, performing magic under the name The Great Carsoni from the age of 14. His donations included $600,000 to Norfolk High School in the 1980s to build a new performing arts centre. When Carson died, President Bush led the public tributes, saying the presenter \"had a profound influence on American life and entertainment\".\n", "llama3.2:1b": ["Over 1,000 people gathered at Johnny Carson's alma mater in Nebraska for a school tribute to the late TV host, who passed away from respiratory disease emphysema.", "Carson lived in Norfolk until he joined the Navy, but returned regularly and donated $5m (£2.7m) to local causes, including building a new performing arts centre at his old high school."], "llama3.2:3b": ["More than 1,000 people gathered at a Nebraska school to pay tribute to late TV host Johnny Carson, who hosted the Tonight Show for 30 years and donated $5m to local causes."], "gemma2:2b": ["Over 1,000 people attended Johnny Carson's school tribute in Nebraska where he grew up.", "He passed away from emphysema at age 79.", "Despite living in Los Angeles later in life, Carson requested no public memorial there.", "He donated significant sums to local causes and was a beloved figure in the US entertainment scene.", "President Bush praised his influence on American life and entertainment."], "qwen2.5:0.5b": ["Johnny Carson: Nebraska's Johnny, host of \"The Tonight Show,\" passed away at age 76 due to respiratory disease on January 23, 2021.", "He was from Norfolk, Nebraska where he lived until his death in later years.", "Carson donated $5 million (about £2.7m) to local causes and Old school friends were among the crowd at Johnny Carson Theater's tribute event."], "qwen2.5:1.5b": ["Johnny Carson's former student friends attended his memorial service in Nebraska; he hosted the Tonight Show for 30 years but was known as one of the best-loved US TV personalities.", "His donations included $600,000 to Norfolk High School that rebuilt a performing arts center.", "He lived in Norfolk until joining the Navy and died from emphysema on January 23 at age 74; his Los Angeles residence was chosen for public tributes but he preferred a private ceremony."], "qwen2.5:3b": ["More than 1,000 people attended a tribute for late US TV host Johnny Carson in Norfolk, Nebraska, where he grew up.", "Carson hosted The Tonight Show for 30 years; he died of emphysema.", "He lived there from age eight until joining the Navy and later donated $5m to local causes.", "Carson's public memorial was not held in Los Angeles but instead in Norfolk, where he performed magic under his stage name.", "His donations included $600,000 for a new performing arts center at Norfolk High School in 1980s.", "In response to Carson's death, President Bush praised him as having had \"a profound influence on American life and entertainment\"."], "opencoder:1.5b": ["School tribute for TV host Carson\n\nMore than 1,000 people turned out on Sunday to pay tribute to late US TV presenter Johnny Carson in the Nebraska town where he grew up.", "The remarkable tale of the past begins with Carson, who hosted the Tonight Show for 30 years and died from respiratory disease emphysema.", "He lived in Norfolk, Nebraska from the age of eight until he joined the Navy but returned regularly and donated $5m (£2.7m) to local causes.", "Old friends gathered at the school's Johnny Carson Theater, casting spells under the sun."], "smollm:1.7b": ["The school's tribute for TV host Johnny Carson was more than 1,000 people turning out on Sunday to pay tribute to him in Nebraska.", "The late TV presenter died on 23 January from respiratory disease emphysema at the age of 79.", "He lived in Norfolk, Nebraska from the age of eight until he joined the Navy, but returned regularly and donated $5 million (£2.7m) to local causes.", "Old school friends were among the crowd at the school's Johnny Carson Theater on Sunday.", "Carson, who was one of the best-loved TV personalities in the US, asked not to have a public memorial in Los Angeles, where he lived in later life.", "He began his showbusiness career in Norfolk, performing magic under the name The Great Carsoni from the age of 14.", "His donations included $600,000 to Norfolk High School in the 1980s to build a new performing arts centre.", "When Carson died, President Bush led the public tributes, saying the presenter \"had a profound influence on American life and entertainment\"."], "deepseek-r1:1.5b": ["More than 1,000 people gathered in Nebraska on Sunday to pay tribute to late US TV presenter Johnny Carson.", "He was 23 when he died from respiratory disease and emphysema while living in Norfolk, Nebraska.", "His friends were at the school's Johnny Carson Theater.", "Carson started his career in Norfolk at 14 as The Great Carsoni, a magic act under the name until he joined the Navy.", "He donated $5 million to local causes and had a profound influence on American life and entertainment, with President Bush leading public tributes."], "tinyllama:1.1b": ["School community pays tribute to late TV host Johnny Carson in Nebraska town where he grew up.", "The iconic entertainer, who hosted the Tonight Show for over 30 years and made regular visits back to his native region, died from respiratory disease at age 86.", "Carson donated $5m to local causes and returned regularly to Norfolk High School, where he was asked not to have a public memorial in Los Angeles due to his request for privacy.", "His legacy as an American icon, including his donation of $600k for the new performing arts centre in Norfolk, has inspired public tributes from President George W. Bush."], "tinydolphin:1.1b": [" Summary: Johnny Carson was a well-loved television host who died at the age of 81 after battling respiratory disease.", "He was born in Norfolk, Nebraska and frequently visited his alma mater, Norfolk High School, to donate money for local causes."], "phi:2.7b": [" 1,000 people paid tribute to Johnny Carson at his hometown school in Nebraska after he passed away.", "2.", "Carson was an American TV host who hosted Tonight Show for 30 years.", "3.", "He lived in Norfolk, Nebraska from eight until joining the Navy, but still returned regularly and donated $5 million to local causes.", "4.", "Old friends gathered in his old school's theater to pay tribute to him as he was one of the most beloved TV personalities in the US."], "orca-mini:3b": [" A crowd of more than 1,000 people paid tribute to late US TV host Johnny Carson at a school in Nebraska where he grew up.", "The tribute was held at the Johnny Carson Theater."], "hermes3:3b": ["Tribute for Johnny Carson in birth town, over 1000 people attended; local donations by Carson even after living elsewhere; best-loved US TV personality."], "stablelm-zephyr:3b": ["A school tribute event in Nebraska honored late TV host Johnny Carson, who was known for hosting the Tonight Show for 30 years.", "More than 1,000 people attended, including old friends from his childhood in Norfolk.", "Despite not wanting a public memorial in Los Angeles, Carson donated $5m to local causes and $600,000 towards building a performing arts center at Norfolk High School in the 1980s.", "President Bush praised Carson's profound influence on American life and entertainment."], "chatgpt-4o-latest": ["More than 1,000 people gathered in Norfolk, Nebraska, to honor late TV host Johnny Carson, who died on January 23 from emphysema.", "Carson, who hosted the Tonight Show for 30 years, grew up in Norfolk and frequently returned, donating $5 million to local causes, including $600,000 for a performing arts center at Norfolk High School.", "He began his entertainment career there as a teenage magician.", "Carson requested no public memorial in Los Angeles, where he later lived.", "President Bush led national tributes, acknowledging Carson's significant impact on American entertainment."], "stablelm2:1.6b": ["Over 1,000 people attended a tribute for late US TV host Johnny Carson in Nebraska, where he grew up.", "Carson, known for hosting the Tonight Show for 20 years, passed away due to respiratory disease emphysema.", "He donated $5 million (around £2.7m) to local causes and performed magic as The Great Carsoni in Norfolk from age 8.", "He asked not to have a public memorial in Los Angeles, where he lived in later life.", "President Bush led the public tributes, calling Carson \"a profound influence on American life and entertainment.\""], "granite3.1-dense:2b": ["Over 1,000 people gathered in Norfolk, Nebraska, to honor the late TV host Johnny Carson, who passed away on January 23 from emphysema.", "Born there at eight years old and having returned frequently, Carson contributed $5 million to local causes during his lifetime, including $600,000 for Norfolk High School's performing arts center in the 1980s.", "Despite not wanting a public memorial in Los Angeles, where he resided later, Carson is celebrated as one of America's most beloved TV personalities.", "President Bush led tributes following his death, praising Carson's significant impact on American life and entertainment.", "The event took place at the school's Johnny Carson Theater, with old friends in attendance."]}