{"raw_text": "Singer Ferguson 'facing eviction'\n \n Three Degrees star Sheila Ferguson is the favourite to be evicted from ITV's I'm A Celebrity... Get Me Out Of Here on Monday.\n \n Bookmakers Ladbrokes says the singer has even odds of being the first contestant to be voted off the show. \"It's going to be close but Sheila is favourite as she has shown herself to be a bit of a troublemaker,\" said Ladbrokes' Warren Lush. Comic Joe Pasquale remains odds on favourite to win the reality show. Mr Lush added that Nancy Sorrell's chances of an early departure had increased since the surprise arrival of husband Vic Reeves in the jungle camp last Wednesday. Notwithstanding, comedian Reeves remains 3/1 favourite to win the show, after Pasquale.\n \n Huggy Bear actor Antonio Fargas also remains a contender for eviction having \"done nothing to live up to the pre-show hype\". \"There has been a big gamble on Natalie [Appleton] to go... but bookies fancy the millions at home will keep piling on the misery by putting her through more bushtucker trials,\" added Mr Lush. The former All Saint star has performed dismally in bushtucker trials which have seen her plunged into glass tanks containing putrid waste and challenged to eat fish eyes. On Friday, Ladbrokes suspended betting after singer Brian Harvey quit the show folllowing a blazing row with Janet Street-Porter. Harvey, who entered the camp a day later than other contestants after learning that his grandmother had died, reached the end of his tether following days of meagre rations and rows.\n", "llama3.2:1b": ["Sheila Ferguson is favourite to be evicted from I'm A Celebrity... Get Me Out Of Here on Monday.", "Bookmakers Ladbrokes say Sheila has 3/1 odds of being voted off, while comedian Joe Pasquale remains favourite to win.", "Comic Vic Reeves also remains a contender for eviction, despite increasing chances since his appearance in the jungle camp last Wednesday."], "llama3.2:3b": ["Sheila Ferguson is the favourite to be evicted from I'm A Celebrity... Get Me Out Of Here, with odds of even money being favourite to be voted off first, according to Ladbrokes.", "Joe Pasquale remains odds on favourite to win, while Nancy Sorrell's chances have increased due to husband Vic Reeves' arrival in the jungle camp."], "gemma2:2b": ["Sheila Ferguson is favored to be evicted from \"I'm A Celebrity... Get Me Out Of Here\" on Monday.", "Comedian Joe Pasquale is still the odds-on favorite to win.", "Nancy Sorrell's chances increased after her husband Vic Reeves joined the camp, but he remains a 3/1 favorite to win overall.", "Antonio Fargas has not impressed and Natalie Appleton is also considered likely to be voted off the show.", "Brian Harvey quit the program after a row with Janet Street-Porter over insufficient rations."], "qwen2.5:0.5b": ["Three Degrees star Sheila Ferguson is facing eviction from ITV's I'm A Celebrity... Get Me Out Of Here on Monday.", "Bookmakers Ladbrokes have her odds of being evicted at 50-50, with Warren Lush suggesting she could be the first contestant to be voted off.", "The show remains Nancy Sorrell's favorite, but her chances are reduced after Pasquale became favoured by the bookies.", "Antonio Fargas is also staying on, having \"done nothing to live up to the pre-show hype.\"", "Huggy Bear actor Brian Harvey has quit following a row with Janet Street-Porter over a meager rations and rows during a bushtucker trial."], "qwen2.5:1.5b": ["Three Degrees star Sheila Ferguson is among those facing eviction from ITV's I'm A Celebrity... Get Me Out Of Here on Monday with odds set at even money for her to be voted off early by bookmakers Ladbrokes, while comic Joe Pasquale remains the favorite to win the reality show."], "qwen2.5:3b": ["Singer Sheila Ferguson is the favorite to be evicted from I'm A Celebrity... Get Me Out Of Here.", "Ladbrokes gives her even odds.", "Joe Pasquale remains the favorite to win.", "Nancy Sorrell's chances have increased due to Vic Reeves' arrival.", "Antonio Fargas and Natalie Appelton are also potential evictions.", "Bookmakers consider Brian Harvey likely to be eliminated after he quit over disputes with his host Janet Street-Porter."], "opencoder:1.5b": ["Three Degrees star Sheila Ferguson, having been evicted from ITV's I'm A Celebrity... Get Me Out Of Here on Monday has a few other attractions.", "The bookmakers Ladbrokes say that the singer has even odds of being the first contestant to be voted off the show.", "\"It's going to be close but Sheila is favourite as she has shown herself to be a bit of a troublemaker,\" said Ladbrokes' Warren Lush, added that comedy Joe Pasquale remains odds on favourite to win the reality show.", "Mr Lush also praised Nancy Sorrell's chances of an early departure had increased since the surprise arrival of husband Vic Reeves in the jungle camp last Wednesday.", "Despite comedian Reeves remaining a favourite, he has shown some signs of dishing up.", "Huggy Bear actor Antonio Fargas, who hasn't made any significant contributions to living life to share with others, also remains a contender for eviction having \"done nothing to live up to the pre-show hype\".", "On Friday, Ladbrokes suspended betting after singer Brian Harvey quit the show following a blazing row with Janet Street-Porter."], "smollm:1.7b": ["The summary is concise and to the point, capturing the key ideas and details from the original text.", "It does not include any explanations or justifications for the decisions made by the bookmakers or other stakeholders involved in the show.", "The summary focuses on the main points of the text, without providing additional information or context that might be important for understanding the story."], "deepseek-r1:1.5b": ["Sheila Ferguson remains the favorite to be evicted from \"I'm A Celebrity... Get Me Out Of Here,\" with odds ranging from 1/2 to 3/1 in favor of her eviction.", "Bookmakers predict Sheila has even chances of being voted off early, citing her efforts as a troublemaker and her recent achievements.", "Huggy Bear actor Antonio Fargas is still a contender for eviction despite some criticisms.", "Nancy Sorrell, who hasn't shown signs of immediate trouble, remains 3/1 favorite to win the show.", "Additionally, contestant Brian Harvey has withdrawn from the show after a fight with Janet Street-Porter due to his late arrival."], "tinyllama:1.1b": ["Singer Sheila Ferguson is the current favorite to be evicted from \"ITV's I'm A Celebrity... Get Me Out of Here\" according to bookmaker Ladbrokes, with odds as low as 3/1.", "However, comedian Joe Pasqualenke has remained a contender for the title since arriving in the jungle camp last week, while Nancy Sorrell remains an early favorite to win the show.", "Actress Antonio Fargas is also still in the running for eviction despite doing \"nothing to live up to the pre-show hype.\"", "Ladbrokes has placed bets on Natalie Appleton making it through more bushtucker trial seasons, but she faces a \"gamble\" of being put through further grueling trials.", "With singer Brian Harvey's exit and recent arguments with Jane Street-Porter, the bookmaker has suspended betting following the exit of Harvey."], "tinydolphin:1.1b": [" The star of I'm A Celebrity... Get Me Out Of Here, Sheila Ferguson, is reportedly facing eviction from the show.", "As fans anxiously await her fate, bookies have given odds to several contestants, but Sheilla appears to be favored to go.", "However, this may change as the season unfolds.", "Ladbrokes, the bookmaking company that provides odds for the reality show, has recently altered their betting on some of the contestants.", "They have taken away some of their earlier odds to include Antonio Fargas and Nancy Sorrell in their predictions.", "However, the numbers remain high for these two comedians to make it into the top three.", "Sheila Ferguson is favored to be evicted by Ladbrokes, but they also have a surprising number of favorites.", "Including Huggy Bear actor Antonio Fargas, who has not performed well in his tasks and seemed to be underwhelmed by the show's format.", "Normally, these bookies odds would indicate that it's a foregone conclusion that one or two contestants will go home before the final episode, but this time there is a lot of uncertainty.", "It could also change throughout the season as other contestants and even the show itself surprise everyone with their behavior."], "phi:2.7b": [" Sheila Ferguson is a favourite to be the first contestant to be evicted from I'm A Celebrity... Get Me Out Of Here on Monday, according to bookmakers Ladbrokes.", "The surprise arrival of Vic Reeves in the jungle camp has made it more likely that she will leave early.", "However, Comic Joe Pasquale remains odds-on favorite to win the show.", "Huggy Bear actor Antonio Fargas is also a contender for eviction after performing poorly in bushtucker trials.", "Brian Harvey quit the show following a row with Janet Street-Porter and Ladbrokes suspended betting."], "orca-mini:3b": [" Sheila Ferguson, a singer from Three Degrees, is favorite to be evicted from I'm A Celebrity... Get Me Out Of Here.", "Ladbrokes says she has even odds of being the first contestant to be voted off the show.", "Comic Joe Pasquale remains odds on favourite to win the reality show."], "hermes3:3b": ["Sheila Ferguson favored for eviction in I'm A Celebrity, Ladbrokes says."], "stablelm-zephyr:3b": ["Sheila Ferguson, a singer from Three Degrees, is favored to be evicted from ITV's I'm A Celebrity... Get Me Out Of Here on Monday.", "Bookmakers Ladbrokes states she has even odds of being the first contestant voted off the show.", "Comic Joe Pasquale remains the favorite to win the reality show, with Nancy Sorrell's chances increasing due to Vic Reeves' surprise arrival in the jungle camp.", "Huggy Bear actor Antonio Fargas is also a contender for eviction.", "Ladbrokes suspended betting on Friday after singer Brian Harvey quit the show following a row with Janet Street-Porter."], "chatgpt-4o-latest": ["Sheila Ferguson is the favorite to be evicted from ITV's I'm A Celebrity... Get Me Out Of Here, with bookmakers giving her even odds due to her perceived troublemaking.", "Joe Pasquale remains the favorite to win, while Nancy Sorrell's chances of early eviction have risen since her husband Vic Reeves joined the camp.", "Antonio Fargas is also at risk, having failed to meet expectations.", "Natalie Appleton, struggling in bushtucker trials, is expected to stay as viewers continue voting for her to endure more challenges.", "Betting was suspended after Brian Harvey quit following a heated argument with Janet Street-Porter, exacerbated by meager rations and personal loss."], "stablelm2:1.6b": ["Singer Sheila Ferguson, known as one of the Three Degrees, faces eviction from ITV's I'm A Celebrity... Get Me Out Of Here on Monday with odds even favoring her for being the first contestant voted off.", "Despite controversy, comedian Vic Reeves remains a favorite to win the reality show.", "Huggy Bear actor Antonio Fargas is also considered a contender for eviction due to poor performance in bushtucker trials.", "Singer Brian Harvey's exit followed a heated argument with fellow participant Janet Street-Porter and he was suspended by Ladbrokes after quitting the show."], "granite3.1-dense:2b": ["Sheila Ferguson, known for her role in Three Degrees, is the current favorite to be evicted from ITV's \"I'm A Celebrity... Get Me Out Of Here\" on Monday.", "Bookmakers Ladbrokes give her odds of 1:1, citing her troublemaking behavior.", "Comic Joe Pasquale maintains his lead as the strongest contender to win the show.", "Nancy Sorrell's eviction chances have escalated with the arrival of her husband, Vic Reeves, in the jungle camp.", "Despite this, Reeves remains a 3/1 favorite to win.", "Antonio Fargas, formerly of All Saints, and Natalie Appleton are also at risk of eviction due to their poor performance in bushtucker trials.", "Betting on the show was paused after Brian Harvey, who entered late due to his grandmother's death, left following a heated argument with Janet Street-Porter over meager rations and rows."]}