{"raw_text": "Stallone evicted from Big Brother\n \n Jackie Stallone, mother of actor Sylvester, has become the first star to be evicted from Celebrity Big Brother.\n \n She and John McCririck faced the public vote on Friday - 67% of people voted to keep the racing pundit in the house. Stallone, 71, appeared not to have enjoyed her time in the house saying: \"I'm a total wreck, I need a vacation, this was a nightmare\". But she was pleased to have patched things up with actress Brigitte Nielsen, her former daughter-in-law. \"That alone was worth $1m,\" she said. Stallone joined the Channel 4 show on Monday as a surprise for Nielsen. She was hot favourite to be evicted first, with odds of 1/4 to leave.\n \n But McCririck has made some enemies with his outspoken views about women. Ladbrokes spokesman Warren Lush said: \"We may have underestimated the power of the anti-McCririck brigade, but it's so hard to call with him, there are people out there who either love him or hate him, there is no middle ground.\" The bookmakers have made former Happy Mondays dancer Bez favourite to win the show at 7/4, while Blazin' Squad singer Kenzie is second at 2/1. \"Bez has wooed the viewers and looks the one to beat, he's kept his nose clean and doesn't take anything too seriously,\" Mr Lush said. Earlier on Friday 15 protesters from the Fathers 4 Justice campaign group were arrested after entering the Big Brother compound at 0300 GMT and throwing fireworks. Feminist icon Germaine Greer quit the show earlier in the week over what she called \"bullying\" tactics used by the programme's producers. The show is currently attracting an average audience of about 4.2 million viewers a night.\n", "llama3.2:1b": ["Jackie Stallone, mother of actor Sylvester, was evicted from Celebrity Big Brother with 67% of voters supporting her.", "She appeared to be unhappy in the house but remained close to actress Brigitte Nielsen.", "Stallone joined as a surprise for Nielsen and is favourite to leave at odds of 1/4.", "However, some bookmakers have favourite contestants Bez (7/4) or Kenzie (2/1)."], "llama3.2:3b": ["Jackie Stallone, mother of actor Sylvester, was evicted from Celebrity Big Brother with 67% of voters choosing to keep John McCririck in the house.", "She appeared to have enjoyed her time with Brigitte Nielsen but was unhappy about being on the show.", "McIricket had some critics due to his outspoken views on women, while bookmakers have made Bez and Kenzie favorites to win the show."], "gemma2:2b": ["Jackie Stallone, mother of actor Sylvester Stallone, was evicted from Celebrity Big Brother.", "She faced public vote and her odds of leaving were high.", "John McCririck, who has been outspoken with his opinions on women, survived the eviction alongside other contestants.", "Other notable details include protest action by Fathers 4 Justice group and feminist icon Germaine Greer's departure from the show."], "qwen2.5:0.5b": ["Jackie Stallone, the mother of actor Sylvester Stallone, has been evicted from Big Brother for refusing to leave the show with the racing pundit John McCririck.", "She and her daughter-in-law, actress Brigitte Nielsen, are not happy with this change and will have to wait until later this year when they face the possibility of another eviction.", "The show is currently attracting an average audience of about 4.2 million viewers per night, including about 67% who voted to keep Jackie Stallone in the house."], "qwen2.5:1.5b": ["Actress Jackie Stallone becomes the first celebrity to be evicted from Celebrity Big Brother, facing public vote and controversy over outspoken opinion about women."], "qwen2.5:3b": ["Jackie Stallone, mother of Sylvester Stallone, became the first celebrity to be evicted from Celebrity Big Brother after facing public voting and appearing unhappy in the show.", "Despite odds favoring her eviction, John McCririck won over voters with 67% support.", "Stallone praised Nielsen for improving their relationship but expressed dissatisfaction with her time there.", "Ladbrokes predicted Bez as the new front-runner for winning the show based on his image and popularity.", "Feminist Germaine Greer had already quit the show due to producers' alleged bullying.", "The show currently attracts an average nightly audience of about 4.2 million viewers."], "opencoder:1.5b": ["Stallone evicted from Big Brother\n\nJackie Stallone, mother of actor Sylvester, has become the first star to be evicted from Celebrity Big Brother.", "She and John McCririck faced the public vote on Friday - 67% of people voted to keep the racing pundit in the house.", "Stallone appeared not to have enjoyed her time in the house saying: \"I'm a total wreck, I need a vacation, this was a nightmare\".", "He was pleased to have patched things up with actress Brigitte Nielsen, her former daughter-in-law.", "\"That alone was worth $1m,\" she said.", "Stallone joined the Channel 4 show on Monday as a surprise for Nielsen."], "smollm:1.7b": ["Stallone evicted from Big Brother"], "deepseek-r1:1.5b": ["Jackie Stallone became the first celebrity eviction among big stars, facing a 67% public vote in Celebrity Big Brother's season.", "StARN was upset but patched it up with Brigitte Nielsen, who helped her settle.", "The show now has odds of 1/4 to leave and is hot favourite.", "John McCririck has strong views about women, while Warren Lush criticized him.", "Protests led to several arrests and Germaine Greer left the show after being targeted by producers.", "Celebrity Big Brother averages around 4.2 million viewers per night."], "tinyllama:1.1b": ["Following Jackie Staullone being evicted from Big Brother, she expressed her disappointment and frustration with the show's production team.", "However, despite her negative feelings, she was pleased to have patched things up with actress Brigitte Nieelsen, who joined the show on Monday as a surprise.", "Despite her outspoken views about women, there were mixed reactions from viewers to the bookmakers regarding the top two competitors for Big Brother, with both Bez and Kenzie believed to be strong contenders.", "Former Happy Monday's dance artist Bez was the clear favourite, while fans of Blazin' Squad singer Kenzie held a second-favourite spot at 2/1.", "However, despite negative feelings towards the show's producers, the overall audience draw attracted an average of around 4.2 million viewers each night."], "tinydolphin:1.1b": [" Stallone, who was evicted from Big Brother, made headlines when she accused former husband John McCririck of being a wimp and needing a vacation.", "Jackie Stallone appeared on the show to confront her estranged husband and re-connect with celebrities.", "Despite facing public scrutiny, Stallone has managed to patch up her relationship with Brigitte Nielsen, another contestant on the show.", "However, it appears that Stallone's stint on the show may have been a bit of an unfortunate juxtaposition between her professional life and personal life.", "As fans vote for their favorite Big Brother houseguests, Jackie Stallone is hoping to rekindle her relationship with John McCririck and secure a vacation that she desperately needs."], "phi:2.7b": [" Jackie Stallone, who was evicted from Celebrity Big Brother and faced public vote, had to patch things up with actress Brigitte Nielsen.", "John McCririck's outspoken views about women made him enemies on the show, which attracted around 4.2 million viewers per night.", "Germaine Greer quit due to what she called bullying tactics used by producers."], "orca-mini:3b": [" Jackie Stallone, mother of actor Sylvester Stallone, was evicted from Celebrity Big Brother after facing a public vote on Friday, with 67% of people voting to keep her in the house.", "Stallone seemed not to enjoy her time in the house and said, \"I'm a total wreck, I need a vacation, this was a nightmare.\"", "However, she was pleased to have patched things up with actress Brigitte Nielsen, her former daughter-in-law.", "The bookmakers have made former Happy Mondays dancer Bez favourite to win the show at 7/4, while Blazin' Squad singer Kenzie is second at 2/1.", "Feminist icon Germaine Greer quit the show earlier in the week over what she called \"bullying\" tactics used by the programme's producers.", "The show is currently attracting an average audience of about 4.2 million viewers a night."], "hermes3:3b": ["Jackie Stallone evicted from Celebrity Big Brother."], "stablelm-zephyr:3b": ["Jackie Stallone, mother of actor Sylvester, was evicted from Celebrity Big Brother on Friday.", "She and John McCririck faced public voting, with 67% voting to keep the racing pundit in the house.", "Stallone mentioned she felt like a \"total wreck\" and needed a vacation from her time in the house.", "She expressed happiness about repairing her relationship with former daughter-in-law Brigitte Nielsen, stating it was worth $1 million.", "McCririck's outspoken views about women have made him popular with some viewers, while others seem to dislike him.", "Despite this, Bez, a former Happy Mondays dancer, is favored to win the show at 7/4, followed by Kenzie at 2/1.", "Earlier in the week, feminist icon Germaine Greer quit the show due to \"bullying\" tactics by producers.", "Big Brother currently attracts an average audience of 4.2 million viewers per night."], "chatgpt-4o-latest": ["Jackie Stallone became the first celebrity evicted from Celebrity Big Brother after losing the public vote to John McCririck.", "Stallone, 71, described her experience as a \"nightmare\" but valued reconciling with former daughter-in-law Brigitte Nielsen.", "McCririck's controversial views on women made him a divisive figure, but he survived the vote.", "Bookmakers favor Bez to win, with Kenzie as the second favorite.", "Earlier, 15 Fathers 4 Justice protesters were arrested for entering the Big Brother compound, and Germaine Greer quit the show citing \"bullying\" by producers.", "The show averages 4.2 million viewers per night."], "stablelm2:1.6b": ["Jackie Stallone, mother of actor Sylvester, was evicted from Celebrity Big Brother as the first celebrity to be eliminated.", "Despite not enjoying her time in the house, she expressed happiness for patching things up with actress Brigitte Nielsen.", "Stallone was a favorite to be evicted early but made enemies with her outspoken views about women.", "Bookmakers have made former Happy Mondays dancer Bez and Blazin' Squad singer Kenzie as potential winners of the show.", "Earlier in the week, activist Germaine Greer quit due to \"bullying\" tactics by producers.", "The show currently attracts an average audience of around 4.2 million viewers per night."], "granite3.1-dense:2b": ["Jackie Stallone, 71, mother of actor Sylvester Stallone, was the first celebrity evicted from Celebrity Big Brother on Channel 4.", "Despite her initial struggles and declaring it a \"nightmare,\" she grew closer to actress Brigitte Nielsen, her former daughter-in-law.", "The public voted 67% in favor of keeping John McCririck, known for his outspoken views about women, over Stallone.", "This outcome surprised bookmakers, who had initially favored Stallone's eviction due to her status as a hot favorite (1/4 odds).", "Germaine Greer left the show earlier over alleged bullying by producers.", "Bez, a former Happy Mondays dancer, is now the favorite to win at 7/4, having impressed viewers with his approachable demeanor and lack of drama.", "The show averages approximately 4.2 million nightly viewers and saw 15 Fathers 4 Justice protesters arrested for throwing fireworks into the Big Brother compound at 0300 GMT on Friday."]}