{"raw_text": "George Michael to perform for BBC\n \n George Michael is to perform live at London's Abbey Road studios as part of a BBC Radio 2 special next month.\n \n The session, which will broadcast on 18 December, will also see him talk about how his biggest hits came about. Michael's appearance is part of the station's Sold on Song initiative, which explores the art of songwriting. The station also confirmed that Chris Tarrant will be hosting a one-off New Year's Eve programme. He left London's Capital FM this year after 17 years. The former breakfast show host - who attracted some of the highest ratings in Britain, despite only broadcasting to London - will offer his own individual take on the year in the two-hour show. \"This should be great fun,\" Tarrant said. \"I've had a fantastic year and I know that lots of other people have as well. I'm definitely looking forward to being on Radio 2.\" Other Christmas specials from Radio 2 include singer Jamelia hosting a Christmas Day concert from the London Community Gospel Choir, while actor Christopher Lee will read Fireside Tales from the likes of Edgar Allan Poe, E Nesbit and Ambrose Bierce. Comedian Harry Hill will host a spoof nostalgia show on Christmas Day, while singer Jamie Cullum will perform a live concert for the station.\n", "llama3.2:1b": ["George Michael to perform at BBC Radio 2 next month; session will feature talks about songwriting process.", "Chris Tarrant hosts one-off New Year's Eve programme.", "Other special events include Jamelia performing from London Community Gospel Choir, Christopher Lee reading Edgar Allan Poe stories, Harry Hill hosting a Christmas Day spoof show, and Jamie Cullum performing live on the station."], "llama3.2:3b": ["George Michael to perform at BBC Radio 2's Sold on Song special next month, discussing his hits, alongside Chris Tarrant hosting a New Year's Eve program and other Christmas specials including Jamelia, Christopher Lee, Harry Hill, and Jamie Cullum."], "gemma2:2b": ["George Michael to perform live at Abbey Road studios for BBC Radio 2 special.", "Chris Tarrant will host a New Year's Eve program.", "Other Christmas specials include Jamelia's concert, Christopher Lee reading Fireside Tales, Harry Hill's show, and Jamie Cullum's live performance."], "qwen2.5:0.5b": ["George Michael is set to perform at London's Abbey Road studios as part of a BBC Radio 2 special next month, which will also include him discussing how his biggest hits came about.", "Chris Tarrant, the former Breakfast Show host, has confirmed that he will be hosting a one-off New Year's Eve programme for Radio 2.", "The station is exploring the art of songwriting through their \"Sold on Song\" initiative.", "Other special features from Radio 2 include singer Jamelia hosting a Christmas Day concert from the London Community Gospel Choir and actor Christopher Lee reading Fireside Tales from Edgar Allan Poe, E Nesbit and Ambrose Bierce.", "Comedian Harry Hill will host a spoof nostalgia show on Christmas Day, while singer Jamie Cullum will perform a live concert for Radio 2."], "qwen2.5:1.5b": ["George Michael will perform at London's Abbey Road studios as part of BBC Radio 2's Sold on Song initiative in December.", "The session features an appearance by Michael discussing his hit song inspirations and is hosted by Chris Tarrant, who hosts New Year's Eve specials with Capital FM.", "Christmas specials include Jamelia performing live for the choir, a reading from Edgar Allan Poe, and Hill hosting a spoof nostalgia show.", "Cullum will also present a concert."], "qwen2.5:3b": ["George Michael is performing at London's Abbey Road studios as part of BBC Radio 2's Sold on Song initiative, featuring interviews about hits and hosted by Chris Tarrant.", "Other special events include Jamelia's Christmas Day concert, Christopher Lee reading stories, Harry Hill hosting a nostalgia show, and Jamie Cullum performing live."], "opencoder:1.5b": ["George Michael plans to perform at BBC London's Abbey Road studios next month.", "He will also discuss his biggest hits and plan to return to London after 17 years.", "The session will be broadcasted on 18 December, and Michael's appearance is part of the Sold on Song initiative, which focuses on songwriting.", "Chris Tarrant, along with other guests, will host a New Year's Eve programme at the station.", "He left London's Capital FM this year.", "Other festive specials from Radio 2 include the BBC's Christmas concert from the London Church and Goliath_gallery, and the actor's Christmas show.", "Tarrant also described his experience as \"great fun,\" which he said was shared with many people in Britain.", "He is also looking forward to being on Radio 2."], "smollm:1.7b": ["George Michael is scheduled to perform live at London's Abbey Road studios as part of a BBC Radio 2 special next month.", "The session, which will broadcast on 18 December, also features him talking about how his biggest hits came about.", "Michael's appearance is part of the station's Sold on Song initiative, which explores the art of songwriting.", "The station also confirmed that Chris Tarrant will be hosting a one-off New Year's Eve programme.", "He left London's Capital FM this year after 17 years.", "The former breakfast show host - who attracted some of the highest ratings in Britain, despite only broadcasting to London - will offer his own individual take on the year in the two-hour show.", "\"This should be great fun,\" Tarrant said.", "\"I've had a fantastic year and I know that lots of other people have as well.", "I'm definitely looking forward to being on Radio 2.\"", "Other Christmas specials from Radio 2 include singer Jamelia hosting a Christmas Day concert from the likes of Edgar Allan Poe, E Nesbit and Ambrose Bierce.", "Comedian Harry Hill will host a spoof nostalgia show on Christmas Day, while singer Jamie Cullum will perform a live concert for the station."], "deepseek-r1:1.5b": ["George Michael is performing live at London's Abbey Road studios for BBC Radio 2 next month as part of a special performance aimed at exploring songwriting and celebrating Christmas.", "The show will also feature discussions about his biggest hits and features Chris Tarrant, who previously hosted \"Capital FM,\" offering an individual take on the year.", "Other notable specials include Jamelia hosting a Christmas Day concert with the London Community Gospel Choir, Christopher Lee reading Fireside Tales by famous authors, Harry Hill hosting a spoof nostalgia show, and Jamie Cullum performing live for Radio 2."], "tinyllama:1.1b": ["George Michael to Perform Live at BBC Studios, Broadcasting on 18 December as part of BBC Radio 2's Sold on Song Initiative and Chris Tarant to host New Year's Evensong show with individual take on year in two-hour special.", "Announced that New Year's Evensong show will air on 31 December with Jamelia hosting a Christmas Day concert from Fireside Talks by Edgar Allan Poe, Ambrose Bierc and E Nebashet."], "tinydolphin:1.1b": [" George Michael is scheduled to appear at London's Abbey Road Studios next month, as part of a BBC Radio 2 special.", "The event will air on December 18th and feature an interview with the legendary singer about his biggest hits.", "Other notable guests in this year's program include Chris Tarrant, who left Capital FM after 17 years to host a New Year's Eve special for BBC Radio 2.", "The station confirmed Tarrant's appearance with a statement on their website and shared a photo of Chris standing next to the studio."], "phi:2.7b": [" George Michael is performing at London's Abbey Road studios as part of BBC Radio 2's Sold on Song initiative.", "Chris Tarrant will also be hosting a one-off New Year's Eve programme.", "Other specials include Jamelia hosting a Christmas Day concert, and Christopher Lee reading Fireside Tales from Edgar Allan Poe and Ambrose Bierce."], "orca-mini:3b": [" George Michael will perform live at London's Abbey Road studios as part of a BBC Radio 2 special next month.", "He will also talk about how his biggest hits came about as part of the station's Sold on Song initiative, which explores the art of songwriting.", "Chris Tarrant will be hosting a one-off New Year's Eve programme."], "hermes3:3b": [" George Michael to perform live for BBC Radio 2 show on 18th Dec."], "stablelm-zephyr:3b": ["George Michael will perform live at London's Abbey Road studios for BBC Radio 2 next month as part of their Sold on Song initiative.", "The session will also include Michael discussing how his biggest hits came about.", "Chris Tarrant will host a one-off New Year's Eve program, and other Christmas specials include Jamelia hosting a Christmas Day concert, Christopher Lee reading Fireside Tales, Harry Hill hosting a spoof nostalgia show, and Jamie Cullum performing a live concert."], "chatgpt-4o-latest": ["George Michael will perform live at London's Abbey Road studios for a BBC Radio 2 special on 18 December, discussing his biggest hits as part of the station's Sold on Song initiative.", "Additionally, Chris Tarrant will host a one-off New Year's Eve show after leaving Capital FM, offering his take on the year.", "Other Radio 2 Christmas specials include Jamelia hosting a Christmas Day concert, Christopher Lee reading Fireside Tales, Harry Hill presenting a spoof nostalgia show, and Jamie Cullum performing a live concert."], "stablelm2:1.6b": ["George Michael will perform at Abbey Road studios in London as part of a BBC Radio 2 special next month, discussing his songwriting process during a broadcast on December 8th.", "This event is part of the Sold on Song initiative, which explores the art of songwriting.", "Chris Tarrant will also host a New Year's Eve program featuring various Christmas specials from Radio  2, including Jamelia's concert with the London Community Gospel Choir, Christopher Lee's readings from Edgar Allan Poe and E Nesbit, Harry Hill's spoof nostalgia show, and Jamie Cullum's live concert."], "granite3.1-dense:2b": ["George Michael is scheduled to perform at Abbey Road Studios for BBC Radio 2's special on December 18.", "The performance is part of their Sold on Song initiative, focusing on songwriting.", "Chris Tarrant, formerly of Capital FM, will host a New Year's Eve program on Radio 2 after 17 years at Capital.", "Other Christmas specials include Jamelia with the London Community Gospel Choir, Christopher Lee reading tales by famous authors, Harry Hill's spoof nostalgia show, and Jamie Cullum's live concert."]}