{"raw_text": "Elvis regains top chart position\n \n Elvis Presley has scored his 19th number one single in the UK charts with the re-release of Jailhouse Rock, 27 years after his death.\n \n Elvis knocked X Factor winner Steve Brookstein down into second place after three weeks in the charts. In at number three was Iron Maiden for the Number Of The Beast and Erasure entered the chart at four with Breathe. Elvis's number one is the 999th in chart history and comes the day after what would have been his 70th birthday. Fans around the world held tribute events for the singer on Saturday, ranging from concerts to memorabilia exhibitions. Meanwhile, a poll carried out by royalty payments group the Performing Right Society found that The Wonder of You is the Elvis song most performed by live bands and tribute acts.\n \n Record company SonyBMG are releasing Elvis's 18 number one singles at the rate of one a week in Britain, complete with original artwork and a collector's box. Hit single One Night will follow next week - with the chance of becoming the 1,000th number one as interest surrounding Elvis's birthday grows. Elsewhere in the singles charts, the Scissor Sisters went straight in at number five with Filthy/Gorgeous. Band Aid 20 slipped to six after seven weeks in the chart with Do They Know It's Christmas. The other two new entries are Dana Rayne with Object of My Desire at seven and Kasabian who are at number eight with Cut Off. Making up the top 10 are Boulevard of Broken Dreams by Green Day, down three places to number nine, and Out of Touch by Uniting Nations, also down three places to 10. In the album charts, the Scissor Sisters went to number one with their self-titled release, knocking Green Day's American Idiot to third place. The Killers' album Hot Fuss moved up three to number two.\n", "llama3.2:1b": ["Elvis Presley regains top chart position with Jailhouse Rock re-release.", "Elvis knocked X Factor winner Steve Brookstein down into second place.", "Number One is the 999th in UK charts history, and fans held tribute events on Elvis's birthday.", "Record company SonyBMG will release 18 number one singles at a rate of one per week until next week's One Night."], "llama3.2:3b": ["Elvis Presley regained his 19th UK chart position with the re-release of Jailhouse Rock, his 999th entry in chart history.", "Fans held tribute events on what would have been his 70th birthday.", "Record company SonyBMG is releasing Elvis's 18 number one singles weekly, and next week will see the release of One Night."], "gemma2:2b": ["Elvis Presley's re-released \"Jailhouse Rock\" topped UK charts for his 19th number one single, surpassing Steve Brookstein in the process.", "This achievement coincided with Elvis's 70th birthday and led to global tribute events.", "SonyBMG is releasing a collection of Elvis's 18 chart-topping singles, creating new opportunities for interest and sales.", "The Scissor Sisters topped the album charts while \"American Idiot\" by Green Day fell from their top position."], "qwen2.5:0.5b": ["Elvis Presley's latest single, Jailhouse Rock, has reached number 19 in the UK charts.", "X Factor winner Steve Brookstein is second with Iron Maiden at number three and Erasure at four.", "Elvis's most recent number one hit comes up next week.", "The Recording Industry Association of America (RIAA) has released five new singles for Elvis in Britain each week, along with original artwork and a collector's box.", "The Scissor Sisters' \"Object of My Desire\" is number 7 and Green Day's \"Hot Fuss\" is number 9.", "A hit song from the album \"Scissor Sisters\" went up to number two on the album chart, while another track dropped to number one in the album charts."], "qwen2.5:1.5b": ["Elvis Presley regains top chart position with his 19th number one single in the UK charts following the re-release of Jailhouse Rock; X Factor winner Steve Brookstein drops from second to third, while Iron Maiden and Erasure enter at four and five respectively; a poll shows The Wonder of You as Elvis's most performed live song, and SonyBMG releases 18 number ones this week."], "qwen2.5:3b": ["Elvis Presley reclaims top chart position in UK with a re-release of Jailhouse Rock, 27 years after his death.", "It marks his 19th number one hit.", "Steve Brookstein drops to second and Iron Maiden at third.", "Fans held tribute events marking Elvis's 70th birthday.", "SonyBMG will release all his previous top ten singles in Britain.", "The Scissor Sisters topped the charts with Filthy/Gorgeous, while Band Aid 20 dropped to sixth.", "Green Day’s American Idiot moved up from seventh to third on album chart, ahead of The Killers' Hot Fuss at two."], "opencoder:1.5b": ["Elvis Presley has scored his 19th number one single in the UK charts with the re-release of Jailhouse Rock, after three weeks in the charts.", "During a tribute event at the concert, fans worldwide held a day-long celebration for Elvis on Saturday.", "The poll by Performing Right Society revealed that The Wonder of You is the most performed song by live bands and acts as a tribute.", "SonyBMG release Elvis's 18 number one single at the rate of one a week in Britain, complete with original artwork and a collector's box.", "The singles chart also featured the Hit single One Night which was released on subsequent weeks with an increase in charts as it coincided with Elvis's 70th birthday.", "The top 10 songs in the album are Boulevard of Broken Dreams by Green Day, down three places to Number Nine, and Out of Touch by Uniting Nations, also down three places to 10.", "The chart positions for the single titled \"American Idiot\" by Green Day, knocked it out of second place, and Elvis's own first single, \"Scissor Sisters\", went straight in at number five with Filthy/Gorgeous.", "Band Aid 20 slipped to six after seven weeks in the chart.", "In the singles chart, The Scissor Sisters' self-titled release, knocked Green Day's American Idiot out of third place, and their album Hot Fuss moved up three to number two.", "Finally, the Killers' album was at number one with the single \"Cut Off\", making it the top 10 in the singles chart."], "smollm:1.7b": ["Elvis Presley has regained his top chart position in the UK charts after a 19 year absence.", "He knocked X Factor winner Steve Brookstein down into second place after three weeks in the charts, and Iron Maiden for the Number Of The Beast and Erasure entered the chart at four with Breathe.", "Elvis's number one is the 999th in chart history and comes the day after what would have been his 70th birthday.", "Fans around the world held tribute events for the singer on Saturday, ranging from concerts to memorabilia exhibitions.", "Meanwhile, a poll carried out by royalty payments group the Performing Right Society found that The Wonder of You is the Elvis song most performed by live bands and tribute acts.", "Elvis's 18 number one singles in Britain are released at the rate of one a week, complete with original artwork and a collector's box.", "Hit single One Night will follow next week - with the chance of becoming the 1,000th number one as interest surrounding Elvis's birthday grows.", "Elsewhere in the singles charts, the Scissor Sisters went straight in at number five with Do They Know It's Christmas.", "The other two new entries are Dana Rayne with Object of My Desire at number eight with Cut Off and Kasabian who are at number eight with Cut Off.", "Making up the top 10 are Boulevard of Broken Dreams by Green Day, down three places to number nine, and Out of Touch by Uniting Nations, also down three places to 10.", "In the album charts, the Scissor Sisters went to number one with their self-titled release, knocking Green Day's American Idiot into third place.", "The Killers' album Hot Fuss moved up three to number two."], "deepseek-r1:1.5b": ["Elvis regains top chart position after 19 number ones since his death.", "In 27 years, he released \"Jailhouse Rock\" with Steve Brookstein at third, earning Iron Maiden first and Breathe second.", "Elvis's 1000th number one is the day after his 70th birthday.", "Fans held tributes Saturday for live performances.", "Record company SonyBMG will release 18 number ones weekly in Britain, including One Night.", "Poll from the Performing Right Society found \"The Wonder of You\" tops among live songs.", "Other singles and albums follow with Green Day moving down and Scissor Sisters taking the top spot."], "tinyllama:1.1b": ["Elvis Presley has scored his 19th number one single in the UK charts after re-releasing Jailed Rock for the tenth time, 27 years after its original release.", "Elvis knocked Steve Brookstein down into second place with X Factor winner Steve Brookstein falling to third and Iron MaiDen entering at fourth with Breathe.", "The other three new entries are Faithless at number five, and the Sci-Fi Sisters and Band Aid 20 debuting at six and seven respectively.", "Elvis Presley's number one is the 999th in chart history, and a poll conducted by royalty payment rights group the Performing Rights Society has found that Elvis's top song of all time, The Wonder of You, is the most performed live band and tributary act in Britain.", "The Sci-Fi Sisters' album, which features their self-titled reliease, also entered at number two, while the Killers' new album, Hot Fuuss, moved up three places to land at number two."], "tinydolphin:1.1b": [" Elvis Presley's re-release of his 19th number one single Jailhouse Rock has made its way into the UK charts, reaching a peak position of number 27.", "This marks the 19th time that this classic rock song has reached the top spot in the UK.", "The announcement comes after Elvis's tragic passing on August 16, 1977 at the age of 42.", "Despite being inducted into the Rock and Roll Hall of Fame in 1988, he is still remembered for his iconic performances on television and for leaving a lasting impact on popular music."], "phi:2.7b": [" Elvis Presley scored his 19th UK number one single with the re-release of Jailhouse Rock 27 years after his death.", "He knocked X Factor winner Steve Brookstein down into second place and Iron Maiden into third place on the charts.", "Fans held tribute events around the world for Elvis, while SonyBMG released 18 of his number ones in Britain, complete with collector's boxes.", "One Night is scheduled to be the 1,000th number one single.", "Meanwhile, the Scissor Sisters went straight in at number five with Filthy/Gorgeous, and Dana Rayne with Object of My Desire was at seven.", "The Killers' album Hot Fuss moved up three places to second, while Green Day's American Idiot dropped to third place."], "orca-mini:3b": [" Elvis Presley has reclaimed his top chart position in the UK charts after 27 years with the re-release of Jailhouse Rock.", "He knocked X Factor winner Steve Brookstein down to second place, and Iron Maiden for the Number Of The Beast and Erasure entered the chart at fourth and fifth respectively.", "Record company SonyBMG is releasing Elvis's 18 number one singles at a weekly rate of one each, with original artwork and collector's boxes.", "One Night will be released next week as the 999th number one in chart history.", "Band Aid 20 slipped to sixth after seven weeks in the chart with Do They Know It's Christmas, and Dana Rayne with Object of My Desire reached seventh place.", "Kasabian entered at eighth place with Cut Off.", "The Scissor Sisters topped the charts with their self-titled release, while Green Day's American Idiot dropped to third place.", "The Killers' album Hot Fuss moved up to second place."], "hermes3:3b": ["Elvis Presley's re-release of Jailhouse Rock returns to UK #1 chart, 27 years after death; 19th for Presley."], "stablelm-zephyr:3b": ["Elvis Presley achieved his 19th number one single in the UK charts with the re-release of Jailhouse Rock, 27 years after his death.", "This song knocked X Factor winner Steve Brookstein into second place.", "The release of Elvis's 18 number one singles at a rate of one per week was initiated by SonyBMG.", "The Scissor Sisters' single Filthy/Gorgeous entered the charts at number five, while Green Day's Boulevard of Broken Dreams and Uniting Nations' Out of Touch moved up in the top 10.", "In the album charts, the Scissor Sisters' self-titled release topped the charts, pushing Green Day's American Idiot to third place and The Killers' Hot Fuss to number two."], "chatgpt-4o-latest": ["Elvis Presley has reclaimed the UK chart's top spot with the re-release of \"Jailhouse Rock,\" marking his 19th number one single, 27 years after his death.", "This milestone, the 999th number one in chart history, coincided with what would have been his 70th birthday, prompting global tribute events.", "SonyBMG is re-releasing his 18 number one singles weekly, with \"One Night\" potentially becoming the 1,000th number one.", "Steve Brookstein dropped to second place, while Iron Maiden and Erasure entered at third and fourth, respectively.", "In the album charts, the Scissor Sisters claimed the top spot, pushing Green Day's \"American Idiot\" to third."], "stablelm2:1.6b": ["Elvis Presley's Jailhouse Rock re-release reaches #1 in UK charts, making it the 14th greatest single in chart history.", "Elvis knocked Steve Brookstein out of second place after three weeks; Iron Maiden, Erasure, and The Wonder of You followed.", "SonyBMG plans to release all remaining singles with artwork.", "In album charts, Scissor Sisters' self-titled album tops the list at #1, while Green Day's American Idiot holds third place."], "granite3.1-dense:2b": ["Elvis Presley reclaimed his 19th UK chart top position with the re-release of Jailhouse Rock, 27 years posthumously.", "This achievement resulted in Steve Brookstein's X Factor win falling to second place.", "Other notable entries included Iron Maiden at number three, Erasure at four, and The Wonder of You as the most frequently performed Elvis song by live bands and tribute acts.", "SonyBMG is releasing Elvis's 18 number one singles weekly in Britain, with Hit single One Night set to follow next week.", "In the album charts, the Scissor Sisters topped with their self-titled release, displacing Green Day's American Idiot to third place, while The Killers' Hot Fuss rose to second."]}