{"raw_text": "TOTP turns to Elvis impersonator\n \n Top of the Pops has turned to the star of Elvis Presley musical Jailhouse Rock after the late rock legend scooped the UK's 1,000th number one single.\n \n Mario Kombou, who plays the Presley role on stage, will sing One Night on Friday's BBC One show as producers are unable to use Presley video footage. It is his second number one in a row. The show used Presley photos last week. Presley will feature in the charts for several more months as all 18 of his original UK chart-toppers are reissued.\n \n A Top of the Pops spokesperson said: \"It's a very special number one as it's the UK's 1,000th. \"We wanted to pay tribute to Elvis in the best way we knew how, so we thought getting a professional would be the best way for Top of the Pops to do that.\" Kombou is likely to appear on the show again next week as the next Presley re-release, A Fool Such As I, is on course to give him his third number one in three weeks. Kombou plays Vince Everett in Jailhouse Rock - the same role Presley played in the 1957 film of the same name.\n", "llama3.2:1b": ["Elvis impersonator Mario Kombou will sing \"One Night On Friday\" from Top of the Pops to commemorate Elvis Presley's UK number one single, which is his second in a row and all of his original UK chart-toppers are reissued for several more months."], "llama3.2:3b": ["Top of the Pops has turned to an Elvis impersonator, Mario Kombou, to sing on its show after securing Elvis Presley's 1,000th UK number one single.", "Kombou, who plays Elvis in a stage musical, will perform \"One Night\" on BBC One, as producers couldn't use Presley video footage."], "gemma2:2b": ["Top of the Pops celebrated the UK's 1,000th number one single by using Elvis impersonator Mario Kombou to sing \"One Night.\"", "Kombou is set to appear again next week for a potential third consecutive number one in three weeks with another Presley re-release.", "Presley's images were used last week."], "qwen2.5:0.5b": ["Top of the Pops has turned to Elvis impersonator; Mario Kombou, who will appear on Friday's BBC One show, used Presley photos last week.", "Presley is likely to be featured again next week as A Fool Such As I, his third number one in three weeks after Jailhouse Rock and Vince Everett."], "qwen2.5:1.5b": ["Top of the Pops has named Elvis impersonator Mario Kombou as its performer for this week's show, following Presley's UK number one single milestone and upcoming reissues of his chart-toppers.", "Kombou will sing \"One Night\" on the BBC One program and features in Presley's 18 original UK chart-topper reissues until all releases are complete in September."], "qwen2.5:3b": ["Top of the Pops has achieved its 1,000th number one single with a performance by Mario Kombou, who portrays Elvis Presley in the stage musical \"Jailhouse Rock.\"", "This marks Kombou's second consecutive number one hit on the show.", "All of Elvis Presley's original UK chart-toppers are being reissued, including his recent appearance featured using photographs.", "A spokesperson for Top of the Pops stated that they paid tribute to Elvis by hiring a professional impersonator due to restrictions on using footage of the late icon.", "Kombou is expected to appear again next week with another Presley release, potentially securing him a third number one in three weeks, while he continues to play Vince Everett in \"Jailhouse Rock.\""], "opencoder:1.5b": ["TOTP turns to Elvis impersonator\n\nTop of the Pops has turned to the star of Elvis Presley musical Jailhouse Rock after the late rock legend scooped the UK's 1,000th number one single.", "Mario Kombou, who plays the Presley role on stage, will sing One Night on Friday's BBC One show as producers are unable to use Presley video footage.", "It is his second number one in a row.", "The show used Presley photos last week.", "Presley will feature in the charts for several more months as all 18 of his original UK chart-toppers are reissued.", "A Top of the Pops spokesperson said: \"It's a very special number one as it's the UK's 1,000th.", "We wanted to pay tribute to Elvis in the best way we knew how, so we thought getting a professional would be the best way for Top of the Pops to do that.\"", "Kombou is likely to appear on the show again next week as the next Presley re-release, A Fool Such As I, is on course to give him his third number one in three weeks.", "Kombou plays Vince Everett in Jailhouse Rock - the same role Presley played in the 1957 film of the same name."], "smollm:1.7b": ["Elvis impersonator TOTP turned to Mario Kombou, who will sing One Night on Friday's BBC One show as producers are unable to use Presley video footage.", "It is his second number one in a row.", "The show used Presley photos last week.", "Presley will feature in the charts for several more months as all 18 of his original UK chart-toppers are reissued.", "A Top of the Pops spokesperson said: \"It's a very special number one as it is the UK's 1,000th.", "We wanted to pay tribute to Elvis in the best way we knew how, so we thought getting a professional would be the best way for Top of the Pops to do that.\"", "Kombou is likely to appear on the show again next week as the next Presley re-release, A Fool Such As I, is on course to give him his third number one in three weeks.", "Kombou plays Vince Everett in Jailhouse Rock - the same role Presley played in the 1957 film of the same name."], "deepseek-r1:1.5b": ["Top of the Pops is considering replacing Jimmy Koolen, the star in Elvis impersonator jailhouse rock, with Mario Kombou, who plays Presley on stage.", "Kombou will perform in \"Jailhouse Rock\" next week as the Presley impersonator and the UK chart-toppers re-release Presley's work.", "The show last week used Presley photos, and Presley will feature in charts for several more months as his original UK chart-toppers are reissued.", "Top of Pops spokesperson highlighted this as a special number one due to honoring Elvis with a professional substitute role.", "Kombou will perform as Vince Everett again in \"Jailhouse Rock\" as number one since last week, and Jimmy Koolen is expected to appear next week for his third appearance."], "tinyllama:1.1b": ["Top of the Pop Songs has named Elvis Presley as their 1,000th chart-topper in the UK, and following the decision to use his video footage in place of other performances from similar acts, they have turned to a professional actor who plays the star's role on stage for their performance.", "The producer is able to use Presley's original videos as they are set to feature for several more months.", "Despite this, Top of the Pop Songs is paying tribute to Elvis in the best way possible by using a professional artist to perform his song One Night again next week.", "This will be his second number one in a row, following his 1957 film release A Foil Such As I, which was also named their 1,000th chart-topper."], "tinydolphin:1.1b": [" Top of the Pops has turned to Elvis impersonator Mario Kombou for its 1,000th number one single after the late rock legend scooped the UK's 1,000th chart-topping song.", "Kombou will sing during this week's episode on BBC One.", "Producers are unable to use Presley video footage, so they have reissued all of his original UK chart-toppers.", "This move is a tribute to the late star and will be accompanied by a mix of old and new Elvis songs."], "phi:2.7b": [" Elvis impersonator Mario Kombou will sing Top of the Pops' tribute song One Night, replacing a missing video footage from Presley's performances.", "The show will feature all 18 of his original UK chart-toppers for several more months as they are reissued.", "Kombou has already sung a number one with this show and is likely to appear again next week as the new Presley release reaches its third consecutive number one."], "orca-mini:3b": [" The Elvis impersonator who plays the star of Elvis Presley musical Jailhouse Rock will perform One Night on Friday's BBC One show as producers cannot use Presley video footage.", "It is his second number one in a row.", "All 18 of Presley's original UK chart-toppers are reissued, and he will feature in the charts for several more months."], "hermes3:3b": ["Top of the Pops uses Elvis Impersonator Mario Kombou to sing \"One Night\" after not using Presley video, as 1000th UK number one single."], "stablelm-zephyr:3b": ["Top of the Pops honored Elvis Presley by featuring his Jailhouse Rock impersonator, Mario Kombou, on their show after they reached their 1,000th number one single.", "Kombou sang \"One Night\" and had previously achieved a number one hit with his rendition of a Presley photo.", "They plan to continue using Presley's original UK chart-toppers for several more months."], "chatgpt-4o-latest": ["Top of the Pops enlisted Elvis impersonator Mario Kombou to perform \"One Night\" after Elvis Presley's song became the UK's 1,000th number one single.", "Unable to use Presley video footage, the show previously used photos.", "Presley will remain in the charts for months as all 18 of his UK number ones are reissued.", "A spokesperson said they wanted to honor Elvis appropriately.", "Kombou, who plays Presley’s role in the musical Jailhouse Rock, may return next week as another Presley re-release is expected to top the charts."], "stablelm2:1.6b": ["TOTP switched to Elvis impersonator Mario Kombou for a tribute after he won the UK's #1 single, as BBC One couldn..\nKombou, who plays Presley in stage show Jailhouse Rock, will sing \"One Night\" on Friday's BBC One show due to unable producers to use video footage.", "This is his second number one in a row; last week they used Presley photos.", "Kombou may appear again next week for the #1 release, \"A Fool Such As I.\""], "granite3.1-dense:2b": ["Top of the Pops celebrates Elvis Presley's UK 1,000th number one single with a performance by Mario Kombou, an actor who impersonates Presley on stage.", "This marks his second consecutive number one.", "The show reuses Presley photos for last week's episode.", "All of Presley's original UK chart-toppers will remain in the charts for several months due to upcoming reissues.", "A Top of the Pops spokesperson emphasized the significance of this milestone, choosing a professional Elvis impersonator as tribute.", "Kombou, who portrays Vince Everett from Jailhouse Rock (1957), is expected to appear again next week following Presley's third consecutive number one in three weeks due to the release of A Fool Such As I."]}