{"raw_text": "Deal to ban 'homophobic' reggae\n \n The reggae industry is to refuse to release or stage concerts featuring homophobic songs under a global deal struck with gay rights groups.\n \n A damaging campaign against stars such as Beenie Man and Sizzla has been waged over lyrics that allegedly call for gay people to be killed or assaulted. The campaign, which led to gigs being scrapped and a UK police investigation, will now be dropped under the truce. Brett Lock of gay group OutRage! said they were \"wiping the slate clean\". The protests had been led by the Stop Murder Music coalition, an umbrella group including OutRage!, the Black Gay Men's Advisory Group and Jamaican movement J-Flag.\n \n That coalition has reached a verbal agreement with major dancehall reggae record labels and concert promoters covering eight of the scene's biggest stars. But the artists themselves were not involved in the negotiations and have not directly signed up. Instead, the record companies have pledged not to release or re-release any offensive songs - many of which date back a number of years. And it is believed promoters will make stars agree not to perform such tunes on stage. \"The reggae industry will work with the artists while still maintaining their freedom of speech and artistic freedom,\" according to media and PR strategist Glen Yearwood, who is representing the reggae industry.\n \n The industry would halt any attempt by an artist to perform or release a song inciting violence against any group or gender, he said. \"We'll advise them this is not the way forward in a civilised society.\" The Stop Murder Music campaign saw protesters picket gigs, resulted in Sizzla's UK tour being cancelled in November, forced Mobo award organisers to drop artists from nominations and saw Beenie Man dropped from an MTV show in August. Police have also been investigating whether lyrics incite the assault and murder of gay people. The campaign was a blow to the reggae industry, Mr Yearwood admitted. \"If you can't have major stars touring, then you don't sell many albums,\" he said.\n \n But the artists - Beenie Man, Sizzla, Elephant Man, Buju Banton, Bounty Killer, TOK, Capleton and Vybz Kartel - will not have to apologise for past songs or comments. OutRage!'s Mr Lock said: \"The main players in the dancehall reggae industry will attempt to regulate the industry themselves to ensure that there aren't any violently homophobic or gay-bashing lyrics in the future. \"As a gesture of good faith, the Stop Murder Music coalition has agreed to suspend our aggressive campaigning against murder music. \"So we shall not be picketing concerts or calling for prosecutions to give the industry the space to regulate and reform itself.\" Record companies VP and Greensleeves, distributor Jet Star and concert promoters including Jammins and Apollo Entertainment are all on board.\n", "llama3.2:1b": ["The reggae industry has reached a deal with gay rights groups OutRage!", "to ban homophobic songs in concerts and stage performances.", "The agreement will apply to eight major dancehall reggae record labels and concert promoters covering notable stars such as Beenie Man, Sizzla, Elephant Man, and Vybz Kartel.", "Artists will not be forced to apologize for past comments or lyrics that were deemed homophobic, but rather the industry will work with them to prevent similar songs from being released in the future."], "llama3.2:3b": ["Reggae industry to stop releasing or staging concerts featuring homophobic songs under agreement with gay rights groups following damaging campaign that led to gig cancellations and police investigation; artists' past comments not directly addressed but record companies will advise against inciting violence against any group or gender; deal allows for regulation of the industry itself."], "gemma2:2b": ["The reggae industry has agreed to ban homophobic songs from releases and performances.", "This agreement was reached with gay rights groups after a campaign demanding this action targeted artists like Beenie Man and Sizzla.", "The deal involves record companies agreeing not to release offensive songs, promoters agreeing not to allow such songs to be performed live, and the industry vowing to avoid lyrics that incite violence against any group or gender.", "The deal is seen as an attempt to regulate the industry without suppressing artistic freedom."], "qwen2.5:0.5b": ["The reggae industry is to refuse to release or stage concerts featuring homophobic songs under a global deal with gay rights groups.", "OutRage!", "artists will not have to apologise for past lyrics inciting violence against any group or gender, but will need to work with the industry to regulate and reform itself in order to prevent such songs from being released in the future."], "qwen2.5:1.5b": ["Reggae industry agrees to ban homophobic songs following global deal with gay rights groups, while artists maintain artistic freedom."], "qwen2.5:3b": ["The reggae industry will refuse to release or stage concerts featuring homophobic songs under a global deal with gay rights groups.", "This truce comes after years of protests led by the Stop Murder Music coalition, which resulted in gigs being canceled, police investigations, and boycotts of artists from major shows.", "The agreement covers eight of the genre's biggest stars but does not involve them directly; instead, record companies will commit to not releasing or re-releasing offensive songs.", "The campaign was initiated due to lyrics that allegedly call for violence against gay people, leading to protests at gigs and investigations by police.", "The reggae industry now pledges to halt performances of such content while still allowing artists to maintain their freedom of speech."], "opencoder:1.5b": ["Deal to ban 'homophobic' reggae.", "The reggae industry is against releasing or staging songs that have homophobic lyrics.", "A damaging campaign has been set up by OutRage!, a gay rights group, against major stars like Beenie Man and Sizzla who claim the opposite of freedom.", "The Stop Murder Music coalition, which includes OutRage!, the Black Gay Men's Advisory Group and Jamaican movement J-Flag, has reached a verbal agreement with labels and concert promoters to cover eight of the biggest hits on the scene.", "The artists themselves have not been involved in the negotiations; instead, record companies have pledged not to release or re-release any songs that incite violence against any group.", "Similarly, promoter元素的参与没有直接转化为正式的签约，这引发了关于商业协议的争议。\n\nHowever, OutRage!’s critics, including Mr Lock, admitted they had made a \"wipe the slate clean\" move against homophobic lyrics.", "The protests were led by a coalition of independent campaigns, including the Stop Murder Music campaign.", "Protesters have poked funerals from Gays and lesbians in many countries, accusing them of not getting to stage.", "The industry would halt any attempt by an artist to perform or release a song that incites violence against any group or gender.", "As a result of these acts, artists are being told to respect freedom of speech and artistic freedom.", "The Stop Murder Music campaign was a blow to the reggae industry, which has now suffered irreparable damage.", "It is not a coincidence that songs from this genre have been cancelled on MTV's November tour.", "In addition, police investigations have also revealed that lyrics incite attacks and kill.", "The campaign was a significant blow to the industry, accusing them of not being able to regulate the industry.", "The Stop Murder Music campaign has now given way to any attempt by an artist to perform or release songs against homophobia and gender.", "As a result, artists are being told to respect the values and rules outlined in the law, which include freedom from speech and artistic expression."], "smollm:1.7b": ["The reggae industry is to refuse to release or stage concerts featuring homophobic songs under a global deal struck with gay rights groups.", "The deal was reached after the Stop Murder Music campaign had led to gigs being scrapped and a UK police investigation, which will now be dropped.", "The campaign has been waged against artists such as Beenie Man and Sizzla, who allegedly call for gay people to be killed or assaulted in their lyrics.", "The campaign, which led to gigs being scraped and a UK police investigation, will now be dropped under the truce.", "The Stop Murder Music coalition has reached a verbal agreement with major dancehall reggae record labels and concert promoters covering eight of the scene's biggest stars.", "But the artists themselves were not involved in the negotiations and have not directly signed up.", "The record companies have pledged not to release or re-release any offensive songs - many of which date back a number of years.", "And it is believed promoters will make stars agree not to perform such tunes on stage.", "The industry would halt any attempt by an artist to perform or release a song inciting violence against any group or gender, he said.", "\"We'll advise them this is not the way forward in a civilised society.\"", "The Stop Murder Music campaign saw protesters picket gigs, resulted in Sizzla's UK tour being cancelled in November, forced Mobo award organisers to drop artists from nominations and saw Beenie Man dropped from an MTV show in August.", "Police have also been investigating whether lyrics incite the assault and murder of gay people.", "The campaign was a blow to the reggae industry, Mr Yearwood admitted.", "\"If you can't have major stars touring, then you don't sell many albums,\" he said.", "But the artists - Beenie Man, Sizzla, Elephant Man, Buju Banton, Bounty Killer, TOK, Capleton and Vybz Kartel - will not have to apologise for past songs or comments.", "OutRage!", "'s Mr Lock said: \"The main players in the dancehall reggae industry will attempt to regulate the industry themselves to ensure that there aren't violently homophobic or gay-bashing lyrics in the future.\"", "As a gesture of good faith, the Stop Murder Music coalition has agreed to suspend our aggressive campaigning against murder music.", "So we shall not be picketing concerts or calling for prosecutions to give the industry the space to regulate and reform itself."], "deepseek-r1:1.5b": ["The reggae industry will cease any attempt to perform or release songs that incite violence against homothetic groups or genders due to homophobic lyrics.", "Record labels and promoter groups have agreed not to release or re-release offensive songs dating back decades, with artists like Sizzla and Beenie Man being excluded from such actions.", "The industry will regulate itself to prevent violent content, leading to the cancellation of tours for Sizzla and Beenie Man, and a national investigation by police investigating any violence sparked by lyrics.", "Meanwhile, OutRage!", "has claimed to \"wipe the slate clean,\" addressing past criticisms."], "tinyllama:1.1b": ["In a deal struck with gay rights groups, major dancehall reggae record labels and concert promoters have agreed not to release or re-release any songs inciting violence against any group or gender, including \"homophobiic\" lyrics that allegedly call for gay people to be killed or assaulted.", "The move is part of a global effort to reform the industry, which has come under fire for years due to issues with homophobia and other hate speech.", "This campaign was sparked by protests over songs featuring such lyrics, but will not require artists to apologize for past statements or remarks.", "Some of the biggest stars in the scene have agreed not to perform any such offensive music on stage, as well."], "tinydolphin:1.1b": [" The reggae industry has reached a truce with gay rights groups over lyrics that promote violence and homophobia.", "In a major deal struck, the major dancehall record labels and concert promoters will not release or re-release any offensive songs by eight of the scene's biggest stars.", "These include Beenie Man, Sizzla, Elephant Man, Buju Banton, Bounty Killer, TOK, Capleton, Vybz Kartel and Bounty Killer.", "Instead, the record companies have pledged not to release or re-release any songs with homophobic or gay-bashing lyrics.", "This marks a significant victory for the Stop Murder Music coalition, which has been campaigning against these offending songs for years.", "The reggae industry will also work with the artists while maintaining their freedom of speech and artistic freedom.", "In return, the artists themselves have not signed up to any verbal agreements or contracts.", "Promoters, too, are committed to not releasing or re-ributing songs containing homophobic lyrics.", "This decision is seen as a significant move towards social acceptance in reggae music."], "phi:2.7b": [" The reggae industry has agreed to refuse to release or stage concerts featuring homophobic songs under a global deal struck with gay rights groups.", "The campaign had been led by the Stop Murder Music coalition, which has reached a verbal agreement with major dancehall reggae record labels and concert promoters covering eight of the scene's biggest stars.", "However, the artists themselves were not involved in the negotiations and have not directly signed up.", "Instead, the record companies have pledged to halt any attempt by an artist to perform or release a song inciting violence against any group or gender."], "orca-mini:3b": [" A global deal has been struck between gay rights groups and the reggae industry to ban homophobic songs and stop concerts featuring them.", "The deal involves major dancehall reggae record labels and concert promoters covering eight of the scene's biggest stars, who have not directly signed up.", "The artists will not have to apologize for past songs or comments and the industry will regulate itself to prevent violent homophobia and gay-bashing lyrics in the future.", "The Stop Murder Music campaign has led to cancelled tours and a police investigation for Sizzla and Mobo award nominations being withdrawn."], "hermes3:3b": ["Reggae industry agrees not to release or stage concerts featuring homophobic songs, under deal with gay rights groups; record labels and promoters pledge not to release/re-release any offensive songs, artists' freedom of speech maintained."], "stablelm-zephyr:3b": ["The reggae industry has agreed to a global deal with gay rights groups to ban homophobic songs and lyrics.", "Major dancehall reggae record labels and concert promoters have reached a verbal agreement with the Stop Murder Music coalition, covering eight of the scene's biggest stars.", "Protests against artists such as Beenie Man and Sizzla were dropped following damage to the industry's reputation, but the artists themselves were not involved in the negotiations.", "The stop murder music campaign saw numerous events being cancelled or dropping certain artists from line-ups due to allegedly inciting violence against gay people.", "Under this new agreement, record companies have pledged not to release or re-release any offensive songs and promoters will make stars agree not to perform such tunes on stage."], "chatgpt-4o-latest": ["The reggae industry has agreed to stop releasing or staging concerts featuring homophobic songs under a global deal with gay rights groups.", "The agreement follows a campaign against artists like Beenie Man and Sizzla over lyrics allegedly inciting violence against gay people, which led to concert cancellations and a UK police investigation.", "While the artists themselves were not directly involved, major record labels and promoters have pledged to prevent the release or performance of such songs.", "The industry aims to regulate itself while maintaining artistic freedom.", "In response, the Stop Murder Music coalition has suspended its protests, allowing the industry to reform.", "The deal includes major labels and promoters but does not require artists to apologize for past lyrics."], "stablelm2:1.6b": ["Global deal struck by major dancehall reggae record labels and concert promoters includes refusal to release or stage concerts featuring homophobic songs.", "Campaign against artists like Beenie Man and Sizzla led to gigs being scrapped and a UK police investigation; artists themselves were not involved in negotiations.", "OutRage!", "has reached an agreement with the industry to regulate and reform the music scene while maintaining freedom of speech and artistic freedom.", "The campaign will see major stars advise that violent lyrics are not the way forward in a civilized society."], "granite3.1-dense:2b": ["The reggae industry has agreed to a global deal with gay rights groups to prevent the release or staging of concerts featuring homophobic songs.", "This resolution aims to address lyrics from artists like Beenie Man, Sizzla, and others that allegedly incite violence against LGBTQ+ individuals.", "The Stop Murder Music coalition, comprising OutRage!, Black Gay Men's Advisory Group, and Jamaican movement J-Flag, will not protest or picket concerts, but they will monitor the industry to ensure compliance with the agreement.", "Major record labels and promoters have committed to not releasing or re-releasing offensive songs and preventing artists from performing such tunes on stage.", "The reggae industry will maintain artists' freedom of speech while advising them against promoting violence.", "This truce comes after a campaign that led to cancelled gigs, dropped nominations, and a UK police investigation into potential lyrical incitement to assault and murder."]}