{"raw_text": "No jail for singer Courtney Love\n \n Singer Courtney Love has been spared jail for assault and drug offences, but must serve three years probation.\n \n She had back-to-back court appearances in two separate cases in Los Angeles, first pleading no contest to attacking a woman with a whisky bottle. In the second, Ms Love, 40, pleaded guilty to possessing a forged prescription and painkiller oxycodone. She must also do 100 hours community service, have drug treatment, attend Narcotics Anonymous and pay a fine. The ex-Hole singer's lawyer Howard Weitzman said Ms Love had \"turned her life around\" and she was \"clean and sober\".\n \n The assault charge stemmed from April 2004, when Ms Love found musician Kristin King in her boyfriend's home. Ms King said the singer \"threw the bottle at the left side of my face\" in an \"angry, vicious and erratic\" attack. Ms Love was originally charged with the more serious offence of assault with a deadly weapon, but that was reduced to assault. Judge Rand Rubin said she must:\n \n - Spend three years on probation \n  - Have one year's anger management counselling \n  - Have one year's drug rehabilitation \n  - Do 100 hours community service \n  - Pay $1,000 (£535) fine \n  - Have random drug tests \n  - Go to three Narcotics Anonymous meetings per week\n \n In the drugs case, she was sentenced to 18 months probation, to run concurrently with the probation for the assault. That offence stemmed from October 2003, when she suffered an overdose after breaking a window at her boyfriend's home. In a separate case relating to the same incident, Ms Love was sentenced to 18 months in drug rehabilitation for being under the influence of cocaine and opiates. In another case last October, she pleaded guilty to disorderly conduct for hitting a man on the head with a microphone stand at a New York City nightclub. Last month her lawyers said she had won back custody of Frances Bean, her 12-year-old daughter with former Nirvana frontman Kurt Cobain. The girl was removed from her care following her double arrest in October 2003. Cobain committed suicide in 1994.\n", "llama3.2:1b": ["Singer Courtney Love has been spared jail for assault and drug offences but must serve three years probation, including 100 hours of community service, drug treatment, and Narcotics Anonymous meetings.", "She pleaded guilty to possessing a forged prescription and painkiller oxycodone."], "llama3.2:3b": ["Courtney Love has been sentenced to three years probation for assault and drug offenses after a series of court appearances.", "She pleaded no contest to attacking a woman with a whisky bottle and was found guilty of possessing a forged prescription and painkiller oxycodone.", "As part of her sentence, she must serve 100 hours of community service, attend Narcotics Anonymous meetings, and pay a fine."], "gemma2:2b": ["Courtney Love was spared jail time for assault and drug offenses but must serve three years probation.", "She pleaded no contest to an attack on Kristin King with a whisky bottle, and she admitted to possessing a forged prescription and painkiller oxycodone.", "She will undergo anger management counseling, drug rehabilitation, community service, random drug testing, and attend Narcotics Anonymous meetings.", "The judge also sentenced her for drug offenses in a separate case related to a 2003 overdose and disorderly conduct.", "Love regained custody of her daughter Frances Bean in November after previous removal due to her double arrest."], "qwen2.5:0.5b": ["Courtney Love, an ex-Hole singer, served a three-year jail sentence for assault and drug offenses after pleading no contest to attacking Kristin King with a whisky bottle in Los Angeles.", "She was also required to do community service, attend Narcotics Anonymous meetings, pay fines, and undergo random drug tests."], "qwen2.5:1.5b": ["Courtney Love has been spared jail for assault and drug offenses but must serve three years probation, including community service, substance abuse treatment, and random drug testing."], "qwen2.5:3b": ["Singer Courtney Love avoided jail but must serve three years probation for assault and drug offenses.", "She pleaded no contest to attacking a woman with a whisky bottle in 2004, was given one year of anger management counseling, one year of drug rehabilitation, 100 hours community service, $1,000 fine, random drug tests, and three Narcotics Anonymous meetings per week.", "In the same incident, she received 18 months probation for possessing a forged prescription and painkiller oxycodone.", "She also served 18 months in drug rehabilitation for an overdose at her boyfriend's home due to cocaine and opiates use.", "Additionally, she pleaded guilty to disorderly conduct after hitting someone with a microphone stand.", "Her lawyers reported that she regained custody of her daughter Frances Bean."], "opencoder:1.5b": ["Singer Courtney Love has been spared jail for assault and drug offences, but must serve three years probation.", "She had back-to-back court appearances in two separate cases in Los Angeles, first pleading no contest to attacking a woman with a whisky bottle.", "In the second case, Ms Love, 40, pleaded guilty to possessing a forged prescription and painkiller oxycodone.", "The ex-Hole singer's lawyer Howard Weitzman said Ms Love had \"turned her life around\" and she was \"clean and sober\".", "The assault charge stemmed from April 2004, when Ms Love found musician Kristin King in her boyfriend's home.", "The drugs case is being sentenced to 18 months probation, to run concurrently with the probation for the assault.", "She suffers an overdose after breaking a window at her boyfriend's home.", "In a separate case relating to the same incident, Ms Love was sentenced to 18 months in drug rehabilitation for being under the influence of cocaine and opiates.", "The disorderly conduct offence is also being sentenced to 18 months in drug rehabilitation.", "In another case last October, she pleaded guilty to disorderly conduct for hitting a man on the head with a microphone stand at a New York City nightclub.", "Last month her lawyers said she had won back custody of Frances Bean, her 12-year-old daughter with former Nirvana frontman Kurt Cobain.", "She committed suicide in 1994."], "smollm:1.7b": ["No jail for singer Courtney Love"], "deepseek-r1:1.5b": ["Courtney Love was spared jail for assault and drug offenses but must serve three years probation.", "She pleaded no contest in a 2004 attack on a woman with a whisky bottle.", "In 2005, she pleaded guilty tooxycodone possession and had additional charges of assault and drug abuse, including an overdose from breaking a window at her boyfriend's home.", "The judge assigned three years on probation, requiring anger management counseling, drug rehab, community service, a fine, random drug tests, and three Narcotics Anonymous meetings per week.", "She was clean and sober with a 2003 double arrest in New York City for hitting a man with a microphone stand.", "She received custody of her 12-year-old daughter, Frances Bean, after being removed from her previous care."], "tinyllama:1.1b": ["Unrelated to the previous text, a singer Courtney Love has been spared jail for assault and drug offences, but must serve three years probation.", "She pleaded no contest to attacking a woman with a whisky bottle and was sentenced to three years on probation, which includes 100 hours of community service, random drug tests, attending Narcom Anonymous meetings, and a fine of $1,000 (£535).", "In addition, she must undergo anger management counseling for the assault, submit to drug rehab for her overdose, and avoid harming anyone else in the future.", "Courtney Love was initially charged with a more serious offence of assault with a deadly weapon but had the charge reduced to assault.", "Despite being convicted in April 2004, she received probation rather than jail time."], "tinydolphin:1.1b": [" Courtney Love, a well-known singer, has been spared jail time after pleading no contest to assault and drug offenses, but she must undergo three years of probation.", "She was initially charged with attacking a woman in April 2004, but reduced the charge to one involving an attack with a bottle.", "Love will also attend Narcotics Anonymous meetings and complete 100 hours of community service in addition to receiving a $1,000 fine and three years of probation."], "phi:2.7b": [" Singer Courtney Love has been given probation and ordered to do community service, attend Narcotics Anonymous meetings, and pay a fine for assault and drug offences.", "She pleaded guilty to possessing a forged prescription and painkiller oxycodone in the second case and was sentenced to 18 months probation.", "The singer's lawyer said she had turned her life around and was clean and sober."], "orca-mini:3b": [" Singer Courtney Love has been spared jail time for assault and drug offences, but must serve probation for three years, complete 100 hours of community service, do random drug tests, and pay a fine of $1,000."], "hermes3:3b": ["Courtney Love not sent to jail for assault, drug offenses; 3yrs probation, community service required."], "stablelm-zephyr:3b": ["Singer Courtney Love pleaded no contest to assaulting a woman with a whisky bottle and possessing a forged prescription of oxycodone, resulting in three years probation, 100 hours community service, drug treatment, attendance at Narcotics Anonymous, and a $1,000 fine.", "The first charge stemmed from an attack on musician Kristin King in 2004, while the second case occurred in 2003 after an overdose.", "Love's lawyer stated that she has turned her life around and is now clean and sober.", "Additionally, Courtney Love won back custody of her 12-year-old daughter, Frances Bean, following her previous drug-related arrests in 2003 involving Cobain's suicide."], "chatgpt-4o-latest": ["Singer Courtney Love avoided jail for assault and drug offenses but received three years of probation.", "She pleaded no contest to attacking a woman with a whisky bottle and guilty to possessing a forged prescription and oxycodone.", "Her sentence includes 100 hours of community service, drug treatment, anger management, and a fine.", "The assault charge stemmed from an April 2004 incident involving musician Kristin King, while the drug case related to an October 2003 overdose.", "She also received 18 months of probation for drug-related offenses and was previously sentenced to drug rehabilitation for cocaine and opiate use.", "In another case, she pleaded guilty to disorderly conduct for hitting a man with a microphone stand.", "Recently, she regained custody of her daughter, Frances Bean, who had been removed from her care after her 2003 arrests."], "stablelm2:1.6b": ["Singer Courtney Love was spared jail for assault and drug offenses but must serve three years of probation.", "She pleaded no contest to attacking a woman with a whisky bottle and admitted to possessing forged prescription medication.", "In another case, she pleaded guilty to possessing oxycodone without a prescription and community service requirements have been imposed.", "Love must also attend Narcotics Anonymous meetings and pay a fine.", "The assault charge stems from an attack on musician Kristin King in April 2014.", "As part of her probation, she must undergo anger management counseling, drug treatment, one year's of community service, and three years of probation."], "granite3.1-dense:2b": ["Courtney Love, the singer, was recently sentenced to three years probation for assault and drug offences in Los Angeles.", "She pleaded no contest to attacking musician Kristin King with a whisky bottle in April 2004, a charge reduced from assault with a deadly weapon.", "For this, Love must complete 100 hours community service, attend Narcotics Anonymous meetings weekly, undergo drug rehabilitation, and pay a $1,000 fine.", "She also has random drug testing requirements.", "In another case, she pleaded guilty to possessing forged prescription oxycodone in October 2003, leading to an additional 18 months of probation and 18 months of drug rehabilitation (concurrent with the assault probation).", "Love had previously served time for disorderly conduct at a New York City nightclub.", "Her lawyer claims she has turned her life around and is currently sober.", "Notably, Love recently regained custody of her 12-year-old daughter, Frances Bean, from ex-husband Kurt Cobain, who died by suicide in 1994."]}