{"raw_text": "Abba reunite for musical premiere\n \n The original stars of Swedish pop quartet Abba have reunited for the home premiere of hit musical Mamma Mia! which is based on the band's songs.\n \n It is the first time in almost 20 years that the four, Bjorn Ulvaeus, Benny Andersson, Agnetha Faltskog and Anni-Frid Lyngstad, have met publicly. Faltskog has been a virtual recluse since the band split up in 1982. The musical, which has become a global phenomenon, will be performed in Swedish for the first time. Fans camped outside Stockholm's Cirkus theatre in the snow for a glimpse of the stars. The premiere marks Abba's first public reunion since the legendary band's acrimonious break-up in the early 1980s. It was thought that Faltskog would appear in London for the musical's fifth anniversary celebrations in April 2004 but she stayed away due to her fear of flying.\n \n Original Abba member Bjorn Ulvaeus set about translating the musical into the band's mother tongue for the celebrated homecoming, alongside Swedish artist Niklas Stromstedt. Almost all of Abba's original songs, which have sold more than 350 million records worldwide, were written and recorded in English. The musical, set on a small Greek island, tells of the story of a young woman and her fiercely independent single mother. The show will include such classics as Super Trouper, SOS and Dancing Queen. There are currently 14 productions being staged worldwide, including New York and London, with road shows in Toronto, South Korea and Madrid. More than 20 million people around the world have seen the show.\n", "llama3.2:1b": ["Abba reunites for Mamma Mia!", "musical premiere after almost 20 years apart.", "The original four members - Bjorn Ulvaeus, Benny Andersson, Agnetha Faltskog, and Anni-Frid Lyngstad - reunited to perform the hit musical, which will be performed in Swedish for the first time."], "llama3.2:3b": ["Swedish pop quartet Abba has reunited for a musical premiere of Mamma Mia!, their first public reunion in almost 20 years.", "The original stars, Bjorn Ulvaeus, Benny Andersson, Agnetha Faltskog, and Anni-Frid Lyngstad, have met publicly after the band's acrimonious break-up in the early 1980s.", "The musical will be performed for the first time in Swedish, featuring most of Abba's songs translated by Ulvaeus alongside Niklas Stromstedt."], "gemma2:2b": ["ABBA reunited for the premiere of their musical \"Mamma Mia!\"", "in Swedish.", "The performance marked their first public reunion since the band split in the early 1980s.", "The musical, based on the band's songs, tells the story of a young woman and her single mother.", "It includes classic ABBA tracks like \"Super Trouper\", \"SOS\", and \"Dancing Queen\"."], "qwen2.5:0.5b": ["The Swedish pop quartet Abba reunite for the home premiere of their hit musical Mamma Mia!, which follows on from their 1982 breakup.", "It is the first time since then that the original members have met publicly, with fans gathering outside Stockholm's Cirkus theatre in the snow to see them perform.", "The show, set on a small Greek island, tells the story of a young woman and her single mother.", "More than 20 million people worldwide have seen it, including New York, London, Toronto, South Korea, and Madrid."], "qwen2.5:1.5b": ["Abba stars reunite for Swedish premiere of Mamma Mia!", "musical, marking first public reunion since 1982 break-up; featuring original songs written by band members, set on a Greek island about young woman and single mother."], "qwen2.5:3b": ["Abba's original stars reunite for Mamma Mia!", "premiere after nearly two decades.", "Faltskog, a virtual recluse since Abba split in 1982, attended the Swedish home premiere of the hit musical set on a Greek island.", "The event featured Abba's original songs and marked their first public appearance together since their breakup."], "opencoder:1.5b": ["\"Abba reunite for musical premiere\""], "smollm:1.7b": ["Abba reunite for musical premiere"], "deepseek-r1:1.5b": ["The Swedish pop quartet Abba has reunitted for the home premiere of \"Mamma Mia!\"", "based on their song.", "It's the first time in over 20 years that Bjorn Ulvaeus, Benny Andersson, Agnetha Faltskog, and Anni-Frid Lyngstad have met publicly since their 1982 breakup.", "The musical will be performed for the first time in Sweden, marking Abba's first public reunion since their famous break-up.", "Fans from Stockholm's Cirkus Theatre gathered in the snow to watch the premiere.", "The show is a global phenomenon with 350 million recordings, featuring classic songs and multiple productions worldwide.", "Bjorn Ulvaeus translated \"Mamma Mia!\"", "into Swedish for the event.", "This was a significant move as their music had sold over 350 million records globally.", "Rumors of fans emitting 'fan farts' for London's Mamma Mia!", "fifth-anniversary celebrations were unfounded, with the artist fears of flying preventing her attendance.", "The summary captures key points: reunite Abba, first Swedish performance, Stockholm snow premiere, fans gathering, translation efforts, rumors about Fan Farts, safety concerns, and global success."], "tinyllama:1.1b": ["The Swedish pop quartet Abba has reunited for the first time since their split in 1982, with Björn Ulvaeus, Benny Andersson, Agnetha Faltsköng, and Ann-Caroline Lyngsjötade set to perform the musical \"Mammi Mià!\"", "based on Abba's songs.", "The original stars have reunited for the home premiere of the musical, which has become a global phenomenon, with Swedish artist Niklas Stromssted translating many of the lyrics into the native language.", "Abba's original hit songs are being reimagined in this new production, which includes performances in London, New York, Toronto, South Korea and Madrid.", "The show now enjoys over 20 productions worldwide, with more than 14 productions in operation as of 2022."], "tinydolphin:1.1b": [" The original stars of Swedish pop quartet Abba have reunited for the home premiere of hit musical Mamma Mia!", "which is based on the band's songs.", "It is the first time in almost 20 years that the four, Bjorn Ulvaeus, Benny Andersson, Agnetha Faltskog and Anni-Frid Lyngstad, have met publicly.", "The musical, which has become a global phenomenon, will be performed in Swedish for the first time.", "Agnetha Faltskog has been a virtual recluse since the band split up in 1982.", "The musical, which has become a worldwide hit, will be performed in Swedish for the first time."], "phi:2.7b": [" Abba, a Swedish pop quartet, has reunited for the home premiere of the musical Mamma Mia!", "based on their songs.", "It is the first time in almost 20 years that the four original stars have been seen together.", "The musical, set on an island in Greece, tells the story of a young woman and her single mother and features Abba's classics such as Super Trouper, SOS, and Dancing Queen.", "There are currently 14 productions being staged worldwide, with over 20 million people seeing the show."], "orca-mini:3b": [" The original members of Swedish pop quartet Abba have reunited for the home premiere of their hit musical Mamma Mia!.", "Bjorn Ulvaeus, Benny Andersson, Agnetha Faltskog, and Anni-Frid Lyngstad met publicly for the first time in almost 20 years.", "The musical will be performed in Swedish for the first time.", "Camping sites were set up outside a theatre in Stockholm for fans to see original members of Abba perform."], "hermes3:3b": ["Abba members reunite (after 19yrs), Bjorn Ulvaeus & Anni-Frid Lyngstad, for Swedish premiere of Mamma Mia!", "musical, which performs in Swedish for first time."], "stablelm-zephyr:3b": ["Abba's original members reunited for the home premiere of their hit musical Mamma Mia!, which marked their first public reunion in almost 20 years.", "The musical, translated into Swedish, tells the story of a young woman and her fiercely independent single mother, incorporating many of Abba's classic songs including Super Trouper, SOS, and Dancing Queen.", "It had been performed in English worldwide since its creation, with 14 productions staged globally at the time of the reunion."], "chatgpt-4o-latest": ["Abba reunited publicly for the first time in nearly 20 years at the Swedish premiere of the musical *Mamma Mia!", "*, based on their songs.", "The event marked a rare appearance by Agnetha Faltskog, who has been reclusive since the band's 1982 split.", "Fans braved the snow outside Stockholm's Cirkus theatre to see the group.", "Bjorn Ulvaeus helped translate the musical into Swedish for this homecoming.", "*Mamma Mia!", "* has become a global success, with 14 productions worldwide and over 20 million viewers.", "The show, set on a Greek island, features Abba classics like *Super Trouper*, *SOS*, and *Dancing Queen*."], "stablelm2:1.6b": ["The original Abba members reunited for a musical premiere of Mamma Mia!, which is based on their songs.", "This marks their first public meeting since the band's breakup in the early '80s.", "The Swedish adaptation will be performed, and almost all of Abba's English songs were translated into Swedish by Bjorn Ulvaeus and Niklas Stromstedt.", "The musical follows a young woman and her single mother on a Greek island and includes hits such as \"Super Trouper,\" \"SOS,\" and \"Dancing Queen.\""], "granite3.1-dense:2b": ["Abba's original members—Bjorn Ulvaeus, Benny Andersson, Agnetha Faltskog, and Anni-Frid Lyngstad—reunited for the home premiere of their musical adaptation, Mamma Mia!, in Stockholm.", "This marks the group's first public gathering since they disbanded in 1982.", "Faltskog, who has largely avoided the limelight, joined Ulvaeus and Andersson for the event, performed in Swedish for the first time.", "The musical, known for hits like Super Trouper, SOS, and Dancing Queen, was adapted from their songs, which were originally written in English.", "Fans braved harsh weather to attend the premiere at Stockholm's Cirkus theatre.", "Mamma Mia!", "has garnered international acclaim, with 14 productions across various cities and over 20 million global viewers."]}