{"raw_text": "Hendrix guitar fetches £100,000\n \n A much-loved guitar belonging to Jimi Hendrix has been sold for £100,000 at an auction in London.\n \n The 1965 Fender Stratocaster was one of a number of guitars included in the sale dedicated to the rock legend. The vast archive of instruments, signed records and posters were collected by a dedicated fan who had become friendly with the star. The auction was billed as the biggest collection of Hendrix memorabilia to go under the hammer. The majority of the items were collected by fan Bob Terry who began collecting at the age of 17. He later sold it on to another collector.\n \n Hendrix, widely considered one of the best guitarists of his era, died of a drug overdose in 1970 at the age of 27. The 1965 Fender Stratocaster was used by the musician on tour and in his studio. A poem written by Hendrix two weeks after his infamous appearance at the Monterey Festival where he set light to his guitar went for £10,000. The Jimi Hendrix Experience's first single Hey Joe, signed by all the band, was sold for £2,000. The sale, hosted by auctioneers Cooper Owen, was held at the Hard Rock Cafe in London.\n", "llama3.2:1b": ["Jimi Hendrix's 1965 Fender Stratocaster was sold at an auction in London for £100,000 to dedicated fan Bob Terry.", "The guitar was part of a collection dedicated to the musician and featured memorabilia such as signed records and posters.", "The sale was billed as one of the largest collections of Hendrix memorabilia under hammer."], "llama3.2:3b": ["A 1965 Fender Stratocaster guitar used by Jimi Hendrix fetched £100,000 at an auction in London.", "The guitar was one of many items from a large collection of Hendrix memorabilia, including signed records and posters, sold to another collector after being acquired by fan Bob Terry at age 17."], "gemma2:2b": ["A 1965 Fender Stratocaster owned by Jimi Hendrix was sold for £100,000 at an auction in London.", "The auction featured a vast collection of Hendrix memorabilia including guitars, signed records and posters, and items such as a poem written by Hendrix after the Monterey Festival fire, and his band's first single \"Hey Joe\"."], "qwen2.5:0.5b": ["A 1965 Fender Stratocaster guitar is worth £100, 000.", "It's part of a collection dedicated to Jimi Hendrix and sold as part of an auction for £100, 000 at the Hard Rock Cafe in London.", "The guitar was used by Hendrix on tours and in his studio.", "A poem written by Hendrix two weeks after his Monterey Festival appearance was sold for £10, 000."], "qwen2.5:1.5b": ["A 1965 Fender Stratocaster guitar from Jimi Hendrix's collection has been sold for £100,000 at an auction in London featuring memorabilia of the legendary musician."], "qwen2.5:3b": ["A 1965 Fender Stratocaster guitar belonging to Jimi Hendrix fetched £100,000 at an auction in London.", "The sale included a collection of instruments, signed records, and posters collected by fan Bob Terry over his lifetime.", "The majority of the items were sold by Terry to another collector.", "Notable items included a poem written by Hendrix for $10,000 and the band's first single \"Hey Joe,\" signed by all members, for $2,000.", "The auction was hosted by Cooper Owen at the Hard Rock Cafe in London."], "opencoder:1.5b": ["Hendrix fetches a guitar worth 100,000 pounds.", "A guitar owned by Jimi Hendrix has been sold for 100,000 pounds at an auction in London.", "The 19,650 Fender Stratocaster is one of many included in the sale dedicated to the rock legend.", "The vast archive of instruments, signed records and posters were collected by a fan who had become friendly with the star.", "The auction was billed as the biggest collection of Hendrix memorabilia.", "The fan Bob Terry bought it from him at his age of 17.", "Later, he sold it to another collector.", "Hendrix died on Monroeville in 1970 aged 27.", "The 19,650 Fender Stratocaster was used by Hendrix on tour and in his studio.", "A poem written by Hendrix two weeks after his appearance at the Monterey Festival he set light to his guitar went for £10,000.", "The Jimi Hendrix Experience's first single Hey Joe, signed by all the band, was sold for £2,000.", "The sale, held by auctioneers Cooper Owen, was held at the Hard Rock Cafe in London."], "smollm:1.7b": ["The 1965 Fender Stratocaster, a guitar owned by Jimi Hendrix, has been sold for £100,000 at an auction in London.", "The vast archive of instruments, signed records and posters were collected by a dedicated fan who had become friendly with the rock legend.", "The auction was billed as the biggest collection of Hendrix memorabilia to go under the hammer.", "The majority of the items were collected by fan Bob Terry who began collecting at the age of 17.", "He later sold it on to another collector.", "Hendrix, widely considered one of the best guitarists of his era, died of a drug overdose in 1970 at the age of 27.", "The 1965 Fender Stratocaster was used by the musician on tour and in his studio.", "A poem written by Hendrix two weeks after his infamous appearance at the Monterey Festival where he set light to his guitar went for £10,000.", "The Jimi Hendrix Experience's first single Hey Joe, signed by all the band, was sold for £2,000.", "The sale, hosted by auctioneers Cooper Owen, was held at the Hard Rock Cafe in London."], "deepseek-r1:1.5b": ["The 1965 Fender Stratocaster guitar from Jimi Hendrix fetched £100,000 at London's highest auction.", "It was part of a vast collection dedicated to the legendary artist, with Bob Terry collecting many items starting at age 17.", "Hendrix died in 1970 after a drug overdose, though he was performing on tour.", "A poem written two weeks after his Monterey Festival appearance sold for £10,000.", "The Jimi Hendrix Experience's Hey Joe single fetched £2,000.", "The sale took place at the Hard Rock Cafe in London by auctioneers Cooper Owen."], "tinyllama:1.1b": ["Early 1960s Fender guitar fetches £100k as part of Hendrix memorabilia auctioned off, with significant items from Hendrix's estate also included in the sale dedicated to the rock legend.", "The collection includes a number of Jimi Hendrix's guitars, signed records and poster collections signed by fan Bob Terry.", "The collection was sold for over £100k at an auction held by aucctioneeers Cooper Owen in London, making it one of the most significant collections of Hendrix's memorabilia to be sold."], "tinydolphin:1.1b": [" In summary, a well-known guitar from Jimi Hendrix's estate fetched $100,000 during an auction held in London.", "This guitar, known as the \"Hendrix Stratocaster,\" was signed by numerous items belonging to Jimi Hendrix himself or other memorabilia collectors.", "The massive collection of guitars, records, and posters collected by a dedicated fan showcased the iconic artist's extensive work in the music industry."], "phi:2.7b": [" A 1970s Fender Stratocaster belonging to Jimi Hendrix has been sold for £100,000 at an auction in London.", "The guitar had previously belonged to Bob Terry, a dedicated fan of the musician who began collecting in his early teens and eventually sold the collection on to another collector.", "Despite the high price tag, the sale was billed as the biggest collection of Jimi Hendrix memorabilia ever."], "orca-mini:3b": [" A guitar owned by Jimi Hendrix was sold for £100,000 at an auction in London.", "The guitar was from 1965 and was used by Hendrix during his tours and studio sessions.", "It was accompanied by a poem written by Hendrix two weeks after his Monterey Festival appearance where he set fire to his guitar.", "Another item that belonged to Hendrix, a record from his band, The Jimi Hendrix Experience, sold for £2,000.", "The auction, hosted by Cooper Owen, was held at the Hard Rock Cafe in London."], "hermes3:3b": ["Jimi Hendrix 1965 Fender Stratocaster sells for $100,000."], "stablelm-zephyr:3b": ["A 1965 Fender Stratocaster guitar used by Jimi Hendrix was sold for £100,000 at a London auction, along with other guitars, records, and posters dedicated to the rock legend.", "The archive was mostly collected by fan Bob Terry, who began at age 17 and later sold to another collector.", "A poem by Hendrix and a signed single \"Hey Joe\" by The Jimi Hendrix Experience were also sold."], "chatgpt-4o-latest": ["Jimi Hendrix's 1965 Fender Stratocaster was sold for £100,000 at a London auction featuring the largest collection of Hendrix memorabilia.", "The collection, amassed by fan Bob Terry and later sold to another collector, included instruments, signed records, and posters.", "Hendrix, regarded as one of the greatest guitarists, used the Stratocaster on tour and in the studio.", "Other notable items sold included a poem he wrote after his Monterey Festival performance for £10,000 and a signed copy of \"Hey Joe\" for £2,000.", "The auction, hosted by Cooper Owen, took place at the Hard Rock Cafe in London."], "stablelm2:1.6b": ["A rare Fender Stratocaster from Jimi Hendrix's collection sold for £550,000 at a London auction.", "This guitar, along with other instruments, signed records, and posters, belonged to the rock legend's vast archive of memorabilia.", "The collector was fan Bob Terry who began collecting at age 24 before selling it.", "Jimi Hendrix died from a drug overdose in 1970 at age 27.", "A poem he wrote after his Monterey Festival appearance sold for £50,0.", "The first single by The Jimi Hendrix Experience, \"Hey Joe,\" signed by all members, was sold for £2,000."], "granite3.1-dense:2b": ["A 1965 Fender Stratocaster guitar once owned by Jimi Hendrix, part of a comprehensive collection from a dedicated fan named Bob Terry, fetched £100,000 at an auction in London's Hard Rock Cafe.", "The collection included signed records and posters, with other items selling for £10,000 (Hendrix' poem about his Monterey Festival performance) and £2,000 (the Jimi Hendrix Experience's first single Hey Joe).", "Hendrix, renowned for his exceptional guitar skills, died in 1970 at age 27."]}