{"raw_text": "Musical treatment for Capra film\n \n The classic film It's A Wonderful Life is to be turned into a musical by the producer of the controversial hit show Jerry Springer - The Opera.\n \n Frank Capra's 1946 movie starring James Stewart, is being turned into a £7m musical by producer Jon Thoday. He is working with Steve Brown, who wrote the award-winning musical Spend Spend Spend. A spokeswoman said the plans were in the \"very early stages\", with no cast, opening date or theatre announced.\n \n A series of workshops have been held in London, and on Wednesday a cast of singers unveiled the musical to a select group of potential investors. Mr Thoday said the idea of turning the film into a musical had been an ambition of his for almost 20 years. It's a Wonderful Life was based on a short story, The Greatest Gift, by Philip van Doren Stern. Mr Thoday managed to buy the rights to the story from Van Doren Stern's family in 1999, following Mr Brown's success with Spend Spend Spend. He later secured the film rights from Paramount, enabling them to use the title It's A Wonderful Life.\n", "llama3.2:1b": ["The classic film \"It's A Wonderful Life\" is to be turned into a musical by producer Jon Thoday, working in collaboration with writer Steve Brown and producer Jon Thoday's company.", "The plan involves a series of workshops in London, with plans announced for a cast and opening date, but no details yet."], "llama3.2:3b": ["It's A Wonderful Life is being turned into a musical by producer Jon Thoday and writer Steve Brown, based on Frank Capra's 1946 film starring James Stewart.", "Plans are in early stages with no cast or theatre announced."], "gemma2:2b": ["A musical adaptation of the classic film \"It's a Wonderful Life\" is being developed by producer Jon Thoday in collaboration with Steve Brown, creator of the award-winning musical \"Spend Spend Spend.\"", "The project is still in its early stages and no details about cast, date or theatre have been announced.", "The musical adaptation was inspired by Philip van Doren Stern's short story \"The Greatest Gift\" and secured rights from both the author's family and Paramount Pictures."], "qwen2.5:0.5b": ["Jerry Springer's controversial hit show is to be turned into a musical after Frank Capra's classic 1946 film It's A Wonderful Life was adapted for the stage by Jon Thoday.", "The production is being done with Steve Brown and its cast of singers unveiled in London.", "A series of workshops have been held, but the full plans are not yet official."], "qwen2.5:1.5b": ["Frank Capra's 1946 movie \"It's A Wonderful Life\" is being turned into a £7m musical by producer Jon Thoday and writer Steve Brown, working with former \"Jerry Springer\" star singer James Stewart.", "The project has been in the early stages for almost 20 years, with workshops held in London and an undisclosed cast yet to be announced.", "Capra's original short story was adapted into the film starring James Stewart."], "qwen2.5:3b": ["The classic 1946 Frank Capra film \"It's a Wonderful Life\" is being turned into a £7m musical by producer Jon Thoday.", "Steve Brown, who wrote an award-winning musical, is collaborating on this project.", "The plans are in the early stages with no cast, opening date or theatre announced.", "A cast of singers unveiled the musical to potential investors at a London workshop.", "Thoday has been interested in turning the film into a musical for nearly 20 years and secured the film rights from Paramount after buying the story's rights from Van Doren Stern's family in 1999."], "opencoder:1.5b": ["Musical treatment for Capra film\n\nThe classic film \"It's a Wonderful Life\" is being turned into a musical by the producer of the controversial hit show Jerry Springer - The Opera.", "Frank Capra's 19th movie starring James Stewart was turned into a $7 million musical by Jon Thoday, working with Steve Brown who wrote the acclaimed musical Spend Spend Spend.", "A spokeswoman said that plans were in the \"very early stages\" and no cast, opening date or theatre announced.", "A series of workshops were held in London, and on Wednesday a casting team unveiled the musical to a select group of potential investors.", "Mr Thoday's ambition was for almost 20 years, having been focusing on turning the film into a musical based on a short story, The Greatest Gift, by Philip van Doren Stern.", "After acquiring Van Doren's rights, he managed to secure the rights from Paramount, enabling them to use the title \"It's A Wonderful Life\".", "This process is an ambitious undertaking by Capra and his team for almost 20 years, bringing a unique musical treatment to the film."], "smollm:1.7b": ["The musical treatment for Capra film is a project that aims to transform the classic film into a musical production by the producer of the popular TV show Jerry Springer - The Opera.", "The project involves working with Steve Brown, who wrote the award-winning musical Spend Spend Spend, and a team of producers and musicians.", "The idea of turning the film into a musical was first proposed by Frank Capra in 1946, but it has taken several years to develop the concept further.", "The project is expected to be completed within the next few months, with no cast or opening date announced at this stage.", "However, a series of workshops have been held in London and on Wednesday a cast of singers unveiled the musical to a select group of potential investors.", "The idea of turning the film into a musical was first proposed by Frank Capra in 1946, but it has taken several years to develop the concept further.", "The project involves working with Steve Brown, who wrote the award-winning musical Spend SpendSpend.", "Mr Thoday managed to buy the rights to the story from Van Doren Stern's family in 1999, following Mr Brown's success with Spend SpendSpend.", "He later secured the film rights from Paramount, enabling them to use the title It's A Wonderful Life.", "The musical treatment for Capra film aims to transform the classic film into a musical production by the producer of the popular TV show Jerry Springer - The Opera.", "The project involves working with Steve Brown, who wrote the award-winning musical SpendSpendSpend, and a team of producers and musicians.", "The idea of turning the film into a musical was first proposed by Frank Capra in 1946, but it has taken several years to develop the concept further.", "The project is expected to be completed within the next few months, with no cast or opening date announced at this stage.", "However, a series of workshops have been held in London and on Wednesday a cast of singers unveiled the musical to a select group of potential investors.", "The idea of turning the film into a musical was first proposed by Frank Capra in 1946, but it has taken several years to develop the concept further."], "deepseek-r1:1.5b": ["The classic film \"It's A Wonderful Life\" (1946), starring James Stewart, will be turned into a £7m musical by producer Jon Thoday for Jerry Springer - The Opera.", "Based on Philip van Doren's short story \"The Greatest Gift,\" which was written by Steve Brown, the plans were in early stages with no cast or opening date announced.", "Thoday mentioned this ambitious project had been his vision since 20 years earlier.", "The film rights were acquired from Van Doren Stern in 1999 and later by Paramount, allowing their use of its title It's A Wonderful Life.", "A workshop was held in London on Wednesday, where the cast unveiled the musical to potential investors."], "tinyllama:1.1b": ["The classic film It's A Wonderful Life will be turned into a musical by the producer of Jerry Springer - The Opera.", "It is reported that Frank Capra's 1946 movie starring James Stewart will become a £7m musical, with producer Jon Thoday working with songwriter Steve Brown to develop a cast for the stage adaptation.", "The plans are in the \"very early stages\", and no cast or opening date has been announced yet.", "A series of workshops have taken place in London, and an invite-only casting announcement is set for Wednesday.", "Despite being in the early stages, Mr Thoday has previously expressed his ambition to turn the film into a musical for almost 20 years.", "It's a Wonderful Life was based on a short story by Philip van Doren Stern, who later secured the film rights from Paramount upon the success of Spend Spend Spend.", "The musical is part of Mr Thoday's vision to revive classic films into stage productions for theatre audiences."], "tinydolphin:1.1b": [" The classic film It's a Wonderful Life is being turned into a musical by the producer of the controversial hit show Jerry Springer - The Opera.", "Frank Capra's 1946 movie starring James Stewart will be transformed into an £7 million musical.", "The project has been in development for several years, with no cast or opening date announced yet.", "It is being produced by producer Jon Thoday, who worked on another successful musical - the Tony Award-winning Spend Spend Spend, which was performed at London's Apollo Theatre from 2014 to 2016.", "A series of workshops took place in London earlier this week, with a group of potential investors attending.", "They were shown a sample of the musical and were encouraged to express their interest in the project by offering to fund it.", "Mr Thoday said he had been working on this idea for almost 20 years, and the opportunity to bring Frank Capra's classic story to life through music was something he couldn't pass up."], "phi:2.7b": [" Producer Jon Thoday is turning classic movie It's A Wonderful Life into a £7m musical by working with Steve Brown who wrote the award-winning show Spend Spend Spend.", "They have held workshops in London and will announce cast, opening date, theatre soon.", "The plan has been an ambition for almost 20 years, and they secured film and story rights in 1999 and 2019 respectively."], "orca-mini:3b": [" The classic film \"It's A Wonderful Life\" is being turned into a musical by producer Jon Thoday, who produced the controversial hit show \"Jerry Springer - The Opera\".", "No casting, opening date or theatre have been announced yet.", "The musical was revealed during workshops in London and is intended to be a £7 million production."], "hermes3:3b": ["It's a Wonderful Life musical (by Frank Capra, $7m), produced by Jon Thoday & Steve Brown; based on their workshops & nearly 20y old ambition."], "stablelm-zephyr:3b": ["A producer named Jon Thoday, who worked on a show called Jerry Springer - The Opera, wants to turn the classic movie It's A Wonderful Life into a musical.", "He is working with someone named Steve Brown to create the music and is in the very early planning stages.", "They have already held workshops in London and showed a musical version of the movie to potential investors."], "chatgpt-4o-latest": ["The classic film It's A Wonderful Life is being adapted into a £7m musical by producer Jon Thoday, known for Jerry Springer - The Opera.", "Thoday is collaborating with Steve Brown, writer of Spend Spend Spend.", "The project is in early stages, with no cast, opening date, or theatre announced.", "Workshops have been held in London, and a cast performed for potential investors.", "Thoday had wanted to adapt the film for nearly 20 years, acquiring the story rights in 1999 and later securing the film rights from Paramount."], "stablelm2:1.6b": ["\"It's a Wonderful Life\" film is being turned into a £7m musical by producer Jon Thoday and composer Steve Brown, inspired by Frank Capra's classic movie starring James Stewart.", "The production began as an idea of Thoday for several years and has progressed to include workshops in London and a preview performance for potential investors.", "Composer Steve Brown wrote the award-winning musical Spend Spend Spend before adapting it for this project.", "It's a Wonderful Life was based on a short story by Philip van Doren Stern, with Paramount film rights securing the title's use in the final production."], "granite3.1-dense:2b": ["Producer Jon Thoday, known for controversial musical Jerry Springer - The Opera, plans a £7m adaptation of Frank Capra's 1946 film \"It's A Wonderful Life\" into a stage production.", "This project has been in the works for nearly two decades, with Thoday acquiring the rights to the short story basis of the film from Philip van Doren Stern's family in 1999 and the film rights from Paramount.", "Collaborating with Steve Brown, who created the award-winning musical \"Spend Spend Spend,\" Thoday has held workshops in London and recently presented the concept to potential investors."]}