{"raw_text": "TV presenter Deeley drops CD:UK\n \n Cat Deeley has resigned as host of ITV1's Saturday morning children's music show CD:UK after six years.\n \n The 28-year-old host who also presents Stars In Their Eyes said she wanted to concentrate on new television projects. \"I've had a great few years, met some really incredible people and been given some wonderful opportunities,\" the presenter said. Deeley will host her last show on 5 March and guest presenters will stand in until a replacement is found.\n \n The long-running presenter said: \"I would like to take this opportunity to thank the CD:UK team and all the viewers that have watched, supported the show and let me gate crash their Saturday morning. \"Whilst obviously I am really sad to say goodbye, I'm immensely excited about the future.\" Deeley formerly co-hosted SM:tv, the children's show which airs before CD:UK on a Saturday morning, alongside hit presenters Ant and Dec. She won a Children's Bafta award for best presenter in December 2001 and also fronted BBC One's Fame Academy series.\n", "llama3.2:1b": ["Deeley has resigned as host of ITV1's children's music show CD:UK after six years.", "She will host her final episode on March 5, with guest presenters taking over until a replacement is found.", "Deeley leaves the show at the end of its current run and had previously co-hosted another Saturday morning children's program SM:tv alongside Ant and Dec."], "llama3.2:3b": ["Cat Deeley has resigned as host of ITV1's CD:UK after six years to focus on new projects, hosting her last show on March 5 with guest presenters until a replacement is found."], "gemma2:2b": ["Cat Deeley is leaving her role as host of ITV1's CD:UK after six years.", "She will host her last show on March 5th, and guest presenters will take over until a replacement is found.", "Deeley thanked viewers and the team for their support during her time on the show, and expressed excitement about future opportunities."], "qwen2.5:0.5b": ["Deeley is leaving ITV to host her last show on 5 March.", "The presenter had previously co-hosted SM:tv, the children’s show that aired before CD:UK on Saturday mornings.", "She won a Children's Bafta award for best presenter in December 2001 and also fronted BBC One's Fame Academy series."], "qwen2.5:1.5b": ["Cat Deeley resigns as host of ITV1's Saturday morning children's music show CD:UK after six years, hosting her final broadcast on March 5th before replacing with guest presenters until a replacement is found."], "qwen2.5:3b": ["Cat Deeley resigns as host of ITV1's children's music show CD:UK after six years, citing her desire to focus on new television projects.", "She will hand over her last show on March 5th, with guest presenters filling in until a replacement is found.", "Deeley thanked the team and viewers for their support.", "Prior to CD:UK, she co-hosted SM:tv alongside Ant & Dec and won a Children's Bafta award."], "opencoder:1.5b": ["Deeley has resigned as host of ITV1's Saturday morning children's music show CD:UK after six years.", "The 28-year-old host who also presents Stars In Their Eyes said she wanted to concentrate on new television projects.", "\"I've had a great few years, met some really incredible people and been given some wonderful opportunities,\" the presenter said.", "Deeley will host her last show on 5 March and guest presenters will stand in until a replacement is found.", "The long-running presenter said: \"I would like to take this opportunity to thank the CD:UK team and all the viewers that have watched, supported the show and let me gate crash their Saturday morning.", "Whilst obviously I am really sad to say goodbye, I'm immensely excited about the future.\""], "smollm:1.7b": ["Deeley has resigned as host of ITV1's Saturday morning children's music show CD:UK after six years."], "deepseek-r1:1.5b": ["Deeley has resigned as host of ITV1's CD:UK, after six years.", "She co-hosted SM:tv before joining CD:UK and won a Children's Bafta for best presenter in 2001.", "She will host her last show on 5 March and guest presenters from Stars In Their Eyes will stand in until a replacement is found."], "tinyllama:1.1b": ["TV presenter Cat Deeley has resigned from the children's music show CD:UK after six years, citing personal reasons for her decision.", "She will host her last show on 5 March before guest presenters are in place until a replacement is found.", "The long-running presentaor said she was grateful for the support and opportunities provided by the show over the past six years, but \"I'm immensely excited about the future\".", "Deeley presented CD:UK alongside Ant & Dec on BBC One before also hosting the children's show Fame Academy series, which won her a Children's Bafta award in December 2001."], "tinydolphin:1.1b": [" The UK-based television host Cat Deeley has decided to exit from her Saturday morning children's music show, CD:UK, after six years on air.", "The 28-year-old Cat Deeley had been with ITV1 since 2016, hosting the children's show before launching Stars In Their Eyes, a new talent competition.", "She announced her departure from the show on March 5th and will take up new television projects until an announcement is made regarding her replacement."], "phi:2.7b": [" Deeley has resigned as host of ITV1's children's music show CD:UK after six years to concentrate on new television projects, with guest presenters stepping in until a replacement is found.", "She will be hosting her last show on March 5th and will not return for the foreseeable future.", "Deeley previously co-hosted SM:tv alongside Ant and Dec and won a Children's Bafta award in 2001 for best presenter."], "orca-mini:3b": [" TV presenter Deeley has left her role as host of ITV1's Saturday morning children's music show CD:UK after six years."], "hermes3:3b": ["Deeley resigns as CD:UK host after 6 years, plans to concentrate on new TV projects.", "Will host last show on Mar 5th."], "stablelm-zephyr:3b": ["Cat Deeley has resigned as host of ITV1's children's music show CD:UK after six years to focus on new television projects.", "She will host her last show on March 5th, with guest presenters stepping in until a replacement is found.", "Deeley thanked the team and viewers for their support during her time hosting the show."], "chatgpt-4o-latest": ["Cat Deeley has resigned as host of ITV1's CD:UK after six years to focus on new television projects.", "She expressed gratitude for her experiences and will present her final show on 5 March, with guest presenters filling in until a replacement is found.", "Deeley, who previously co-hosted SM:tv with Ant and Dec and won a Children's Bafta in 2001, said she is sad to leave but excited for the future."], "stablelm2:1.6b": ["TV presenter Cat Deeley has resigned as host of ITV1's CD:UK after six years.", "She will guest present during the search for a new replacement.", "Deeley previously co-hosted SM:tv alongside Ant and Dec before joining CD:UK.", "She won a Children's Bafta award for best presenter in 2008 and has hosted other shows like BBC One's Fame Academy series."], "granite3.1-dense:2b": ["Cat Deeley, 28, has stepped down as the host of ITV1's CD:UK after six years to focus on new television projects.", "Her last show is scheduled for 5 March; guest presenters will fill in until a replacement is appointed.", "Deeley, who previously co-hosted SM:tv with Ant and Dec, also won a Children's Bafta for best presenter in 2001 and fronted the BBC One series Fame Academy.", "She expressed gratitude to CD:UK team and viewers, expressing both sadness at leaving and excitement about her future endeavors."]}