{"raw_text": "Church urges Nelly show boycott\n \n Church ministers are trying to prevent rapper Nelly performing in Arkansas, saying they do not want his \"vile and filthy lyrics\" in their town.\n \n More than 20 Jonesboro ministers urged music fans to boycott Nelly's 12 March concert at Arkansas State University in a bid to have it cancelled. \"Jonesboro is a wonderful city because of what does not come here,\" said the Reverend Adrian Rodgers. But a venue spokesman said more than 5,500 tickets had been sold so far.\n \n Mr Rodgers, of the Fullness of Joy Church, said he was concerned about the rapper's lyrics that include references to drugs, sex and violence, and songs that the minister said were demeaning to women. Ministers were worried that bringing such acts to Jonesboro would lead to problems. \"Tear the tickets up,\" Mr Rodgers said. \"Do not go and do not allow your children to go.\"\n \n Tim Dean, director of the Arkansas State University venue, said ticket sales had been brisk. \"It would appear that with ticket sales over 5,000, many others have expressed their right to find Nelly's music entertaining and worth spending their time and money on,\" he said. Nelly has sold more than 30 million singles and albums worldwide, and in September 2004 simultaneously occupied the number one and two positions in the US albums chart. He has had 12 UK hit singles, including Hot in Herre, Dilemma and recent number one Over and Over.\n", "llama3.2:1b": ["Church ministers are urging Nelly to cancel his March concert at Arkansas State University due to concerns about his lyrics.", "The Reverend Adrian Rodgers from the Fullness of Joy Church said Nelly's music includes references to drugs, sex, and violence, making it unsuitable for their town.", "More than 5,500 tickets have been sold so far, despite concerns that bringing such acts could lead to problems."], "llama3.2:3b": ["Church leaders in Jonesboro, Arkansas are urging a boycott of Nelly's concert at Arkansas State University, citing his \"vile and filthy lyrics\" as a reason to prevent him from performing.", "Despite concerns, over 5,500 tickets have been sold for the event."], "gemma2:2b": ["Reverend Adrian Rodgers and other church ministers in Jonesboro are urging fans to boycott rapper Nelly's concert at Arkansas State University.", "They argue that his lyrics promote drug use, violence, and disrespect towards women and believe it will bring negative consequences to the town.", "Despite protests, over 5,000 tickets have been sold for the concert.", "Nelly has enjoyed international success with numerous hit songs."], "qwen2.5:0.5b": ["Church ministers are trying to prevent rapper Nelly from performing at Arkansas State University.", "Many Jonesboro ministers urged music fans to boycott his concert after he posted vulgar lyrics on his Twitter account.", "More than 5,500 tickets had been sold so far at the concert venue in Jonesboro.", "Mr Rodgers of Fullness of Joy Church was concerned about the lyrics and said that bringing Nelly's acts to Jonesboro would lead to problems for other musicians.", "Tim Dean of Arkansas State University said ticket sales were brisk and many others have expressed their right to enjoy Nelly's music.", "Summarizing this text, we can focus on key ideas like:\n\n- Church ministers trying to stop rapper Nelly from performing\n- Motivation: lyrics that include drug references\n- Jonesboro ministers' advice: boycott the concert\n- More than 5,500 tickets sold at the concert venue\n- Other musicians' support for Nelly's performances"], "qwen2.5:1.5b": ["Church ministers urge Nelly to cancel concert due to concern over lyrics and music's potential negative impact on local community.", "Ministers warn against allowing children to attend event.", "Venue sold out despite concerns about controversial rapper's content."], "qwen2.5:3b": ["Church ministers urge a boycott of Nelly's March 12 concert at Arkansas State University, citing his \"vile and filthy lyrics\" as demeaning to women and containing references to drugs, sex, and violence.", "More than 20 Jonesboro ministers demanded the show be cancelled due to ticket sales exceeding 5,500.", "Reverend Adrian Rodgers from Fullness of Joy Church called for tearing up tickets, while venue director Tim Dean defended sales.", "Nelly has a global music career with numerous hits."], "opencoder:1.5b": ["Church urges Nelly to boycott\n\nNelly show boycot is being held back by several Church ministers trying to prevent her from performing in Arkansas.", "More than 20 Jonesboro city leaders urged fans to boycott the concert at Arkansas State University.", "They expressed concerns about the rapper's lyrics featuring drugs, sex and violence.", "The Reverend Adrian Rodgers of Fullness of Joy Church stated he was concerned about the rappers' lyrics which mention things like drugs, sex and violent songs that the minister said were unsuitable for women.", "Ministers in this city were worried about bringing such acts to Arkansas because they are likely to lead to problems due to its high traffic volume.", "Mr Rodgers said his concerns may be related but it hasn't been a problem yet.", "\"Till tickets have sold up, many others will continue to express their right to boycott Nelly's music,\" he said.", "Tim Dean’s director of the Arkansas State University venue noted the ticket sales are brisk.", "\"It appears there have been several other people expressing their rights to boycott Nelly's music with a high number of tickets sold in recent weeks, indicating their support.\""], "smollm:1.7b": ["The summary should be:\nChurch urges Nelly show boycott\n\nMore than 20 Jonesboro ministers urged music fans to boycott Nelly's 12 March concert at Arkansas State University in a bid to have it cancelled.", "\"Jonesboro is a wonderful city because of what does not come here,\" said the Reverend Adrian Rodgers.", "But a venue spokesman said more than 5,500 tickets had been sold so far.", "Mr Rodgers, of the Fullness of Joy Church, said he was concerned about the rapper's lyrics that include references to drugs, sex and violence, and songs that the minister said were demeaning to women.", "Ministers were worried that bringing such acts to Jonesboro would lead to problems.", "\"Tear the tickets up,\" Mr Rodgers said.", "\"Do not go and do not allow your children to go.\"", "Tim Dean, director of the Arkansas State University venue, said ticket sales had been brisk.", "\"It would appear that with ticket sales over 5,000, many others have expressed their right to find Nelly's music entertaining and worth spending their time and money on,\" he said.", "Nelly has sold more than 30 million singles and albums worldwide, and in September 2004 simultaneously occupied the number one and two positions in the US albums chart.", "He has had 12 UK hit singles, including Hot in Herre, Dilemma and recent number one Over and Over."], "deepseek-r1:1.5b": ["Church ministers are urging Nelly to boycott the concert in Jonesboro due to her lyrics containing references to drugs, sex, and violence.", "The Reverend Adrian Rodgers of the Fullness of Joy Church is concerned about the demeaning nature of his songs for women and has warned fans that attending such an event could lead to issues on Jonesboro.", "Tim Dean noted ticket sales were brisk, with over 5,000 tickets sold so far, suggesting a mix of enthusiasm and concerns about the potential negative impact of Nelly's performance."], "tinyllama:1.1b": ["Church urges Nelly to avoid Arkansas\n\nChurch ministers are calling for rapper Nelly's concert at a venue in Jonesboro, Arkansas, to be cancelled due to his allegedly vulgar lyrics and content deemed \"filthy\" by some.", "More than 20 ministers have urged fans not to attend the event or boycott it outright, while the venue manager has said they hope to continue welcoming Nelly's fans despite the concerns.", "The ministers are worried about his music's demoralizing impact on women and children.", "Tickets for the concert have sold quickly, with more than 5,500 reportedly being bought so far."], "tinydolphin:1.1b": [" In a statement to the press, church ministers urged music fans to boycott rapper Nelly's 12 March concert at Arkansas State University due to his \"vile and filthy lyrics.\"", "The ministers argued that Jonesboro is a great city due to its welcoming atmosphere, but felt it was inappropriate for the venue to host such performances.", "The spokesman for Fullness of Joy Church said he worried about rapper Nelly's lyrics, which include references to drugs, sex, and violence.", "In particular, he mentioned songs that were demeaning towards women, which Mr Rodgers has previously described as \"vile and filthy.\"", "Ministers were urged to tear up their tickets or leave the venue if they did not want to listen to Nelly's music.", "They suggested the concert would lead to potential problems for attendees, who they believed might feel uncomfortable with the rapper's content.", "Tim Dean, who manages the Arkansas State University venue, expressed satisfaction with ticket sales, which he said have been brisk despite being over 5,000 in number.", "Many attendees have applauded Nelly's music, but some fans are considering not attending his concert due to the controversy surrounding his lyrics.", "In summary, church ministers urge their fans to boycott Nelly's concert at Arkansas State University, citing his \"vile and filthy\" lyrics.", "The venue has received a mixed reception, with some attending the event despite their concerns regarding the content of the music."], "phi:2.7b": [" Dozens of Jonesboro ministers have urged fans to boycott Nelly's 12 March concert at Arkansas State University, saying they do not want his \"vile and filthy lyrics\" in their town.", "Mr Rodgers, a minister from Fullness of Joy Church, was particularly concerned about the rapper's lyrics that include references to drugs, sex, and violence, as well as songs that he said were demeaning to women.", "However, more than 5,500 tickets had already been sold for the concert.", "A venue spokesman stated that over 5,000 tickets had been sold so far despite the minister's concerns.", "Mr Dean, director of the university venue, said ticket sales had been brisk and expressed his appreciation for the fans' interest in Nelly's music.", "He also mentioned that over 200,000 copies of one of Nelly's songs were sold simultaneously in 2004."], "orca-mini:3b": [" The text discusses a church's efforts to prevent rapper Nelly from performing in Arkansas by boycotting his concert.", "More than 20 Jonesboro ministers urge music fans to boycott Nelly's concert at Arkansas State University, citing concerns about his \"vile and filthy lyrics\" and demeaning references to women in his songs.", "The venue spokesman says ticket sales have been brisk, with over 5,500 tickets sold so far.", "Tim Dean, director of the Arkansas State University venue, says ticket sales have been brisk, and Nelly has sold more than 30 million singles and albums worldwide.", "He has had 12 UK hit singles, including Hot in Herre, Dilemma, and recent number one Over and Over."], "hermes3:3b": ["Church ministers urge Nelly boycott over \"vile\" lyrics before concert in Arkansas."], "stablelm-zephyr:3b": ["Church ministers are attempting to prevent rapper Nelly from performing in Jonesboro, Arkansas, due to their objection towards his \"vile and filthy lyrics.\"", "More than 20 ministers urged music fans to boycott his March 12 concert at Arkansas State University, concerned that the presence of such acts would lead to problems.", "Despite this, a venue spokesman confirmed that over 5,500 tickets had been sold for the event.", "Nelly has sold over 30 million singles and albums worldwide and has had multiple UK hit singles."], "chatgpt-4o-latest": ["Church ministers in Jonesboro, Arkansas, are urging a boycott of rapper Nelly's 12 March concert at Arkansas State University, citing concerns over his lyrics, which they deem \"vile and filthy\" due to references to drugs, sex, and violence.", "Reverend Adrian Rodgers and over 20 ministers fear the performance could negatively impact the community and are calling on residents to avoid the show.", "Despite their efforts, ticket sales have exceeded 5,500, with venue director Tim Dean noting strong public interest.", "Nelly, a globally successful artist with over 30 million records sold, has had multiple chart-topping hits, including \"Hot in Herre\" and \"Dilemma.\""], "stablelm2:1.6b": ["A group of church ministers in Jonesboro, Arkansas, have urged a boycott against rapper Nelly's upcoming concert citing his \"vile and filthy lyrics.\"", "More than 5,0..\n- Church urges Nelly show boycott\n \nChurch ministers are trying to prevent rapper Nelly from performing in Arkansas.", "They claim that he has \"filthy\" lyrics that should not be allowed in their town.", "More than 100 Jonesboro ministers joined forces with music fans urging Nelly's March concert at the Arkansas State University to be canceled.", "The event was scheduled to have over 5,000 attendees and it seemed unlikely that the show would proceed without facing significant opposition.", "Rev.", "Adrian Rodgers, a Fullness of Joy Church member, expressed concern about Nelly's lyrics which include references to drugs, sex, and violence as well as songs demeaning women.", "These concerns might lead to problems in Jonesboro, according to Rev.", "Rodgers.", "He called for all ticket sales to be stopped, urging people not to attend the concert or let their children go.", "In response to these objections, the director of the Arkansas State University venue expressed that despite opposition from religious leaders, more than 5,000 tickets had already been sold to fans eager to listen to Nelly's music.", "Nelly has sold over a million singles and albums worldwide and in September 2014, his song 4 simultaneously occupied the number one and two positions in the US album charts.", "He also achieved significant success with UK hit singles such as \"Hot in Herre,\" \"Dilemma,\" and recent number one \"Over and Over.\"", "It is noteworthy that despite opposition from religious leaders, Nelly's show went on at the Arkansas State University, which experienced brisk ticket sales of over 5,0"], "granite3.1-dense:2b": ["Jonesboro ministers, led by Reverend Adrian Rodgers, are urging residents to boycott Nelly's concert at Arkansas State University on March 12 due to the rapper's explicit lyrics containing references to drugs, sex, violence, and demeaning content toward women.", "Despite their concerns, over 5,500 tickets have been sold, indicating strong audience interest in Nelly's performance.", "Nelly, a popular artist with millions of fans worldwide, has held top positions on the US albums chart and numerous UK hit singles."]}