{"raw_text": "Rap feud in 50 Cent's G-Unit crew\n \n US rap star 50 Cent has said he has thrown protege The Game out of his G-Unit gang in a feud that has apparently involved two shootings.\n \n In a radio interview on Monday, 50 Cent said the newcomer was disloyal in conflicts with other rappers. A man was shot in the thigh outside New York's Hot 97 studios while 50 Cent was on air. More shots were fired outside his management offices two hours later. 50 Cent appeared on The Game's debut album, which was number one in the US. 50 Cent, whose second album is about to be released after his debut made him one of hip-hop's biggest stars, has been involved in recent rivalries with fellow artists including Fat Joe, Nas and Jadakiss.\n \n He has claimed credit for the success of The Game, who has become the hottest new star on the rap scene. Both were drug dealers and were shot before turning to music.\n \n In an interview with Hot 97 on Saturday, The Game described some of 50 Cent's rivals as \"my friends\" and said he would not turn on them. \"Nas is one of my friends, and Jada's really a homie,\" he said. \"50's beef is 50's beef and I really don't know where all this stems from.\" When 50 Cent appeared on the same station two days later, he said The Game was no longer a member of G-Unit. \"Every record he's selling is based on me being on his record with him,\" he said. When the shooting took place outside the studio, the interview was ended and the rapper was escorted out of the building by security personnel.\n \n An unidentified 24-year-old Los Angeles man is stable with a gunshot wound to the upper thigh. Police say The Game's associates may have heard the interview and gone to the studio, where they confronted 50 Cent's entourage. Officers are also investigating a later shooting in which eight bullets were fired into the door of 50 Cent's management company, Violator. No arrests have been made in relation to either incident. 50 Cent's second album, The Massacre, is released on Thursday, five weeks after The Game's debut, Documentary, went to number one.\n \n Elliott Wilson, editor-in-chief of hip-hop magazine XXL, said the feud would boost publicity for 50 Cent's release. \"It helps him obviously in terms of exposure. You can't ask for better promotion,\" he said. But he added: \"I think he's making more and more enemies. \"You definitely feel like is he doing too much of a Tupac spiral, like me against the world. You bring more people wanting to see you fail.\" Tupac Shakur was shot dead in 1996.\n", "llama3.2:1b": ["50 Cent and The Game have been involved in a feud due to disagreements over loyalty and success within G-Unit.", "On Saturday, The Game was interviewed on Hot 97, where he described some of the other artists as friends and stated that his beef is with Snoop Dogg, not 50 Cent.", "The next day, 50 Cent appeared on the same station to discuss his feud with The Game and announced that The Game would no longer be a member of G-Unit.", "A shooting occurred outside Hot 97 studios, where 24-year-old Los Angeles man is being treated for a gunshot wound.", "Police are investigating two shootings at 50 Cent's management company, Violator.", "The Massacre album by 50 Cent, which was released five weeks ago, has been described as boosting publicity for the rapper due to his involvement in the feud."], "llama3.2:3b": ["50 Cent has thrown protege The Game out of his G-Unit gang amid a feud involving two shootings.", "A man was shot outside New York's Hot 97 studios, and shots were fired again at management offices after The Game's radio interview.", "The Game claimed 50 Cent's rivals as friends, but 50 Cent declared him no longer part of the group.", "An unidentified man was injured in the shooting, and police are investigating another incident targeting 50 Cent's company."], "gemma2:2b": ["50 Cent removed The Game from his G-Unit crew after accusations of disloyalty and shooting incidents.", "The Game denied involvement in conflicts with other artists, while claiming 50 Cent's success came partly from his association with him.", "Police are investigating shootings that took place outside studios.", "An unidentified man was shot in the thigh and an incident occurred at 50 Cent's management company, Violator.", "50 Cent's second album will be released shortly, which may capitalize on the ongoing feud."], "qwen2.5:0.5b": ["50 Cent has thrown out protege The Game from his G-Unit gang.", "A man was shot at New York's Hot 97 studios and two others were shot outside the management offices of 50 Cent's G-Unit crew, who became one of hip-hop's biggest stars.", "Rap star Elliott Wilson said it would help boost publicity for 50 Cent's release."], "qwen2.5:1.5b": ["50 Cent expelled The Game from G-Unit due to a feud that involved shootings and rivalries with other rappers.", "After claiming credit for The Game's success, he later denied the rapper was part of his crew.", "Two shooting incidents occurred near rap studio Hot 97 and management offices, prompting security measures at their site.", "50 Cent released his second album \"The Massacre\" while The Game's debut album peaked at number one.", "The feud is expected to increase his exposure through publicity."], "qwen2.5:3b": ["US rap star 50 Cent has thrown protege The Game out of his G-Unit crew due to alleged disloyalty and involvement in feuds with other rappers, leading to a shooting outside Hot 97 studios where both were present.", "This feud escalated when the studio was stormed by gunmen who fired on G-Unit members.", "Despite acknowledging credit for The Game's success, 50 Cent maintains he is no longer part of G-Unit following their last collaboration.", "Both artists are facing increased scrutiny and potential rivals, with the shooting incidents potentially boosting publicity for 50 Cent’s upcoming album."], "opencoder:1.5b": ["Rap feud in 50 Cent's G-Unit crew\n\nUS rap star 50 Cent has said he has thrown protege The Game out of his G-Unit gang in a feud that has apparently involved two shootings.", "The newcomer was disloyal in conflicts with other rappers.", "A man was shot in the thigh outside New York's Hot 97 studios while 50 Cent was on air.", "More shots were fired outside his management offices two hours later.", "50 Cent appeared on The Game's debut album, which was number one in the US.", "Both of them have been involved in recent rivalries with fellow artists including Fat Joe, Nas and Jadakiss.", "He has claimed credit for the success of The Game, who has become the hottest new star on the rap scene.", "Both were drug dealers and were shot before turning to music.", "An interview with Hot 97 on Saturday, The Game described some of 50 Cent's rivals as \"my friends\" and said he would not turn on them.", "\"Nas is one of my friends, and Jada's really a homie,\" he said.", "\"50’s beef is 50’s beef and I really don’t know where all this stems from.\"", "When 50 Cent appeared on the same station two days later, he said The Game was no longer a member of G-Unit.", "An unidentified 24-year-old Los Angeles man is stable with a gunshot wound to the upper thigh.", "Police say The Game's associates may have heard the interview and gone to the studio, where they confronted 50 Cent’s entourage.", "Officers are also investigating a later shooting in which eight bullets were fired into the door of 50 Cent’s management company, Violator.", "No arrests have been made in relation to either incident.", "Elliott Wilson, editor-in-chief of hip-hop magazine XXL, said the feud would boost publicity for 50 Cent's release.", "“It helps him obviously in terms of exposure.", "You can’t ask for better promotion,” he said.", "But he added: “I think he’s making more and more enemies.", "‘You definitely feel like is he doing too much of a Tupac spiral, like me against the world.", "You bring more people wanting to see you fail.’ Tupac Shakur was shot dead in 1996.”"], "smollm:1.7b": ["50 Cent has said that he has thrown protege The Game out of his G-Unit gang in a feud that has apparently involved two shootings.", "In a radio interview on Monday, 50 Cent said the newcomers were disloyal in conflicts with other rappers.", "A man was shot in the thigh outside New York's Hot 97 studios while 50 Cent was on air.", "More shots were fired outside his management offices two hours later.", "50 Cent appeared on The Game's debut album, which was number one in the US.", "50 Cent has been involved in recent rivalries with fellow artists including Fat Joe, Nas and Jadakiss.", "In an interview with Hot 97 on Saturday, The Game described some of 50 Cent's rivals as \"my friends\" and said he would not turn on them.", "\"Nas is one of my friends, and Jada's really a homie,\" he said.", "\"50's beef is 50's beef and I really don't know where all this stems from.\"", "When 50 Cent appeared on the same station two days later, he said The Game was no longer a member of G-Unit.", "\"Every record he's selling is based on me being on his record with him,\" he said.", "When the shooting took place outside the studio, the interview was ended and the rapper was escorted out of the building by security personnel.", "An unidentified 24-year-old Los Angeles man is stable with a gunshot wound to the upper thigh.", "Police say The Game's associates may have heard the interview and gone to the studio, where they confronted 50 Cent's entourage.", "Officers are also investigating a later shooting in which eight bullets were fired into the door of 50 Cent's management company, Violator.", "No arrests have been made in relation to either incident.", "Elliott Wilson, editor-in-chief of hip-hop magazine XXL, said the feud would boost publicity for 50 Cent's release.", "\"It helps him obviously in terms of exposure.", "You can't ask for better promotion,\" he said.", "But he added: \"I think he's making more and more enemies.", "You definitely feel like is he doing too much of a Tupac spiral, like me against the world.", "You bring more people wanting to see you fail.\"", "Tupac Shakur was shot dead in 1996."], "deepseek-r1:1.5b": ["The G-Unit rap star 50 Cent is involved in a feud with The Game, which includes two shooting incidents.", "A man was shot in the thigh outside New York's Hot 97 studios while 50 Cent was on air (MID-NIGHT SHOWS, 10:30 AM EDT).", "Two hours later, more shots were fired outside his management offices, and security arrived at The Game's studio after the incident.", "50 Cent described some of his rivals as \"friends,\" but he denied turning on them.", "He also mentioned that The Game was no longer a member of G-Unit two days later.", "Police are investigating another shooting in 50 Cent's management company, Violator, where eight bullets were fired into the door during the incident.", "No arrests have been made, and the second album by 50 Cent, The Massacre, is set for release five weeks after The Game's debut.", "Elliott Wilson notes that 50 Cent's promotion has been boosted by the feud, while he thinks him inducting more people may be due to the tension caused by his rivalries."], "tinyllama:1.1b": ["The rap star 50 Cent has disassociated himself from newcomer The Game after a series of conflicts between them and other rappers, including JaDaKiSS and FaT Joe.", "50 Cent claimed credit for The Game's success on the hip-hop scene but The Game claims he is now a \"friend\" of his.", "In the last few days, The Game was involved in rivalries with some of 50 Cent's famous rivals like Nas and JaDaKiSS, according to an interview with Hot 97 radio station.", "Following the shooting of two G-Unit members, including Game's associate, 50 Cent's entourage were confronted by police while they were inside the studio.", "Both 50 Cent and The Game claimed that the firearm was accidentally discharged, but an unidentified man later succumbed to a gunshot wound to his upper thigh outside their studio on Monday morning (19th February).", "The episode comes amid recent rivalries between 50 Cent and rappers like FaT Joe and Nas, both of whom were shot before turning to music."], "tinydolphin:1.1b": [" The feud between US rap star 50 Cent and his protege The Game has reportedly involved two shootings, according to a report by hip-hop magazine XXL.", "The conflict started when 50 Cent disbanded The Game's G-Unit gang, which was formed by the rapper and his associates.", "In a recent radio interview, 50 Cent claimed that The Game was disloyal to other rappers and accused him of being involved in rivalries with other artists.", "He also mentioned that he had credited The Game for his success and that they were both friends before the feud.", "The Game's associates may have heard the interview, leading to the confrontation outside New York's Hot 97 studios.", "Later, officers were called in after eight bullets were fired into the door of 50 Cent's management company.", "The feud between 50 Cent and The Game has boosted publicity for The Massacre, his second album, released on Thursday.", "Elliott Wilson, editor-in-chief of hip-hop magazine XXL, believes that the conflicts have helped to promote exposure for the album.", "\"It helps him obviously in terms of exposure,\" he said.", "\"You can't ask for better promotion.\""], "phi:2.7b": [" 50 Cent has claimed The Game as one of his gang members after a feud that involved two shootings.", "The Game's debut album topped the US charts and he has been involved in rivalries with other rappers.", "In an interview, The Game described himself as not turning on 50 Cent or any of his rivals.", "However, he was shot in the thigh and security removed him from the studio during another shooting at his management company.", "No arrests have been made in relation to these incidents."], "orca-mini:3b": [" The text contains information about a feud between rap stars 50 Cent and The Game, involving two shootings outside their management companies.", "A man was shot in the thigh and 8 bullets were fired into 50 Cent's management company.", "Both incidents are linked to 50 Cent's radio interview on a hip-hop magazine's website in which he announced throwing his protege out of his G-Unit crew in a feud that involves rivalries with other artists like Fat Joe, Nas and Jadakiss.", "50 Cent's second album is released this Thursday, five weeks after The Game's debut, and the feud is expected to boost his publicity.", "However, some people feel like he is doing too much of a Tupac spiral, creating tension among rap artists."], "hermes3:3b": ["50 Cent's G-Unit crew rap feud\n- The Game was kicked out by 50 Cent\n- Two shootings occurred during conflicts between them\n- Both were former drug dealers turned rappers\n- The Game described rival artists as friends, but 50 Cent no longer considers him part of G-Unit"], "stablelm-zephyr:3b": ["Rap star 50 Cent expelled The Game from his G-Unit gang due to disloyalty during a feud that involved two shootings.", "A man was shot outside New York's Hot 97 studios while 50 Cent was on air, with additional shots fired outside his management offices later.", "Both artists were once drug dealers and had been shot before turning to music.", "The feud between 50 Cent and The Game gained significant attention, potentially boosting publicity for 50 Cent's second album, The Massacre.", "However, some believe this may lead to more enemies and compare the situation to Tupac Shakur's spiral."], "chatgpt-4o-latest": ["50 Cent has expelled The Game from his G-Unit crew, citing disloyalty in conflicts with other rappers.", "The feud has led to two shootings—one outside Hot 97 studios during 50 Cent's radio interview and another at his management office.", "The Game, whose debut album topped the charts with 50 Cent's involvement, refused to take sides in 50 Cent's rivalries.", "50 Cent claimed credit for The Game's success and dismissed him from G-Unit.", "Police are investigating the shootings, with no arrests made.", "The feud coincides with the release of 50 Cent's second album, The Massacre, which some believe benefits from the publicity, though concerns arise about him making more enemies, drawing comparisons to Tupac Shakur."], "stablelm2:1.6b": ["Rap artist Biggie (also known as Cypress Cent) expelled Game from his G-Unit crew after claims Game disloyal among rival artists.", "Both were former drug dealers, with Game's debut album selling well despite Biggie's comments about his rival artists.", "The feud involved two shootings outside music studios and management offices.", "Game initially appeared on Biggie's debut album that became number one in US charts.", "Recently, Biggie claimed credit for Game's success.", "The shooting incidents may have been the result of confrontations between Game's associates and Biggie's entourage at a radio station.", "Both artists continue to be involved in rivalries with other hip-hop stars like Nas and Jadakiss."], "granite3.1-dense:2b": ["50 Cent, a prominent US rapper, expelled his protege The Game from G-Unit due to disloyalty during a feud involving two shootings.", "These incidents occurred after The Game's appearance on 50 Cent's radio interview, where he named fellow artists as friends.", "An unidentified 24-year-old was shot in the thigh outside Hot 97 studios following this interview, and later, eight bullets were fired into 50 Cent's management company.", "No arrests have been made.", "The Game's debut album, Documentary, had recently topped the US charts.", "50 Cent's upcoming second album, The Massacre, is set for release five weeks after The Game's success.", "Experts suggest this feud could enhance 50 Cent's publicity but also increase his enemies, drawing parallels to Tupac Shakur's \"me against the world\" narrative."]}