{"raw_text": "Prodigy join V Festival line-up\n \n Essex act Prodigy are to headline the second stage at this year's V Festival, joining main stage headliners Scissor Sisters and Franz Ferdinand.\n \n The event, which is in its 10th year, will be held at two venues - Hylands Park in Essex and Weston Park in Staffordshire on 20 and 21 August. Meanwhile, rock veterans New Order have joined the T in the Park line-up alongside Athlete and Green Day. The Manchester band will play on 9 July at Scotland's biggest festival. It will be their debut performance at the music event which is held over the weekend of 9 and 10 July in Balado near Kinross. Other bands at the sold-out festival include Queens of the Stone Age, The Killers, Keane, The Streets and Foo Fighters.\n \n A month later at the V Festival, Prodigy will play at Weston Park on Saturday 20 August and Hylands Park on Sunday 21 August and the Chemical Brothers vice versa. It will be the Chemical Brothers' only UK festival performance of the year. V festival director Bob Angus said: \"With the Prodigy and the Chemical Brothers now confirmed to headline the second stage, we are headed for a really stellar line-up. \"We pride ourselves on putting on an unbeatable live music experience and V Festival 2005 will not disappoint.\" Tickets for the V festival go on sale on Friday 11 March.\n", "llama3.2:1b": ["Prodigy join V Festival lineup with Scissor Sisters and Franz Ferdinand as headliners.", "New Order also joins in at T in the Park, alongside Athlete and Green Day.", "Prodigy perform at Weston Park on August 20-21, while Chemical Brothers take over on the other side of town on those days."], "llama3.2:3b": ["Prodigy join V Festival line-up as headliner alongside Scissor Sisters and Franz Ferdinand, with New Order also joining T in the Park.", "Prodigy perform at V Festival's second stage on August 20-21, while Chemical Brothers headline the same day but at a different venue."], "gemma2:2b": ["Prodigy will headline the second stage at V Festival, joining main stage headliners Scissor Sisters and Franz Ferdinand.", "New Order are joining T in the Park's lineup, playing on July 9th.", "Other notable acts include Queens of the Stone Age, The Killers, Keane, The Streets, and Foo Fighters.", "The Chemical Brothers will also headline at V Festival, performing at Weston Park on Saturday, August 20th, and Hylands Park on Sunday, August 21st.", "Tickets go on sale on March 11th."], "qwen2.5:0.5b": ["Prodigy's lineup heads for V Festival at Hylands Park in Essex and Weston Park in Staffordshire, playing two nights over eight dates from August 20-21.", "They will be joined by rock veterans New Order and Manchester band Queens of the Stone Age.", "A month later, Prodigy will headline the second stage, with the Chemical Brothers opposite them."], "qwen2.5:1.5b": ["Prodigy will headline the second stage at this year's V Festival, joining Scissor Sisters and Franz Ferdinand.", "The event takes place in Hylands Park and Weston Park over two days in August.", "New Order will perform at T in the Park, while Queens of the Stone Age, The Killers, Keane, The Streets, and Foo Fighters are also part of the lineup.", "Prodigy's performance is their only UK festival appearance for 2005."], "qwen2.5:3b": ["Prodigy join main stage headliners Scissor Sisters and Franz Ferdinand at this year's V Festival, taking place in two venues - Hylands Park in Essex and Weston Park in Staffordshire from 20-21 August.", "Rock veterans New Order perform alongside Athlete and Green Day at the T in the Park festival.", "The Chemical Brothers will be the only UK festival performers for the year, playing at both V Festival venues on consecutive days.", "Bob Angus of V Festival says it is headed for a \"really stellar line-up\" with confirmed headliners.", "Tickets go on sale from March 11."], "opencoder:1.5b": ["The summary of the text can be obtained by removing all extraneous details, explanations, and reasoning processes.", "Here is a summarized version of the provided text:\n\n\"Prodigy join V Festival line-up at two venues - Hylands Park in Essex and Weston Park in Staffordshire on 20 and 21 August.", "Meanwhile, rock veterans New Order have joined the T in the Park line-up alongside Athlete and Green Day.", "The Manchester band will play on 9 July at Scotland's biggest festival.", "They will also conduct their debut performance at the music event which is held over the weekend of 9 and 10 July in Balado near Kinross.", "Other bands at the sold-out festival include Queens of the Stone Age, The Killers, Keane, The Streets and Foo Fighters.", "At the V Festival, Prodigy will play at Weston Park on Saturday 20 August and Hylands Park on Sunday 21 August and vice versa.", "The Chemical Brothers' only UK festival performance of the year.\""], "smollm:1.7b": ["The summary should be:\nProdigy join V Festival line-up\n\nThis summary captures the main ideas of the original text, including the key information about the two venues and the bands that will perform at the event.", "The summary is concise and to the point, without any additional explanations or details."], "deepseek-r1:1.5b": ["Prodigy is set to join the second-stage lineup of the V Festival, joining Scissor Sisters and Franz Ferdinand.", "The event will take place at Hylands Park in Essex on Saturday, August 20th, and Weston Park in Staffordshire on Sunday, August 21st.", "Other bands include New Order, Athlete, Green Day, and Manchester's band performing at the T in the Park.", "A month later, Prodigy will perform again at the V Festival, with their vice versa, and they're confirmed for another UK festival.", "Tickets are on sale from March 11th."], "tinyllama:1.1b": ["Prodigy, who have joined New Order and Green Day at T in the Park this summer, will be headlining the second stage of this year's V Festival, which is taking place at two venues - Hylands Park in Essex and Weston Park in Staffordshire on 20 August.", "Meanwhile, Prodigy will perform a headline slot at V Festival on Saturday 20 August while Chemical Brothers will be closing out the festival's second stage on Sunday 21 August.", "Other notable acts confirmed for the main stage include Queens of the Stone Age, The Killers, Keane, The Street and Foo Fighters.", "Prodigy headline Hylands Park on Saturday 20 August and Weston Park on Sunday 21 August, while Chemical Brothers perform at Weston Park on Sunday 21 August only.", "Tickets for V Festival go on sale on Friday 11 March."], "tinydolphin:1.1b": [" Prodigy, a highly anticipated concert event, has secured major spots on the second stage at this year's V Festival, which takes place August 20 and 21 in Hylands Park and Weston Park in Essex, England.", "The iconic event is held over two weekends each summer, attracting millions of festival-goers from around the world.", "Prodigy, a popular Essex band, will join forces with main stage headliners Scissor Sisters and Franz Ferdinand to create the second stage's top attraction.", "New Order, an acclaimed British rock band that has played at T in the Park since its inaugural year, has secured a spot on the bill as well.", "The festival is set to take place from July 9th to 10th in Scotland and features headliners such as Queens of the Stone Age, The Killers, Keane, The Streets, and Foo Fighters.", "The event will also see Prodigy perform at Weston Park on Saturday 20th August, while Hylands Park on Sunday 21st August.", "V Festival director Bob Angus has expressed excitement about this year's lineup, stating that it will provide an unforgettable live music experience for festival-goers.", "Tickets are scheduled to go on sale March 11th at a price of £75 each, but fans can secure VIP packages or meet and greet experiences starting at £200."], "phi:2.7b": [" Prodigy is set to headline the second stage at this year's V Festival in Hylands Park, Essex, with other headliners including Scissor Sisters and Franz Ferdinand.", "New Order will also join T in the Park in Staffordshire.", "The Chemical Brothers are set to play two shows at the festival later in May, after playing a sold-out performance in Scotland.", "V Festival director Bob Angus is confident that this year's line-up will be unbeatable, with fans able to purchase tickets on Friday March 11th."], "orca-mini:3b": [" Prodigy will headline the second stage at this year's V Festival, joining main stage headliners Scissor Sisters and Franz Ferdinand.", "They will perform at Weston Park on Saturday 20 August and Hylands Park on Sunday 21 August."], "hermes3:3b": ["Prodigy, Scissor Sisters, Franz Ferdinand to headline V Festival; New Order joins T in the Park line-up."], "stablelm-zephyr:3b": ["Prodigy is headlining the second stage at V Festival, joining main stage headliners Scissor Sisters and Franz Ferdinand.", "The event will be held at Hylands Park in Essex and Weston Park in Staffordshire on 20 and 21 August respectively.", "Rock veterans New Order have joined T in the Park line-up on 9 July.", "Other bands performing at the festival include Queens of the Stone Age, The Killers, Keane, The Streets, and Foo Fighters.", "Prodigy will play at Weston Park and Hylands Park on 20 and 21 August, while the Chemical Brothers will perform at the same venues the following weekend.", "V Festival director Bob Angus stated that the line-up is headed for a \"really stellar\" performance, with tickets going on sale from 11 March."], "chatgpt-4o-latest": ["Prodigy will headline the second stage at this year's V Festival, joining main stage acts Scissor Sisters and Franz Ferdinand.", "The festival, celebrating its 10th year, will take place on 20-21 August at Hylands Park in Essex and Weston Park in Staffordshire.", "Meanwhile, New Order will debut at Scotland's T in the Park on 9 July, alongside Athlete and Green Day.", "Other acts at the sold-out festival include Queens of the Stone Age, The Killers, Keane, The Streets, and Foo Fighters.", "At V Festival, Prodigy will perform at Weston Park on 20 August and Hylands Park on 21 August, with the Chemical Brothers playing the opposite schedule in their only UK festival appearance of the year.", "V Festival director Bob Angus promises a stellar line-up, with tickets going on sale on 11 March."], "stablelm2:1.6b": ["Prodigy headlines the second stage at V Festival alongside Scissor Sisters, Franz Ferdinand, and other acts like The Killers, Queens of the Stone Age, Foo Fighters, Athlete, New Order, Green Day, and The Streets.", "Prodigy also performs at Weston Park and Hylands Park in August.", "V Festival director Bob Angus is excited about this year's lineup as it will be a \"really stellar line-up.\"", "Tickets for the festival go on sale March 5th."], "granite3.1-dense:2b": ["Prodigy has been added to this year's V Festival line-up as the second stage headliner, alongside main stage acts Scissor Sisters and Franz Ferdinand.", "The festival, in its 10th year, will take place at Hylands Park in Essex on 20 August and Weston Park in Staffordshire on 21 August.", "Meanwhile, New Order is set to make their T in the Park debut on 9 July, playing alongside Athlete and Green Day.", "Other notable acts at T in the Park include Queens of the Stone Age, The Killers, Keane, The Streets, and Foo Fighters.", "At V Festival, Prodigy will perform at Weston Park on Saturday 20 August and Hylands Park on Sunday 21 August, while the Chemical Brothers will headline their respective stages on those same days.", "This will be the Chemical Brothers' sole UK festival appearance in 2005.", "V Festival director Bob Angus expressed confidence in delivering an exceptional live music experience for attendees.", "Tickets for both events go on sale on Friday, March 11."]}