{"raw_text": "Singer Ian Brown 'in gig arrest'\n \n Former Stone Roses singer Ian Brown was arrested after a fight during a concert in San Francisco on Tuesday, his spokesman has said.\n \n A fan jumped on stage and attacked the singer, who then became involved in a fracas with a security guard, Fiction Records spokesman Paul Smernicki said. He said Brown was arrested at his hotel after the show at the Great American Music Hall but released without charge. San Francisco police said they could find no record of his arrest. Mr Smernicki said he had been told a fan \"rugby-tackled\" the singer during the gig, which resulted in \"pushing and shoving\".\n \n Brown then got into a brawl with another man who tried to restrain him - without realising he was a security guard, Mr Smernicki added. The star went off for 15 minutes before returning to finish his set. Police took witness statements and apprehended Brown at his hotel, Mr Smernicki said. But he was released without charge and \"as far as we're aware, that's the end of it\", Mr Smernicki added. A spokesperson for the San Francisco Police Department said he may have been detained but they could find no record of the incident. Brown, 42, was lead singer with The Stone Roses, one of the most seminal bands in British rock, until they split in 1996. He has since forged a successful solo career, scoring nine UK top 30 singles since 1998. In 1998, he was sentenced to four months in jail for using threatening behaviour towards an aeroplane captain and stewardess.\n", "llama3.2:1b": ["Ian Brown, former lead singer of The Stone Roses, was arrested after a fight during a concert in San Francisco on Tuesday.", "A fan attacked him on stage, resulting in pushing and shoving with security guard Paul Smernicki.", "Brown became involved in the altercation and got into a brawl with another man without realizing he was a security guard.", "He left for 15 minutes before returning to finish his set, which was later released without charge due to lack of evidence."], "llama3.2:3b": ["Ian Brown, former lead singer of The Stone Roses, was arrested after a fight during a concert in San Francisco.", "A fan attacked him on stage, leading to \"pushing and shoving\".", "Brown then got into a brawl with another man who turned out to be a security guard.", "He was arrested at his hotel but released without charge."], "gemma2:2b": ["Ian Brown was arrested after a fight during a concert in San Francisco.", "A fan jumped on stage and attacked Brown, leading to a scuffle with security guards and a brawl with another man.", "He was detained but released without charge and the incident appears to have ended there."], "qwen2.5:0.5b": ["A singer named Ian Brown got into a fight during a concert with his band The Stone Roses.", "He became involved in a brawling with a security guard who tried to stop him from leaving the stage.", "When he returned, another man came up and grabbed him and tried to restrain him.", "Brown didn't realize that he was being attacked by the security guard.", "He got into a physical altercation with the other man who tried to stop him, without realizing it was a security guard.", "Police took witness statements and apprehended him at his hotel, but he wasn't arrested and he had 15 minutes to walk off before returning and finishing his set.", "The police said they could find no record of Brown's arrest.", "Ian Brown, the lead singer of The Stone Roses, has since become a successful solo artist.", "He scored nine UK top 30 singles since 1998 in 2014.", "In 1998, he was sentenced to four months in jail for using threatening behavior towards an aeroplane captain and stewardess.", "The text highlights Ian Brown's arrest during the concert with his band The Stone Roses after a fight with a security guard and his physical altercation with another man who tried to stop him from leaving the stage."], "qwen2.5:1.5b": ["Former Stone Roses frontman Ian Brown arrested after fight during concert in San Francisco, released without charge."], "qwen2.5:3b": ["Singer Ian Brown was arrested after a fight during his concert at the Great American Music Hall in San Francisco on Tuesday.", "A fan attacked him, leading to a confrontation with security guards where Brown got into a brawl with a man mistaken for a guard.", "Initially detained but released without charge, police could not find any record of the arrest.", "Brown, formerly of The Stone Roses, had a successful solo career since their 1996 split.", "He was previously jailed for threatening behavior in 1998."], "opencoder:1.5b": ["Ian Brown 'in gig arrest' is a statement from former Stone Roses singer Ian Brown who is accused of being arrested after engaging in aggressive behavior during a concert at San Francisco.", "The statement also highlights the incident where he was approached by a security guard while being on scene, and is released without charge, despite the latter's apparent oversight.", "This incident also highlights the fan \"rugby-tackled\" the singer which resulted in \"pushing and shoving\", adding to his reputation as a former rock star."], "smollm:1.7b": ["The summary should be:\n\nIan Brown was arrested after a fight during a concert in San Francisco on Tuesday, his spokesman said.", "A fan jumped on stage and attacked the singer, who then became involved in a fracas with a security guard, Fiction Records spokesman Paul Smernicki said.", "He said Brown was arrested at his hotel after the show but released without charge.", "San Francisco police said they could find no record of his arrest.", "Mr Smernicki said he had been told a fan \"rugby-tacked\" the singer during the gig, which resulted in \"pushing and shoving\".", "The star then got into a brawl with another man who tried to restrain him - without realising he was a security guard, Mr Smernicki added.", "The star went off for 15 minutes before returning to finish his set.", "Police took witness statements and apprehended Brown at his hotel, Mr Smernicki said.", "But he was released without charge and \"as far as we're aware, that's the end of it\", Mr Smernicki added.", "A spokesperson for the San Francisco Police Department said he may have been detained but they could find no record of the incident.", "Brown, 42, was lead singer with The Stone Roses, one of the most seminal bands in British rock, until they split in 1996.", "He has since forged a successful solo career, scoring nine UK top 30 singles since 1998.", "In 1998, he was sentenced to four months in jail for using threatening behaviour towards an aeroplane captain and stewardess."], "deepseek-r1:1.5b": ["Singer Ian Brown was arrested after a fight at a concert in San Francisco.", "He faced a racial incident involving fans and security guards.", "Police reported no record of his arrest.", "Brown released without charge but was detained at his hotel, leading to his eventual release from custody without being granted bail.", "He's the lead singer of The Stone Roses, one of the most influential rock bands until they split in 1996.", "Since then, he has a successful solo career, winning nine UK top 30 singles in 1998 on trial for threatening an airbus."], "tinyllama:1.1b": ["Singer Ian Brown \"in gig arrest\" during a concert in San Francisco on Tuesday night after a fan jumped onto the stage, causing a fight between Brown and a security guard.", "The incident was described as \"pushing and shoving\", but no further details are available at this time.", "Brown has been detained without charge by San Francisco police but may have been released without any formal charges being filed against him.", "However, a spokesperson for the police department could not provide information on whether he was arrested or detained.", "As of the publication date, there were no official reports or news sources reporting an incident involving Brown."], "tinydolphin:1.1b": [" A fan at a concert by former Stone Roses singer Ian Brown became involved in a fight with security personnel and was arrested, his spokesman has said.", "The star, now known as Ian Brown, was later released without charge.", "Fiction Records confirmed the arrest, stating that it occurred after an altercation during a show in San Francisco."], "phi:2.7b": [" Ian Brown, former lead singer of The Stone Roses, was arrested in San Francisco after a fan attacked him during a concert and got into a fight with a security guard.", "He was taken into custody at his hotel but released without charge.", "There is no record of the incident by the police.", "Brown has had a successful solo career since breaking up with The Stone Roses in 1996."], "orca-mini:3b": [" Ian Brown, former lead singer of The Stone Roses, was arrested during a concert in San Francisco after a fan jumped on stage and attacked him.", "A security guard also got involved in a brawl with Brown, who finished his set 15 minutes after being taken off stage.", "He was later arrested at his hotel but released without charge, and according to the San Francisco Police Department, they had no record of his arrest."], "hermes3:3b": ["Ian Brown arrested during concert in San Francisco; fight occurred after fan jumped on stage."], "stablelm-zephyr:3b": ["Former Stone Roses singer Ian Brown was arrested after a fight occurred during a concert in San Francisco.", "A fan jumped on stage and attacked Brown, leading to a confrontation with a security guard.", "Brown was later arrested at his hotel but released without charge.", "The incident remains unconfirmed by the San Francisco Police Department.", "Brown is also known for his solo career and being sentenced to four months in jail for threatening behavior towards an airplane captain and stewardess in 1998."], "chatgpt-4o-latest": ["Ian Brown, former Stone Roses singer, was arrested after a fight during a San Francisco concert when a fan tackled him on stage, leading to a scuffle with a security guard.", "He was detained at his hotel but released without charge.", "San Francisco police found no record of the arrest.", "Brown briefly left the stage but returned to finish his set.", "The incident appears to be resolved.", "Brown, 42, has had a successful solo career since The Stone Roses split in 1996 and previously served jail time in 1998 for threatening behavior on a flight."], "stablelm2:1.6b": ["Ian Brown was arrested during a concert in San Francisco after a fan attacked him, causing a fight with a security guard.", "Brown, the former lead singer of Stone Roses, was detained at his hotel but released without charge.", "The incident does not show up as a record in police records."], "granite3.1-dense:2b": ["Former Stone Roses lead singer Ian Brown, 42, was involved in a fight during his concert at the Great American Music Hall in San Francisco on Tuesday.", "A fan reportedly rugby-tackled him, leading to a stage altercation with security and another man, who turned out to be a guard.", "Brown temporarily left the stage but returned for his set, which lasted 15 minutes before he was arrested at his hotel without charge.", "San Francisco police could not confirm the incident due to a lack of records.", "Brown, known for his successful solo career, was previously jailed in 1998 for threatening an aircrew."]}