{"raw_text": "Snow Patrol bassist exits group\n \n Snow Patrol had \"no other course of action\" but to ask their co-founder and bassist to leave the band, lead singer Gary Lightbody has said.\n \n Mark McClelland had been in the band for more than 10 years since its formation at Dundee University. Lightbody said \"over the last 18 months touring has taken its toll on the rest of the band's relationship with him\". He said: \"This is the hardest decision we have ever had to make and believe us when we say we didn't make it lightly.\" The group, originally from Northern Ireland, has only achieved mainstream success in the last year with the single Run and award-winning album Final Straw. In a statement on the band's website, Lightbody said: \"I started the group with Mark 10 years ago and he was a massive part of Snow Patrol and my life throughout that decade.\"\n \n He added: \"It got to the stage that things couldn't go on as they were, so we felt there was no other course of action but this. \"I know you will all be distressed and may not understand this news but we had to do what was best for the band.\" Snow Patrol are currently working on the follow-up to their breakthrough third album. The band is set to play support to U2 on a number of summer stadium gigs. Last month, they were the big winners in Ireland's top music honours, the Meteor Awards, picking up accolades for best band and album. It followed nominations for the Brit Awards and the Mercury Music Prize. The band formed in 1994 when Lightbody and McClelland met as students at Dundee University.\n", "llama3.2:1b": ["Mark McClelland has left Snow Patrol after 10 years with the band, citing a need to reevaluate the group's relationship.", "Gary Lightbody said the decision was not taken lightly and that things had become difficult for all involved.", "The band is working on new music and has been nominated for several awards, including the Brit Awards and Mercury Music Prize."], "llama3.2:3b": ["Snow Patrol has asked bassist Mark McClelland to leave the group due to a strained relationship among band members that worsened over the last 18 months of touring.", "Lead singer Gary Lightbody described the decision as \"the hardest\" they've ever had to make, but felt it was necessary for the band's well-being."], "gemma2:2b": ["Mark McClelland, Snow Patrol's bassist, has left the band after a long period of strained relationships among the members.", "This decision was made due to touring taking a toll on other band members' relationship with McClelland, despite his longstanding contributions over the past decade.", "The band acknowledges the difficult news and emphasizes this choice is for the betterment of their future as a group.", "They are currently working on the next album and will support U2 on some summer stadium gigs."], "qwen2.5:0.5b": ["Snow Patrol bassist Gary Lightbody left the group to take over with Mark McClelland, a former co-founder, amid concerns about touring pressure.", "Lightbody revealed that the band had achieved mainstream success in recent years but was struggling with tour and recording commitments.", "He stated that they decided to cut their ties and focus on the group's upcoming projects, promising the band would continue working hard despite the difficulties.", "The band has been active since 1994 under both Gary Lightbody and Mark McClelland."], "qwen2.5:1.5b": ["Snow Patrol, known for their Northern Irish roots, asked bassist Mark McClelland to leave due to his physical demands of touring, leading to a \"hardest decision\" the group had ever made.", "The band has seen increased success since 2018 with the single \"Run\" and album \"Final Straw,\" but Lightbody's departure is believed to be necessary for their long-term viability as McClelland has been part of Snow Patrol since 2013."], "qwen2.5:3b": ["Snow Patrol bassist Mark McClelland has left the band over touring strain.", "He joined the group ten years ago, but tensions have risen over recent tours.", "Gary Lightbody, lead singer, says this is a difficult decision, made after considering all options.", "The band, known for their breakthrough third album and successful singles like \"Run,\" is currently working on new music to follow up their album \"Final Straw.\"", "They will support U2 in summer gigs and were top winners at Ireland's Meteor Awards."], "opencoder:1.5b": ["The output is a simple summary of the provided text, focusing on key points such as Snow Patrol's decision to leave the band, the relationship between Mark and Gary Lightbody, and the impact on the band's performance."], "smollm:1.7b": ["Snow Patrol bassist exits group"], "deepseek-r1:1.5b": ["Snow Patrol bassist leaves after co-founder Mark McClelland says so over 10 years of service since Dundee University formation.", "He reflects on touring impact, emphasizing decision was tough but crucial for music success.", "Currently working on next album and support for U2 at meteor awards in Ireland."], "tinyllama:1.1b": ["Snow Patrol's bassist Mark McClelland has left the band, leaving co-founder Gary Lightbody to seek an exit from the group.", "The decision was made after nearly a decade of touring for McClelland and the rest of the band had grown increasingly uncomfortable with his absence.", "This marks the first departure from Snow Patrol since its formation, which began in 1994.", "Despite achieving mainstream success only recently, the group has struggled with internal tension in recent years.", "This decision is said to have been taken after McClelland's persistent absence on the band's touring schedule.", "The band plans to support U2 during a number of summer stadium gigs and will be eligible for awards at Ireland's top music honors, the Meteor Awards."], "tinydolphin:1.1b": [" Snow Patrol announced that bassist Mark McClelland has left the band, leading singer Gary Lightbody shared.", "The decision was made due to the band's ongoing commitment to touring and its desire for a better work-life balance.", "McClelland had been in the group since 1994.", "The band is currently working on the follow-up to their critically acclaimed third album, and will support U2 on some summer stadium shows."], "phi:2.7b": [" Lead singer Gary Lightbody of Snow Patrol has asked bassist Mark McClelland to leave the band after 10 years.", "This is due to a strain on their relationship, with touring taking its toll.", "The group has only achieved mainstream success in the last year and will play support to U2 on summer stadium gigs.", "They are currently working on their follow-up album and have won several music awards in Ireland."], "orca-mini:3b": [" Snow Patrol's bassist Mark McClelland has been asked to leave the group after more than a decade of being a part of it.", "Gary Lightbody, the lead singer of the band, said that \"over the last 18 months, touring has taken its toll on the rest of the band's relationship with him\".", "He added that \"this is the hardest decision we have ever had to make\" and that \"the band had no other course of action but to ask McClelland to leave\".", "The band formed in 1994 and achieved mainstream success in the last year with the single Run and the award-winning album Final Straw."], "hermes3:3b": ["Snow Patrol bassist Mark McClelland leaves group after 18 months, despite being co-founder for over 10 years; decision made due to strained relationship and touring toll on band's dynamics."], "stablelm-zephyr:3b": ["Snow Patrol's co-founder and bassist, Mark McClelland, has left the band after over 10 years, following tensions that arose during touring.", "Lead singer Gary Lightbody confirmed this decision, stating it was the hardest they had to make.", "Since achieving mainstream success with the single \"Run\" and album \"Final Straw,\" the band is now working on their follow-up album and will support U2 at several summer stadium gigs."], "chatgpt-4o-latest": ["Snow Patrol asked co-founder and bassist Mark McClelland to leave the band due to strained relationships after extensive touring.", "Lead singer Gary Lightbody described it as the hardest decision they had to make but necessary for the band's future.", "McClelland had been with the group since its formation at Dundee University in 1994.", "Snow Patrol recently gained mainstream success with their album *Final Straw* and hit single *Run*.", "They are currently working on a new album and will support U2 on tour.", "The band recently won top honors at Ireland’s Meteor Awards after receiving Brit and Mercury Prize nominations."], "stablelm2:1.6b": ["Snow Patrol bassist Mark McClelland has left the group, with lead singer Gary Lightbody stating they didn't make the decision lightly due to deteriorating relationships over the past few months while touring.", "The band originally from Northern Ireland experienced mainstream success in recent years with their singles \"Run\" and album \"Final Straw.\"", "Snow Patrol is working on a follow-up to their third album and will support U2 at several summer stadium gigs."], "granite3.1-dense:2b": ["Snow Patrol's lead singer, Gary Lightbody, announced that co-founder and bassist Mark McClelland would be leaving the band after over a decade of collaboration.", "The decision was made due to the impact of extensive touring on the group's relationships, which Lightbody described as \"the hardest decision we've ever had to make.\"", "Despite the difficulty, the band felt compelled to take this course of action for the betterment of their collective.", "McClelland played a significant role in Snow Patrol's formation and success, contributing to hits like \"Run\" and the award-winning album \"Final Straw.\"", "Currently, the band is preparing for summer stadium gigs supporting U2 and has recently been recognized with multiple music awards, including best band and album at Ireland's Meteor Awards."]}