{"raw_text": "Bollywood draws global stars\n \n British actress Antonia Bernath is making her debut in Kisna - the Warrior Poet, marking a growing trend for non-Indian stars to appear in Bollywood films.\n \n Directed by Bollywood veteran Subhash Ghai, the film is set in the British Raj and Bernath plays an army general's daughter who falls in love with a rural boy, Kisna. \"I liked the fluid nature of film-making. We improvised quite a lot,\" says Bernath. \"At times it felt very chaotic but Mr Ghai was quite clear about what he wanted.\" Picked from more than 200 girls in an audition in London, Bernath cut short her education at Bristol's Old Vic Theatre School to take up the opportunity. It is not often that somebody gets to play the lead role straight out of a drama school. She spent three weeks learning Hindi and taking dance lessons. \"Initially, I was a bit sceptical about how people would respond to me,\" Bernath says. \"But I found the Hindi film industry very warm and encouraging. I even had a few offers before the work on Kisna was completed.\"\n \n Films are one of India's biggest exports and those like Lagaan and Monsoon Wedding have broken the traditional boundaries of colour and culture. Spurred by this, Bollywood producers are trying to go global in all aspects of film-making, be it technical or artistic.\n \n From young heart-throbs like Nick Moran of Lock, Stock and Two Smoking Barrels to model Sophie Dahl, many non-Indian stars want to make the most of this opportunity. \"Bollywood has truly gone global,\" says Taran Adarsh, editor of Indian film journal Trade Guide. \"Directors are now attempting to woo non-Asian audience to increase their share in the overseas film market.\" Kisna has been shot simultaneously in Hindi and English, with the English print shortened by an hour to accommodate the Western audience. The film even has a song composed in English by AR Rahman, the director of the popular West End musical, Bombay Dreams. \"Identification is a popular cinematic device. Use of European or American actors can be viewed as a step in that direction,\" says Adarsh.\n \n The cast of Kisna also includes British actors Michael Maloney, Caroline Langrishe and Polly Adams.\n \n Another actress, Annabelle Wallace, plays the lead role in a bilingual romantic comedy Dil Jo Bhi Kahey (Whatever the Heart Says), which also stars Indian screen legend Amitabh Bachchan. Actor and Producer Aamir Khan's forthcoming venture The Rising is set against the backdrop of the Indian mutiny of 1857, with British actor Toby Stephens in a key role. But it isn't only the Western actors looking eastwards. Bollywood sweetheart Aishwarya Rai, recently seen in Bride and Prejudice alongside New Zealand actor Martin Henderson, is building her international career. And, many other Bollywood stars have their eyes set on Hollywood. \"Hollywood or Bollywood, it's the box office that determines whether something is a passing phase or a trend,\" says Adarsh.\n \n Kisna - the Warrior Poet opens in the UK on 21 January.\n", "llama3.2:1b": ["Bollywood actors are pursuing international roles, including in UK films and Hollywood movies.", "Antonia Bernath plays an army general's daughter who falls in love with a rural boy in Bollywood film Kisna - the Warrior Poet.", "British actor Antonia Bernath attended drama school in London but cut short her education to pursue acting opportunities in India.", "Kisna is being shot simultaneously in Hindi and English, with some parts shortened for Western audiences.", "The film includes British actors Michael Maloney, Caroline Langrishe, Polly Adams, Annabelle Wallace, and Toby Stephens.", "Bollywood stars are building their international careers through films like Dil Jo Bhi Kahey and The Rising, which feature Indian and Western actors alike."], "llama3.2:3b": ["Bollywood producers are increasingly drawing global stars for films like Antonia Bernath in Kisna - the Warrior Poet, which marks a growing trend of non-Indian actors in Bollywood.", "The film is set in the British Raj and features an English-speaking lead role alongside Indian talent.", "The industry aims to go global with its productions, with directors attempting to woo non-Asian audiences.", "Films like Lagaan and Monsoon Wedding have already broken cultural boundaries, and many Western actors are now looking to make a career in Bollywood."], "gemma2:2b": ["Antonia Bernath stars in \"Kisna - the Warrior Poet\", marking a growing trend of non-Indian actors appearing in Bollywood films.", "The film, directed by Subhash Ghai and aiming for a global audience, uses English language prints to accommodate Western viewers.", "Other notable examples include Nick Moran, Sophie Dahl, and Aamir Khan's projects which feature both Indian and international stars."], "qwen2.5:0.5b": ["Bollywood has seen a growing trend for non-Indian stars to appear in films.", "British actress Antonia Bernath made her Bollywood debut with a film about a military princess, \"Kisna\", starring British actor Michael Maloney and Caroline Langrishe.", "The film was shot simultaneously in Hindi and English and features an English-language soundtrack.", "Italian director Taran Adarsh predicts that Bollywood is going global due to the rise of the Indian film industry.", "Other Indian stars like Aishwarya Rai, Aamir Khan, Toby Stephens, and Martin Henderson are also set for international success."], "qwen2.5:1.5b": ["Non-Indian actors are making their Bollywood debuts, including British actress Antonia Bernath who stars as an army general's daughter in \"Kisna - The Warrior Poet\".", "This marks a trend for non-Indian actors to appear in Indian films.", "Directors like Subhash Ghai are trying to go global in film-making aspects such as technical and artistic choices.", "Bollywood is expanding its appeal, with the cast including British actors Michael Maloney, Caroline Langrishe, Polly Adams, and Aamir Khan's upcoming venture The Rising set against a backdrop of the Indian mutiny 1857 starring Toby Stephens."], "qwen2.5:3b": ["British actress Antonia Bernath stars in Bollywood film Kisna - the Warrior Poet, directed by Subhash Ghai.", "She cut her studies short to take up the role and learned Hindi and dance lessons for three weeks.", "The film reflects India's growing global reach, with non-Asian actors like Bernath being chosen for lead roles.", "Films are produced simultaneously in multiple languages, including English, with Western audiences considered.", "Kisna also features songs from popular West End musicals and incorporates elements of European or American culture to appeal to a wider audience."], "opencoder:1.5b": ["Bollywood draws global stars\n\nThe film directed by Subhash Ghai, Kisna marks a growing trend for non-Indian stars to appear in Bollywood films.", "A significant role for Antonia Bernath is played as a army general's daughter who falls in love with a rural boy.", "She engages in an engaging dialogue filled with fluidity and the passion for film-making, making her a dynamic figure on the stage.", "The film is set in a British Raj and Bernath plays the heroine of India's army.", "\"I liked the fluid nature of film-making, we improvised quite a lot,\" says Bernath.", "\"At times it felt very chaotic but Mr Ghai was quite clear about what he wanted.\"", "The film opens with Kisna, an auditioned in London, and Bernath makes a mark on her education at Bristol's Old Vic Theatre School.", "From the start, Bernath is not only determined to excel academically but also to unleash the potential of non-Indian stars into Hollywood.", "The director's vision for a global film industry is set to redefine our cinematic experience.", "Nonetheless, many non-Indian stars are eager to delve deeper and explore the film-making world.", "\"Bollywood has truly gone global,\" says Taran Adarsh, editor of Indian film journal Trade Guide.", "This film leverages the beauty of India's cultural heritage and international business model, creating a new dimension for India's film industry."], "smollm:1.7b": ["Kisna - the Warrior Poet is an Indian romantic comedy film directed by Bollywood veteran Subhash Ghai and starring British actress Antonia Bernath as a lead role.", "The film was released in India on 21 January 2019, and it premiered at the 63rd Filmfare Awards in Mumbai on 24 January 2019.", "The film tells the story of an Indian army general's daughter who falls in love with a rural boy, Kisna, while working as a nurse in a British hospital during the British Raj.", "The film is set in the British Raj and features Bollywood stars like Aishwarya Rai, Anupam Kher, and Shah Rukh Khan among others.", "The film's success can be attributed to its unique blend of Indian and Western cultural influences, as well as its romantic comedy genre.", "The film also received positive reviews from critics, with many praising its strong performances from the lead actress Antonia Bernath.", "Kisna - the Warrior Poet was released in several languages, including Hindi, English, and Urdu, making it a global phenomenon.", "It has been screened at several international film festivals, including the 63rd Filmfare Awards in Mumbai, where it won the Best Romantic Comedy award.", "The film's success can be attributed to its strong performances from the lead actress Antonia Bernath, who played the lead role of Kisna.", "The film also received positive reviews from critics, with many praising its strong performances from the other cast members.", "Kisna - the Warrior Poet has been screened at several international film festivals, including the 63rd Filmfare Awards in Mumbai, where it won the Best Romantic Comedy award.", "It has also received positive reviews from critics, with many praising its strong performances from the lead actress Antonia Bernath.", "The film's success can be attributed to its unique blend of Indian and Western cultural influences, as well as its romantic comedy genre.", "The film also receives positive reviews from critics, with many praising its strong performances from the lead actress Antonia Bernath."], "deepseek-r1:1.5b": ["Bollywood's首位 Indian actress Antonia Bernath is leading a bold journey in Bollywood with her debut role in \"Kisna,\" set against British colonial norms.", "Directed by Subhash Ghai, she plays an army general's daughter who falls in love with a rural boy.", "Her three-week training in Hindi and dance highlights her dedication to adaptation.", "The film is shot in both languages, blending cultures seamlessly.", "She collaborates with international actors like Aamir Khan, adding global appeal.", "\"Kisna\" also features \"Dil Jo Bhi Kahey,\" a bilingual romantic comedy starring Amitabh Bachchan.", "Annabelle Wallace and other Bollywood stars are heading towards Hollywood, marking the global rise of filmmakers."], "tinyllama:1.1b": ["The text mentions British actress Antonia Bernath, who plays a role in the upcoming Bollywood film, \"Kisunä,\" marking an increased number of non-Indian stars appearing in Hollywood films.", "The article highlights that directors are attempting to go global and woo non-Asian audiences by having simultaneous English and Indian prints of the film.", "In addition, many actors from India have internationally successful careers, including Aishwarya Raichand, who is building her career in Hollywood, while Toby Stephens from The Risings also stars in a bilingual romantic comedy.", "The article notes that films like Lagaaan and Monsoon Wedding have broken traditional boundaries of colour and culture in Bollywood film-making.", "Key Idea: Non-Indian actors are increasingly appearing in Hollywood films, wooing non-Asian audiences and building their international careers."], "tinydolphin:1.1b": [" As a helpful AI assistant, I can summarize this text for you in an understandable and concise manner: \"Bollywood is going global with more non-Indian stars appearing in films set in colonial British India.", "Directed by Subhash Ghai, the movie features British actress Antonia Bernath as a general's daughter falling in love with a rural boy.", "'Kisna - the Warrior Poet' is set in 19th-century India and stars non-Indian actors such as Toby Stephens, Aamir Khan, and Polly Adams.", "The film is inspired by the historical novel 'Dil Jo Bhi Kahey' and has a bilingual cast with British actors Michael Maloney and Caroline Langrishe also appearing.\""], "phi:2.7b": [" British actress Antonia Bernath makes her debut in the Indian film industry as she plays an army general's daughter who falls in love with a rural boy, Kisna, in Subhash Ghai' s movie set in the British Raj.", "The film is Bernath' s first lead role straight out of drama school and she spent three weeks learning Hindi and dance to prepare for it.", "Bollywood producers are trying to go global in all aspects of film-making, be it technical or artistic, by casting non-Indian stars like Nick Moran, Sophie Dahl, Michael Maloney, Polly Adams and Annabelle Wallace.", "Many non-Indian actors want to make the most of this opportunity and Bollywood has truly gone global, according to Taran Adarsh, editor of Indian film journal Trade Guide.", "Kisna  - the Warrior Poet, is set to be released in the UK on 21 January."], "orca-mini:3b": [" Bollywood draws global stars such as British actress Antonia Bernath, who makes her debut in Kisna - the Warrior Poet, a film directed by Bollywood veteran Subhash Ghai.", "The film is set in the British Raj and Bernath plays an army general's daughter who falls in love with a rural boy, Kisna.", "Bernath improvised and took dance lessons for the film.", "The film has a song composed by AR Rahman in English, which is shortened by an hour for the Western audience.", "Kisna is released in the UK on 21 January."], "hermes3:3b": ["Bollywood attracting global stars, e.g.", "British actress Antonia Bernath for film Kisna - the Warrior Poet."], "stablelm-zephyr:3b": ["British actress Antonia Bernath makes her debut in Bollywood film Kisna - the Warrior Poet, directed by Subhash Ghai and set in the British Raj.", "The film explores a love story between a daughter of an army general and a rural boy named Kisna.", "This trend of non-Indian actors appearing in Bollywood films is spurred by the global success of Indian films like Lagaan and Monsoon Wedding, leading to efforts to reach a global audience.", "Kisna has been shot simultaneously in Hindi and English to accommodate Western audiences, and features songs composed by AR Rahman, who also directed Bombay Dreams."], "chatgpt-4o-latest": ["British actress Antonia Bernath debuts in Bollywood with *Kisna - the Warrior Poet*, reflecting a trend of non-Indian actors joining Indian cinema.", "Directed by Subhash Ghai, the film is set in the British Raj, and Bernath plays an army general’s daughter who falls for a rural boy.", "Chosen from over 200 candidates, she learned Hindi and dance for the role and found Bollywood welcoming.", "Indian cinema is expanding globally, with films like *Lagaan* and *Monsoon Wedding* breaking cultural barriers.", "Western actors, including Nick Moran and Sophie Dahl, are drawn to Bollywood, while Indian filmmakers aim to attract international audiences.", "*Kisna* was shot in both Hindi and English, featuring a song by AR Rahman.", "Other Bollywood films, such as *Dil Jo Bhi Kahey* and *The Rising*, also feature Western actors.", "Meanwhile, Bollywood stars like Aishwarya Rai are pursuing Hollywood careers.", "The success of this trend depends on box office performance.", "*Kisna* releases in the UK on 21 January."], "stablelm2:1.6b": ["British actress Antonia Bernath makes her debut in the film \"Kisna - The Warrior Poet\", playing an army general's daughter who falls in love with a rural boy during the British Raj.", "With non-Indian stars increasingly appearing in Bollywood films, Kisna was shot simultaneously in Hindi and English.", "Director Subhash Ghai encouraged Bernath to learn Hindi and dance, despite her lack of theater experience.", "Lagaan and Monsoon Wedding have popularized Bollywood's global appeal, prompting producers to focus on expanding their market share internationally.", "Notable performances include Michael Maloney, Caroline Langrishe, Polly Adams, Annabelle Wallace, Amitabh Bachchan, and Aishwarya Rai in upcoming projects like Dil Jo Bhi Kahey and The Rising."], "granite3.1-dense:2b": ["British actress Antonia Bernath is making her Bollywood debut in \"Kisna - the Warrior Poet,\" directed by Subhash Ghai, set in the British Raj.", "Bernath, picked from over 200 auditionees in London, plays an army general's daughter who falls for a rural boy.", "She learned Hindi and dance quickly for the role.", "This marks a growing trend of non-Indian stars appearing in Bollywood films, with producers seeking to attract global audiences and increase overseas film market share.", "Other notable examples include Nick Moran from \"Lock, Stock and Two Smoking Barrels,\" model Sophie Dahl, Aishwarya Rai, and British actors in films like \"Dil Jo Bhi Kahey\" and \"The Rising.\"", "These movies are being shot simultaneously in Hindi and English, with extended English versions for Western audiences.", "The use of non-Indian stars is seen as a step towards greater cultural identification in film."]}