{"raw_text": "Actress Roberts takes spider role\n \n Actress Julia Roberts will play the part of a spider in a new film version of children's classic Charlotte's Web.\n \n She will voice Charlotte, who teams up with a girl to save their friend Wilbur the pig, in the story by EB White. The film - a mix of live action and animation - will be Roberts' first project since the birth of her twins, Hazel and Phinnaeus, two months ago. Oprah Winfrey will voice a goose, John Cleese will voice a sheep and Steve Buscemi a rat in the 2006 film.\n \n Ten-year-old Dakota Fanning will play Fern, the girl at the centre of the story, in the film to be directed by 13 Going on 30 film-maker Gary Winick. Filming is due to begin in Melbourne, Australia, later this month. Charlotte's Web has sold 45 million copies since it was published in 1952. An animated version was made in 1973 but this will be the first live action film. The actor who will voice Wilbur the pig has yet to be revealed.\n", "llama3.2:1b": ["Actress Julia Roberts to play spider role, voices Charlotte, plays Fern and will direct new film of Charlotte's Web"], "llama3.2:3b": ["Julia Roberts will voice Charlotte, a spider in a new film adaptation of children's classic Charlotte's Web.", "She joins Dakota Fanning as Fern, John Cleese as a sheep and Steve Buscemi as a rat.", "The film, directed by Gary Winick, is set to begin filming in Melbourne, Australia later this month."], "gemma2:2b": ["Julia Roberts voices Charlotte the spider in a new live-action/animation film adaptation of Charlotte's Web, her first project since the birth of her twins.", "The film will also feature Dakota Fanning as Fern, Oprah Winfrey as a goose, John Cleese as a sheep, and Steve Buscemi as a rat, directed by Gary Winick.", "Filming is planned for Melbourne, Australia later this month."], "qwen2.5:0.5b": ["A new film based on the classic children's story Charlotte's Web will feature actress Julia Roberts playing Charlotte, an animal with a mission to save her friend Wilbur.", "It will be the first project for actress Julia Roberts since she had twins and will voice two other animals: a goose by John Cleese, a sheep by Steve Buscemi and a rat by Ed Burns in \"Charlotte's Web\".", "The film is set to begin filming in Melbourne, Australia later this month."], "qwen2.5:1.5b": ["Actor Julia Roberts will play Charlotte, a spider, in a new film adaptation of children's classic Charlotte's Web, which also features voices from Dakota Fanning as Fern and Steve Buscemi as a rat, among others."], "qwen2.5:3b": ["Actress Julia Roberts will play Charlotte, a spider character in the new film adaptation of Charlotte's Web, voiced by Dakota Fanning.", "Directed by Gary Winick, it combines live-action and animation.", "Roberts voices Charlotte after giving birth to twins recently; Oprah Winfrey, John Cleese, and Steve Buscemi voice other characters.", "The film, based on E.B.", "White’s 1952 novel, is the first live-action adaptation of the story that has sold over 45 million copies since publication.", "Filming began in Melbourne, Australia, this month.", "Wilbur's pig voice actor remains undisclosed."], "opencoder:1.5b": ["\"Actress Julia Roberts takes her role as a spider in a new film called Charlotte's Web.\""], "smollm:1.7b": ["Actress Julia Roberts will play the part of a spider in a new film version of Charlotte's Web, which will be directed by Gary Winick and feature ten-year-old Dakota Fanning as Fern.", "The film is based on the 1952 children's classic by EB White and will be the first live action film adaptation of the story.", "The film will also feature a mix of live action and animation, with Charlotte's Web being the main focus of the story.", "The film will be directed by Gary Winick, who has previously worked on films such as The Princess Bride and The Big Sick.", "Winick is known for his work on animated films such as The Little Mermaid and Beauty and the Beast.", "The film will also feature a new spin-off of the classic story, with Charlotte's Web being the main focus of the film.", "The film will be directed by Gary Winick and feature ten-year-old Dakota Fanning as Fern, who will play the role of the girl at the centre of the story.", "The film is expected to be a commercial success, with sales of 45 million copies since its publication in 1952.", "The animated version of the film has sold 10 million copies since it was released in 1973 but this will be the first live action film adaptation of the story.", "The actor who will voice Wilbur the pig is yet to be revealed, but Winick has stated that he hopes to find someone with a strong accent and good vocal range for the role.", "The actor who will voice Charlotte will also be expected to have a strong accent and good vocal range."], "deepseek-r1:1.5b": ["Julia Roberts is taking on the spider role in a new version of Charlotte's Web, an animated mix of live action and animation directed by Gary Winick.", "The voice actors include Oprah for a goose, John Cleese for a sheep, Steve Buscemi for a rat, Dakota Fanning as Fern, and Charlotte's web has sold over 45 million copies."], "tinyllama:1.1b": ["Julia Roberts will play Charlotte, the spider character in a new film adaptation of EB White's popular children's book Charlotte's Web.", "She will voiced by actresses Julia Roberts and Julia Roberts, both twins, Hazel and Phinnaeus.", "The live-action/animation movie is set to be directed by Gary Winick and is expected to premiere in 2023.", "Dakota Faunce will play the role of Fern, the girl at the centre of the story.", "The film has sold over 45 million copies since it was published in 1952.", "Another version of Charlotte's Web was made in 1973, but this time around an animated version is being prepared.", "A spokesperson for Roberts revealed that she will voice Wilbur the piñata during the filming."], "tinydolphin:1.1b": [" Actress Julia Roberts will play the role of a spider in the upcoming film adaptation of Charlotte's Web, directed by Gary Winick and set for release in 2013.", "In this movie version, Roberts will voice Charlotte, who teams up with a girl to save their friend Wilbur the pig.", "The film will also feature other actors such as Oprah Winfrey, John Cleese, and Steve Buscemi.", "The story, written by EB White, is about a girl named Fern who finds a magical spider web that leads her to the secret world of Charlotte's Web, where she learns about courage, friendship, and bravery."], "phi:2.7b": [" Actress Julia Roberts is playing Charlotte, a spider in a new children's classic that is being remade as both live-action and animation.", "The film features Oprah Winfrey voicing a goose, John Cleese voicing a sheep, Steve Buscemi voicing a rat, and Dakota Fanning playing Fern, the girl at the center of the story.", "Filming will begin later this month in Australia.", "Charlotte's Web has sold 45 million copies since it was first published and there is no information yet on who will voice Wilbur the pig."], "orca-mini:3b": [" Julia Roberts will play the role of a spider in a new film adaptation of Charlotte's Web.", "She will voice the character of Charlotte, who teams up with a girl to save their friend Wilbur the pig.", "The film is a mix of live action and animation and will be directed by Gary Winick.", "Dakota Fanning will play the role of Fern, the girl at the center of the story.", "Filming is due to begin in Melbourne, Australia later this month.", "Charlotte's Web has sold 45 million copies since it was published in 1952 and an animated version was made in 1973.", "The actor who will voice Wilbur the pig has yet to be revealed."], "hermes3:3b": [" Julia Roberts to play spider (Charlotte) in \"Charlotte's Web\" film, directing by Gary Winick; Oprah Winfrey, John Cleese, Steve Buscemi to voice other characters."], "stablelm-zephyr:3b": ["Actress Julia Roberts voices Charlotte, a spider, in the upcoming film adaptation of Charlotte's Web.", "This live-action/animated movie, directed by Gary Winick and featuring Oprah Winfrey as a goose and John Cleese as a sheep, will be Roberts' first project post-pregnancy.", "Ten-year-old Dakota Fanning plays Fern, the central girl character.", "Filming begins in Melbourne, Australia later this month.", "The film marks the first live-action adaptation of the children's classic published in 1952 and an animated version made in 1973."], "chatgpt-4o-latest": ["Julia Roberts will voice Charlotte the spider in a new live-action and animated film adaptation of Charlotte's Web.", "The film, based on EB White's classic story, follows Charlotte and a girl named Fern as they try to save Wilbur the pig.", "Oprah Winfrey, John Cleese, and Steve Buscemi will voice other animal characters, while Dakota Fanning will play Fern.", "Directed by Gary Winick, filming will begin in Melbourne, Australia.", "This will be the first live-action version of the story, following a 1973 animated adaptation.", "The actor voicing Wilbur has not yet been announced."], "stablelm2:1.6b": ["Actress Julia Roberts will join an animated film adaptation of \"Charlotte's Web\" as a spider, featuring her voice alongside other A-list actors such as Oprah Winfrey and Steve Buscemi in their respective roles as a goose, sheep, and rat.", "Young actress Dakota Fanning will play the main character, Fern, while director Gary Winick selects Melbourne for filming due to commence later this month after the book's million copies sold worldwide since its publication.", "A live-action version of \"Charlotte's Web\" was produced in 2003, marking this as a new addition to the film franchise."], "granite3.1-dense:2b": ["Actress Julia Roberts will voice Charlotte, a spider, in a new live-action adaptation of E.B.", "White's children's classic, Charlotte's Web.", "This film, directed by Gary Winick and set to begin shooting in Melbourne, Australia, features Roberts' first project post her twins' birth two months ago.", "Dakota Fanning will portray Fern, the girl central to the story.", "Other voice actors include Oprah Winfrey as a goose, John Cleese as a sheep, and Steve Buscemi as a rat.", "The 2006 animated version of Charlotte's Web sold 45 million copies since its 1973 release; this will be the first live-action film adaptation.", "The voice for Wilbur the pig remains unannounced."]}