{"raw_text": "Fantasy book wins Hollywood deal\n \n A British author has had the film rights to her children's bestseller snapped up for a seven-figure sum, with Ridley Scott set to direct.\n \n Michelle Paver's Wolf Brother, a fantasy set 6,000 years ago, is the first in a planned series of six books. Film studio Fox has bought the rights for around $4m (£2.13m) for Scott's company Scott Free to develop. The director said he was \"thrilled\" with the project. \"Wolf Brother is an enchanting book,\" he said. Paver, who lives in London and previously worked as a lawyer, began writing the book in 1982 while studying biochemistry at Oxford University.\n \n She was an established author of love stories when she turned the work-in-progress into a children's novel. It was published in 2004, with Paver earning an advance of $5m (£2.8m) - the highest sum ever paid for a debut children's book. Wolf Brother tells the story of Torak, a 12-year-old hunter who lives in the forest. After his father is killed he teams up with a wolf cub and sets out to rid the forest of an evil force. Paver is currently writing the second book in the series. \"Michelle Paver lives and breathes the worlds she writes about,\" said a spokesman for the author. \"I've told her about the film deal but at the moment she is writing the second book and her mind is 6000 years away deep in the primeval forest.\"\n", "llama3.2:1b": ["A British author's children's bestseller, Wolf Brother, has been sold to film studio Fox for $4m (£2.13m) with Ridley Scott set to direct.", "The series of six books follows a young hunter named Torak as he battles an evil force in the primeval forest.", "Michelle Paver, the author, is currently writing the second book and has earned $5m ($2.8m) for her first children's novel."], "llama3.2:3b": ["A British author, Michelle Paver, has sold the film rights to her children's fantasy series \"Wolf Brother\" for a seven-figure sum.", "Ridley Scott will direct the movie based on Paver's bestseller, which tells the story of a 12-year-old hunter battling an evil force in the forest.", "The book is part of a planned six-book series, and Paver is currently writing the second installment."], "gemma2:2b": ["British author Michelle Paver sold the movie rights to her children’s fantasy novel “Wolf Brother” for a seven-figure sum to Ridley Scott’s production company.", "The deal includes six planned books, with Scott set to direct and Paver currently working on the second installment of the series."], "qwen2.5:0.5b": ["A British author, Michelle Paver, had the rights to write a children's fantasy novel about a 12-year-old hunter named Torak.", "After nearly ten years of development, she became an established author when the book was published in 2004.", "She has since written two more books in the series for her film rights, but this article focuses on Wolf Brother, which is the first part of the series.", "Paver's work ethic and talent make her a sought-after writer."], "qwen2.5:1.5b": ["A British fantasy children's novel has been sold to Hollywood, with director Ridley Scott set to direct a $4 million adaptation of Michelle Paver's \"Wolf Brother\" series.", "The deal was signed for Fox via Scott Free Productions.", "Paver previously earned an advance of $5 million on her debut children's book and is currently writing the second installment in her planned fantasy saga."], "qwen2.5:3b": ["A British author, Michelle Paver, whose children's bestseller Wolf Brother has been bought by Fox for a seven-figure sum with Ridley Scott to direct.", "The fantasy series set 6,000 years ago began as an established author's love story and was published in 2004.", "Paver lives in London and currently writes the second book in the series."], "opencoder:1.5b": ["A fantasy book wins Hollywood deal.", "British author Ridley Scott, who has the rights to her children's bestseller Snap up a seven-figure sum for Fox.", "Scott set to direct the film project.", "Michelle Paver, Wolf Brother, and Fox have bought the rights for approximately $4 million (£2.13 million).", "The director said he was \"thrilled\" with the project.", "Wolf Brother is an enchanting book and was written by Paver in 1982 while studying biochemistry at Oxford University.", "She turned the work into a children's novel and published it in 2004, earning an advance of $5 million (£2.8 million).", "Paver currently writes the second book in the series.", "The author shares that Michelle lives and breathes the world she writes about."], "smollm:1.7b": ["Fantasy book wins Hollywood deal"], "deepseek-r1:1.5b": ["Michelle Paver's children's bestseller has been snapped up by a British author for seven-figure deals, with Ridley Scott directing and Fox Studios acquiring the rights to her film.", "She directed \"Wolf Brother,\" a fantasy book set 6,000 years ago, part of a planned six-book series.", "Michelle Paver, who studied biochemistry at Oxford and has been writing love stories since 1982, is currently writing her second installment in the series."], "tinyllama:1.1b": ["A British author, Michelle Paver, has had the film rights to her children's bestseller Wolf Brother awarded to Ripley Scott, director of the upcoming fantasy film.", "The author, whose book was published in 2004 and earned $5m (£2.8m) in advance, will be developing six books in the series with Fox studio, which acquired the rights for around $4m (£2.13m).", "Paver herself is currently writing Wolf Brother 2 and working on Wolf Brother 3, 4, and 5, which will bring to a close the story of Torak, a young hunter who travels through the forest to rid it of an evil force.", "The awarding of the film rights marks another success for Paver, whose book was also published when she was still in law school, earning her a $5m (£2.8m) advance that launched her into the world of literature and helped launch Fox's interest in publishing children's books."], "tinydolphin:1.1b": [" Fantasy author Michelle Paver has had her bestselling children's book, Wolf Brother, snapped up by Hollywood for a reported $4m (£2.13m), with British director Ridley Scott set to direct.", "The deal marks the first film rights of Michelle Paver's popular series, which is set 6,000 years ago in the forest of Wolf Brother.", "Fox, the movie studio behind the project, has purchased the rights for around £2.13m ($4m) for Scott's production company, Scott Free.", "The director said he was \"thrilled\" with the prospect.", "Paver began writing the book in 1982 while studying biochemistry at Oxford University, where she gained a master's degree.", "She was an established author of love stories when Wolf Brother was published in 2004.", "The book's advance payment of $5m (£2.8m) to the author marked the highest sum ever paid for a debut children's book."], "phi:2.7b": [" British author Michelle Paver's best-selling children's book \"Wolf Brother\", set 6,000 years ago in a fantasy world, has been sold to Hollywood for a seven-figure sum.", "Fox will make a movie based on this novel directed by Ridley Scott.", "The film studio bought the rights for around $4 million.", "The director is thrilled with the project and described the book as enchanting.", "Paver started writing the book while studying biochemistry at Oxford University in 1982, turning it into a children's novel after its publication in 2004.", "She earned an advance of $5 million, making it the highest amount ever paid for a debut children's book.", "Paver is currently writing the second book in this series that follows the story of Torak, a 12-year-old hunter who teams up with a wolf cub to rid the forest of evil forces.", "The author lives and breathes her fictional worlds, but is currently focused on her upcoming novel."], "orca-mini:3b": [" A British fantasy book, Wolf Brother by Michelle Paver, has won a seven-figure sum for a Hollywood deal.", "The book was inspired by Michelle's time studying biochemistry at Oxford University while writing children's novels.", "She earned $5 million for her debut novel."], "hermes3:3b": ["British author's \"Wolf Brother\" fantasy book gets Hollywood $4m deal, Ridley Scott to direct."], "stablelm-zephyr:3b": ["A British author, Michelle Paver, whose children's book \"Wolf Brother\" won a seven-figure Hollywood deal, with Ridley Scott directing.", "The fantasy novel set 6,000 years ago is the first of a planned six books.", "Fox purchased the rights for around $4m (£2.13m) for development by Scott Free under Ridley Scott.", "Paver's legal background and love stories began her journey as an established author before she turned \"Wolf Brother\" into a children's novel in 2004, earning an advance of $5m (£2.8m), the highest sum ever paid for a debut children's book.", "The story follows 12-year-old hunter Torak who teams up with a wolf cub to rid the forest of an evil force.", "Currently, Paver is writing the second book in the series."], "chatgpt-4o-latest": ["British author Michelle Paver's children's fantasy novel *Wolf Brother* has been acquired by film studio Fox for around $4 million, with Ridley Scott set to direct.", "The book, set 6,000 years ago, is the first in a planned six-book series.", "Paver, a former lawyer, began writing it in 1982 and later turned it into a children's novel, earning a record $5 million advance.", "The story follows 12-year-old hunter Torak, who, after his father's death, teams up with a wolf cub to battle an evil force.", "Paver is currently writing the second book, while Scott expressed excitement about the film adaptation."], "stablelm2:1.6b": ["British fantasy author Michelle Paver's novel \"Wolf Brother\", sold to Film Studio Fox for £2m, has secured a seven-figure deal.", "Ridley Scott will direct, with plans for six books in the series.", "Publisher Random House acquired rights for around $4m.", "Paver began writing at Oxford University while studying biochemistry.", "She previously worked as a lawyer before becoming an established author of love stories.", "\"Wolf Brother\" tells the story of Torak, a 6-year-old hunter, and his quest to rid the forest of an evil force with help from a wolf cub.", "Currently, Paver is working on the second book in the series."], "granite3.1-dense:2b": ["British fantasy author Michelle Paver, previously known for love stories, has secured a seven-figure Hollywood deal for her children's series, \"Wolf Brother,\" with director Ridley Scott attached.", "Fox has acquired the film rights for around $4 million (£2.13m), and Scott Free will produce it.", "Paver began writing \"Wolf Brother\" in 1982 while studying biochemistry at Oxford, later transforming it into a children's novel upon completing her studies.", "The book, set 6,000 years ago, follows Torak, a 12-year-old hunter who forms an alliance with a wolf cub to vanquish an evil force in the forest after his father's death.", "Paver is currently working on the second book in the series, immersing herself in the ancient forest world."]}