{"raw_text": "Bangkok film festival battles on\n \n Organisers of the third Bangkok International Film Festival have been determined to carry on with this year's event despite the ravages of the Asian tsunami disaster.\n \n The festivities have been scaled down, red carpets have been mothballed and profits from ticket sales are being donated to the tsunami relief fund. Apart from this, however, the festival has continued as originally planned. \"When the disaster happened, we naturally asked ourselves if we should cancel,\" said the festival's executive director, Craig Prater. \"The decision was made that we would continue, but that the focus would change.\n \n \"Our premieres became fundraisers, the opening night was visibly toned down and 10% of every ticket sold goes to the disaster fund,\" he continued. \"But we feel like we've turned a page. We've acknowledged our position, and now it's business as usual.\"\n \n Mr Prater's sentiments were echoed by Christine Rush, director of the festival's sister event, the Bangkok Film Market. \"We have been careful to be respectful of the Thai nation's recovery from this terrible disaster,\" she said.\n \n \"However, the nation's recovery very much depends upon it continuing its economic life. \"We are encouraging attendees to keep the victims in mind and aggressively support the aid organisations helping out,\" she added. Given the conspicuously low audience figures, that support may be more symbolic than significant. However, poor ticket sales have less to do with any fallout from the disaster and more to do with administrative and promotional difficulties.\n \n The eclectic programme contains a wide range of titles, including such Oscar hopefuls as Ray Charles biopic Ray and Mike Leigh's abortion drama Vera Drake. That said, the absence of Thai subtitles on most film prints might have proved offputting to local cinemagoers.\n \n On a more positive note, the celebrity guests attending the event have generated huge media interest in this busy capital city. Problems securing air transport, the clash with last Sunday's Golden Globes ceremony in Los Angeles and other factors have forced some big names to cancel.\n \n But the festival has still attracted such Hollywood directors as Oliver Stone and Joel Schumacher, alongside such screen stars as Michael Douglas, Jeremy Irons and Jean-Claude Van Damme. Irons, whose film Being Julia is in competition for the festival's Golden Kinnaree awards, said he had wondered whether he should attend after December's catastrophe. \"I questioned whether I should come when such a tragedy had happened,\" the British actor said. \"I thought it might be in rather bad taste. But then I spoke to the organisers and I was encouraged to let life go on. \"Now I've come here I'm very glad. What impresses me about Thai culture is they get over these things far quicker than we do in the West,\" he continued. \"Basically I was invited here by Thailand. If they still want you to come, you should.\"\n \n Now in its third year, Bangkok is a relatively recent addition to the hectic film festival calendar. And while it has yet to attain the stature of more established events held in Hong Kong, Tokyo and Pusan in South Korea, Mr Prater predicts it will soon become their equal. \"It's grown awfully fast in three years - maybe too fast,\" he concedes. \"We've had some bumps in the road, but that's only because the festival is still a baby. \"I have no doubt in my mind that in five years, this will be the top Asian film festival in the world.\" The Golden Kinnarees will be awarded on Friday. The festival itself runs until 24 January.\n", "llama3.2:1b": ["The third Bangkok International Film Festival has been determined to continue despite the aftermath of the Asian tsunami disaster.", "Organisers have scaled down the event and redirected profits from ticket sales to a tsunami relief fund.", "The festival's executive director, Craig Prater, stated that while some aspects were changed in response to the disaster, business as usual had been maintained.", "The programme includes Oscar hopefuls such as Ray Charles biopic Ray and abortion drama Vera Drake.", "Celebrity guests attending the event have generated media interest, despite issues with air transport and other logistical challenges.", "However, the festival has attracted big-name guests including directors Oliver Stone and Joel Schumacher, alongside screen stars Michael Douglas and Jean-Claude Van Damme.", "The festival's director, Christine Rush, acknowledged that the disaster had affected Thailand's recovery efforts, but encouraged attendees to support aid organisations helping those affected by the disaster.", "The event will run until January 24."], "llama3.2:3b": ["Bangkok International Film Festival continues despite the Asian tsunami disaster with scaled-down festivities and donations to relief funds.", "The focus has shifted but many premieres have become fundraisers, and celebrity guests like Oliver Stone and Jeremy Irons attended.", "The festival is gaining popularity, with predictions that it will soon become a top Asian film festival in five years."], "gemma2:2b": ["Despite the devastation caused by the Asian tsunami disaster, organizers of the Bangkok International Film Festival have continued with the event.", "Ticket sales are being donated to relief efforts, and although the festivities have been scaled down, the program features Oscar-worthy films like \"Ray\" and \"Vera Drake.\"", "Challenges include low audience turnout, difficulties securing air transport for celebrity guests, and a clash with the Golden Globes ceremony in Los Angeles.", "However, the festival remains optimistic about its future growth and potential to rival established Asian film festivals."], "qwen2.5:0.5b": ["The third Bangkok International Film Festival has been scaled back due to the disaster, with a focus on fundraisers and donations to the tsunami relief fund.", "However, the event continues as originally planned and is being attended by celebrity guests, including Oliver Stone, Joel Schumacher, Michael Douglas, Jeremy Irons, and Jean-Claude Van Damme.", "The festival's popularity has grown since its inaugural year in 2014, with it now attracting both established and emerging filmmakers."], "qwen2.5:1.5b": ["The Bangkok International Film Festival continues despite the tsunami disaster, focusing on fundraising and adapting to low attendance due to administrative issues and air transport problems."], "qwen2.5:3b": ["Organisers of the third Bangkok International Film Festival continued despite the Asian tsunami disaster by scaling down festivities and donating profits to relief funds.", "Primarily focused on fundraising for tsunami victims, they adjusted premieres and toned down opening nights.", "The eclectic programme includes Oscar hopefuls like Ray and Vera Drake, though Thai subtitles were absent.", "Despite low audience figures, celebrity guests attracted significant media attention but some big names canceled due to air transport issues and conflicting schedules with the Golden Globes in Los Angeles.", "Actors including Michael Douglas and Jeremy Irons attended, praising Thai culture for its resilience post-disaster.", "The festival has grown rapidly in three years and is projected to become a top Asian event by 2028.", "Golden Kinnaree awards will be announced on Friday, with the festival running until January 24th."], "opencoder:1.5b": ["Bangkok Film Festival battles on\n\nOrganisers of the third Bangkok International Film Festival have been determined to carry on with this year's event despite the ravages of the Asian tsunami disaster.", "The festivities have been scaled down, red carpets have been mothballed and profits from ticket sales are being donated to the tsunami relief fund.", "Apart from this, however, the festival has continued as originally planned.", "\"When the disaster happened, we naturally asked ourselves if we should cancel,\" said the festival's executive director, Craig Prater.", "\"The decision was made that we would continue, but that the focus would change.\"", "He expressed his sense of responsibility and excitement in acknowledging his position, directing the festival.", "Mr Prater's sentiments were echoed by Christine Rush, director of the festival's sister event, the Bangkok Film Market.", "\"We have been careful to be respectful of the Thai nation's recovery from this terrible disaster,\" she said.", "\"However, the nation's recovery very much depends upon it continuing its economic life.\"", "He added that encouraging attendees to keep the victims in mind and actively support the aid organisations helping out.", "Given the conspicuously low audience figures, that support may be more symbolic than significant.", "However, poor ticket sales have less to do with any fallout from the disaster and more to do with administrative and promotional difficulties.", "The eclectic programme contains a wide range of titles, including such Oscar hopefuls as Ray Charles biopic Ray and Mike Leigh's abortion drama Vera Drake.", "But the absence of Thai subtitles on most film prints might have proved offputting to local cinemagoers.", "On a more positive note, the celebrity guests attending the event have generated huge media interest in this busy capital city.", "Problems securing air transport, the clash with last Sunday's Golden Globes ceremony in Los Angeles and other factors have forced some big names to cancel.", "But the festival has still attracted such Hollywood directors as Oliver Stone and Joel Schumacher, alongside such screen stars as Michael Douglas, Jeremy Irons and Jean-Claude Van Damme.", "Now in its third year, Bangkok is a relatively recent addition to the hectic film festival calendar.", "And while it has yet to attain the stature of more established events held in Hong Kong, Tokyo and Pusan in South Korea, Mr Prater predicts it will soon become their equal.", "\"It's grown awfully fast in three years - maybe too fast,\" he concedes.", "\"We've had some bumps in the road, but that's only because the festival is still a baby.\"", "He added that in five years, this will be the top Asian film festival in the world."], "smollm:1.7b": ["Summarize the following text concisely, preserving key ideas and details."], "deepseek-r1:1.5b": ["The Bangkok International Film Festival has continued despite the Asian tsunami, with plans scaled down on red carpets and profits donated to aid.", "Despite this, it remains largely unchanged.", "The festival's executive director, Craig Prater, acknowledges their position but moves forward.", "Christine Rush supports the decision by focusing on recovery and local support.", "The festival attracts popular celebrities but faces logistical challenges.", "Thai culture is gaining recognition, especially with three years of growth, though they may not yet be as prominent as others in Asia."], "tinyllama:1.1b": ["The Bangkok International Film Festival has been scaled down and redirected to focus on supporting relief efforts for the Thailand-induced disaster, with some big names attending despite postponing or canceling their appearances due to other factors.", "The festival attracted Hollywood directors like Oliver Stone and Jean-Claude Van Damme and has since become a respectable addition to Asian film festivals in recent years.", "Despite the challenges posed by the disaster, organizers are confident that the event will eventually reach its stature and attain a similar status as other well-established festivals like Hong Kong, Tokyo, and Puansi in South Korea."], "tinydolphin:1.1b": [" The Bangkok International Film Festival (BIFF) has been successfully running for three consecutive years, despite the recent tsunami disaster and subsequent challenges.", "The event has continued to promote Thai cinema and attract international celebrities.", "This year's lineup includes several thought-provoking films, including Ray Charles biopic Ray and Mike Leigh's abortion drama Vera Drake.", "However, the absence of local subtitles on most film prints may have caused some issues for local cinemagoers.", "Despite the challenges, the festival has still attracted celebrities like Oliver Stone and Joel Schumacher and has been a significant platform for Thai directors, such as Michael Douglas, Jeremy Irons, and Jean-Claude Van Damme."], "phi:2.7b": [" Despite the impact of the 2004 Indian Ocean tsunami disaster, organisers of the Bangkok International Film Festival decided to continue with their event, scaled down in size and donated a portion of ticket sales to the relief fund.", "However, poor ticket sales may have less to do with any fallout from the disaster and more to do with administrative and promotional difficulties.", "The festival features a diverse programme, including popular films such as Ray Charles biopic Ray and Mike Leigh's abortion drama Vera Drake.", "Celebrities attending the event include Hollywood directors Oliver Stone and Joel Schumacher.", "Thai culture was praised for its ability to move on from tragedy quickly.", "The festival has grown rapidly since its debut in 2003 and is predicted to become a top Asian film festival in the future."], "orca-mini:3b": [" Bangkok International Film Festival continues despite Asian tsunami disaster.", "Organisers have scaled down festivities and postponed profits from ticket sales to aid relief funds.", "However, original programme has been maintained and celebrities such as Michael Douglas, Jeremy Irons, and Jean-Claude Van Damme have attended.", "Despite lower audience figures, some big names have cancelled due to other commitments."], "hermes3:3b": ["Festiving Bangkok Intl Film Fest proceeds donated to tsunami relief despite reduced red carpets & scaled-down celebrations due to disaster.", "Festival continues, albeit with low attendance; celebrity guests attract media interest."], "stablelm-zephyr:3b": ["The Bangkok International Film Festival continued despite the effects of the Asian tsunami disaster, donating profits from ticket sales to the relief fund and scaling down festivities.", "Organizers decided to focus on fundraising and supporting aid organizations instead of cancelling the event.", "The festival featured a range of films, including Oscar hopefuls, but struggled with low attendance due to administrative and promotional difficulties, as well as the absence of Thai subtitles for most film prints.", "Celebrity guests attending the event generated significant media interest in Bangkok.", "Festival director Craig Prater predicts that in five years, Bangkok will be among the top Asian film festivals in the world."], "chatgpt-4o-latest": ["The third Bangkok International Film Festival proceeded despite the Asian tsunami disaster, with scaled-down festivities and ticket sale profits donated to relief efforts.", "Organizers, including executive director Craig Prater, emphasized the importance of continuing while being respectful of Thailand’s recovery.", "The festival faced low audience turnout due to administrative and promotional issues rather than the disaster.", "The event featured a diverse film lineup, though the lack of Thai subtitles may have deterred local viewers.", "Celebrity guests, including Oliver Stone, Joel Schumacher, Michael Douglas, and Jeremy Irons, generated media interest, though some big names canceled due to logistical challenges.", "Irons initially hesitated to attend but was encouraged by organizers to support the event.", "Despite being a relatively new festival, Prater believes Bangkok will soon rival established Asian film festivals.", "The Golden Kinnaree awards will be presented on Friday, and the festival runs until January 24."], "stablelm2:1.6b": ["The Bangkok International Film Festival continued despite the Asian tsunami disaster, reducing festivities and focusing on fundraising with all ticket sales going towards the relief fund.", "They screened films such..\n  \n- \"Ray\" by Mike Leigh (Oscar contender)\n- \"Vera Drake\" by Mike Leigh (biographical drama)\n  \nDespite Thai language issues affecting some local attendees, Hollywood directors like Oliver Stone, Joel Schumacher and actors Michael Douglas, Jeremy Irons, and Jean-Claude Van Damme attended.", "Organiser's optimism for future success includes its potential as the top Asian film festival in the world within five years."], "granite3.1-dense:2b": ["Despite the devastating impact of the Asian tsunami, organizers of the Bangkok International Film Festival decided to proceed with the third edition.", "The event was scaled down, with red carpets removed and profits from ticket sales donated to tsunami relief.", "Premieres served as fundraisers, and 10% of every ticket sold went to the disaster fund.", "Celebrity guests like Oliver Stone, Joel Schumacher, Michael Douglas, Jeremy Irons, and Jean-Claude Van Damme attended, despite logistical challenges.", "The festival, known for its diverse program featuring Oscar contenders, continues to grow in stature as a significant Asian film event, with organizers predicting it will rival major festivals in Hong Kong, Tokyo, and Pusan within five years."]}