{"raw_text": "BBC denies Blackadder TV comeback\n \n The BBC has said there are no plans in the pipeline for a new series of hit comedy Blackadder, which ended in 1989.\n \n Tony Robinson, who played the servant Baldrick, told ITV1's This Morning the show's star, Rowan Atkinson, was \"more keen than he has been in the past\". Robinson added he would \"love\" to do another series, each of which was set in a different era, ranging from the 15th century to World War I. But the BBC said on Thursday there were no plans for a comeback.\n \n In the final series all the main characters were killed off charging towards German lines after being ordered out of their trench. The poignant finale was later voted the best farewell episode of a TV series. A host of other UK actors, including Hugh Laurie, Stephen Fry and Miranda Richardson, also appeared in the show. Blackadder returned for a one-off special filmed to celebrate the arrival of the millennium in 1999. It was shown at the Millennium Dome in Greenwich before being screened on BSkyB.\n", "llama3.2:1b": ["The BBC has denied plans for a new series of Blackadder, which ended in 1989.", "Tony Robinson expressed interest in doing another series with Rowan Atkinson, but the BBC says there are no current plans.", "A one-off special was filmed to celebrate the millennium in 1999 and screened on BSkyB."], "llama3.2:3b": ["The BBC has denied plans for a new series of the comedy Blackadder, which ended in 1989, despite Tony Robinson expressing his desire to do another one with Rowan Atkinson."], "gemma2:2b": ["The BBC has no plans for a new \"Blackadder\" television series, despite actor Tony Robinson expressing interest and Rowan Atkinson's potential enthusiasm.", "Previous episodes explored various historical eras, with a final episode culminating in the deaths of all main characters.", "A special episode was produced for the millennium."], "qwen2.5:0.5b": ["The BBC has denied plans for a new series of hit comedy Blackadder TV, which ended in 1989.", "However, there are no specific details about the return or upcoming episodes.", "Some notable actors involved with the show include Rowan Atkinson, Stephen Fry, and Miranda Richardson."], "qwen2.5:1.5b": ["The BBC has denied plans for a return series of \"Blackadder,\" which ended in 1989, citing lack of interest from star Rowan Atkinson and no new project in development."], "qwen2.5:3b": ["BBC denies plans for new series of Blackadder, despite actor Tony Robinson expressing interest.", "The show ended in 1989 and featured main characters killed off in its final episode.", "Other notable appearances included Hugh Laurie, Stephen Fry, and Miranda Richardson.", "A one-off special was aired to celebrate the millennium in 1999."], "opencoder:1.5b": ["BBC has said there are no plans in the pipeline for a new series of hit comedy Blackadder.", "In the final series, all the main characters were killed off charging towards German lines after being ordered out of their trenches.", "The poignant finale was later voted the best farewell episode of a TV series and a host of other UK actors, including Hugh Laurie, Stephen Fry and Miranda Richardson, also appeared in the show.", "Blackadder returned for a one-off special, which would be shown at the Millennium Dome in Greenwich before being screened on BSkyB."], "smollm:1.7b": ["The BBC has denied there are no plans in the pipeline for a new series of hit comedy Blackadder, which ended in 1989.", "Tony Robinson, who played the servant Baldrick, told ITV1's This Morning that he would \"love\" to do another series, each of which was set in a different era, ranging from the 15th century to World War I.", "But the BBC said on Thursday there were no plans for a comeback.", "The BBC said on Thursday there were no plans for a comeback.", "However, it did say that the BBC would be looking at ways to revive the Blackadder franchise in the future.", "It added that the show's creators had been working on new ideas and storylines since the last series ended in 1989.", "The final season of Blackadder was shown to a packed house at the BBC headquarters in London, with many of the cast members returning for their second appearance.", "The show was also screened at the Millennium Dome in Greenwich before being broadcast on BSkyB.", "The BBC said it would be looking at ways to revive the Blackadder franchise, including new ideas and storylines.", "It added that the show's creators had been working on new ideas and storylines since the last series ended in 1989.", "The BBC has not announced any plans for a new series of Blackadder, but it did say that it would be looking at ways to revive the franchise in the future.", "It also said that the show's creators had been working on new ideas and storylines since the last season ended in 1989."], "deepseek-r1:1.5b": ["BBC denies new Blackadder series; Tony Robinson claims another show planned but no comeback; each season set in different eras (15th to WWII); Blackadder returns as special film in 1999 at Millennium Dome."], "tinyllama:1.1b": ["The BBC has denied any plans for a return to the hit comedy \"Blackaddr,\" which ended in 1989.", "Tony Robinson, who played Baldrick in the series, told ITV1's This Morning that Rowan Atkinson, who starred as the servant, was \"more keen than he has been in the past.\"", "However, the BBC said there were no plans for a comeback despite the show featuring all main characters being killed off towards German lines after being ordered out of their trench.", "The finale earned it accolades from critics for its poignant scenes depicting the final farewells of characters before they fought in World War I and the eventual defeat of Germany."], "tinydolphin:1.1b": [" The BBC has confirmed that there are no plans for a Blackadder TV comeback.", "However, Tony Robinson, who portrayed Baldrick in the series, expressed his desire to revisit the characters again.", "Rowan Atkinson, the star of the show, was reportedly more keen than he had been in the past."], "phi:2.7b": [" The BBC has confirmed that there are no plans for a new series of the hit comedy Blackadder, which ended in 1999.", "In the final episode, all the main characters were killed off as they charged towards German lines during World War I.", "A one-off special was filmed to celebrate the Millennium and screened on BSkyB."], "orca-mini:3b": [" The BBC has denied reports of a new series of Blackadder, which ended in 1989.", "Tony Robinson, who played Baldrick, told This Morning he would \"love\" to do another series, each set in a different era ranging from the 15th century to World War I.", "However, the BBC says there are no plans for a comeback.", "Blackadder featured other UK actors including Hugh Laurie, Stephen Fry, and Miranda Richardson.", "A one-off special was also filmed to celebrate the arrival of the millennium in 1999.", "It was shown at the Millennium Dome in Greenwich before being screened on BSkyB."], "hermes3:3b": ["BBC dismisses plans for Blackader TV comeback.", "(1989 series end, no new plans, Tony Robinson interested.)"], "stablelm-zephyr:3b": ["The BBC has confirmed that there are no plans for a new series of the popular comedy Blackadder, which originally aired from 1989 to 1999.", "Tony Robinson, who played character Baldrick, expressed interest in revisiting the show's various time periods but said Rowan Atkinson, the series star, was \"more keen than he has been in the past.\"", "However, the BBC clarified that there are no current plans for a comeback.", "The final series ended with the main characters being killed off during an explosive finale, which earned praise as the best farewell episode of a TV series and featured appearances from several notable UK actors.", "A one-off special was produced to celebrate the millennium in 1999 and was shown at the Millennium Dome before being aired on SkyBet."], "chatgpt-4o-latest": ["The BBC has stated there are no plans for a new series of Blackadder, which ended in 1989.", "Tony Robinson, who played Baldrick, mentioned that Rowan Atkinson was more interested in a revival than before and expressed his own enthusiasm for another series.", "However, the BBC confirmed no comeback is planned.", "The final series ended with the main characters dying in World War I, and its finale was voted the best farewell episode of a TV series.", "The show featured actors like Hugh Laurie, Stephen Fry, and Miranda Richardson.", "Blackadder briefly returned for a one-off special in 1999 to mark the millennium."], "stablelm2:1.6b": ["The BBC has confirmed there are no plans for a new series of hit comedy \"Blackadder,\" which originally aired from 1983-1985, with actor Rowan Atkinson as the main character.", "Tony Robinson expressed interest in continuing the show but the BBC stated they have no current intentions for another season.", "The final series featured all main characters' deaths during World War I, earning high praise and being voted the best farewell episode of a TV series by viewers.", "A one-off special was also aired to celebrate the arrival of the millennium in 1999."], "granite3.1-dense:2b": ["BBC declines to renew Blackadder, despite Tony Robinson's enthusiasm for a 21st-century series set across various historical eras from the 15th century to World War I.", "The show, known for its wit and memorable characters including Rowan Atkinson and other notable UK actors like Hugh Laurie and Stephen Fry, concluded in 1989 with a poignant finale where main characters were killed charging towards German lines during World War I.", "A one-off special was made for the millennium in 1999 to mark its return."]}