{"raw_text": "BBC to pour £9m into new comedy\n \n The BBC is to invest £9m in developing new comedy and entertainment programmes outside London.\n \n The changes come as part of a shake-up of several departments to create shows that appeal to a wider range of people. Changes are also being made to teams in the factual and daytime departments outside London. Director of television Jana Bennett said the changes were about \"getting the best ideas on screen as efficiently and effectively as we can\". \"The new structure in each genre is designed to ensure that happens,\" she said.\n \n A number of new roles are being created in each department, including a head of comedy commissioning based in Glasgow. The new person will be in charge of the £9m budget and their role will be to develop shows outside the capital, both within the BBC and with independent production companies. Jane Lush, controller of entertainment commissioning, said, \"Entertainment and comedy are incredibly important to our audiences; I'm confident these changes will help us get the very best programmes on screen.\" Similar positions will also be created in the other departments, with the new commissioning editor for documentaries based in Bristol and the daytime commissioning editor in Birmingham. Ms Bennett said the new roles would benefit those making programmes within the BBC as well as those making shows for the channel independently. \"A strong independent sector and a flourishing in-house production base are not mutually exclusive and will stimulate the competition that will deliver the best ideas to the audience,\" she said.\n", "llama3.2:1b": ["BBC to invest £9m in comedy programs, creating new roles including head of comedy commissioning and new commissioning editors for documentaries and daytime shows.", "The changes aim to appeal to a wider range of audiences through new programming strategies and efficient production processes."], "llama3.2:3b": ["BBC invests £9m in new comedy and entertainment programmes outside London, creating new roles for head of comedy commissioning in Glasgow, documentary editor in Bristol, and daytime editor in Birmingham, as part of a shake-up to develop shows that appeal to a wider range of people."], "gemma2:2b": ["The BBC is investing £9 million in new comedy programs outside London, creating new roles like a head of comedy commissioning in Glasgow.", "These changes aim to develop shows that appeal to wider audiences while also supporting independent production companies.", "Similar initiatives are planned for factual and daytime departments outside London.", "The goal is to foster competition that will result in high-quality programming."], "qwen2.5:0.5b": ["The BBC is investing £9m in new comedy and entertainment programmes outside London, following a change of departments to create shows that appeal to wider audiences.", "The changes include creating head positions for comedy commissioning, as well as new teams in factual and daytime departments outside London."], "qwen2.5:1.5b": ["The BBC plans to invest £9 million over two years, allocating funds specifically to develop new comedy and entertainment programs outside London, with roles set up across departments to support such productions in cities other than the capital."], "qwen2.5:3b": ["BBC invests £9m in new comedy and entertainment programmes outside London.", "Changes aim to create more appealing shows for wider audiences, including a head of comedy commissioning based in Glasgow with a £9m budget.", "Similar roles are being created in documentary and daytime departments across Bristol and Birmingham.", "Jana Bennett emphasizes the importance of both independent production companies and an in-house BBC base to stimulate competition and deliver the best ideas to viewers."], "opencoder:1.5b": ["BBC is investing $9 million in developing new comedy and entertainment programmes outside London.", "The changes come as part of a shake-up of several departments, creating shows that appeal to a wider range of people.", "Director Jana Bennett has highlighted efficient and effective ways to get the best ideas on screen.", "She said, \"The new structure in each genre is designed to ensure that happens.\"", "New roles are being created in each department including head of comedy commissioning in Glasgow and independent production companies like entertainment commissioning controller for documentaries based in Bristol.", "Jana also stressed the importance of entertainment and comedy sectors as audiences and viewership.", "The investment is aligned with the growth of the BBC and its own independent sector, stimulating competition and influencing the best ideas to be aired on the channel."], "smollm:1.7b": ["The summary should be:\n\nBBC to invest £9m in new comedy productions outside London, creating new roles and departments to develop shows appealing to a wider range of people.", "The changes come as part of a shake-up of several departments to create shows that appeal to a wider range of people.", "Changes are also being made to teams in the factual and daytime departments outside London.", "Director of television Jana Bennett said the changes were about \"getting the best ideas on screen as efficiently and effectively as we can\".", "\"The new structure in each genre is designed to ensure that happens,\" she said.", "Note: The summary should be concise, clear, and free of unnecessary information."], "deepseek-r1:1.5b": ["The BBC is investing £9 million in developing new comedy and entertainment programs outside London.", "This change comes as part of a restructuring plan involving several departments.", "New roles are being created for staff in comedy commissioning (Glasgow), documentaries commissioning (Bristol), and daytime commissioning (Birmingham).", "These changes aim to enhance creativity and efficiency, benefitting both BBC staff and independent producers who create shows."], "tinyllama:1.1b": ["The BBC has announced changes to several departments, including investing £9m into developing new comedy and entertainment programs outside London as part of a wider shake-up of its operations.", "The changes are aimed at creating shows that appeal to a wider range of people by ensuring the most effective and efficient use of resources in the department for factual and daytime programming, which is being reorganized into new roles based in Glasgow and Bristol respectively.", "Ms Jan Luš, controller of entertainment commissioning, said the changes will help ensure the best ideas are brought to the audience.", "The shake-up includes the creation of new positions with a head of comedy commissioning at Glasgow, and a daytime commissioning editor for Birminham and Bristol, as well as several other changes in departments.", "The move is part of an effort to create shows that appeal to a wider range of people and promote the competition between programs within the BBC as well as those made by independent producers."], "tinydolphin:1.1b": [" The BBC is set to invest £9m in developing new comedy and entertainment programmes outside London as part of a shake-up aimed at reaching a wider range of people.", "The changes come as part of a reorganization plan that also sees directors of television Jana Bennett and Jane Lush take on new roles within the BBC's factual and daytime departments outside London.", "Both Jana Bennett and Jane Lush have emphasized the importance of bringing creative ideas to life in different parts of the country, with a particular focus on Glasgow and Glasgow-based production companies.", "They believe these changes will help the BBC deliver the best shows for its audiences while also encouraging collaboration and experimentation across various genres.", "The revised structure also includes new roles for heads of comedy commissioning based in Glasgow, with Jane Lush stating, \"Entertainment and comedy are incredibly important to our audiences; I'm confident these changes will help us get the very best programmes on screen.\"", "Ms Bennett emphasized that the new roles would benefit both those making programmes within the BBC as well as those making shows for the channel independently.", "The reorganization plan is meant to boost competition among the industry and stimulate innovation, while also providing better quality entertainment for viewers."], "phi:2.7b": [" The BBC is investing £9m in developing new comedy and entertainment programmes outside London, as part of changes made to several departments outside the capital.", "These changes aim to create shows that appeal to a wider range of people by hiring more creative staff and creating new roles in each department.", "This will help the BBC commission the best programmes on-screen for their audiences while also stimulating competition from independent producers."], "orca-mini:3b": [" The BBC is investing £9m in developing new comedy and entertainment programs outside London, as part of a restructuring process to create shows that appeal to a wider range of people.", "The changes are intended to improve efficiency and effectiveness in creating these types of programs.", "A number of new roles are being created in each department, including a head of comedy commissioning based in Glasgow."], "hermes3:3b": ["BBC invests 9m in new comedy development outside London."], "stablelm-zephyr:3b": ["The BBC is investing £9m in developing new comedy and entertainment programs outside London as part of a shake-up within several departments to appeal to a wider range of audiences.", "This includes creating new roles, such as a head of comedy commissioning in Glasgow, to develop shows outside the capital, both within the BBC and with independent production companies.", "Director of Television, Jana Bennett, emphasizes that these changes will help get the best ideas on screen efficiently and effectively while promoting a strong independent sector and flourishing in-house production base."], "chatgpt-4o-latest": ["The BBC is investing £9m in developing new comedy and entertainment programmes outside London as part of a departmental shake-up to create more diverse content.", "New roles are being established, including a head of comedy commissioning in Glasgow, who will oversee the budget and work with both BBC and independent producers.", "Similar positions will be created in other departments, with a documentaries commissioning editor in Bristol and a daytime commissioning editor in Birmingham.", "Director of television Jana Bennett emphasized the goal of efficiently bringing the best ideas to screen, while entertainment controller Jane Lush highlighted the importance of comedy and entertainment to audiences.", "The changes aim to strengthen both in-house and independent production, fostering competition to deliver high-quality content."], "stablelm2:1.6b": ["The BBC is investing £9 million in developing new comedy and entertainment programs outside of London as part of a restructuring to appeal to a broader range of people.", "This follows changes made to several departments, including factual and daytime teams.", "New roles such CCO (Chief Comedy Officer) for Glasgow-based shows will be created based on the £9 million budget, allowing efficient development of both in-house productions and independent companies.", "Similar positions will also be established in other departments with the new commissioning editor for documentaries and daytime programming.", "Director of television Jana Bennett emphasizes that these changes aim to \"get the best ideas on screen as efficiently and effectively as we can,\" benefiting those within the BBC and the independent production sector."], "granite3.1-dense:2b": ["The BBC is allocating £9 million to develop new comedy and entertainment programs outside London, as part of a broader departmental restructuring to broaden content appeal.", "This initiative includes creating new roles such as head of comedy commissioning in Glasgow, who will oversee the budget for these productions.", "Jane Lush, controller of entertainment commissioning, expressed confidence that these changes will enhance the quality of programmes.", "Similar positions are being established in other departments, including documentary commissioning editors based in Bristol and daytime commissioning editor in Birmingham.", "The director of television, Jana Bennett, emphasized that this restructuring aims to optimize idea generation and foster a competitive environment between the BBC's in-house productions and independent partners."]}