{"raw_text": "Music mogul Fuller sells company\n \n Pop Idol supremo Simon Fuller has sold his 19 Entertainment company to an US entrepreneur in a $156m (£81.5m) deal.\n \n Robert Sillerman's Sports Entertainment Enterprises, which is to be renamed CFX, recently also bought an 85% share in the estate of Elvis Presley. Mr Fuller has been appointed to the CFX board and will plan and implement the company's creative strategy. The 19 firm handles a roster of music artists, TV shows and PR strategies for stars including the Beckhams. The deal sees Mr Fuller receive £64.5m in cash and about 1.9 million shares in Sports Entertainment. There will also be a further £19.2m in either cash or stocks by the end of the financial year in June. Mr Fuller has signed a long-term agreement with the company which will see him continue to expand and develop entertainment brands. He said: \"This is a hugely exciting new partnership for myself and 19 Entertainment.\n \n \"CKX will provide 19 with a powerful platform for global growth and allow us to fully take advantage of all the amazing opportunities that lie ahead. I cannot wait to get started.\"\n \n Mr Fuller was the creative drive behind Pop Idol and its US offspring American Idol. 19 Management runs the careers of many of its successful contestants including Will Young, Gareth Gates and Kelly Clarkson. The company was set up 15 years ago by Mr Fuller, taking the name from his first successful single - 19 by Paul Hardcastle. Fuller was the driving force behind the Spice Girls phenomenon, using canny marketing and catchy pop songs to secure their place as the most lucrative girl group in history. He then put together S Club 7, who had their own TV show as well as a music career. Mr Sillerman's deal to buy the Presley estate sees him control the operation of Graceland, as well as money from the late star's music and films. Presley's daughter Lisa Marie retains possession of Graceland and many of her father's \"personal effects\".\n", "llama3.2:1b": ["Simon Fuller has sold his 19 Entertainment company to US entrepreneur Robert Sillerman for $156 million (£81.5m).", "He will continue to serve on the CFX board, which now handles music artists, TV shows, and PR strategies for stars such as the Beckhams.", "The deal includes a cash payment of £64.5m and approximately 1.9 million shares in Sports Entertainment.", "Fuller also receives £19.2m by June's end, contingent on either cash or stock.", "He has signed a long-term agreement with CFX, expanding and developing entertainment brands, including his role as creative director for the company."], "llama3.2:3b": ["Simon Fuller has sold his 19 Entertainment company to US entrepreneur Robert Sillerman for $156m.", "Mr Fuller will remain on the CFX board, overseeing creative strategy.", "He received £64.5m in cash and shares, with further £19.2m expected by year end."], "gemma2:2b": ["Simon Fuller has sold his 19 Entertainment company to Robert Sillerman's Sports Entertainment Enterprises for $156 million.", "Fuller will remain involved with the company, serving as creative director and shaping its strategy.", "The deal includes cash payment of £64.5 million and a share in the new company CFX.", "Fuller's legacy includes Pop Idol and American Idol and he is now setting up a long-term partnership to expand entertainment brands globally.", "Sillerman also purchased an 85% stake in Elvis Presley’s estate, including Graceland.", "Presley's daughter Lisa Marie retains ownership of some personal items from her father."], "qwen2.5:0.5b": ["Here is a summary of the text in plain text:\n\nFuller buys 19 Entertainment for $156 million, with $81.5 million cash and about 1.9 million shares.", "He will take control of Presley's estate.", "He says he can \"take advantage\" of the brand after his experience with Pop Idol."], "qwen2.5:1.5b": ["Simon Fuller sells 19 Entertainment to Robert Sillerman for $156m.", "He will plan CFX's creative strategy as part of a long-term agreement, receiving £64.5m in cash and shares.", "The deal also includes another US entertainment firm buying Elvis Presley's estate."], "qwen2.5:3b": ["Pop Idol founder Simon Fuller has sold his 19 Entertainment company to US entrepreneur Robert Sillerman for $156m (£81.5m).", "The acquired firm, now named CFX, will handle the Elvis Presley estate, with Fuller appointed to their board and tasked with creative strategy development.", "Fuller receives £64.5m in cash and 1.9 million shares; additional payments totaling £19.2m are guaranteed by June.", "Fuller was behind shows like Pop Idol and American Idol, managing stars including Will Young, Gareth Gates, Kelly Clarkson, Spice Girls, and S Club 7.", "With this deal, Fuller gains a powerful platform for global growth, while Sillerman acquires the Presley estate and control over Graceland."], "opencoder:1.5b": ["Music mogul Fuller sells company\n\nPop Idol supremo Simon Fuller has sold his 19 Entertainment company to an US entrepreneur in a $156m (£81.5m) deal.", "Robert Sillerman's Sports Entertainment Enterprises, which is to be renamed CFX, recently also bought an 85% share in the estate of Elvis Presley.", "Mr Fuller has been appointed to the CFX board and will plan and implement the company's creative strategy.", "The 19 firm handles a roster of music artists, TV shows and PR strategies for stars including the Beckhams.", "The deal sees Mr Fuller receive £64.5m in cash and about 1.9 million shares in Sports Entertainment.", "There will also be a further £19.2m in either cash or stocks by the end of the financial year in June.", "Mr Fuller has signed a long-term agreement with the company which will see him continue to expand and develop entertainment brands.", "He said: \"This is a hugely exciting new partnership for myself and 19 Entertainment.\"", "CKX will provide 19 with a powerful platform for global growth and allow us to fully take advantage of all the amazing opportunities that lie ahead.", "I cannot wait to get started."], "smollm:1.7b": ["Music mogul Fuller sells company by Robert Sillerman's Sports Entertainment Enterprises (SESE) for $156 million in cash, with a 85% stake in the company.", "This deal brings together two companies that have been operating independently for several years: Sports Entertainment Enterprises (SEE) and CFX.", "The deal also sees Robert Sillerman's Sports Entertainment Enterprises (SESE) acquire an additional $19 million in cash and shares from Robert Sillerman's Sports Entertainment Enterprises (SEE).", "This acquisition brings the total value of the company to around $250 million, with a net gain of approximately $146 million.", "The deal also sees Simon Fuller, the founder of Sports Entertainment Enterprises (SEE), sign a long-term agreement with SESE that will see him continue to expand and develop entertainment brands for several years.", "The deal brings together two companies that have been operating independently for several years: Sports Entertainment Enterprises (SEE) and CFX.", "The deal also sees Robert Sillerman's Sports Entertainment Enterprises (SEE) acquire an additional $19 million in cash and shares from Robert Sillerman's Sports Entertainment Enterprises (SEE).", "This acquisition brings together two companies that have been operating independently for several years: Sports Entertainment Enterprises (SEE) and CFX.", "The deal also sees Simon Fuller, the founder of Sports Entertainment Enterprises (SEE), sign a long-term agreement with SESE that will see him continue to expand and develop entertainment brands for several years.", "The deal brings together two companies that have been operating independently for several years: Sports Entertainment Enterprises (SEE) and CFX.", "The deal also sees Robert Sillerman's Sports Entertainment Enterprises (SEE) acquire an additional $19 million in cash and shares from Robert Sillerman's Sports Entertainment Enterprises (SEE).", "This acquisition brings together two companies that have been operating independently for several years: Sports Entertainment Enterprises (SEE) and CFX.", "The deal also sees Simon Fuller, the founder of Sports Entertainment Enterprises (SEE), sign a long-term agreement with SESE that will see him continue to expand and develop entertainment brands for several years."], "deepseek-r1:1.5b": ["Fuller sold 19 Entertainment for £64.5m cash and 1.9m shares, while Sillerman bought CFX for $37.8m, obtaining 203k shares.", "Both deals are significant, with growth expected post-agreement."], "tinyllama:1.1b": ["Fuller Sells Music Mogul 19 Entertainment Company for $156m to American Entrepreneur in a Deal\nPop Idol supremo Simon Fuller has sold his 19 Entertainment company to an US entrepreneur for $156m (£81.5m).", "Robert Sillerman's Sports Entertainment Enterprises, which is to be renamed CFX, recently also bought an 85% share in the estate of Elvis Presley.", "Fuller will plan and implement the company's creative strategy under a long-term agreement with his firm, having signed a new deal worth £64.5m.", "The deal sees him continue to expand and develop entertainment brands.", "Fuller was the driving force behind Pop Idol and its US offshoot American Idol, which he created in 1999, and ran for eight years before ending in 2010.", "The company's successes also include the Spice Girls phenomenon, S Club 7, and Presley's estate ownership."], "tinydolphin:1.1b": [" Summary: Simon Fuller has sold his company 19 Entertainment to a US entrepreneur for $156m (£81.5m), which will allow him to fully take advantage of global growth opportunities and expand his entertainment empire.", "The deal includes an agreement with CKX, a leading entertainment investment and management firm, for 19 to have a significant stake in CKX.", "This will enable Fuller to continue developing his creative vision for music artists and the entertainment industry as a whole."], "phi:2.7b": [" Simon Fuller has sold his entertainment company to an American entrepreneur for a $156 million deal.", "The new company is named CFX, and will take over the creative strategy of the 19 Entertainment company, which handles music artists, TV shows, and PR strategies.", "Mr. Fuller will continue to expand and develop entertainment brands under the new partnership, and will receive cash and shares in Sports Entertainment Enterprises."], "orca-mini:3b": [" Pop Idol supremo Simon Fuller has sold his 19 Entertainment company to an US entrepreneur in a $156 million deal.", "Robert Sillerman's Sports Entertainment Enterprises, which is to be renamed CFX, recently bought an 85% share in the estate of Elvis Presley.", "Mr Fuller has been appointed to the CFX board and will plan and implement the company's creative strategy.", "The deal sees him receive £64.5 million in cash and about 1.9 million shares in Sports Entertainment.", "There will also be a further £19.2 million in either cash or stocks by the end of the financial year in June.", "Mr Fuller has signed a long-term agreement with the company which will see him continue to expand and develop entertainment brands.", "He said: \"This is a hugely exciting new partnership for myself and 19 Entertainment.", "CKX will provide 19 with a powerful platform for global growth and allow us to fully take advantage of all the amazing opportunities that lie ahead.", "I cannot wait to get started.\""], "hermes3:3b": ["Simon Fuller's 19 Entertainment sold to CFX for $156m, with Fuller remaining on board and planning creative strategy."], "stablelm-zephyr:3b": ["Simon Fuller has sold his entertainment company 19 Entertainment to Robert Sillerman's Sports Entertainment Enterprises for $156m (£81.5m).", "19 Entertainment handles music artists, TV shows, and PR strategies for stars like the Beckhams.", "The deal includes £64.5m in cash and about 1.9 million shares in Sports Entertainment, with a further £19.2m to be given by June 30th.", "Fuller will continue to expand and develop entertainment brands through his long-term agreement with CFX, the new company that will rename 19 Entertainment."], "chatgpt-4o-latest": ["Simon Fuller has sold his company, 19 Entertainment, to US entrepreneur Robert Sillerman's Sports Entertainment Enterprises (soon to be renamed CKX) in a $156 million deal.", "Fuller will receive £64.5 million in cash, 1.9 million shares, and an additional £19.2 million by June.", "He will join CKX's board to oversee creative strategy and has signed a long-term agreement to expand entertainment brands.", "19 Entertainment manages music artists, TV shows, and PR for stars like the Beckhams.", "Fuller, known for creating Pop Idol and American Idol, also managed the Spice Girls and S Club 7.", "Sillerman recently acquired an 85% stake in Elvis Presley's estate, gaining control over Graceland and revenue from Presley's music and films, while Lisa Marie Presley retains ownership of Graceland and personal items."], "stablelm2:1.6b": ["Pop Idol creator Simon Fuller has sold his entertainment company to US entrepreneur Robert Sillerman in a $5m deal, with Sillerman's company renaming as CFX.", "Fuller will serve on the board and develop creative strategies for the new venture, handling music artists, TV shows, and PR strategies for stars like the Beckhams.", "This partnership allows for global growth and expansion of entertainment brands."], "granite3.1-dense:2b": ["Simon Fuller, known for creating Pop Idol and American Idol, has sold his 19 Entertainment company to US entrepreneur Robert Sillerman's Sports Entertainment Enterprises (CFX) for $156m.", "The deal includes a cash payment of £64.5m and approximately 1.9 million shares in Sports Entertainment, with an additional £19.2m to be delivered by June.", "Fuller will join CFX's board and oversee its creative strategy.", "19 Entertainment manages artists like the Beckhams and has been instrumental in launching popular acts such as Spice Girls and S Club 7.", "The sale allows for global expansion of entertainment brands, with Fuller expressing excitement about the partnership.", "Additionally, Mr. Sillerman acquired an 85% share in Elvis Presley's estate, controlling Graceland and its assets, while retaining Lisa Marie Presley's possessions."]}