{"raw_text": "India to deport Bollywood actress\n \n India has ordered the deportation of Iranian-born model and actress Negar Khan to Norway after saying she was working illegally on her visa.\n \n Khan has had raunchy roles in music videos and Bollywood films over the past two years. The distressed actress told media she was being driven straight to the airport after a routine appointment at the Bombay immigration office. Immigration officials said she had been warned about her visa last year.\n \n Khan told an Indian news channel on her mobile phone: \"They are not even letting me go home to get my bags. I have no clothes or money on me. \"They did not give me any notice. I don't know why they are taking me away like this. There is nothing wrong with my visa. It says I work here... They are not allowing me to even call a lawyer.\" Bipin Bihari, deputy police chief in Bombay, said Khan was being sent back to Norway, from which she holds a passport, on the first available flight. \"She was on a visitor's visa but she has engaged in several commercial ventures,\" he said. \"We issued notices last year, in view of which she had gone back to Norway, but she has returned again this year to work.\" One of Khan's biggest successes was the steamy Hindi song Chadti Jawani (Rising Youth). Khan was involved in controversy when topless photos alleged to be of her appeared in a Norwegian magazine.\n", "llama3.2:1b": ["India orders deportation of Iranian-born model Negar Khan to Norway due to visa issues.", "She had been warned about her visa last year but was not given notice, and officials said she was being sent back on the first available flight from Norway after she engaged in commercial ventures and returned to work this year."], "llama3.2:3b": ["India plans to deport Iranian-born model and actress Negar Khan to Norway due to allegations she worked illegally on her visa, despite being warned last year."], "gemma2:2b": ["India is deporting Iranian-born actress Negar Khan to Norway due to allegations that she worked illegally on her visitor visa while engaging in commercial ventures in India.", "Khan claims she had no prior notice about the deportation and has been denied access to legal representation.", "She was previously deported from Norway last year but returned this year."], "qwen2.5:0.5b": ["India ordered the deportation of Iranian-born Bollywood actress Negar Khan to Norway after saying she was working illegally on her visa.", "She had raunchy roles in music videos and Bollywood films over the past two years, receiving no notice or warning when deported.", "Her main issues were that she wasn't allowed to even call a lawyer, and she had engaged in several commercial ventures despite receiving a visitor's visa last year."], "qwen2.5:1.5b": ["Iranian-born Bollywood actress Negar Khan deported from India to Norway on a visitor's visa after allegations of illegal work."], "qwen2.5:3b": ["India ordered the deportation of Iranian-born Bollywood actress Negar Khan to Norway after she worked illegally on her visa, despite having no legal issues with her current visa.", "She had previously been warned about her visa last year and faced difficulties packing due to being taken directly to the airport without notice or time to collect clothes or money.", "Officials stated that she was engaged in commercial ventures under a visitor's visa, while Khan maintained there were no problems with her visa status.", "Her work has included raunchy roles in music videos and Bollywood films, leading to controversy involving topless photos appearing on Norwegian magazine pages."], "opencoder:1.5b": ["India to deport Bollywood actress\n\nKhan, a Iranian-born model and director who has had raunchy roles in music videos and film since 2018, has been ordered the deportation from Norway after repeatedly threatening to commit illegal acts like driving straight home.", "The deportation order comes under the guidance of an Immigration official who has warned that she was working illegally and her visa had issues as well.", "Khan told a news outlet on her mobile phone: \"They are not letting me go and it's really annoying because I have nothing on my hands.", "I am in the airport, but I don't know why they keep asking me to go home, they do not give any notice.", "I don’t understand why they’re taking me away like this.", "I’m fine with my visa but I didn’t get anything.", "I am a business executive and it's really bad for her that she’s been back again.\"", "She said that they did not give any notice and they took her back to Norway, from which she holds a passport.", "\"I told them about this issue last year, and they gave me nothing, and they keep asking me to go home.\"", "A deputy police chief in Bombay has also confirmed that she was involved in several commercial ventures.", "This is just a part of the story as they did not directly call a lawyer.", "The incident happened due to an Indian news agency's claim to fame with her mobile phone screenshots, which appeared to be photographs of her in a Norwegian magazine."], "smollm:1.7b": ["India to deport Bollywood actress"], "deepseek-r1:1.5b": ["India ordered the deportation of Iranian actress Negar Khan to Norway after ruling she was working illegally on her visa.", "Khan, who has been in several raunchy films with bad content, told media that immigration officials were taking her directly to the airport, despite warnings.", "She reportedly had no clothes or money and faced a situation of being taken away without proper notice.", "Bipin Bihari, a police officer, stated she was sent back due to visa issues last year but returned again this year for work.", "Khan's big hit, \"Chadti Jawani,\" gained controversy when topless photos appeared in a Norwegian magazine."], "tinyllama:1.1b": ["India has ordered the deportation of Bollywood actress Negar Khan, who arrived on a flight from Norway last month with a visa issued by India.", "Khan had raunchy roles in music videos and Bollywood films over the past two years, but officials say she is being driven straight to the airport after being warned about her visa last year.", "She told Indian news channels that \"they are not letting me go home, I have no clothes or money on me, and there's nothing wrong with my visa.\"", "Khan was in India on a visitor's visa but has engaged in several commercial ventures.", "In September, Khan was involved in controversy when topless photos appeared in a Norwegian magazine.", "Norway deported her to Norway last year after she failed to produce her documents at the immigration office in Bombay."], "tinydolphin:1.1b": [" India has ordered the deportation of Iranian-born model and actress Negar Khan from India, as she had violated the country's immigration rules by working without permission.", "Khan faced an uncertain future after being denied entry into India for the second time this year.", "She was scheduled to leave India on Sunday, but immigration officials delayed her departure after her visa expired earlier this month.", "Negar Khan has had a string of successful music videos and Bollywood films under her belt, but she became embroiled in controversy when her naked photos were published in a Norwegian magazine."], "phi:2.7b": [" Indian immigration authorities have ordered the deportation of Iranian-born model and actress Negar Khan due to visa concerns, as she has engaged in several commercial ventures without proper notice or permission.", "She is being deported back to Norway on the first available flight."], "orca-mini:3b": [" India deports Bollywood actress Negar Khan to Norway after she violated her visa by working illegally and engaging in commercial ventures."], "hermes3:3b": ["India planning Deportation of Bollywood actress Negar Khan for working illegaly on visa."], "stablelm-zephyr:3b": ["India has ordered the deportation of Iranian-born model and actress Negar Khan to Norway, citing that she was working illegally on her visa.", "Khan starred in raunchy roles in music videos and Bollywood films for two years before being deported.", "She claims that she received no notice and was not allowed to call a lawyer.", "The immigration officials had warned her about her visa last year after she engaged in several commercial ventures while on a visitor's visa."], "chatgpt-4o-latest": ["India has ordered the deportation of Iranian-born Bollywood actress Negar Khan to Norway for working illegally on her visa.", "Khan, known for her bold roles in music videos and films, was taken directly to the airport after a routine immigration appointment.", "She claimed she was not given notice or allowed to collect her belongings or contact a lawyer.", "Authorities stated she was on a visitor's visa but engaged in commercial work despite prior warnings.", "Khan had previously returned to Norway but came back to India to work.", "She gained fame for the song Chadti Jawani and was involved in controversy over alleged topless photos in a Norwegian magazine."], "stablelm2:1.6b": ["Bollywood actress Negar Khan, who had raunchy roles in music videos and Bollywood films, is being deported from India to Norway by immigration officials due to working an illegal visa.", "She faced no notice or notice process last year when she returned to Norway.", "A court has issued notices for her alleged involvement in several commercial ventures, leading her back to work after leaving Norway.", "One of Khan's biggest achievements was the Hindi song Chadti Jawani (Rising Youth).", "She also found controversy with topless photos allegedly revealing her in a Norwegian magazine."], "granite3.1-dense:2b": ["India has ordered the deportation of Iranian-born actress Negar Khan, who has worked in Bollywood and Norway, due to irregularities on her visa.", "Khan, known for roles in raunchy music videos and films, was recently taken from her appointment at the Bombay immigration office, reportedly without proper notice or opportunity to contact a lawyer.", "Immigration officials stated she had been previously warned about her visa status, which they claim allows her to work but not independently own businesses in India.", "Khan expressed distress, stating she was not given time to gather belongings and would be taken straight to the airport for a flight back to Norway, her home country.", "This deportation follows an incident last year when topless photos of Khan allegedly surfaced in a Norwegian magazine."]}