{"raw_text": "Women in film 'are earning less'\n \n Women in the UK film industry earn less than their male counterparts despite being better qualified, according to a study released on Wednesday.\n \n Only 16% of women earn more than £50,000, compared with 30% of men. Women make up a third of the workforce. The research was carried out jointly by the UK Film Council and industry training body Skillset. It also found that women in the industry were less likely than men to be married or have dependant children.\n \n The study, which claims to be the most in-depth so far conducted, found 60% of women in the film industry hold degrees, compared with 39% of men. Whilst 17% of men in the industry had no qualifications, this was true for only five per cent of women. In the lower salary bracket, 35% of women earn less than £20,000 a year, compared to only 18% of men. The research found very few women worked in the camera, sound, electrical and construction departments, but they made up a majority of those working in make-up and hairdressing.\n \n UK Film Council chief executive John Woodward said: \"Whilst the UK has benefited hugely from its highly-qualified film production workforce there are still many barriers facing people who want to get in and stay in the industry.\" \"Developing the film production workforce must be underpinned with a commitment to diversity as well as training.\" The workforce is largely focused around London, with 78% in the industry based in the capital and the south east of England. The industry depends heavily on word of mouth, with 81% being recruited in that way. In total, only five percent of the workforce is made up of ethnic minorities, although in London the figure rises to 24%. The necessity of completing unpaid work experience to get into the workforce has also shot up, from 5% before the 1980s, to 45% after 2000.\n", "llama3.2:1b": ["Women in film earn less than men despite being better qualified and making up a third of the workforce.", "They hold 60% degrees and 35% lower salaries in the industry compared to men.", "Women are underrepresented in low-paying roles such as camera, sound, electrical, and construction departments.", "The industry is largely focused on London and relies heavily on word of mouth for recruitment."], "llama3.2:3b": ["Women in the UK film industry earn less than men, despite being better qualified.", "Only 16% of women earn more than £50,000, while 30% of men do so.", "Women make up a third of the workforce but are underrepresented in certain departments.", "The industry is largely concentrated in London and relies heavily on word of mouth recruitment."], "gemma2:2b": ["Women in the UK film industry earn less than men despite having higher qualifications.", "Only 16% of women earn over £50,000, compared with 30% of men.", "The majority of women work in make-up and hairdressing, while few work in technical roles like camera, sound, or construction.", "The industry is concentrated in London, and it relies heavily on word of mouth for recruitment.", "Only 5% of the workforce is comprised of ethnic minorities."], "qwen2.5:0.5b": ["Women in UK film industry earn less than men despite being better qualified and working more women make up a third of the workforce.", "Women are underrepresented in many departments such as cameras, sound and construction.", "The research states that only 16% of women can earn over £50, 000, compared to 30% of men.", "Women are less likely than men to be married or have dependants.", "Most women hold degrees and have no qualifications but they make up a majority of the workforce working in hairdressing, makeup and hairdrying.", "Women are largely focused on London and mainly recruit from the capital and South East of England.", "Women are underrepresented among ethnic minorities.", "Women were less likely to complete unpaid work experience compared to men after 2000."], "qwen2.5:1.5b": ["Women in UK film industry earn less than men despite better qualifications and higher education levels, according to a study released on Wednesday.", "Women make up one-third of the workforce but earn only 16% more than men.", "The research found women are less likely to be married or have children, and fewer work in camera, sound, electrical, construction departments compared to men.", "Only 5% have completed unpaid work experience."], "qwen2.5:3b": ["Women in UK film industry earn less than men despite having higher qualifications (60% of women vs 39% of men hold degrees).", "Women are less likely to be married or have dependents and represent a majority in make-up/hairdressing roles, while only 16% earn over £50,000 compared to 30% of men.", "The study found barriers such as lack of diversity commitment and difficulty for non-London-based individuals.", "Recruitment is primarily through word-of-mouth (81%), with a minority of ethnic minorities in the workforce (5% before 1980s, rising to 24% in London).", "Mandatory unpaid work experience has increased significantly over time (from 5% before 2000 to 45%)."], "opencoder:1.5b": ["Women in film 'are earning less'.", "Women in the UK film industry earn less than their male counterparts despite being better qualified.", "A study released on Wednesday found that only 16% of women earn more than £50,000 compared with 30% of men.", "Women make up a third of the workforce.", "The research was jointly conducted by the UK Film Council and industry training body Skillset.", "It also found that women in the industry were less likely than men to be married or have dependant children.", "The study revealed that only 60% of women in the film industry hold degrees, compared with 39% of men.", "Men with no qualifications earned less compared to women.", "In the lower salary bracket, more women earned less than £20,000 a year than men.", "Workforce is predominantly based in London and the south east of England.", "The industry relies heavily on word-of-mouth recruitment while only five percent of the workforce consists of ethnic minorities.", "Unpaid work experience has increased to 45% after 2000."], "smollm:1.7b": ["Women earn less than men in the UK film industry despite being better qualified.", "Only 16% of women earn more than £50,000 a year, compared with 30% of men.", "Women make up a third of the workforce.", "The research was carried out jointly by the UK Film Council and industry training body Skillset.", "It also found that women in the industry are less likely than men to be married or have dependant children."], "deepseek-r1:1.5b": ["Women in the UK film industry earn less than men despite being more educated.", "Women make up a third of the workforce, holding 16% of those with degrees compared to 39% of men.", "In the lower salary bracket, women earn less than £20k, while men earn more.", "Women are concentrated in make-up and hairdressing, making up a majority, whereas they work in camera, sound, electrical, construction, etc., which are filled by men more often.", "The film council leader emphasizes that diversity and training are barriers but notes women's workforce is primarily in London with 78% there, relying on word-of-mouth recruitment, and only five percent are ethnic minorities.", "More unpaid experience is needed after the '80s."], "tinyllama:1.1b": ["Das Frauen in der Filmwirtschaft \"ist nicht zu überquält\" (Aussprache: FEMENKUNDE) und ihre Erfolgskonkurrenz setzt sich bei Frauen mit der qualifizierten Mitarbeiterinnen der Industrie auf der Grundlage ungepfiffener Studien fort.", "Ungewisse 16% erreichen mehr als £50.000, was aus der Mitte eines Wertebereichs liegt, und die Frauen arbeiten in der Filmwirtschaft mit ihren 39%igen Erfolgskonkurrenz auf den Kosten von 60% ihrer männlichen Mitarbeitern.", "Das Studium, das die UK Film Council zusammen mit dem Skillset-Zertifizierungsinstitut vorgenommen hat, zeigt, dass 60% der Frauen in der Filmindustrie eine Hochschule besitzen und nur 35% der Männer dieselfde Ausbildung haben, was für einen geringen Grad der Qualifikation ungewöhnlich ist.", "Die meisten Frauen arbeiten in den Kategorien \"Kameramann\", \"Soundmixer\", \"Elektro-/Klangmaschineninstallateur\", \"Fan und Lichtbildner\" sowie im \"Betriebseinstieg\".", "Das UK Film Council CEO John Woodward sagte: \"Es gibt sehr vielen Barriern für Menschen, die an der Kulisse des Filmgeschäfts stehen und haben noch keine Qualifikationen.", "Der Filmwirtschaft liegt unter anderem eine Duldung aufzubieten mit einem ungleich starken Durchgang angeboten.\"", "Der Filmgewerbehalt 1980er bis 2000er Jahre waren von unpaid work experience zu einer wesentlichen Teil, bis zu 5%, und nach dem Jahr 2000 hat die Bedeutung der unpaid work experience in den Filmgewerbehalt zugenommen."], "tinydolphin:1.1b": [" The UK Film Council and Skillset jointly released a study revealing that women in the film industry earn less than their male counterparts despite having better qualifications.", "The research found that only 16% of women earn more than £50,000, compared to 30% of men.", "Women make up a third of the workforce and are less likely to be married or have dependant children.", "The study indicates that this gender pay gap is still prevalent in the film industry despite efforts by the UK Film Council and industry training body Skillset to improve representation and opportunities for women."], "phi:2.7b": [" Women in the UK film industry earn less than men, despite being better qualified.", "The study shows that only 16% of women earn more than £50,000 compared to 30% of men, and 60% of women hold degrees while 17% of men have no qualifications.", "Women make up a third of the workforce but are less likely to be married or have dependant children.", "The majority of women work in make-up and hairdressing departments, with very few working in other areas such as camera, sound, electrical and construction.", "The UK Film Council has called for more commitment to diversity and training to develop the industry's workforce.", "Women are largely based in London and the south east of England, and the majority are recruited through word of mouth.", "However, only 5% of the workforce is made up of ethnic minorities, despite a rise to 24% in London.", "The need for unpaid work experience has also increased from 5% before"], "orca-mini:3b": [" Women in film in the UK earn less than their male counterparts despite being better qualified and making up a third of the workforce.", "Only 16% of women earn more than £50,000 compared with 30% of men.", "Women are less likely to be married or have dependant children and less likely to work in certain departments such as camera, sound, electrical and construction.", "The industry depends heavily on word of mouth and is largely focused around London."], "hermes3:3b": ["Women in UK film industry earn less than men, despite higher qualifications.", "Women make up 1/3 but earn lower salaries; only 16% of women earn more than £50,000 compared to 30% of men."], "stablelm-zephyr:3b": ["A study reveals that women in the UK film industry earn less than men, with 16% earning over £50,000 compared to 30% of men.", "Women make up a third of the workforce and are less likely to be married or have dependents.", "60% of women hold degrees, while only 17% of men have no qualifications.", "The industry is largely focused in London, and diversity remains a challenge with only 5% of the workforce being ethnic minorities."], "chatgpt-4o-latest": ["Women in the UK film industry earn less than men despite being better qualified, according to a study by the UK Film Council and Skillset.", "Only 16% of women earn over £50,000 compared to 30% of men, and 35% of women earn less than £20,000, compared to 18% of men.", "Women, who make up a third of the workforce, are more likely to hold degrees but are underrepresented in technical roles like camera and sound, while dominating in make-up and hairdressing.", "The industry is concentrated in London, relies heavily on word-of-mouth hiring, and has low ethnic minority representation.", "Unpaid work experience has become increasingly necessary to enter the field.", "UK Film Council chief John Woodward emphasized the need for diversity and training to improve workforce accessibility."], "stablelm2:1.6b": ["Women in UK film earn less than men despite being better qualified; only 1% women earn over £50k compared to 4% men.", "Lower percentage of women hold degrees and fewer women work in key departments (camera, sound, electrical, construction).", "London dominates with a large number of based employees, while ethnic minorities account for just 5%.", "Recruitment via word-of-mouth has also increased from 5% to 10%."], "granite3.1-dense:2b": ["Women in the UK film industry earn less than men, despite having similar qualifications.", "The study by the UK Film Council and Skillset reveals that only 16% of women exceed £50,000 annual income, compared to 30% of men.", "Women account for a third of the workforce, with 60% holding degrees versus 39% of men.", "Lower-paid jobs disproportionately affect women (35% earn less than £20,000), while men in similar roles are more prevalent.", "Women predominate in make-up and hairdressing departments but are underrepresented in camera, sound, electrical, and construction roles.", "The industry is concentrated in London (78% of the workforce) with significant reliance on word of mouth for recruitment (81%).", "Ethnic minorities make up just 5% of the total workforce, increasing to 24% in London.", "The need for unpaid work experience has increased from 5% before the 1980s to 45% after 2000.", "UK Film Council CEO John Woodward emphasizes the need for diversity and comprehensive training to improve the industry's composition."]}