{"raw_text": "Film star Fox behind theatre bid\n \n Leading actor Edward Fox is one of the men behind plans to reopen a Swansea theatre thought to be Wales' oldest.\n \n The star of film and TV hits Day of the Jackal and Edward and Mrs Simpson has joined forces with Swansea-born actor-director Terry Palmer. They will set up a charity to raise money to buy the Palace Theatre, and hope to reopen it to audiences in summer 2006. It is estimated that £500,000 is needed to buy the Grade II listed building. The Palace Theatre, which will be known as The Pavilion Repertory Theatre, was sold to an undisclosed bidder at auction 13 months ago for £340,000. Before that it had been used as a nightclub for 10 years.\n \n Oscar-winner Sir Anthony Hopkins, who was born in nearby Port Talbot, made his professional debut there, and Charlie Chaplin and Lily Langtry have also trodden its boards. Fox told the South Wales Evening Post that after visiting the theatre he was surprised by its beauty. \"A lot of money needs to be spent on it, but all the bones are there - it just needs a beautiful skin,\" he said.\n \n \"To call it a jewel is not an over-estimation. There are not many theatres left like this. \"The hope for the immediate future is that we can attract enough people to come forward to allow it to prosper,\" he told the newspaper.\n \n Fox first found fame in the 1960s. One of his most memorable roles was as an assassin in the Day of the Jackal in 1973, and he won a TV Bafta as the Prince of Wales in 1980 for Edward and Mrs Simpson. He was brought on board to save the theatre by Mr Palmer, a long-standing friend of 40 years. \"Two years ago I decided to return to Swansea and do something for the city,\" said Mr Palmer. He said he was excited by the idea of running the Palace as a charity where young actors could develop, and with an annual Shakespeare festival in the summer. \"If in five years' time the theatre can function in all areas without me, I shall be well satisfied having helped to create a vital living theatre for the city,\" he added. Keith Poulton, a business adviser from Swansea, has already committed an undisclosed amount of money to the project. \"We need at least £75,000 to secure a deposit on the building and we've only got two months to do that,\" said Mr Poulton. \"A few benefactors have expressed their interest and Mr Fox is going to give it an awful lot of time,\" he added. Last year, roads around the theatre were cordoned off when masonry from its roof fell onto a car, but engineers said they were happy that it was safe.\n", "llama3.2:1b": ["Edward Fox has joined forces with Terry Palmer to reopen Swansea's Palace Theatre, which is thought to be Wales' oldest.", "The theatre will be renamed The Pavilion Repertory Theatre and raised funds to buy it from an undisclosed bidder for £500,000.", "The goal is to attract enough audiences in 2006 to ensure the building can function and remain a vital part of Swansea's cultural scene."], "llama3.2:3b": ["Edward Fox and Terry Palmer plan to reopen Swansea's Palace Theatre through a charity, aiming to raise £500,000 for the Grade II listed building, with plans to open in summer 2006.", "The theatre, which has hosted Oscar-winner Sir Anthony Hopkins and Charlie Chaplin, was sold at auction for £340,000 last year after being used as a nightclub for 10 years."], "gemma2:2b": ["Edward Fox and Terry Palmer are co-leading a charity effort to reopen the Palace Theatre in Swansea.", "They aim to raise £500,000 to purchase the building, which has been vacant for 10 years.", "Fox believes the theatre possesses significant historical value.", "The project is backed by an undisclosed amount from Keith Poulton and with the hope of attracting more funding and interest."], "qwen2.5:0.5b": ["The film star Edward Fox has joined forces with Swansea-born actor-director Terry Palmer to set up The Pavilion Repertory Theatre in 2006 to raise money for the Palace Theatre.", "Fox says he hopes the theatre can attract enough young actors to develop their acting skills and support an annual Shakespeare festival.", "He also plans to provide a deposit on the building that will cost £75,000."], "qwen2.5:1.5b": ["Swansea film star Edward Fox leads effort to reopen and convert Grade II-listed Palace Theatre into The Pavilion Repertory Theatre, aiming to raise £500k through charity and restore the theatre for use as an annual Shakespeare festival in summer 2006.", "The project requires securing at least £75k to buy the building and attracts interest from business adviser Keith Poulton."], "qwen2.5:3b": ["Film star Edward Fox joins Terry Palmer in plans to reopen Swansea's Palace Theatre, thought to be Wales' oldest.", "Estimated £500,000 needed for restoration.", "Formerly used as nightclub, the theatre will be renamed The Pavilion Repertory Theatre and feature an annual Shakespeare festival.", "Oscar winner Sir Anthony Hopkins is among those who have visited it and praised its beauty.", "Fox has been brought in to help save the theatre, which has a long history of notable performances including Charlie Chaplin and Lily Langtry.", "Keith Poulton has already committed funds for restoration with two months left to raise additional £75,000."], "opencoder:1.5b": ["\"After visiting the theatre, Edward Fox was surprised by its beauty and a lot of money needs to be spent on it.", "He also made his professional debut there and with an annual Shakespeare festival in the summer, The Palace Theatre is known as The Pavilion Repertory Theatre.", "After that, it has been used as a nightclub for 10 years, giving it a jewel-like reputation.\""], "smollm:1.7b": ["The film star Edward Fox is one of the men behind plans to reopen a Swansea theatre thought to be Wales' oldest.", "The leading actor has joined forces with Swansea-born actor-director Terry Palmer to set up a charity to raise money to buy the Palace Theatre, and hope to reopen it to audiences in summer 2006.", "It is estimated that £500,000 is needed to buy the Grade II listed building.", "The Palace Theatre, which will be known as The Pavilion Repertory Theatre, was sold to an undisclosed bidder at auction 13 months ago for £340,000.", "Before that it had been used as a nightclub for 10 years.", "The Oscar-winner Sir Anthony Hopkins, who was born in nearby Port Talbot, made his professional debut there, and Charlie Chaplin and Lily Langtry have also trodden its boards.", "Fox told the South Wales Evening Post that after visiting the theatre he was surprised by its beauty.", "\"A lot of money needs to be spent on it, but all the bones are there - it just needs a beautiful skin,\" he said.", "To call it a jewel is not an over-estimation.", "There are not many theatres left like this.", "\"The hope for the immediate future is that we can attract enough people to allow it to prosper,\" he told the newspaper.", "Fox first found fame in the 1960s.", "One of his most memorable roles was as an assassin in the Day of the Jackal in 1973, and he won a TV Bafta as the Prince of Wales in 1980 for Edward and Mrs Simpson.", "He was brought on board to save the theatre by Mr Palmer, a long-standing friend of 40 years.", "\"Two years ago I decided to return to Swansea and do something for the city,\" said Mr Palmer.", "\"I was excited by the idea of running the Palace as a charity where young actors could develop, and with an annual Shakespeare festival in the summer.\"", "Keith Poulton, a business adviser from Swansea, has already committed an undisclosed amount of money to the project.", "\"We need at least £75,000 to secure a deposit on the building and we've only got two months to do that,\" said Mr Poulton.", "\"A few benefactors have expressed their interest and Mr Fox is going to give it an awful lot of time.\"", "Last year, roads around the theatre were cordoned off when masonry from its roof fell onto a car, but engineers said they were happy that it was safe."], "deepseek-r1:1.5b": ["Fox is leading plans to reopen Swansea's oldest theatre, aiming to sell it for £500k in 2006 as The Pavilion Repertory Theatre.", "Edward Fox and Terry Palmer will coordinate the charity, with Hopkins joining their debut role.", "The theatre's beauty surprised him, and they're hopeful it'll attract more people to run it as a charity.", "They've secured funding but have months to secure a deposit before opening."], "tinyllama:1.1b": ["The leading actor Edward Fox is partnering with Swansea-born actor-director Terry Palmer to set up a charity aimed at buying the oldest theatre in Wales and reopening it for audiences, as well as providing a venue for events such as Shakespeare festivals.", "The theatre has been sold once before and had to close due to financial issues, but with the support of Oscar-winner Sir Anthony Hopkins, Charlie Chaplin, and Lilie Langtry, Fox said that $500,000 is needed to buy it.", "He also spoke about plans for a beautiful skin and mentioned that he believes there are \"not many theatre left like this.\""], "tinydolphin:1.1b": [" A star actor, Edward Fox, in collaboration with his co-star and Swansea-born actor-director Terry Palmer, plans to bring the Palace Theatre back to life as a charity.", "The theatre is one of Swansea's oldest buildings, having opened its doors in 1806, while Fox himself has appeared in films like \"The Day of the Jackal\" and directed productions like \"The Pavilion Repertory Theatre.\"", "Palmer believes that raising a total of £500,000 for the theatre's purchase is necessary to bring it back into operation.", "The aim is to reopen the Palace Theatre in 2006, with their plans dependent on securing the necessary funds for its renovation and restoration."], "phi:2.7b": [" Edward Fox is one of the men behind plans to reopen Swansea's oldest theatre, The Pavilion Repertory Theatre, which has been bought by an undisclosed bidder for £340,000.", "To reopen and make it flourish, at least £500,000 is needed, including restoring its bones to their former glory.", "Sir Anthony Hopkins, Charlie Chaplin, and Lily Langtry are some of the notable performers who have graced its stage in the past.", "Edward Fox has joined forces with Swansea-born actor-director Terry Palmer, and together they plan to use the theatre as a charity to raise funds for its restoration."], "orca-mini:3b": [" Leading actor Edward Fox joins forces with Swansea-born actor-director Terry Palmer to set up a charity to raise money to buy the Palace Theatre in Swansea, which is thought to be Wales' oldest theatre.", "The star of film and TV hits Day of the Jackal and Edward and Mrs Simpson has committed an undisclosed amount of money to the project.", "Plans include running the theatre as a charity where young actors can develop and having an annual Shakespeare festival in the summer.", "It is estimated that £500,000 is needed to buy the Grade II listed building.", "The theatre was sold to an undisclosed bidder at auction for £340,000 last year, and before that it had been used as a nightclub for 10 years."], "hermes3:3b": ["Edward Fox bids to reopen Swansea's Palace Theatre, aiming to raise £500K for purchase and reopening in summer 2006."], "stablelm-zephyr:3b": ["Edward Fox, star of films like \"Day of the Jackal\" and \"Edward and Mrs Simpson,\" is working with Swansea-born actor Terry Palmer to reopen Wales' oldest theatre, the Palace Theatre.", "Originally a nightclub for 10 years before being used as a venue for various performances, the Grade II listed building needs an estimated £500,000 to buy.", "Fox and Palmer aim to set up a charity to raise funds and hope to reopen the theatre in summer 2006.", "Sir Anthony Hopkins also has connections with the area and could potentially be involved in the project.", "Keith Poulton has committed an undisclosed amount of money to the venture, which needs at least £75,000 for a deposit by February."], "chatgpt-4o-latest": ["Actor Edward Fox is supporting efforts to reopen Swansea's historic Palace Theatre, partnering with actor-director Terry Palmer to establish a charity for fundraising.", "They aim to raise £500,000 to purchase and restore the Grade II listed building, which was previously a nightclub.", "The theatre, where Sir Anthony Hopkins made his professional debut, has a rich history, having hosted Charlie Chaplin and Lily Langtry.", "Fox praised its beauty and potential, emphasizing the need for restoration.", "Palmer envisions the venue as a space for young actors and an annual Shakespeare festival.", "Business adviser Keith Poulton has pledged financial support, but at least £75,000 is needed within two months for a deposit.", "Despite past structural concerns, engineers have deemed the building safe."], "stablelm2:1.6b": ["Leading actor Edward Fox and Swansea-born actor-director Terry Palmer are behind plans to reopen Wales' oldest theatre, known as Palace Theatre or The Pavilion Repertory Theatre.", "They aim to raise money for the Grade II listed building through a charity and hope to re-open it in summer 2019.", "Fox expressed surprise at its beauty after visiting; however, he said that \"all the bones are there - it just needs a beautiful skin.\"", "The theatre aims to offer a vital living theatre experience for young actors.", "Two years ago, Swansea-born actor Terry Palmer decided to return to the city and establish the theatre as a charity.", "Keith Poulton, a business adviser from Swansea, has already committed an undisclosed amount  of money to the project."], "granite3.1-dense:2b": ["Leading actor Edward Fox and Swansea-born actor-director Terry Palmer have joined forces to reopen the Palace Theatre in Swansea, Wales' potentially oldest theatre.", "The charitable project aims to raise £500,000 for purchasing the Grade II listed building, which was sold at auction 13 months ago for £340,000 after being used as a nightclub for ten years.", "Notable performers like Sir Anthony Hopkins and Charlie Chaplin have graced its stage in the past.", "Fox expressed admiration for the theatre's historical beauty and potential to become a thriving venue, emphasizing its value as a \"jewel\" due to its rarity among surviving theatres.", "Palmer, a long-time friend of 40 years, aims to transform the theatre into a platform for young actors and host an annual Shakespeare festival in summer.", "Business adviser Keith Poulton has pledged support, but at least £75,000 is needed to secure a building deposit within two months.", "Despite minor safety concerns from fallen masonry last year, engineers assured its structural integrity."]}