{"raw_text": "Super Size Me wins writers' award\n \n Super Size Me director Morgan Spurlock has won the Writers Guild of America's award for documentary feature writing.\n \n The Oscar-nominated film followed Spurlock as he ate only McDonald's fast food for an entire month. Spurlock was given the award at a special ceremony at the Roosevelt Hotel in Hollywood on Tuesday. Organisers said the rising popularity of documentary films led them to honour a writer for a documentary screenplay for the first time.\n \n Producer Brian Grazer presented the award to Spurlock and the film's backers, Roadside Attractions, Samuel Goldwyn Films and Showtime Independent Films. Spurlock set out to discover the effect of living on nothing but McDonald's for a month, upgrading to supersize portions when offered. The film followed his 25lb weight gain and the health effects on his body, including his liver and cholesterol levels. McDonald's announced it was to scrap its \"supersized\" meals last year, but denied the move was as a result of the negative publicity created by Spurlock's film. Spurlock was given his award on the same day the European Court of Human Rights ruled that two UK activists should have been given legal aid in their long fight against a McDonald's libel action. Helen Steel and David Morris, from north London, dubbed the \"McLibel Two\", were found guilty in a 1990s trial of libelling the company in a leaflet they had been handing out At the end of the case the High Court in London ruled McDonald's had been libelled and awarded the company £60,000 in damages, later reduced to £40,000 on appeal. But he found the leaflet was true in some aspects.\n", "llama3.2:1b": ["Morgan Spurlock wins Writers Guild award for documentary feature writing for \"Super Size Me\".", "The film follows his 30-day experiment eating only McDonald's fast food and documents its effects on his health.", "The award is given by the Writers Guild of America, leading to a special ceremony at the Roosevelt Hotel in Hollywood."], "llama3.2:3b": ["Super Size Me director Morgan Spurlock won the Writers Guild of America award for documentary feature writing at a ceremony in Hollywood.", "The film documented his 25lb weight gain after eating only McDonald's fast food for a month, and its release led to changes in the company's menu, including scrapping supersized meals."], "gemma2:2b": ["Morgan Spurlock won the Writers Guild of America award for documentary feature writing for his film \"Super Size Me\".", "The film followed Spurlock's month-long fast food diet experiment and documented its effects on his health.", "The European Court of Human Rights ruled in favor of UK activists involved in a legal battle against McDonald's."], "qwen2.5:0.5b": ["Super Size Me director Morgan Spurlock won a Writers Guild of America award for documentary feature writing.", "Key points:\n- Super Size Me director Spurlock won an award at the Writers Guild of America (WGA) awards.", "- Spurlock's film followed him over a month without eating fast food and focused on his weight gain, liver function, cholesterol levels, and more.", "- The film is about living off nothing but McDonald's for a month to track various health effects."], "qwen2.5:1.5b": ["Super Size Me director Morgan Spurlock wins Writers Guild of America award for documentary screenplay writing; Oscar-nominated film features an actor who embarked on a McDonald's fast-food-only diet for 30 days to investigate its health effects, including weight gain and liver problems.", "McDonald's announced it would stop selling supersized meals as a result of the film."], "qwen2.5:3b": ["Super Size Me director Morgan Spurlock wins Writers Guild of America award for documentary feature writing.", "The film about eating only McDonald's for a month led to his 25lb weight gain and health effects, including liver and cholesterol issues.", "Spurlock won the award at a special ceremony in Hollywood.", "Additionally, Helen Steel and David Morris received legal aid from the European Court of Human Rights due to their successful fight against McDonald's libel action, which was initially awarded damages but reduced on appeal."], "opencoder:1.5b": ["\"Super Size Me wins writers' award for documentary feature writing.", "The Oscar-nominated film directed Morgan Spurlock.", "Spurlock set out to discover the effect of living on nothing but McDonald's for a month, upgraded to supersize portions when offered.", "The movie followed his 25lb weight gain and the health effects on his body including his liver and cholesterol levels.", "The European Court of Human Rights ruled that two UK activists should have been given legal aid in their long fight against a McDonald's libel action.\""], "smollm:1.7b": ["Super Size Me wins Writers' Award"], "deepseek-r1:1.5b": ["Super Size Me triumphed at the Writers Guild of America award for its director, Morgan Spurlock, who won his film by eating only McDonald's fast food for an entire month.", "The film, starring Brian Grazer, follows Spurlock as he gains significant weight through this unconventional diet, exploring its health implications—especially liver and cholesterol effects—and highlights the film’s role in inspiring public awareness against McDonald's libel.", "Organizers honored him at a Hollywood ceremony, honoring his contribution to documentaries."], "tinyllama:1.1b": ["The documentary film Super Size Me directed by Morgan Spurlock won the Writers Guild of America's award for documentary feature writing, beating out hundreds of submissions from around the world.", "The Oscar-nominated film followed Spurlock as he ate only McDonald's fast food for an entire month, and won the prestigious award at a ceremony held on Tuesday in Hollywood.", "Producer Brian Grazer presented the award to Spurlock and his backers, Roadside Attractions, Samuel Goldwyne Films, and Showtime Independent Films.", "The film aimed to discover the negative health effects of living off nothing but McDonald's for a month and was praised for its investigation into the company's advertising tactics.", "McDonald's has since scrapped its \"supersized\" meals in response to the publicity created by Spurlock's film, while campaigners have vowed to continue their fight against the company's libel action.", "The European Court of Human Rights found Helen Steel and David Morris guilty in a 1990 trial over leaflets handed out at McDonald's, awarding the company £60,000 in damages later reduced to £40,000 on appeal."], "tinydolphin:1.1b": [" Super Size Me director Morgan Spurlock has won the Writers Guild of America award for documentary feature writing.", "The Oscar-nominated film followed Spurlock as he ate only McDonald's fast food for an entire month, gaining 25lb in weight.", "The film screenplay also received recognition at the special ceremony held at the Roosevelt Hotel in Hollywood on Tuesday, where Roadside Attractions, Samuel Goldwyn Films, and Showtime Independent Films presented him with the award."], "phi:2.7b": [" Super Size Me director Morgan Spurlock has won an award for his documentary feature writing about eating only McDonald's fast food for a month and its effects on his health, leading to him gaining 25 pounds.", "The Writers Guild of America recognised documentary film writers for the first time by awarding one of their Oscars to Spurlock and his team at Roadside Attractions, Samuel Goldwyn Films, and Showtime Independent Films.", "Meanwhile, McDonald's has ended its \"supersized\" meals after a trial found two activists in the UK were libelled by the company over a leaflet they handed out."], "orca-mini:3b": [" Super Size Me director Morgan Spurlock wins Writers Guild of America's award for documentary feature writing."], "hermes3:3b": ["Spurlock's 'Super Size Me' wins Writers Guild Award\nMorgan Spurlock's documentary feature wins writing award\nAward for documentary screenplay (first time)\nAwards given at Hollywood Roosevelt Hotel\nDirector Morgan Spurlock won for documentary feature writing\nDocumentary followed author eating McDonald's for a month, supersize portions\nIncreased weight gain, health effects on body\nMcDonald's scrapped \"supersized\" meals, but denied related to negative publicity"], "stablelm-zephyr:3b": ["Morgan Spurlock, director of \"Super Size Me,\" has won the Writers Guild of America award for documentary feature writing.", "The Oscar-nominated film followed Spurlock as he consumed only McDonald's fast food for a month, resulting in a 25lb weight gain and examination of health effects on his liver and cholesterol levels."], "chatgpt-4o-latest": ["Morgan Spurlock won the Writers Guild of America's award for documentary feature writing for his film *Super Size Me*, which documented his month-long diet of only McDonald's food and its health effects.", "The award was presented at a ceremony in Hollywood, marking the first time the guild honored a documentary screenplay.", "The film showed Spurlock gaining 25 pounds and experiencing negative health impacts, while McDonald's later discontinued its \"supersized\" meals but denied any connection to the film.", "On the same day, the European Court of Human Rights ruled that two UK activists, known as the \"McLibel Two,\" should have received legal aid in their long legal battle against McDonald's over a libel case."], "stablelm2:1.6b": ["Super Size Me director Morgan Spurlock wins the Writers Guild of America award for documentary feature writing after completing a month-long fast food challenge eating only McDonald's meals.", "The film documented his weight gain and health effects, including liver and cholesterol levels.", "Despite McDonald's opposition, the European Court of Human Rights ruled that two UK activists should have been granted legal aid in their fight against a McDonald's libel action."], "granite3.1-dense:2b": ["Morgan Spurlock, director of Super Size Me, won the Writers Guild of America's award for documentary feature writing at a special ceremony in Hollywood.", "The Oscar-nominated film documented Spurlock's month-long consumption solely of McDonald's fast food, including supersized portions, leading to significant weight gain and health issues.", "Despite McDonald's earlier announcement to discontinue \"supersized\" meals, the company denied this decision was due to the film's negative impact.", "On the same day, the European Court of Human Rights ruled in favor of two UK activists, the \"McLibel Two,\" who had been found guilty of libeling McDonald's through a 1990s leaflet.", "The High Court had previously awarded £60,000 in damages to McDonald's; however, the court later reduced this amount to £40,000 after finding some aspects of the leaflet true."]}