{"raw_text": "Oscar nominees lack pulling power\n \n This year's clutch of Oscar nominees have been the least popular for 20 years according to box office figures.\n \n In the US the five nominated for best film have been seen by 50% fewer people than movies in previous years. While the awards are not based on box office popularity there is concern for the ratings of the televised ceremony. \"We don't have a Titanic or a Lord of the Rings out there. I think it's fair to say it does concern us a bit,\" said Academy executive director Bruce Davis. About 51 million people in the US have seen this year's nominees, compared with between 100 million and 118 million in recent years. The last time combined attendance was so low was in 1984 when Amadeus beat The Killing Fields, A Passage to India, Places in the Heart and A Soldier's Story to best picture, when 41 million saw the five films. Last year's ceremony attracted the highest audience in four years as viewers tuned in to see Lord of the Ring: Return of the King sweep the board.\n \n And the show reaped its biggest audience in 1997 when Titanic took home 11 Oscars.\n \n The film had taken $500m (£264m) worldwide before the ceremony, and eventually took $1.8bn (£952m). \"Eyeballs starring at the movie screen translates to eyeballs staring at the TV screen,\" said Paul Dergarabedian of box office tracker Exhibitor Relations. \"People like to have a vested interest in what they're watching. \"When Titanic does $1.8bn in worldwide box office, you've got a lot of people with a vested interest.\" Past years have also seen blockbusters such as Saving Private Ryan, Forrest Gump and Ghost compete for Oscars. The biggest box office hitter among this year's nominees is The Aviator, which has taken $90m (£48m) in the US, although takings in the UK have reached only £7m so far.\n \n Low-budget move Sideways and Finding Neverland have so far grossed about $45m (£24m) each. The year's biggest blockbusters do actually feature in the Oscar nominees but in the animation category. Shrek 2 and The Incredibles took $436m (£231m) while The Incredibles took $259m (£137m). Mel Gibson's The Passion of the Christ, which took $370m (£196m) in the US, was largely ignored by Academy voters.\n \n But many in the film industry do not equate award and box office success. \"I have never equated the Academy Awards with how much money a movie takes in,\" said Nikki Rocco, head of distribution at Universal which released nominee Ray. \"That's the People's Choice Awards. This is not about the public. This is about the industry bestowing awards on what they think are the best films of the year.\"\n", "llama3.2:1b": ["Oscar nominees lack pulling power, with attendance figures 50% lower than previous years in the US.", "The televised ceremony has also seen its highest audience since 1984, but viewership declined by around 30-40%.", "Many past blockbusters compete for Oscars, and low-budget films like Sideways and Finding Neverland have grossed $45m each."], "llama3.2:3b": ["This year's Oscar nominees have been seen by 50% fewer people in the US than in previous years, with a total attendance of around 51 million compared to 100-118 million in recent years.", "The ceremony has historically drawn larger audiences for big-budget blockbusters like Titanic and Lord of the Rings.", "Industry experts argue that there is a disconnect between box office success and Oscar nominations, with some arguing that awards should be about recognizing industry excellence rather than public popularity."], "gemma2:2b": ["This year's Oscar nominees have low box office appeal, with fewer people seeing them compared to past years.", "The lack of highly popular blockbuster films has raised concerns about ratings for the televised ceremony."], "qwen2.5:0.5b": ["Oscar nominees struggle to generate popularity in 2017 as only 50% fewer people watched them compared to last years, according to box office figures.", "The film \"Titanic\" took home eight Oscar nominations and was a huge hit, but \"Sideways\" and \"Finding Neverland\" have so far seen little attention from the Academy of Motion Picture Arts and Sciences (AMPAS)."], "qwen2.5:1.5b": ["Oscar nominees have lower box office attendance compared to recent years, with five nominees having seen 50% fewer people than before.", "Concerns exist regarding the ratings for the televised ceremony due to a lack of high-profile blockbusters.", "The Academy's executive director Bruce Davis mentioned that there is a \"fair concern\" about the low turnout and that the last time combined attendance was so low was in 1984, when Titanic topped the Oscar nominations."], "qwen2.5:3b": ["This year's Oscar nominees have seen the lowest audience in 20 years, with five nominated films attracting only half as many viewers compared to recent years.", "The situation raises concerns for the ceremony’s ratings, as this year’s nominees have been viewed by about 51 million people in the US, significantly lower than previous years.", "The film industry does not necessarily equate award success with box office performance; many popular blockbusters are missing from the nominations.", "Past winners like Titanic and Lord of the Rings had much higher viewership for their respective ceremonies.", "This year's nominees include a mix of high-grossing ($1.8 billion) and low-budget ($45 million+) films, reflecting varied commercial success in the industry."], "opencoder:1.5b": ["Oscar nominees lack pulling power.", "This year's clutch of Oscar nominees have been the least popular for 20 years according to box office figures.", "In the US, the five nominated for best film have seen an increase in attendance compared with previous years by 50% - a difference of 49%.", "The awards are not based on box office popularity and there is concern for the ratings of the televised ceremony, but \"We don't have a Titanic or a Lord of the Rings out there\" concerns us a bit.", "About 51 million people in the US have seen this year's nominees - compared with between 100 million and 118 million in recent years - and the last time combined attendance was so low was in 1984 when Amadeus beat The Killing Fields, A Passage to India, Places in the Heart and A Soldier's Story to best picture.", "In 1997, Titanic took home 11 Oscars which is the biggest box office hitter among this year's nominees."], "smollm:1.7b": ["The Oscar nominees lack pulling power in the US due to a combination of factors, including:\n\n1.", "**Box office performance**: The 2019 Oscars saw a significant decrease in box office receipts compared to previous years, with many movies failing to attract a large audience or generating sufficient revenue to justify their release on the big screen.", "2.", "**Televised competition**: The televised ceremony is not based on box office performance, but rather on the nominees' critical acclaim and cultural relevance.", "This means that movies that may have performed well in the US may struggle to attract a large audience at home or internationally.", "3.", "**Lack of cultural relevance**: The 2019 Oscars saw a decline in nominees who were widely popular in the US, such as Titanic and Finding Neverland.", "These films may not resonate with audiences in other countries or regions, which can negatively impact their box office performance.", "4.", "**Competition from other awards**: The Academy Awards are one of several major film awards competitions, including the Golden Globe Awards, BAFTA Awards, and Saturn Awards.", "This competition can lead to a situation where nominees from other categories may receive more attention and accolades than those in the Oscars.", "5.", "**Criticisms of the nomination process**: Some critics have argued that the Academy's nomination process is flawed, with some arguing that it prioritizes nominees based on their popularity rather than their artistic merit or cultural relevance.", "This can lead to a situation where movies that are critically acclaimed but commercially underwhelming may struggle to win Oscars.", "6.", "**Economic factors**: The 2019 Oscars saw a decline in the number of nominees from major studios, which can negatively impact their box office performance and overall economic viability.", "This is particularly true for smaller studios or those that are not as well-known globally.", "7.", "**Lack of diversity**: The 2019 Oscars saw a lack of diversity among nominees, with many films featuring predominantly white casts and crews.", "This can lead to a situation where movies from underrepresented groups may struggle to gain attention and accolades at home or internationally.", "Overall, the 2019 Oscar nominees lacked pulling power in the US due to a combination of factors that included box office performance, televised competition, lack of cultural relevance, competition from other awards, criticisms of the nomination process, economic factors, and lack of diversity among nominees."], "deepseek-r1:1.5b": ["The film industry has faced criticism for not always aligning with box office success.", "This year's Oscar nominees have underperformed by 50% over the past decade, particularly during the televised ceremony, where ratings are a concern.", "In the U.S., five films were nominated but only 51 million viewers compared to higher attendance in previous years, especially up from 41 million for Amadeus.", "The highest audience was last year with Lord of the Rings winning, at 38.79 million.", "Blockbusters like Saving Private Ryan and Forrest Gump occasionally made the cut in awards but haven't won box office success.", "Biggest grosses this year were Sideways ($45m) and Finding Neverland ($45m), while Shrek 2 and The Incredibles claimed $436m and $259m, respectively.", "Mel Gibson's The Passion of the Christ was largely overlooked in awards but made box office success.", "The film industry debates award precedence over box office performance."], "tinyllama:1.1b": ["The 2016 Oscar nominations have been less successful than in previous years, with a total of 5 nominations for each film, down from 13 in 2014.", "The box office figures for the five nominated films were seen as not as popular by Exhibitor Relations, who estimated that they attracted between $1.8bn and $1.9bn worldwide before the ceremony, with a total of $500m (£264m) in advance pre-sales alone.", "Some industry executives have expressed concern for the ratings of this year's event, noting that the box office figures were lower than in recent years and the number of people who had seen each nominated film was lower than usual.", "However, some have pointed out that the most popular Oscar nominee, The Avengers, won over $1.8bn globally."], "tinydolphin:1.1b": [" Oscar nominations lack pulling power, and this year's clutch of contenders have been the least popular in 20 years for box office figures.", "In the US, the five nominated movies have seen a collective viewership of 51 million people compared to around 100 million in previous years.", "Adequate viewership is crucial for any film to succeed at the Oscars, and this low-end attendance may impact its chances of winning big prizes.", "The nominations are a reflection of a slowing box office, further highlighting the concerns surrounding the upcoming awards ceremony."], "phi:2.7b": [" The Oscar nominees this year have been less popular than in previous years, with box office figures showing that five nominated films have been seen by 50% fewer people than movies from previous years.", "The lack of a blockbuster like Titanic has raised concerns about ratings for the televised ceremony.", "While some in the film industry do not equate award and box office success, others argue that the Academy Awards should recognize the best films regardless of their popularity or financial success."], "orca-mini:3b": [" This year's clutch of Oscar nominees have been the least popular for 20 years according to box office figures.", "The five nominated for best film have been seen by 50% fewer people than movies in previous years.", "While the awards are not based on box office popularity, there is concern for the ratings of the televised ceremony.", "In the US the last time combined attendance was so low was in 1984 when Amadeus beat The Killing Fields, A Passage to India, Places in the Heart and A Soldier's Story to best picture, when 41 million saw the five films.", "Last year's ceremony attracted the highest audience in four years as viewers tuned in to see Lord of the Ring: Return of the King win all 11 Oscars."], "hermes3:3b": ["Oscar nominees have lowest US attendance in 20 years, drawing 50% fewer people than previously."], "stablelm-zephyr:3b": ["This year's Oscar nominees have seen a significant decline in popularity, with 50% fewer people watching them compared to previous years.", "Although the Oscars are not based on box office success, there is concern about ratings for the televised ceremony.", "The last time combined attendance was this low was in 1984.", "Big-budget films such as Titanic and Saving Private Ryan have previously competed for Oscars, while low-budget movies like Sideways and Finding Neverland have also garnered attention with their respective Oscar nominations."], "chatgpt-4o-latest": ["This year's Oscar nominees are the least popular in 20 years based on box office figures, with attendance for the five Best Picture nominees down 50% compared to previous years.", "About 51 million people in the US have seen the nominated films, far fewer than past years when attendance ranged from 100 to 118 million.", "The lack of a major blockbuster like Titanic or The Lord of the Rings raises concerns about TV ratings for the ceremony.", "The biggest box office success among nominees, The Aviator, has earned $90 million in the US, while Sideways and Finding Neverland have each grossed about $45 million.", "Meanwhile, major hits like Shrek 2 and The Incredibles are only nominated in the animation category, and The Passion of the Christ was largely ignored by the Academy.", "However, some in the industry argue that Oscars are about artistic merit rather than box office success."], "stablelm2:1.6b": ["This year's Oscar nominees have been the least popular for several years based on box office figures, with only around 1 million viewers seeing them in the US compared to around 2-3 million in recent years.", "Low-budget movies such..", "The text discusses the popularity and box office success of this year's Oscar nominees and how their popularity compares to previous years.", "The article highlights that although low-budget films such as \"Sideways\" and \"Finding Neverland\" have grossed between $1-$2 million, major blockbusters like \"Titanic\" have taken significantly more.", "Despite the box office success of these films, many in the industry don..", "The text also examines how Academy voters view award versus box office success.", "According to Nikki Rocco, head of distribution at Universal for releasing nominee Ray, the awards are not based on box office popularity but rather on the quality of the film itself.", "The article also discusses concerns about the ratings for this year's televised ceremony due to the perceived lack of a blockbuster movie."], "granite3.1-dense:2b": ["This year's Oscar nominees have seen reduced attendance compared to previous years, with 51 million U.S. viewers watching the five best picture contenders—a 50% decline from averages between 100 and 118 million in recent decades.", "This marks the lowest combined attendance since 1984. Notable films like Titanic, which grossed $2.2 billion worldwide before the ceremony, and blockbusters Shrek 2 and The Incredibles are among this year's nominees but have failed to draw the same level of audience interest as past Oscar contenders, such as Lord of the Rings: Return of the King.", "Low-budget films Sideways and Finding Neverland have also underperformed at the box office.", "Industry figures argue that award consideration is more about critical acclaim than box office success, emphasizing that the Academy Awards represent industry recognition rather than public voting."]}