{"raw_text": "Lost Doors frontman movie found\n \n Historians in Florida have discovered a 40-year-old clip of a clean-cut Jim Morrison appearing in a promotional film for his university.\n \n The 1964 film shows the Doors frontman, who died aged 27 in 1971, playing the part of a young man who had been rejected by Florida State University. Morrison is seen quizzing a college administrator on why he was refused. \"But what happened? How come my parents and the state and the university didn't look ahead?\" he is seen asking.\n \n \"It's incredible. He's so clean cut and soft-spoken,\" said Florida state archivist Jody Norman. \"We know he was at Florida State University for a period of time and he did some acting when he was there,\" Norman added. The Doors were one of the most influential bands of the 1960s, with hits including Light My Fire and Riders On The Storm. Morrison was notorious for his wild lifestyle - and was accused of exposing himself and simulating a sex act at a Miami concert in 1969. He was found dead in the bath of his Paris apartment and died from heart problems, aggravated by alcohol. A coroner recorded a verdict of death by natural causes and his grave at the city's Pere Lachaise ceremony has become a shrine for fans.\n", "llama3.2:1b": ["Historians in Florida have discovered a 40-year-old clip of Jim Morrison in a promotional film from 1964 showing him playing a character who was rejected by Florida State University, quizzing an administrator on his parents' and university's reasons.", "The discovery is seen as significant due to Morrison's early start at the university and his acting career during that time."], "llama3.2:3b": ["Historians have discovered a 1964 film clip showing young Jim Morrison, then a university student, being rejected from Florida State University and quizzing an administrator on why he was refused."], "gemma2:2b": ["A promotional film from 1964 shows Jim Morrison, lead singer of The Doors, questioning why he was rejected from Florida State University.", "He is seen appearing as a young man looking for answers about his rejection.", "The discovery sheds light on Morrison's life before his infamous wild lifestyle and tragic death."], "qwen2.5:0.5b": ["A 40-year-old clip of a clean-cut Jim Morrison appeared in a promotional film for his university, which shows him playing the part of a young man who had been rejected by Florida State University.", "The clip was discovered by Florida state archivist Jody Norman and revealed that Morrison was at Florida State University for a period of time and did some acting when he was there.", "He was known for his wild lifestyle and was accused of exposing himself and simulating a sex act at a Miami concert in 1969.", "He died from heart problems, aggravated by alcohol, during a coroner's verdict of death by natural causes and his grave became a shrine for fans at the city's Pere Lachaise ceremony."], "qwen2.5:1.5b": ["Historians have discovered 40-year-old footage showing Jim Morrison appearing in a promotional film for Florida State University in 1964, where he played a character rejected by the university due to poor grades.", "The Doors frontman died at age 27 from heart problems aggravated by alcohol and is remembered as one of the most influential bands of the 1960s."], "qwen2.5:3b": ["Historians in Florida have unearthed a 40-year-old promotional film featuring Jim Morrison of The Doors, showing him as a rejected student questioning university administrators.", "First discovered in 1964, Morrison appears polished yet confronts an administrator about his rejection from Florida State University.", "Known for his wild lifestyle and later death by heart problems exacerbated by alcohol, Morrison's life contrasts sharply with this seemingly refined depiction."], "opencoder:1.5b": ["The Los Angeles Times reported that Florida State University student Jim Morrison was found dead in an apartment on the lake side of a college campus, after allegedly exposing himself as a streetwise and unfaithful liar at a Miami concert in 1979.", "His parents were also found in court, accusing him of causing any similar acts to public figures in Florida."], "smollm:1.7b": ["The Lost Doors frontman movie found is a 40-year-old film clip that shows Jim Morrison playing the role of a young man who was rejected by Florida State University in a promotional film for his university.", "The clip appears to show him questioning a college administrator about why he was refused, and it also features a clean cut and soft-spoken tone.", "Historians in Florida have discovered this 1964 film clip that shows Jim Morrison playing the role of a young man who was rejected by Florida State University in a promotional film for his university.", "The clip appears to show him questioning a college administrator about why he was refused, and it also features a clean cut and soft-spoken tone.", "The 1964 film clip is significant because it shows Jim Morrison performing as the frontman of the Lost Doors, one of the most influential bands of the 1960s.", "The clip appears to show him playing the role of a young man who was rejected by Florida State University in a promotional film for his university.", "This suggests that Morrison may have been at Florida State University during this period and may have performed there as part of a promotional effort.", "The clip also shows Jim Morrison's clean cut and soft-spoken tone, which is consistent with the image of the Lost Doors frontman that fans associate with Morrison.", "The clip appears to show him performing in a promotional film for his university, which suggests that he was at Florida State University during this period.", "This adds credibility to the claim that Morrison may have been at Florida State University during this period and may have performed there as part of a promotional effort.", "The discovery of this 1964 film clip has significant implications for our understanding of Jim Morrison's career and legacy.", "It suggests that Morrison was not only a talented musician but also a charismatic performer who was able to connect with audiences on an emotional level.", "The clip also shows that Morrison was not afraid to push boundaries and challenge societal norms, which is consistent with the image of the Lost Doors frontman that fans associate with Morrison.", "Overall, the discovery of this 1964 film clip provides a new window into Jim Morrison's career and legacy.", "It suggests that Morrison may have been at Florida State University during this period and may have performed there as part of a promotional effort.", "The clip also shows his clean cut and soft-spoken tone, which is consistent with the image of the Lost Doors frontman that fans associate with Morrison."], "deepseek-r1:1.5b": ["A 40-year-old clip of Jim Morrison, frontman from *The Doors*, appears in a promotional film for Florida State University in 1964.", "Morrison, who died at 27 in 1971 after being rejected by the university and later criticized for his wild lifestyle (including acts of humor), is questioned on his decision to leave Florida State during a meeting.", "The clip has been discovered, sparking interest among historians in Florida.", "Morrison's death was attributed to heart problems exacerbated by alcohol consumption, and his passing became a memorials site for fans."], "tinyllama:1.1b": ["Los Tres Doctos protagonista de una película promocional del estado de Florida descubrió que su acto en la versión de 1964 de un papel para la Universidad Estatal de Florida.", "El actor Jim Morrison está visto jugando al personaje del chico rechazado por Florida State University.", "\"Se ve tan limpio y bien cortado, se parece mucho a él\", dijo el archivador del estado de Florida Joey Norman.", "\"Vale que conocemos que fue en el Instituto Estatal de Florida durante un periodo temprano y se hizo acto de presencia cuando estaba allí.\"", "Los Tres Doctos fueron una de las bandas más influyentes del siglo 1960, con canciones como Light My Fire y Riendones On The Storm.", "Morrison fue notorio por su vida loca - y fue acusado de exposarse al público y simular una escena de sexo en un concierto de Miami en 1969.", "Murió de problemas cardiovasculares aggravados y se dio cuenta de la tumba del estudio de los Coroneros de muerte por Naturales (1970) que había estado asignado al lugar, y descubrió que había sido enterrado en la celebración de los restos de un acuerdo de la banda."], "tinydolphin:1.1b": [" Lost Doors frontman movie found: The 1964 film featuring Jim Morrison, the iconic Doors frontman who died in 1971, is believed to have been lost for decades before being discovered by historians in Florida.", "In this clip from a promotional film for his university, Jim Morrison plays the role of a young man who is rejected by the school.", "The footage shows him questioning an administrator about why he was turned down."], "phi:2.7b": [" Jim Morrison, frontman of Lost Doors, appeared in a promotional film for Florida State University 40 years ago when he played a young man who had been rejected.", "The clip shows him asking questions to an administrator about why he was denied enrollment.", "Florida state historian Jody Norman said that Morrison was clean-cut and soft spoken, which is unusual for the wild lifestyle he lived."], "orca-mini:3b": [" The frontman of the band The Doors, Jim Morrison, appeared in a promotional film for his university while he was studying there.", "In the film, Morrison played the role of a young man who had been rejected by Florida State University, questioning why his parents and the state had not looked ahead.", "He died at the age of 27 in 1971."], "hermes3:3b": ["Jim Morrison film clip found: Doors frontman appearing in 1964 college acting role."], "stablelm-zephyr:3b": ["A 40-year-old video has been discovered featuring Jim Morrison, known as the frontman of the Doors band, appearing in a promotional film for Florida State University where he played the part of a young man rejected by the university.", "The video shows Morrison asking the college administrator why he was denied admission, and it provides insight into his soft-spoken personality at that time.", "The discovery highlights Morrison's connection to Florida State University during his period of study there, as well as his acting endeavors while studying.", "The Doors emerged as one of the most influential bands in the 1960s with hits such as Light My Fire and Riders On The Storm, but Morrison was also known for his wild lifestyle, which included accusations of exposing himself and simulating a sex act at a Miami concert in 1969.", "He died at age 27 due to heart problems exacerbated by alcohol consumption, and his grave has since become a shrine for fans."], "chatgpt-4o-latest": ["Historians in Florida have discovered a 1964 promotional film featuring a young, clean-cut Jim Morrison before his rise to fame with The Doors.", "The clip shows Morrison playing a rejected student questioning a college administrator at Florida State University, where he briefly studied and acted.", "Archivist Jody Norman expressed surprise at his soft-spoken demeanor.", "The Doors became one of the most influential bands of the 1960s, with Morrison known for his wild lifestyle.", "He died in 1971 at age 27 from heart problems aggravated by alcohol, and his grave in Paris remains a fan shrine."], "stablelm2:1.6b": ["Historians find clip of Jim Morrison in a 1978 university promotional film; he plays a rejected student at Florida State University.", "Clean-cut appearance, soft-spoken demeanor notable.", "Doors were influential during '60s with hits like \"Light My Fire\" and \"Riders on the Storm.\"", "Morrison died at age 27 from heart problems exacerbated by alcohol."], "granite3.1-dense:2b": ["40-year-old film footage has surfaced, revealing Jim Morrison, Doors frontman who died in 1971 at 27, as a student at Florida State University.", "In the 1964 promotional clip, Morrison, portrayed as a young man rejected by the university, questions an administrator about his rejection.", "Despite his infamous reputation for wild behavior and a controversial death from alcohol-related heart failure in Paris, this film showcases a more subdued side of Morrison, emphasizing his clean-cut appearance and mild demeanor during his brief period at the university."]}