{"raw_text": "Hobbit picture 'four years away'\n \n Lord of the Rings director Peter Jackson has said that it will be up to four years before he starts work on a film version of The Hobbit.\n \n The Oscar winner said on a visit to Sydney there was a \"desire\" to make it, but not before lengthy negotiations. \"I think it's gonna be a lot of lawyers sitting in a room trying to thrash out a deal before it will ever happen,\" said the New Zealander. The rights to JRR Tolkien's book are split between two major film studios. Jackson, who is currently filming a remake of Hollywood classic King Kong, said he thought that the sale of MGM studios to the Sony Corporation would cast further uncertainty on the project. The 43-year-old was in the Australian city to visit a Lord of the Rings exhibition, which has attracted 140,000 visitors since it opened in December.\n \n The film-maker recently sued film company New Line Cinema for undisclosed damages over alleged withheld profits and lost revenue from the first part of the Middle Earth trilogy. The Fellowship of The Ring from 2001 went on to make worldwide profits of $291 million (£152 million). Jackson is thought to have secured the most lucrative film directing deal in history to remake King Kong, which is currently in production in Wellington. The picture, which stars Naomi Watts and Oscar winner Adrien Brody, is due to be released in December. Jackson has also committed to making a film version of Lovely Bones, based on the best-selling book by Alice Sebold.\n", "llama3.2:1b": ["Peter Jackson will start work on a Hobbit film version four years after announcing plans.", "The rights to Tolkien's book are split between MGM and Sony.", "Jackson is considering lengthy negotiations due to uncertainty over studio deals.", "He has sued New Line Cinema for undisclosed damages."], "llama3.2:3b": ["Peter Jackson said he won't start work on The Hobbit for four years due to lengthy negotiations over the rights between two major film studios.", "He recently sued New Line Cinema for undisclosed damages."], "gemma2:2b": ["Peter Jackson says it will be four years before he starts work on \"The Hobbit\" due to lengthy negotiations and uncertainty about the rights' split between two film studios.", "He recently sued New Line Cinema over profits from the first \"Lord of the Rings\" movie, and is currently directing \"King Kong\" which has a lucrative deal for Jackson."], "qwen2.5:0.5b": ["Lord of the Rings director Peter Jackson said it would be up four years before he starts working on a film version of The Hobbit.", "He is currently filming a remake of King Kong and has been sued by New Line Cinema for undisclosed damages over profits from the Middle Earth trilogy.", "Jackson also plans to make a film version of Lovely Bones based on Alice Sebold's best-selling book."], "qwen2.5:1.5b": ["Peter Jackson expects four years for Hobbit adaptation after lengthy negotiations with studios over rights; JRR Tolkien's books split between MGM and Sony; New Line Cinema sued for undisclosed damages in King Kong remake deal; Jackson also committed to making a film version of Lovely Bones based on Alice Sebold's novel."], "qwen2.5:3b": ["Lord of the Rings director Peter Jackson plans to start work on a Hobbit film version in four years after lengthy negotiations with rights holders.", "Jackson mentioned potential uncertainty due to Sony's purchase of MGM studios.", "He is currently filming a remake of King Kong and recently sued New Line Cinema over profits from The Fellowship of the Ring.", "Jackson has also secured lucrative deals for directing films of Lovely Bones and intends to make a Hobbit movie once agreements are finalized."], "opencoder:1.5b": ["The film-maker recently sued New Line Cinema for undisclosed damages over alleged withheld profits and lost revenue from the first part of The Hobbit trilogy.", "The picture, which stars Naomi Watts and Adrien Brody, is due to be released in December."], "smollm:1.7b": ["The Hobbit: Four Years Away is a movie adaptation of J.R.R.", "Tolkien's novel The Hobbit.", "It will be directed by Peter Jackson and produced by New Line Cinema.", "The film is expected to be released in December 2019, with the first part of the trilogy being released in 2023.", "The Oscar winner has said that it will take four years before he starts work on a film version of The Hobbit.", "He thinks that the sale of MGM studios to Sony Corporation would cast further uncertainty on the project.", "Jackson, who is currently filming a remake of Hollywood classic King Kong, said he thought that the sale of MGM studios to the Sony Corporation would have an impact on the project.", "The film-maker recently sued New Line Cinema for undisclosed damages over alleged withheld profits and lost revenue from the first part of the Middle Earth trilogy.", "The Fellowship of The Ring from 2001 went on to make worldwide profits of $291 million (£152 million).", "Jackson is thought to have secured the most lucrative film directing deal in history to remake King Kong, which is currently in production in Wellington.", "Jackson has also committed to making a film version of Lovely Bones, based on the best-selling book by Alice Sebold."], "deepseek-r1:1.5b": ["Hobbit 'four years away' indicates that *The Lord of the Rings* will take at least four years before its film adaptation begins.", "Peter Jackson, the director, made comments about negotiations needing lengthy efforts, mentioning potential deals with two major studios and uncertain deal acquisition due to possible sale uncertainties.", "The first part of the Middle-earth trilogy generated $291 million worldwide.", "Jackson has secured one of his most lucrative directing deals, aiming for a film version in December.", "A new *Lovely Bones* adaptation is also in production."], "tinyllama:1.1b": ["Peter Jackson has stated that he will not begin work on The Hobbit until after lengthy negotiations are completed with two major studios.", "Jackson mentioned concerns over the sale of JRR Tolkien's rights to Hollywood filmmakers, who were reportedly interested in purchasing MGM Studios in December 2017.", "This deal has attracted criticism, as it may result in further uncertainty on the project.", "Jackson has not yet committed to making a film adaptation of Lovely Bones or other works by Alice Sebold, but has stated his interest in making such projects in the future."], "tinydolphin:1.1b": [" The Hobbit, a popular fantasy novel by JRR Tolkien, will not be made into a film until four years have passed, according to Peter Jackson, director of the Lord of the Rings trilogy.", "The Hobbit was once a well-known book in its own right, but due to the delays, it has been pushed back into future time.", "Currently, Jackson is in Australia to visit for a filming project and the Lord of the Rings exhibition in Sydney, where fans can see the first part of Middle Earth's story."], "phi:2.7b": [" Peter Jackson, director of The Hobbit movie, announced that it will take four years before he starts work on the film adaptation.", "He mentioned negotiations with two major film studios and added that Sony Corporation's acquisition of MGM studios might affect the project due to uncertain rights division.", "On a separate note, Jackson recently sued New Line Cinema for undisclosed damages from the first part of The Lord of the Rings trilogy.", "However, he secured the most lucrative film directing deal in history to remake King Kong and is also working on a film adaptation of Lovely Bones."], "orca-mini:3b": [" Peter Jackson said he will take up to four years to make a film version of The Hobbit after completing negotiations with the rights to the book between two major film studios.", "However, the sale of MGM studios to Sony Corporation is expected to cast further uncertainty on the project.", "Jackson has also sued New Line Cinema for undisclosed damages and won profits from the first part of the Middle Earth trilogy.", "He is set to direct the remake of King Kong, which stars Naomi Watts and Adrien Brody."], "hermes3:3b": ["Hobbit film 4 years away; Peter Jackson to start after negotiations."], "stablelm-zephyr:3b": ["Peter Jackson, director of Lord of the Rings, says it will take up to four years to start making a movie version of The Hobbit.", "This is because of problems with the rights to the book and lots of lawyers trying to work out a deal.", "He also talked about making a King Kong remake and a film based on a book called Lovely Bones."], "chatgpt-4o-latest": ["Peter Jackson stated that it could take up to four years before work begins on a film adaptation of The Hobbit due to complex legal negotiations between two major studios holding the rights.", "He noted that MGM’s sale to Sony could further delay the project.", "Jackson, currently directing a King Kong remake, recently sued New Line Cinema over alleged withheld profits from The Fellowship of the Ring.", "His King Kong film, starring Naomi Watts and Adrien Brody, is set for release in December.", "He has also committed to directing a film adaptation of Alice Sebold’s novel Lovely Bones."], "stablelm2:1.6b": ["Director Peter Jackson expects it to take four years for a film adaptation of The Hobbit with two major studios handling rights.", "Uncertainty arises from recent studio sales and ongoing legal negotiations.", "He is currently filming King Kong remake.", "Jackson recently sued New Line Cinema over undisclosed damages.", "First part of Middle Earth trilogy made worldwide profits of $10 million (£5 million).", "Other projects include Lovely Bones film adaptation."], "granite3.1-dense:2b": ["Lord of the Rings director Peter Jackson anticipates a four-year delay in initiating The Hobbit film adaptation due to complex rights negotiations involving two major studios.", "These rights were recently transferred during MGM's sale to Sony, adding uncertainty.", "Jackson is currently filming King Kong's remake and has faced legal disputes with New Line Cinema over undisclosed profits from The Lord of the Rings trilogy.", "His most recent project, a film version of Lovely Bones based on Alice Sebold's book, is in progress.", "Despite these challenges, Jackson's Lord of the Rings exhibition in Sydney has drawn 140,000 visitors since its December opening."]}