{"raw_text": "Yukos unit buyer faces loan claim\n \n The owners of embattled Russian oil giant Yukos are to ask the buyer of its former production unit to pay back a $900m (£479m) loan.\n \n State-owned Rosneft bought the Yugansk unit for $9.3bn in a sale forced by Russia to part settle a $27.5bn tax claim against Yukos. Yukos' owner Menatep Group says it will ask Rosneft to repay a loan that Yugansk had secured on its assets. Rosneft already faces a similar $540m repayment demand from foreign banks. Legal experts said Rosneft's purchase of Yugansk would include such obligations. \"The pledged assets are with Rosneft, so it will have to pay real money to the creditors to avoid seizure of Yugansk assets,\" said Moscow-based US lawyer Jamie Firestone, who is not connected to the case. Menatep Group's managing director Tim Osborne told the Reuters news agency: \"If they default, we will fight them where the rule of law exists under the international arbitration clauses of the credit.\"\n \n Rosneft officials were unavailable for comment. But the company has said it intends to take action against Menatep to recover some of the tax claims and debts owed by Yugansk. Yukos had filed for bankruptcy protection in a US court in an attempt to prevent the forced sale of its main production arm. The sale went ahead in December and Yugansk was sold to a little-known shell company which in turn was bought by Rosneft. Yukos claims its downfall was punishment for the political ambitions of its founder Mikhail Khodorkovsky and has vowed to sue any participant in the sale.\n", "llama3.2:1b": "Yukos unit buyer asks Rosneft to repay $900m loan, facing tax claim against itself. Menatep Group plans to seek repayment from Rosneft due to pledged assets being with company. Rosneft is taking action against Yukos and its parent to recover tax claims and debts owed by Yugansk.", "llama3.2:3b": "The owners of Yukos will ask the buyer of the Yugansk unit, Rosneft, to repay a $900m loan, which was secured by the former production unit's assets. Rosneft faces similar repayment demands from foreign banks and must pay creditors to avoid asset seizure. Menatep Group plans to fight Rosneft in international arbitration if they default on payments.", "gemma2:2b": "Yukos owners are demanding Rosneft, who bought Yugansk production unit, repay a $900 million loan. The demand arises from Yugansk securing loans on its assets before sale.  If Rosneft fails to pay, Yukos owners will take legal action through international arbitration.  Yukos has filed for bankruptcy protection in the US to prevent the forced sale of their main production arm. \n", "qwen2.5:0.5b": "The owners of Russian oil giant Yukos are facing a loan claim from buyer Rosneft, which will require Rosneft to repay $900 million (£479m) owed on Yugansk unit's assets. Rosneft is already faced with a $540 million repayment demand from foreign banks and will have to pay real money to creditors when it purchases Yugansk assets through Rosneft, which includes such obligations as pledged assets with Rosneft.", "qwen2.5:1.5b": "Yukos' former production unit buyer, Rosneft, is facing a $900m loan claim from the previous owner's creditors due to their acquisition of the unit worth $9.3bn from Yukos for $27.5bn in taxes. Rosneft was forced into the sale by Russia to settle its own tax claims against Yukos and now faces repayment demands from foreign banks, highlighting a significant financial issue stemming from its purchase. The situation involves legal challenges regarding obligations attached to acquiring Yugansk's assets from Yukos.", "qwen2.5:3b": "The owners of Russian oil giant Yukos are demanding that State-owned Rosneft pay back a $900m loan it secured on the former production unit Yugansk, which was bought by Rosneft as part of settling a $27.5bn tax claim against Yukos. Rosneft faces similar demands from foreign banks and has already indicated its intention to take action against Menatep Group, the owners of Yukos. The sale of Yugansk went ahead despite Yukos' bankruptcy attempt and the legal battle over the loan highlights ongoing disputes related to the Yukos case.", "opencoder:1.5b": "Yukos unit buyer faces loan claim \n\nThe owners of embattled Russian oil giant Yukos are to ask the buyer of its former production unit to pay back a $900m (£479m) loan.\n\nRosneft bought the Yugansk unit for $9.3bn in a sale forced by Russia to part settle a $27.5bn tax claim against Yukos. Yukos' owner Menatep Group says it will ask Rosneft to repay a loan that Yugansk had secured on its assets.\n\nRosneft already faces a similar $540m repayment demand from foreign banks. Legal experts said Rosneft's purchase of Yugansk would include such obligations. \"The pledged assets are with Rosneft, so it will have to pay real money to the creditors to avoid seizure of Yugansk assets,\" said Moscow-based US lawyer Jamie Firestone.\n\nYugansk had filed for bankruptcy protection in a US court in an attempt to prevent the forced sale of its main production arm. The sale went ahead in December and Yugansk was sold to a little-known shell company which in turn was bought by Rosneft.\n\nThe owners of the Yugansk unit are facing a new loan claim, with both parties now embroiled in financial difficulties.\n", "smollm:1.7b": "The summary should preserve key ideas and details, including:\n\n1. The owners of embattled Russian oil giant Yukos are to ask the buyer of its former production unit to pay back a $900m loan.\n2. State-owned Rosneft bought the Yugansk unit for $9.3bn in a sale forced by Russia to part settle a $27.5bn tax claim against Yukos.\n3. Rosneft already faces a similar $540m repayment demand from foreign banks.\n4. Legal experts said Rosneft's purchase of Yugansk would include such obligations.\n5. Rosneft's managing director Tim Osborne told the Reuters news agency that if they default, they will fight them where the rule of law exists under the international arbitration clauses of the credit.\n6. The company has said it intends to take action against Menatep to recover some of the tax claims and debts owed by Yugansk.\n7. Rosneft had filed for bankruptcy protection in a US court in an attempt to prevent the forced sale of its main production arm.\n8. The sale went ahead in December and Yugansk was sold to a little-known shell company which in turn was bought by Rosneft.\n9. Yukos claims its downfall was punishment for the political ambitions of its founder Mikhail Khodorkovsky and has vowed to sue any participant in the sale.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about the Yukos oil company's loan claim. Let me read through it carefully.\n\nThe main points are that the owners of Yukos, which is now called Menatep Group, are asking the former owner of their production unit, Rosneft, to pay back a $900 million loan. It mentions how this was done by a sale forced by Russia settling a tax claim against Yukos. The deal involved a $9.3 billion price from the Russian state-owned company. Rosneft already has some debt to cover, with about $540 million due to other claims.\n\nThere's also mention of a lawyer named Jamie Firestone who said that if they don't pay, they'll be sold off, so it's not just business for men. The legal experts were worried about the legal framework for such large debts. Rosneft officials aren't available, but the company is preparing to fight back against Menatep to recover some claims.\n\nYukos had filed for bankruptcy because they thought their collapse was punishment for their founder. They sold a shell company that Rosneft bought, and now Yukos wants to sue everyone involved in this sale. The text does mention all these details but the user only needs the summary without explanations or formatting.\n</think>\n\nThe owners of the Russian oil giant Yukos (now Menatep Group) are demanding repayment of a $900 million loan from Rosneft, which had acquired a former production unit under them. The sale was forced by Russia settling a tax claim against Yukos and involved a $9.3 billion price. Rosneft already faces similar debt obligations. Legal experts warn about potential legal issues with such large debts. Rosneft is preparing to contest the acquisition, and Yukos has filed for bankruptcy protection due to their collapse as punishment for their founder.", "tinyllama:1.1b": "Yukos unit buyers face a $900m (£479m) loan claim from Rosneft, which part-buys the former production unit of Russian oil giant YukoS. The company has asked for a repayment and legal experts warn that Rosneft's purchase of YukaSK would include obligations to repay assets to creditors. Menatep Group owners were not present at the hearing, but Rosneft officials denied any involvement in the debt-defaulting company. The sale of YukaSK is part of a larger debt restructuring process for state-owned Russian companies, which aim to prevent defaulting on their borrowings.", "tinydolphin:1.1b": " Yukos unit buyer faces loan claim. In a $900m (£479m) loan, the buyer of Yukos' former production unit is being asked by its owners to pay back a $9.3bn tax claim, along with an additional $540m repayment demand from foreign banks. Despite this, Rosneft officials have not been available for comment on whether they will challenge Menatep Group's pledged assets in the court process.", "phi:2.7b": " The owners of Russian oil giant Yukos are asking the buyer of its former production unit, Yugansk, to pay back a $900m loan. Rosneft bought the unit from Yugansk for $9.3bn as part of a forced sale to settle a tax claim against Yukos. Menatep Group, the owner of Yugansk, intends to sue any participants in the sale for debts owed by Yugansk and will try to recover some of the tax claims through international arbitration. Rosneft is facing a $540m repayment demand from foreign banks.\n", "orca-mini:3b": " The owners of Yukos, the bankrupt Russian oil giant, are asking the buyer of their former production unit to pay back a $900m loan. Rosneft bought Yugansk, the production unit, for $9.3bn in a sale forced by Russia to settle a $27.5bn tax claim against Yukos. Yukos' owner Menatep Group said it will ask Rosneft to repay a loan that Yugansk had secured on its assets. Legal experts said Rosneft's purchase of Yugansk would include such obligations. The sale went ahead in December and Yugansk was sold to a little-known shell company which was bought by Rosneft. Yukos claimed that the sale was punishment for the political ambitions of its founder Mikhail Khodorkovsky and vowed to sue any participant in the sale.", "hermes3:3b": "Yukos owners seek $900m loan repayment from Rosneft, buyer of Yugansk unit.", "stablelm-zephyr:3b": "The owners of the Russian oil giant Yukos are demanding that Rosneft, the buyer of their former production unit, pay back a $900m loan. The state-owned company purchased the Yugansk unit for $9.3bn to help settle a $27.5bn tax claim against Yukos. Menatep Group, Yukos' owner, will pursue legal action if Rosneft defaults on the repayment. This purchase includes obligations that come with the pledged assets. In December, Rosneft bought Yugansk after its original acquisition was made via a little-known shell company.", "stablelm2:1.6b": "Yukos unit buyer must repay $ loan after Russian oil giant's owner Menatep Group demands repayment from their secured loan by state-owned Rosneft in a forced sale deal for Yugansk production unit. Rosneft already faces similar demands from foreign banks. Yukos had filed for bankruptcy protection against the forced sale of its main production arm, and Menatep plans to fight Rosneft in international arbitration if they default.", "granite3.1-dense:2b": "Yukos, a Russian oil giant, is embroiled in legal disputes following its forced sale to state-owned Rosneft for $9.3bn, intended to settle a $27.5bn tax claim against Yukos' owner, Menatep Group. The buyer of Yukos' former production unit, Yugansk, will now face a $900m loan repayment demand from Menatep Group. Rosneft is already obligated to pay foreign banks approximately $540m for similar pledged assets. Legal experts assert that Rosneft's acquisition encompasses such financial responsibilities. If Rosneft fails to meet these payments, Yugansk's assets could be seized. Menatep Group plans to enforce the loan through international arbitration. Yukos' founder, Mikhail Khodorkovsky, has asserted that the company's downfall is politically motivated and intends to sue all parties involved in the forced sale. The bankruptcy filing of Yukos in a US court was part of this strategy to resist the sale.", "chatgpt-4o-latest": "The owners of Yukos are demanding that Rosneft repay a $900 million loan secured by Yugansk's assets. Rosneft, which bought Yugansk for $9.3 billion in a state-forced sale to cover Yukos' tax debts, already faces a $540 million repayment demand from foreign banks. Legal experts say Rosneft is responsible for these obligations. Menatep Group, Yukos' owner, warns of legal action if Rosneft defaults. Rosneft has not commented but plans to seek compensation from Menatep for Yugansk's debts. Yukos, which had unsuccessfully sought US bankruptcy protection, claims the sale was politically motivated and vows to sue those involved.", "reference": "Yukos' owner Menatep Group says it will ask Rosneft to repay a loan that Yugansk had secured on its assets.State-owned Rosneft bought the Yugansk unit for $9.3bn in a sale forced by Russia to part settle a $27.5bn tax claim against Yukos.The sale went ahead in December and Yugansk was sold to a little-known shell company which in turn was bought by Rosneft.But the company has said it intends to take action against Menatep to recover some of the tax claims and debts owed by Yugansk.\"The pledged assets are with Rosneft, so it will have to pay real money to the creditors to avoid seizure of Yugansk assets,\" said Moscow-based US lawyer Jamie Firestone, who is not connected to the case."}