{"raw_text": "Ask Jeeves tips online ad revival\n \n Ask Jeeves has become the third leading online search firm this week to thank a revival in internet advertising for improving fortunes.\n \n The firm's revenue nearly tripled in the fourth quarter of 2004, exceeding $86m (£46m). Ask Jeeves, once among the best-known names on the web, is now a relatively modest player. Its $17m profit for the quarter was dwarfed by the $204m announced by rival Google earlier in the week. During the same quarter, Yahoo earned $187m, again tipping a resurgence in online advertising.\n \n The trend has taken hold relatively quickly. Late last year, marketing company Doubleclick, one of the leading providers of online advertising, warned that some or all of its business would have to be put up for sale. But on Thursday, it announced that a sharp turnaround had brought about an unexpected increase in profits. Neither Ask Jeeves nor Doubleclick thrilled investors with their profit news, however. In both cases, their shares fell by some 4%. Analysts attributed the falls to excessive expectations in some quarters, fuelled by the dramatic outperformance of Google on Tuesday.\n", "llama3.2:1b": "Ask Jeeves's revenue nearly tripled in the fourth quarter of 2004, exceeding $86m, and its profit for that quarter was $17m, while rival Google reported a profit of $204m during the same period. Ask Jeeves is now a modest player, with Yahoo reporting $187m in profits.", "llama3.2:3b": "Ask Jeeves' revenue nearly tripled to $86m in Q4 2004, exceeding $17m profit, thanks to a revival in internet advertising. The trend follows Yahoo's resurgence and preceeds Doubleclick's unexpected profits increase, with both companies' shares falling by 4% due to high expectations fueled by Google's strong outperformance.", "gemma2:2b": "Ask Jeeves' revenue nearly tripled in the fourth quarter of 2004, exceeding $86 million, driven by a revival in internet advertising. While this growth was impressive, it pales compared to rivals like Google ($204 million) and Yahoo ($187 million). Despite improving fortunes, Ask Jeeves' shares fell after investors anticipated a bigger profit jump, as did Doubleclick's share price. \n", "qwen2.5:0.5b": "Ask Jeeves has experienced a surge in online advertising revenues and profits, which are now higher than its rivals. The firm once was a well-known name among online search firms but is now considered relatively modest. Doubleclick's warning about potential business cuts from the company it provides online advertising services earlier this year led to unexpected profit growth for Ask Jeeves during the same quarter.", "qwen2.5:1.5b": "Ask Jeeves' profits nearly tripled in Q4 due to a resurgence in online advertising following a decline; its market share dropped as it became a smaller player compared to rivals like Google and Yahoo. The trend has gained momentum quickly, with Doubleclick anticipating future losses if not improved, causing both firms' shares to drop slightly on news of profits exceeding expectations.", "qwen2.5:3b": "Ask Jeeves has seen a significant revenue increase of nearly $86m in Q4 2004, tripling its previous quarter's revenue and exceeding $17m profit. This resurgence coincides with a broader trend of improved online advertising revenues, as evident from Yahoo ($187m) and Google's $204m quarter. Ask Jeeves' fortunes have been boosted by this revival in online advertising, though both its and Doubleclick's stock prices fell 4% due to high expectations fuelled by Google's success.", "opencoder:1.5b": "Jeeves has become the third leading online search firm this week to thank a revival in internet advertising for improving fortunes. The firm's revenue nearly tripled in the fourth quarter of 2004, exceeding $86m (£46m). Ask Jeeves is now a relatively modest player, having $17m profit for the quarter dwarfed by Google’s announced profit by $204m earlier this week. Yahoo also saw a sharp increase in online advertising during the same period, which could be attributed to the rise of Doubleclick in the previous week.\n", "smollm:1.7b": "The text is concise and summarizes the key points about the revival of online advertising and its impact on companies like Ask Jeeves. The main idea is that the growth of online advertising has led to a decline in profits for some companies, but has also created new opportunities for others.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about Ask Jeeves and how it's doing compared to other search engines. Let me read through the text carefully.\n\nThe first paragraph talks about Ask Jeeves becoming the third leading firm online and thanks a revival in advertising for its growth. They tripled their revenue from around $86 million to almost $204 million, which is impressive.\n\nNext, the article mentions that Google was also involved with this growth, earning significantly more than Ask Jeeves. Yahoo's performance was mixed but still good enough to be considered a comeback after being down since 2015.\n\nThe user had mentioned Doubleclick warning their business might go under, but they did see profits increase unexpectedly despite not having huge shares. Investors weren't happy with the increases either, which likely led to stock price drops. Analysts blamed it on excessive expectations from Google's strong performance.\n\nSo, I need to capture these key points: Ask Jeeves's quick rise in search engine rankings, their increased revenue, competitors like Google and Yahoo catching up; the positive impact of online advertising and the challenges of maintaining profits post-exploration.\n</think>\n\nAsk Jeeves has surged online, becoming the third top search engine this week. The firm tripled its $86 million revenue to nearly $204 million during Q4 2004, eclipsing Google's early-2005 earnings and surpassing Yahoo in the process. Despite no big share price gains (falls by about 4%), analysts attributed profits to excessive expectations fueled by Google's strong performance on Tuesday.", "tinyllama:1.1b": "Ask Jeevets has reported a 35% surge in revenues this year as it revives its fortunes after a recession-related decline. The company's $17m profit in the fourth quarter of 2004 exceeded Google's $204m, and doubled its revenues from $86m to $198m by comparison. However, marketing firm Doubleclick warned that some or all of its business would have to be put up for sale last year, but it subsequently announced a sharp turnaround in profit, suggesting an uneven trend may continue. Doubleclick's shares fell by 4%, while Ask Jeevets' share price dropped by 4%.", "tinydolphin:1.1b": " The key to online ad rejuvenation is understanding that Search engines, like people, can sometimes be charming when it's convenient for them. It was no coincidence that Ask Jeeves and Doubleclick were able to capitalize on the boom in online ads this quarter. The trend of search engine companies jumping into advertising space has been fueled by Google's aggressive expansion, and it looks like this year could be even more exciting.", "phi:2.7b": " The third leading online search firm this week, Ask Jeeves, has experienced a significant increase in revenue, nearly tripling its previous quarter's profit of $86m (£46m). This improvement is attributed to a revival in internet advertising and the success of other firms such as Google and Yahoo who have seen similar profits.\n\nDespite these positive developments, both companies saw their shares fall due to excessive expectations fueled by the dramatic outperformance of Google on Tuesday.\n", "orca-mini:3b": " Ask Jeeves' revenue nearly tripled in the fourth quarter of 2004, exceeding $86m (£46m). Its $17m profit for the quarter was dwarfed by the $204m announced by rival Google earlier in the week. During the same quarter, Yahoo earned $187m, again suggesting a resurgence in online advertising. However, neither Ask Jeeves nor Doubleclick thrilled investors with their profit news, and their shares fell by some 4%. Analysts attributed the falls to excessive expectations.", "hermes3:3b": "Ask Jeeves 3rd top online search, tripling Q4 revenue to over $86m due to internet advertising revival.", "stablelm-zephyr:3b": "Ask Jeeves, once a top online search firm, credited the revival in internet advertising for improving its fortunes, resulting in a nearly tripled revenue of $86 million in the fourth quarter of 2004. Although it now ranks third behind rivals Google and Yahoo, all three companies experienced a resurgence in online advertising profits. Doubleclick, a leading provider of online advertising, also announced an unexpected increase in profits due to the trend. However, their shares fell by 4% as investors were not thrilled with the profit news.", "stablelm2:1.6b": "Ask Jeeves thanks online advertising for its revenue nearly tripling during Q4, becoming the third leading search firm but losing market share compared to rivals like Google and Yahoo. Their profit was smaller than Google's despite Ask Jeeves' growth. Doubleclick experienced a sharp turnaround in profits after warning of potential sales due to competition; however, both Ask Jeeves and Doubleclick disappointed investors with their results. Both shares dropped by 4%. Analysts blame excessive expectations for the declines.", "granite3.1-dense:2b": "Ask Jeeves' revenue nearly tripled to $86 million (£46m) in Q4 2004, marking a significant improvement due to a revival in internet advertising. Despite this growth, Ask Jeeves' profit of $17 million was significantly less than rival Google's $204 million and Yahoo's $187 million during the same quarter. Both Ask Jeeves and marketing company Doubleclick, which had faced potential sale due to financial struggles last year, saw their share prices fall by about 4% after reporting profits, attributed to unrealistically high investor expectations set by Google's earlier impressive results.", "chatgpt-4o-latest": "Ask Jeeves credited a revival in online advertising for its improved performance, with revenue nearly tripling to over $86 million in Q4 2004. Despite this growth, its $17 million profit was far below Google's $204 million and Yahoo's $187 million. The online ad resurgence was swift, as seen with Doubleclick, which reversed its earlier struggles to post unexpected profits. However, investor expectations remained high, leading to a 4% drop in shares for both Ask Jeeves and Doubleclick, influenced by Google's strong performance.", "reference": "Ask Jeeves has become the third leading online search firm this week to thank a revival in internet advertising for improving fortunes.Its $17m profit for the quarter was dwarfed by the $204m announced by rival Google earlier in the week.During the same quarter, Yahoo earned $187m, again tipping a resurgence in online advertising.Neither Ask Jeeves nor Doubleclick thrilled investors with their profit news, however.Ask Jeeves, once among the best-known names on the web, is now a relatively modest player."}