{"raw_text": "India widens access to telecoms\n \n India has raised the limit for foreign direct investment in telecoms companies from 49% to 74%.\n \n Communications Minister Dayanidhi Maran said that there is a need to fund the fast-growing mobile market. The government hopes to increase the number of mobile users from 95 million to between 200 and 250 million by 2007. \"We need at least $20bn (£10.6bn) in investment and part of this has to come as foreign direct investment,\" said Mr Maran. The decision to raise the limit for foreign investors faced considerable opposition from the communist parties, which give crucial support to the coalition headed by Prime Minister Manmohan Singh. Potential foreign investors will however need government approval before they increase their stake beyond 49%, Mr Maran said. Key positions, such as those of chief executive, chief technology officer and chief financial officer are to be held by Indians, he added.\n \n Analysts and investors have welcomed the government decision. \"It is a positive development for carriers and the investment community, looking to take a longer-term view of the huge growth in the Indian telecoms market,\" said Gartner's principal analyst Kobita Desai. \"The FDI relaxation coupled with rapid local market growth could really ignite interest in the Indian telecommunication industry,\" added Ernst and Young's Sanjay Mehta. Investment bank Morgan Stanley has forecast that India's mobile market is likely to grow by about 40% a year until 2007. The Indian mobile market is currently dominated by four companies, Bharti Televentures which has allied itself with Singapore Telecom, Essar which is linked with Hong Kong-based Hutchison Whampoa, the Sterling group and the Tata group.\n", "llama3.2:1b": "India raises telecom investment limit to 74%\nIndia raised the foreign direct investment (FDI) limit in telecoms companies from 49% to 74%.\nGovernment hopes to increase mobile user base from 95 million to 200-250 million by 2007.\nForeign investors will need government approval before increasing stake beyond 49%.\nKey positions, such as CEO and CFO, will be held by Indians.", "llama3.2:3b": "India raises foreign direct investment limit in telecoms to 74% as part of efforts to fund a growing mobile market, aiming to increase users from 95 million to 200-250 million by 2007. Government approval required for investments beyond 49%, with Indians holding key positions such as CEO, CTO and CFO. Analysts welcome the move, citing rapid local growth and forecasts that India's mobile market will grow by around 40% a year until 2007.", "gemma2:2b": "India increased foreign direct investment limit for telecoms companies from 49% to 74%. This change aims to fund the growing mobile market and reach up to 200-250 million users by 2007. Despite opposition from some parties, this move is expected to attract significant investment. Key positions within telecom companies will be filled by Indians.  Experts are positive about this decision and predict continued growth in the Indian telecom market. \n", "qwen2.5:0.5b": "India raised foreign direct investment limits for telecoms firms to 74%. Potential foreign investors will need government approval before they can invest more than 49% in India's mobile market. Analysts have welcomed the decision as it could \"really ignite interest\" in the Indian telecommunication industry, and Morgan Stanley has forecast a growth of about 40% by 2007.", "qwen2.5:1.5b": "India raises foreign investment limit in telecoms from 49% to 74%, aiming for $20bn in investment by 2007 and increasing mobile users from 95 million to between 200-250 million, supported by a government coalition but opposed by communist parties. Analysts expect the Indian telecom market will grow by about 40% annually until 2007.", "qwen2.5:3b": "India has increased the foreign direct investment limit in telecoms companies from 49% to 74%. Communications Minister Dayanidhi Maran stated that this move aims to fund India's growing mobile market with a potential need for $20bn, aiming to increase users from 95 million to 200-250 million by 2007. While facing opposition from communist parties, the government granted foreign investors approval up to 49% stake but requires Indian leadership in key roles. Analysts and investors welcomed this decision, seeing it as a positive for telecom carriers and investment community viewing long-term growth potential. Morgan Stanley predicts the mobile market will grow by about 40% annually until 2007, with India's four major telecom companies being Bharti Televentures (allied with Singapore Telecom), Essar (linked with Hong Kong-based Hutchison Whampoa), the Sterling group and Tata Group.", "opencoder:1.5b": "India widens access to telecoms\n\nIndia has raised the limit for foreign direct investment in telecoms companies from 49% to 74%. Communications Minister Dayanidhi Maran said that there is a need to fund the fast-growing mobile market. The government hopes to increase the number of mobile users from 95 million to between 200 and 250 million by 2007. \"We need at least $20bn (£10.6bn) in investment and part of this has to come as foreign direct investment,\" said Mr Maran. The decision to raise the limit for foreign investors faced considerable opposition from the communist parties, which give crucial support to the coalition headed by Prime Minister Manmohan Singh. Potential foreign investors will however need government approval before they increase their stake beyond 49%.\n", "smollm:1.7b": "The summary of this text should be: India widens access to telecoms by raising the limit for foreign direct investment in telecoms companies from 49% to 74%.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about India's telecoms access. Let me read through it carefully.\n\nThe first sentence says India widens its access to telecom services. That's a broad statement, so I should capture that overall change.\n\nNext, there are specific numbers mentioned: the limit for foreign direct investment in telecom companies went from 49% to 74%. That shows an actual increase, which is important.\n\nThe Communications Minister, Dayanidhi Maran, mentions funding the fast-growing mobile market and aims to increase mobile users from 95 million to between 200 and 250 million by 2007. He talks about needing $20 billion in investment, part of which must come from foreign direct investment.\n\nThere's opposition from communist parties because they gave crucial support to the Indian coalition led by Prime Minister Manmohan Singh. Potential investors need government approval before increasing their stake beyond 49%.\n\nKey positions like CEO, CTO, and CFO are held by Indians themselves, which is interesting about governance structures in India.\n\nAnalysts are welcoming this decision. Gartner says it's a positive move for carriers and the investment community. Sanjay Mehta adds that FDI relaxation could boost interest in the telecom industry. Morgan Stanley forecasts a 40% annual growth until 2007, with four main companies dominating the market: Bharti Televentures, Essar, Sterling, and Tata.\n\nI need to condense all this into a concise summary without any extra information or explanations.\n</think>\n\nIndia expands access to telecom services. Foreign direct investment limits on telecom companies have increased from 49% to 74%. The government aims to grow the mobile market, aiming for 200-250 million users by 2007. Key positions in government are held by Indians. Analysts and investors praise this decision, noting positive trends for carriers and investment communities. Forecasted annual growth of 40% until 2007, with four main telecom companies leading the market.", "tinyllama:1.1b": "India has raised the limit for foreign direct investment (FDI) in telecommunications companies from 49% to 74%. The Communications Minister Dayanidhi Maran stated that there is a need to fund the fast-growing mobile market, as India aims to increase its number of mobile users from 95 million to between 200 and 250 million by 2007. This decision has met with considerable opposition from communist parties, but Indian investors will be allowed to increase their stake beyond the 49% limit. Analysts and investors have welcomed the government's move, which is seen as an opportunity for carriers and the investment community to take a longer-term view of India's mobile market. Investment bank Morgan Stanley has forecasted that India's mobile market could grow by about 40% annually until 2007, making it one of the fastest growing in the world.", "tinydolphin:1.1b": " India's decision to allow foreign direct investment in telecommunications companies has been welcomed by analysts and investors alike. The government has raised the limit for foreign investment from 49% to 74%, allowing more funds to be invested in the rapidly growing Indian mobile market. This move is expected to increase the number of users within the next few years, creating substantial growth opportunities for telecommunications companies in India and around the world. The decision has been met with strong support from the ruling coalition, which includes Prime Minister Manmohan Singh's Congress party, and critics have argued that it may disproportionately benefit certain groups within the industry, such as Indian nationals. Regardless of this criticism, analysts and investors agree that India's telecommunications market is vastly underdeveloped and presents significant opportunities for growth in the coming years.", "phi:2.7b": " India has raised the foreign direct investment limit in telecoms to 74% from 49%, citing the need for funding for its fast-growing mobile market. The government hopes to increase the number of mobile users from 95 million to 200 to 250 million by 2007, requiring at least $20 billion in investments and a portion as foreign direct investment (FDI). The decision has faced opposition from communist parties but is welcomed by analysts and investors who see potential for long-term growth in India's telecoms market.\n", "orca-mini:3b": " India has raised the limit for foreign direct investment in telecoms companies from 49% to 74%. The government hopes to increase the number of mobile users from 95 million to between 200 and 250 million by 2007. Potential foreign investors will need government approval before they increase their stake beyond 49%, according to Communications Minister Dayanidhi Maran. Key positions, such as those of chief executive, chief technology officer and chief financial officer are to be held by Indians. Analysts and investors have welcomed the government decision. The Indian mobile market is dominated by four companies, and investment banks forecast that the market will grow by about 40% a year until 2007.", "hermes3:3b": "India increases FDI limit in telecoms to 74%, from 49%. This aims to fund fast-growing mobile market, increase users to 200-250m by 2007.", "stablelm-zephyr:3b": "India has increased foreign direct investment limits in telecoms companies from 49% to 74%, aiming to fund the fast-growing mobile market. The government hopes to increase mobile users from 95 million to 200-250 million by 2007. This decision was met with support from analysts and investors, who see it as a positive development for carriers and the investment community. India's telecom market is currently dominated by four companies: Bharti Televentures, Singapore Telecom, Essar (Hong Kong-based Hutchison Whampoa), Sterling group, and Tata group.", "stablelm2:1.6b": "India increases foreign investment limit in telecoms to fund fast-growing mobile market and aims to increase mobile users from 100 million to between 125-150 million by 7%. The government will need $10 billion in investment, with approved foreign investors needing approval for stake above 50%. Four major companies dominate the market.", "granite3.1-dense:2b": "India has increased the foreign direct investment limit for telecom companies from 49% to 74%, aiming to fund its burgeoning mobile market. Communications Minister Dayanidhi Maran aims to boost the number of mobile users from 95 million to between 200 and 250 million by 2007, requiring approximately $20 billion in investment. Despite opposition from communist parties, the decision is expected to attract foreign investors who must seek government approval for stakes exceeding 49%. Key positions will remain Indian-held. Analysts and investors view this as a positive development, anticipating rapid growth in the Indian telecoms market due to the FDI relaxation and local market expansion. The current mobile market is dominated by four major companies: Bharti Televentures, Essar, Sterling group, and Tata group.", "chatgpt-4o-latest": "India has raised the foreign direct investment (FDI) limit in telecoms from 49% to 74% to support its rapidly growing mobile market. Communications Minister Dayanidhi Maran stated that at least $20 billion in investment is needed to expand mobile users from 95 million to 200-250 million by 2007. Despite opposition from communist parties, the decision was approved, though foreign investors require government approval to exceed 49%, and key executive positions must be held by Indians. Analysts and investors welcomed the move, seeing it as a boost for the telecom industry. Morgan Stanley predicts 40% annual growth in India's mobile market until 2007, which is currently dominated by Bharti Televentures, Essar, Sterling, and Tata.", "reference": "\"We need at least $20bn (£10.6bn) in investment and part of this has to come as foreign direct investment,\" said Mr Maran.Potential foreign investors will however need government approval before they increase their stake beyond 49%, Mr Maran said.Communications Minister Dayanidhi Maran said that there is a need to fund the fast-growing mobile market.India has raised the limit for foreign direct investment in telecoms companies from 49% to 74%.Investment bank Morgan Stanley has forecast that India's mobile market is likely to grow by about 40% a year until 2007."}