{"raw_text": "Steel firm 'to cut' 45,000 jobs\n \n Mittal Steel, one of the world's largest steel producers, could cut up to 45,000 jobs over the next five years, its chief executive has said.\n \n The Netherlands-based company is due to complete its $4.5bn acquisition of US firm ISG next month, making it one of the largest global firms of its kind. However, Lakshmi Mittal has told investors the combined company will have to shed thousands of jobs. The Indian-born magnate did not say where the job losses would fall.\n \n Mr Mittal told US investors that once the acquisition of International Steel Group was completed, the company would aim to reduce its workforce by between 7,000 and 8,000 annually. This could see its workforce trimmed from 155,000 to 110,000 staff by 2010. \"We are investing in modernisation so employees will go down,\" Mr Mittal told the conference in Chicago.\n \n Mittal Steel was formed last year when Mr Mittal's LNM Holdings merged with Dutch firm Ispat. A combination of Mittal Steel and ISG would have annual sales of $32bn (£16.7bn; 24.1bn euros) and a production capacity of 70 million tonnes.\n \n A Mittal Steel spokeman said that no decisions on job cuts have been made yet. \"We are trying to create a sustainable steel industry and if we want to do that, we have to invest in new technology,\" a spokesman said. Mittal Steel has operations in 14 countries. Many of its businesses - particularly those in eastern Europe - were previously state owned and have huge workforces. It employs 50,000 staff in Kazakhstan alone, and has large operations in Romania, the Czech Republic, South Africa and the United States.\n", "llama3.2:1b": "Steel firm Mittal Steel may cut up to 45,000 jobs over the next five years due to its acquisition of ISG. The combined company aims to reduce its workforce by between 7,000 and 8,000 annually starting in 2010.", "llama3.2:3b": "Mittal Steel, a major steel producer, may cut up to 45,000 jobs over five years as part of its acquisition of US firm ISG. The company aims to reduce its workforce by 7,000-8,000 annually, trimming staff from 155,000 to 110,000.", "gemma2:2b": "Mittal Steel plans to cut up to 45,000 jobs over five years following its acquisition of ISG. This includes an annual workforce reduction of between 7,000 and 8,000 staff. The goal is to modernize operations and create a sustainable steel industry. Job cuts are not yet finalized. Mittal Steel employs thousands across various countries with operations in Eastern Europe, South Africa, the United States, and more. \n", "qwen2.5:0.5b": "Mittal Steel could cut up to 45,000 jobs over five years due to the acquisition of US firm ISG, according to company CEO Lakshmi Mittal. The Indian-born magnate has made it one of the largest global steel producers but warns that combined workforce will be around 155,000 employees by 2010 and reduce from 110,000 to 8,000 annually. The company's spokeman stated they are investing in modernisation, with plans to shed up to 7,000 to 8,000 staff annually.", "qwen2.5:1.5b": "Mittal Steel could cut up to 45,000 jobs over five years as part of its $4.5bn acquisition of ISG, aiming for a workforce reduction from 155,000 to 110,000 by 2010 due to modernization investments.", "qwen2.5:3b": "Steel firm Mittal Steel could cut up to 45,000 jobs over five years post-acquisition of ISG. The combined company aims to reduce workforce by 7,000-8,000 annually, potentially bringing total staff down from 155,000 to 110,000 by 2010. Mittal Steel will invest in modernization leading to job losses across various sectors, including those previously state-owned in eastern Europe and Kazakhstan.", "opencoder:1.5b": "Steel firm 'to cut' 45,000 jobs\n\nMittal Steel, one of the world's largest steel producers, could cut up to 45,000 jobs over the next five years. The Netherlands-based company is due to complete its $4.5bn acquisition of US firm ISG next month. Lakshmi Mittal has told investors the combined company will have to shed thousands of jobs. Mr Mittal said that once the acquisition of International Steel Group was completed, the company would aim to reduce its workforce by between 7,000 and 8,000 annually. It could see its workforce trimmed from 155,000 to 110,000 staff by 20,100. The company has invested in modernisation so employees will go down.\n", "smollm:1.7b": "Steel firm 'to cut' 45,000 jobs", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely while preserving the key ideas and details. Let me read through the provided text first.\n\nThe main points are: Mittal Steel is a global steel producer that could reduce up to 45k jobs over five years. They're considering buying ISG for $4.5bn, making them one of the largest in the world. The merger includes steel operations from their last year's merger with Ispat.\n\nI think the summary should include the main action—cutting jobs—and mention that the acquisition is expected to result in this reduction. It's important to note that they're not announcing specific job cuts yet, just planning for potential reductions based on future market conditions. Also, it's good to highlight that their workforce will be reduced from around 155k to 110k by 2010 and mention some of their businesses were state-owned before.\n\nI should make sure not to include any unnecessary details and keep the language straightforward.\n</think>\n\nMittal Steel aims to reduce up to 45,000 jobs over five years as they merge with ISG. They plan a workforce reduction from 155,000 to 110,000 staff by 2010, expecting this based on future market conditions. Mittal Steel's operations span 14 countries, including state-owned businesses with large workforces in regions like Eastern Europe. Kazakhstan alone employs 50,000 staff, and they have significant operations in Romania, the Czech Republic, South Africa, and the US.", "tinyllama:1.1b": "Steel firm 'to cut' 45,000 jobs over next five years as part of combined US$4.5bn acquisition by Mittal Steel. New company set to have to shed thousands of employees annually until 2010. Mittal has said he aims to reduce workforce by up to 7,000 per year, with total cost savings estimated at $2billion over five years. Company's CEO Lakshmi Mittal has told investors these cuts will have to be made, while also hoping to create a sustainable steel industry.", "tinydolphin:1.1b": " The steel firm Mittal Steel plans to cut up to 45,000 jobs over the next five years. This comes after the company announced its acquisition of US-based International Steel Group for $4.5 billion. However, Lakshmi Mittal, the firm's CEO, has mentioned that they will have to reduce their workforce by 7,000 to 8,000 annually once the deal is completed. This move could see the company's workforce cut from the current 155,000 to around 110,000 staff.", "phi:2.7b": " Mittal Steel plans to cut up to 45,000 jobs over the next five years after acquiring US firm ISG last month. The combined company aims to reduce its workforce by between 7,000-8,000 annually and trim its workforce from 155,000 to 110,000 staff by 2010. The company's spokesman said that no decisions on job cuts have been made yet but that they are trying to create a sustainable steel industry and invest in new technology. Mittal Steel has operations in 14 countries with large workforces in Kazakhstan, Romania, the Czech Republic, South Africa, and the US.\n", "orca-mini:3b": " Mittal Steel, one of the world's largest steel producers, plans to cut up to 45,000 jobs over the next five years. The company's CEO told investors that once the acquisition of International Steel Group was completed, the company would aim to reduce its workforce by between 7,000 and 8,000 annually.", "hermes3:3b": "Mittal Steel plans to cut 45k jobs over 5yrs post $4.5bn ISG acquisition.", "stablelm-zephyr:3b": "Mittal Steel, a major global steel producer, may cut up to 45,000 jobs within the next five years after completing its $4.5bn acquisition of US firm ISG next month. Chief executive Lakshmi Mittal informed investors that the combined company would aim to reduce its workforce by 7,000-8,000 annually once the acquisition is completed. The reduction in workforce could see their current number of 155,000 staff decrease to 110,000 by 2010 as they invest in modernization and new technology. No decisions on job cuts have been made yet, but many of their businesses, particularly those in eastern Europe, previously were state-owned and had large workforces.", "stablelm2:1.6b": "Mittal Steel, one of the world's largest steel producers, may cut up to 7,000 jobs over five years after completing its $4.5bn acquisition of ISG. CEO Lakshmi Mittal said the combined company aims to reduce its workforce from 2,500 to 2,000 staff through modernisation efforts and job losses could fall among thousands in various locations. The combined firm will have annual sales of $10bn ($7.7bn; €8.4bn) and a production capacity of 3 million tonnes. No decisions on job cuts have been made yet.", "granite3.1-dense:2b": "Mittal Steel, a leading global steel producer, plans to reduce its workforce by up to 45,000 over five years following its $4.5 billion acquisition of US firm ISG. CEO Lakshmi Mittal informed investors that the combined company aims to cut between 7,000 and 8,000 jobs annually, potentially shrinking from 155,000 to 110,000 employees by 2010. This modernization drive will focus on implementing new technology in operations spread across 14 countries, including large workforces in eastern Europe like Kazakhstan and states with state-owned steel businesses such as Romania, the Czech Republic, South Africa, and the United States. No definitive job cut decisions have been announced yet; instead, Mittal Steel is emphasizing the necessity of these changes for a sustainable steel industry.", "chatgpt-4o-latest": "Mittal Steel, one of the world's largest steel producers, plans to cut up to 45,000 jobs over five years following its $4.5 billion acquisition of US firm ISG. CEO Lakshmi Mittal told investors that the combined company would reduce its workforce by 7,000 to 8,000 annually, potentially lowering staff numbers from 155,000 to 110,000 by 2010. The job cuts are linked to modernization efforts, though no specific locations were mentioned. Mittal Steel, formed from the merger of LNM Holdings and Ispat, operates in 14 countries, with large workforces in Kazakhstan, Romania, the Czech Republic, South Africa, and the US. A company spokesman stated that no final decisions on job cuts have been made, emphasizing the need for investment in new technology to sustain the steel industry.", "reference": "Mittal Steel, one of the world's largest steel producers, could cut up to 45,000 jobs over the next five years, its chief executive has said.Mittal Steel has operations in 14 countries.Mr Mittal told US investors that once the acquisition of International Steel Group was completed, the company would aim to reduce its workforce by between 7,000 and 8,000 annually.A Mittal Steel spokeman said that no decisions on job cuts have been made yet.Mittal Steel was formed last year when Mr Mittal's LNM Holdings merged with Dutch firm Ispat.However, Lakshmi Mittal has told investors the combined company will have to shed thousands of jobs."}