{"raw_text": "Ad firm WPP's profits surge 15%\n \n UK advertising giant WPP has posted larger-than-expected annual profits and predicted that it will outperform the market in 2005.\n \n Pre-tax profits rose 15% from a year ago to reach £546m ($1.04bn), ahead of average analysts' forecasts of £532m. Revenues were £4.3bn while the firm's operating margins were 14.1%, which it said could reach 14.8% by 2006. During the year WPP bought US rival Grey Global, creating a giant big enough to rival sector leader Omnicom.\n \n Chief Executive Martin Sorrell on Friday told Reuters news agency that WPP had submitted a proposal for United Business Media's NOP World market research unit. Analysts say the unit sell could sell for up to £350m. WPP in recent years has also bought firms such as Ogilvy & Mather and Cordiant Communications. It also includes the firms Young & Rubicam and J Walter Thompson. Events such as the Olympics helped boost WPP's profits in 2004. The company said the US Congressional elections and the FIFA World Cup are likely to present advertising opportunities in the near future. The long-term outlook looks \"very favourable\" because of media and technology developments and the strength of the US economy, WPP said.\n", "llama3.2:1b": "WPP reported a 15% profit increase to £546m (($1.04bn) from previous year's £532m forecast. Pre-tax profits rose ahead of average analyst forecasts. The company bought Grey Global in 2004, creating a giant with the potential to rival Omnicom. WPP submitted a proposal for United Business Media's NOP World market research unit worth up to £350m.", "llama3.2:3b": "WPP posted £546m ($1.04bn) pre-tax profits, a 15% increase from last year, with revenues at £4.3bn and operating margins at 14.1%. The company expects to outperform the market in 2005 and has bought several firms, including Grey Global and Young & Rubicam. WPP is also proposing to buy United Business Media's NOP World unit for up to £350m, citing a favourable long-term outlook due to media and technology developments.", "gemma2:2b": "WPP reported 15% year-over-year profits growth and predicts outperformance in 2005. Pre-tax profit reached £546m, exceeding analyst expectations. Revenue was £4.3bn with operating margins of 14.1%, aiming for 14.8% by 2006. WPP acquired Grey Global, becoming a major competitor to Omnicom. The company is considering a sale of the NOP World market research unit and has previously acquired Ogilvy & Mather, Cordiant Communications, Young & Rubicam, and J Walter Thompson. Events like the Olympics boosted profits in 2004. WPP expects advertising opportunities from US elections and the FIFA World Cup. Their long-term outlook is positive due to media and technology advancements and strong US economy. \n", "qwen2.5:0.5b": "WPP's annual profits increased by 15%, reaching £546m ($1.04bn). The company predicted that it would outperform the market in 2005. In addition to its advertising business, WPP also owns media firms such as Ogilvy & Mather and Cordiant Communications. They were included in this year's report from Reuters.", "qwen2.5:1.5b": "Ad firm WPP's profits surge 15%, beating expectations; predicts outperformance over market in 2005. Bought Grey Global last year; predicted NOP World research unit sale could fetch up to £350m. Olympics boosted 2004 profits; looks for opportunities due to media and tech advances, US economy strength.", "qwen2.5:3b": "Ad firm WPP's profits surge 15%, reaching £546m ($1.04bn), ahead of analysts' forecasts. Profits increased by 15% from a year ago to reach this level. Revenues were £4.3bn, with operating margins at 14.1%, expected to rise to 14.8% by 2006. WPP acquired US rival Grey Global. Analysts estimate the United Business Media's NOP World unit could sell for up to £350m. The company has bought firms like Ogilvy & Mather, Cordiant Communications, Young & Rubicam, and J Walter Thompson. Events such as the Olympics boosted WPP's profits in 2004. Analysts predict future advertising opportunities from US Congressional elections and the FIFA World Cup. WPP sees a positive long-term outlook due to media and technology developments and strong US economy.", "opencoder:1.5b": "Ad firm WPP's profits surge 15% UK advertising giant WPP has posted larger-than-expected annual profits and predicted that it will outperform the market in 2005, pre-tax profits rose 15% from a year ago to reach £546m ($1.04bn), which is ahead of average analysts' forecasts of £532m. During the year, WPP bought US rival Grey Global creating a giant big enough to rival sector leader Omnicom. Chief Executive Martin Sorrell on Friday told Reuters news agency that WPP had submitted a proposal for United Business Media's NOP World market research unit, where the unit sells up to £350m. It also includes firms like Ogilvy & Mather and Cordiant Communications, as well as Young & Rubicam and J Walter Thompson. The US Congressional elections and the FIFA World Cup are likely advertising opportunities in the near future, with WPP's profits predicting a long-term \"very favourable\" outlook due to media and technology developments.\n", "smollm:1.7b": "Ad firm WPP's profits surge 15%", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about WPP's profits. Let me read through it again carefully.\n\nFirst, the headline says WPP profits surge 15%. They had bigger-than-expected profits, reaching £546m or $1.04bn compared to last year. That's a significant increase. \n\nThen, they mention pre-tax profits rose by 15% from before. Their operating margins are 14.1%, which is higher than the average analyst forecasts of £532m. They expect that margin to reach around 14.8% by 2006. \n\nWait, what's the difference between pre-tax and after-tax? I think it's just profit before taxes, right? So their margins are based on that. That means they're doing better than others in their industry because of lower tax rates or something.\n\nThey also talk about buying US rival Grey Global, which is a big deal. This makes them look like a bigger company in the sector leader position, Omnicom. That probably helps with market share and growth.\n\nThen, there's some financial news where WPP sold the NOP World market research unit for up to £350m. I'm not too familiar withNOP, but it's likely an investment firm. They mention recent buys like Ogilvy & Mather and Cordiant Communications. That shows they've been acquiring other big players over the years.\n\nIn 2004, events like the Olympics boosted their profits. That makes sense because ads for sports can be good. Also, the FIFA World Cup might have attracted attention with sponsorships or promotions. \n\nLooking ahead, WPP says media and technology are strong in the US economy, which is a positive sign for their advertising business. They expect long-term growth as these factors continue to develop.\n\nSo putting it all together, I need to make sure I cover the profits increase, margins, strategic buys like Grey Global, NOP sales, 2004 success from Olympics and FIFA events, and the long-term outlook driven by media and tech. Also mention that WPP is a big player in global advertising despite some political costs.\n\nI should avoid any explanations or formatting, just plain text summarizing all key points.\n</think>\n\nWPP's profits saw a 15% surge to £546m, up from last year's £532m. They maintained an operating margin of 14.1%, exceeding average forecasts. WPP acquired Grey Global and others, including Omnicom, to expand their market share. In 2004, the Olympics and FIFA World Cup boosts profits. Future growth is expected due to media and tech developments, supported by a stable business despite political costs.", "tinyllama:1.1b": "WPP reported larger-than-expected annual profit growth of 15% on Thursday, as it expects to exceed market forecasts in 2005 while expanding its operations through the acquisition of NOP World's market research unit. Chief Executive Martin Sorrell told Reuters that the firm has proposed acquiring United Business Media's NOP World for an estimated £350m. The recent events such as the London Olympics and FIFA World Cup are seen as opportunities by WPP to boost its profitability.", "tinydolphin:1.1b": " [Pre-tax profits] at UK advertising giant WPP rose 15% from a year ago to reach £546m ($1.04bn), ahead of average analysts' forecasts. In addition, WPP reported larger-than-expected annual profits and predicted that it would outperform the market in 2005. Pre-tax profits surged from a year ago by reaching £532m ($1.04bn), surpassing analysts' forecasts of £532m. WPP also acquired US rival Grey Global in a £4.3bn deal, creating a giant with revenues of £4.3bn. Chief Executive Martin Sorrell reported that WPP planned to submit a proposal for United Business Media's NOP World market research unit and analysts predicted the unit could sell for up to £350m. In recent years, WPP has acquired companies such as Ogilvy & Mather and Cordiant Communications. WPP expects that its advertising revenue in 2004 would reach £3bn if certain events like the Olympics and the FIFA World Cup take place. The company also reported long-term growth opportunities due to advancements in media and technology, as well as favorable economic conditions.", "phi:2.7b": " WPP's pre-tax profits increased by 15% to £546m in 2005, ahead of analysts' forecasts. The company also announced plans to buy NOP World market research unit from United Business Media. WPP has a strong outlook for future growth due to media and technology developments, as well as the strength of the US economy.\n", "orca-mini:3b": " UK advertising giant WPP reported higher pre-tax profits of 15% from a year ago to reach £546m ($1.04bn), ahead of average analysts' forecasts of £532m. The firm's operating margins were 14.1%, which it said could reach 14.8% by 2006, and it bought US rival Grey Global to create a giant in the advertising sector. WPP also includes firms such as Young & Rubicam and J Walter Thompson. It said events like the Olympics and the US Congressional elections helped boost its profits in 2004, and it predicts a long-term positive outlook due to media and technology developments and the strength of the US economy.", "hermes3:3b": "WPP reports 15% increase in annual profits, $1B pre-tax, ahead of forecasts; operating margins expected to reach 14.8%, may buy NOP World market research unit for up to £350m.", "stablelm-zephyr:3b": "WPP, a UK-based ad firm, reported larger-than-expected annual profits of £546m ($1.04bn), surpassing average analysts' forecasts of £532m. The company's revenues were £4.3bn, and its operating margins reached 14.1%, projected to increase to 14.8% by 2005. WPP bought US rival Grey Global in 2004, creating a large competitor to sector leader Omnicom. The company also purchased firms such as Ogilvy & Mather, Cordiant Communications, Young & Rubicam, and J Walter Thompson. Opportunities in the US Congressional elections and FIFA World Cup are expected to provide advertising opportunities for WPP, along with favorable long-term outlooks due to media and technology developments and a strong US economy.", "stablelm2:1.6b": "WPP, a UK-based advertising firm, has posted significantly higher-than-expected pre-tax profits at £1.2bn ($1.8bn), leading to an outperformance prediction in the market for 2023. The company's revenues reached £4.3bn and its operating margins stood at 19.8%. WPP also acquired Grey Global, creating a giant capable of rivaling Omnicom. Chief Executive Martin Sorrell mentioned that a proposal was submitted to buy NOP World market research unit from United Business Media (UBM). Analysts expect this unit's sell to fetch up to £1.2bn, among WPP's recent acquisitions which include Ogilvy & Mather and Cordiant Communications.", "granite3.1-dense:2b": "UK-based ad firm WPP reported a 15% surge in annual pre-tax profits to £546m ($1.04bn), exceeding analyst expectations of £532m. The company's revenues were £4.3bn, with operating margins projected to increase to 14.8% by 2006. In 2004, WPP acquired US rival Grey Global, expanding its market share and challenging sector leader Omnicom. Chief Executive Martin Sorrell hinted at a potential sale of United Business Media's NOP World market research unit for up to £350m. WPP has made numerous acquisitions, including Ogilvy & Mather and Cordiant Communications, now encompassing firms like Young & Rubicam and J Walter Thompson. Events such as the 2004 Olympics and upcoming US elections and FIFA World Cup are expected to generate advertising opportunities. The company's long-term prospects appear promising due to media advancements, technology developments, and a robust US economy.", "chatgpt-4o-latest": "WPP's pre-tax profits rose 15% to £546m, surpassing forecasts, with revenues of £4.3bn and operating margins at 14.1%, expected to reach 14.8% by 2006. The firm acquired Grey Global, strengthening its position against Omnicom. CEO Martin Sorrell confirmed a bid for NOP World, valued up to £350m. WPP has also acquired Ogilvy & Mather, Cordiant Communications, Young & Rubicam, and J Walter Thompson. Events like the Olympics boosted 2004 profits, with future opportunities from the US Congressional elections and FIFA World Cup. WPP sees a strong long-term outlook due to media and technology growth and a robust US economy.", "reference": "WPP in recent years has also bought firms such as Ogilvy & Mather and Cordiant Communications.UK advertising giant WPP has posted larger-than-expected annual profits and predicted that it will outperform the market in 2005.Pre-tax profits rose 15% from a year ago to reach £546m ($1.04bn), ahead of average analysts' forecasts of £532m.During the year WPP bought US rival Grey Global, creating a giant big enough to rival sector leader Omnicom.The long-term outlook looks \"very favourable\" because of media and technology developments and the strength of the US economy, WPP said."}