{"raw_text": "Japanese mogul arrested for fraud\n \n One of Japan's best-known businessmen was arrested on Thursday on charges of falsifying shareholder information and selling shares based on the false data.\n \n Yoshiaki Tsutsumi was once ranked as the world's richest man and ran a business spanning hotels, railways, construction and a baseball team. His is the latest in a series of arrests of top executives in Japan over business scandals. He was taken away in a van outside one of his Prince hotels in Tokyo.\n \n There was a time when Mr Tsutsumi seemed untouchable. Inheriting a large property business from his father in the 1960s, he became one of Japan's most powerful industrialists, with close connections to many of the country's leading politicians. He used his wealth and influence to bring the Winter Olympic Games to Nagano in 1998. But last year, he was forced to resign from all the posts he held in his business empire, after being accused of falsifying the share-ownership structure of Seibu Railways, one of his companies. Under Japanese stock market rules, no listed company can be more than 80% owned by its 10 largest shareholders. Now Mr Tsutsumi faces criminal charges and the possibility of a prison sentence because he made it look as if the 10 biggest shareholders owned less than this amount. Seibu Railways has been delisted from the stock exchange, its share value has plunged and it is the target of a takeover bid.\n \n Mr Tsutsumi's fall from grace follows the arrests of several other top executives in Japan as the authorities try to curb the murky business practices which were once widespread in Japanese companies. His determination to stay at the top at all costs may have had its roots in his childhood. The illegitimate third son of a rich father, who made his money buying up property as Japan rebuilt after World War II, he has described the demands his father made. \"I felt enormous pressure when I dined with him and it was nothing but pain,\" Tsutsumi told a weekly magazine in 1987. \"He scolded me for pouring too much soy sauce or told me fruit was not for children. He didn't let me use the silk futon, saying it's a luxury.\" There have been corporate governance issues at some other Japanese companies too. Last year, twelve managers from Mitsubishi Motors were charged with covering up safety defects in their vehicles and three executives from Japan's troubled UFJ bank were charged with concealing the extent of the bank's bad loans.\n", "llama3.2:1b": "Japanese billionaire Yoshiaki Tsutsumi was arrested on charges of falsifying shareholder information and selling shares based on false data. He is accused of manipulating the share ownership structure of Seibu Railways, one of his companies, which led to its delisting from the stock exchange and a plunge in its value.", "llama3.2:3b": "Japanese businessman Yoshiaki Tsutsumi was arrested on charges of falsifying shareholder information and selling shares based on false data. He once held top positions in several industries, including hotels, railways, construction, and baseball, but was forced to resign last year after being accused of similar fraud. His arrest follows other high-profile arrests of Japanese executives who have faced scrutiny for corporate governance issues and corrupt practices.", "gemma2:2b": "Yoshiaki Tsutsumi, a former richest man in the world, was arrested for falsifying shareholder information to gain unfair advantage in his business ventures.  He is facing criminal charges and potentially imprisonment due to allegations that he manipulated the ownership structure of Seibu Railways, causing it to be delisted from the stock exchange. This arrest follows a series of similar cases targeting top executives in Japan, as authorities seek to address widespread business scandals and promote stronger corporate governance practices. \n", "qwen2.5:0.5b": "Summary:\nJapanese businessman Yoshiaki Tsutsumi was arrested for falsifying shareholder information and selling company shares based on false data. He faces criminal charges, prison sentence, and potential extradition. His top executives in Japan are facing similar charges. He had grown up as a third son of a wealthy father and felt pressure to follow his father's rules.", "qwen2.5:1.5b": "Japanese tycoon Yoshiaki Tsutsumi arrested for fraud after being accused of falsifying share ownership data, causing stock delisting and financial losses for his company.", "qwen2.5:3b": "Japanese mogul Yoshiaki Tsutsumi arrested for falsifying shareholder information and selling shares based on false data, facing criminal charges after being forced to resign due to similar accusations in 2019. Formerly one of Japan's most powerful industrialists with connections to politicians, he used his wealth and influence, including bringing the Winter Olympic Games to Nagano. His fall from grace follows a series of arrests in Japan over business scandals, revealing murky practices once prevalent among companies. Tsutsumi's rise was marked by immense pressure from his wealthy father during his childhood, who demanded perfection in everything.", "opencoder:1.5b": "Japanese mogul Tsutsumi, once world's richest man, ran a business spanning hotels, railways, construction and baseball team. His arrest led to a series of arrests of top executives in Japan over business scandals. In 1998, he became a prominent industrialist with close ties to major political figures. He hosted the Winter Olympic Games in Nagano. However, he was caught making it look as if the 10 largest shareholders owned less than this amount and faced criminal charges.\n\nThe news followed a series of arrests by several top executives, emphasizing the egregious practices which were once widespread in Japanese companies. His determination to stay at the top at all costs had its roots in his childhood - a thought that comes from the absurdity he introduced to his father's buying scheme.\n", "smollm:1.7b": "The text is a summary of the article \"Japanese mogul arrested for fraud\" which describes the arrest of one of Japan's best-known businessmen, Mr Tsutsumi, on charges of falsifying shareholder information and selling shares based on false data. The article also mentions that Mr Tsutsumi was once ranked as the world's richest man and ran a business spanning hotels, railways, construction and a baseball team.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Yoshiaki Tsutsumi being arrested for fraud. Let me read through it carefully.\n\nFirst, it mentions that he was ranked as the world's richest man and had a big business empire in Japan. He did things like run hotels, railways, construction, and even a baseball team. He ran the Winter Olympics in 1998, which is pretty famous. But now, last year, he faced some serious legal issues because of something called \"fraud.\" I think that means he lied about share-ownership structures or something.\n\nWait, let me make sure. The text says he was taken away in a van outside one of his Prince hotels. So, he left to go somewhere else. The city is Tokyo, and those are the details given.\n\nNow, he's facing criminal charges because the Japanese stock market rules say that no company can be more than 80% owned by its top 10 shareholders. That means if a company has more than 20%, it needs at least one shareholder to own less than 80%. Seibu Railways was listed before, but now it's delisted from the stock exchange because he used false data.\n\nHis shares have gone down a lot too—maybe even bought out by another company. He's been fired from all his business posts. His determination seems tied to something: when he dined with his father and got angry for letting him use a silk futon, which was a luxury item then.\n\nHe describes it as feeling enormous pressure at the time, scolding for not being overly nice or not giving children proper attention. Maybe that's how his parents had made him money—buying properties after rebuilding Japan after WWII.\n\nThere are other companies in Japan with similar issues too, like Mitsubishi Motors and Japan's troubled UFJ bank. Twelve managers there were charged about covering up safety defects in their cars and concealing bad loans from the bank.\n\nSo, summarizing all that, Tsutsumi is being punished for making it look like he lied to others about his shares and business dealings. He used fraud-related stock options as a way to avoid paying taxes or cheat on stock buybacks. His arrest will likely lead to him serving time in prison.\n</think>\n\nYoshiaki Tsutsumi was arrested globally for fraud, leading to legal consequences after being linked to false share ownership structures and conduct. After his arrest, Seibu Railways and part of Mitsubishi Motors were fined with penalties. His case follows a trend of Japanese businesses facing corporate fraud and transparency issues, with details on how he used stock options to evade taxes or buy out shares. The incident highlights the pressure some executives face in their careers due to untruthful business practices.", "tinyllama:1.1b": "The Japanese mogul Yoshiaki Tsutsumi was arrested on Thursday, accused of fraudulent shareholder information and selling shares based on false data. Tsutsumi was once ranked as the world's richest man, but has recently been targeted by investigators for his involvement in a series of business misconducts in Japan. He is facing criminal charges and may face a prison sentence due to the fact that he made it look as if 10% of his listed company's shareholders did not own more than this amount. Tsutsumi's fall from grace comes after several top executives in Japan were arrested over corporate governance issues, including those at Mitsubishi Motor Corporation and UFJ Bank.", "tinydolphin:1.1b": " A Japanese business magnate, Yoshiaki Tsutsumi, was arrested on charges of falsifying shareholder information and selling shares based on false data. He is considered one of Japan's best-known businessmen due to his extensive real estate empire. The arrests follow a series of scandals involving top executives in Japan, which have been linked to business practices that were once prevalent in the country.", "phi:2.7b": " A summary could be:\n\nJapan's richest man, Yoshiaki Tsutsumi, was arrested on charges of fraud for falsifying shareholder information in his business empire. He is accused of making it seem like he had less control over Seibu Railways than he actually did, which resulted in the company being delisted and its value dropping. This follows a series of arrests by Japanese authorities who are trying to crack down on corporate scandals. Tsutsumi was once seen as untouchable due to his connections with politicians and celebrities, but he faced pressure from his father during his childhood.\n", "orca-mini:3b": " Japanese businessman Yoshiaki Tsutsumi was arrested on charges of falsifying shareholder information and selling shares based on the false data. He once ran a business spanning hotels, railways, construction, and a baseball team, and was one of Japan's most powerful industrialists with close connections to politicians. However, last year, he faced criminal charges for covering up safety defects in his company's vehicles and concealing bad loans at UFJ bank.", "hermes3:3b": "Japanese businessman Yoshiaki Tsutsumi arrested for falsifying shareholder information and selling shares based on false data, leading to delisting of company and possible prison sentence.", "stablelm-zephyr:3b": "Yoshiaki Tsutsumi, a once-powerful Japanese businessman, has been arrested on charges of falsifying shareholder information and selling shares based on false data. Tsutsumi, who inherited a large property business from his father in the 1960s, was once ranked as the world's richest man. He is the latest top executive to be arrested in Japan due to business scandals. Authorities are attempting to curb murky business practices that were once widespread in Japanese companies. Twelve managers from Mitsubishi Motors were charged with covering up safety defects in their vehicles, and three executives from UFJ bank were charged with concealing the extent of the bank's bad loans.", "stablelm2:1.6b": "Japanese businessman Yoshiaki Tsutsumi was arrested for fraud after allegedly falsifying shareholder information to sell shares based on false data, part of a series of arrests related to business scandals in Japan. Once ranked as the world's richest man, he now faces criminal charges and potential imprisonment due to misleading ownership structure of Seibu Railways, which has been delisted from the stock exchange. This arrest follows the recent apprehension of several other top executives working to curb these murky business practices in Japanese companies.", "granite3.1-dense:2b": "Japanese tycoon Yoshiaki Tsutsumi, once the world's richest man and head of a diverse business empire including hotels, railways, construction, and a baseball team, was arrested on Thursday for fraud. He is accused of falsifying shareholder data to make it appear that his company, Seibu Railways, was not overly concentrated in the hands of its top 10 shareholders—a requirement set by Japanese stock market rules. This manipulation led to Seibu Railways' delisting from the stock exchange and a significant drop in share value, making it vulnerable to takeover. Tsutsumi's arrest is part of an ongoing campaign against unethical business practices in Japan, following similar cases involving other high-ranking executives. His motivations may stem from his childhood experiences growing up as the third son of a property tycoon who imposed strict regulations and expectations on him.", "chatgpt-4o-latest": "Japanese businessman Yoshiaki Tsutsumi, once the world's richest man, was arrested for falsifying shareholder information and selling shares based on false data. Tsutsumi, who inherited a vast business empire, was influential in Japan's industrial and political circles and played a key role in bringing the 1998 Winter Olympics to Nagano. He resigned from his business positions last year after being accused of manipulating Seibu Railways' share-ownership structure to bypass stock market regulations. Seibu Railways has since been delisted, its share value has plummeted, and it is facing a takeover bid. His arrest is part of a broader crackdown on corporate misconduct in Japan, following similar cases involving Mitsubishi Motors and UFJ bank executives. Tsutsumi's relentless ambition may have stemmed from a strict upbringing under his wealthy but demanding father.", "reference": "But last year, he was forced to resign from all the posts he held in his business empire, after being accused of falsifying the share-ownership structure of Seibu Railways, one of his companies.Mr Tsutsumi's fall from grace follows the arrests of several other top executives in Japan as the authorities try to curb the murky business practices which were once widespread in Japanese companies.There was a time when Mr Tsutsumi seemed untouchable.Yoshiaki Tsutsumi was once ranked as the world's richest man and ran a business spanning hotels, railways, construction and a baseball team.His is the latest in a series of arrests of top executives in Japan over business scandals.One of Japan's best-known businessmen was arrested on Thursday on charges of falsifying shareholder information and selling shares based on the false data.\"I felt enormous pressure when I dined with him and it was nothing but pain,\" Tsutsumi told a weekly magazine in 1987.He was taken away in a van outside one of his Prince hotels in Tokyo."}