{"raw_text": "Deutsche Telekom sees mobile gain\n \n German telecoms firm Deutsche Telekom saw strong fourth quarter profits on the back of upbeat US mobile earnings and better-than-expected asset sales.\n \n Net profit came in at 1.4bn euros (£960m; $1.85bn), a dramatic change from the loss of 364m euros in 2003. Sales rose 2.8% to 14.96bn euros. Sales of stakes in firms including Russia's OAO Mobile Telesystems raised 1.17bn euros. This was more than expected and helped to bring debt down to 35.8bn euros.\n \n A year ago, debt was more than 11bn euros higher. T-Mobile USA, the company's American mobile business, made a strong contribution to profits. \"It's a seminal achievement that they cut debt so low. That gives them some head room to invest in growth now,\" said Hannes Wittig, telecoms analyst at Dresdner Kleinwort Wasserstein. The company also said it would resume paying a dividend, after two years in which it focused on cutting debt.\n", "llama3.2:1b": "Deutsche Telekom saw 1.4bn euros in profits in the fourth quarter due to upbeat US mobile earnings and better-than-expected asset sales, with sales rising by 2.8% to 14.96bn euros. The company cut its debt to 35.8bn euros, more than expected, thanks to contributions from T-Mobile USA and OAO Mobile Telesystems, which raised 1.17bn euros in stake sales.", "llama3.2:3b": "Deutsche Telekom reported strong fourth quarter profits driven by upbeat US mobile earnings and asset sales, with net profit reaching 1.4bn euros, up from a loss of 364m euros in 2003. Sales rose 2.8% to 14.96bn euros, partly due to the sale of stakes in firms like OAO Mobile Telesystems, which increased debt reduction and brought it down to 35.8bn euros.", "gemma2:2b": "Deutsche Telekom achieved strong Q4 profits driven by US mobile earnings and asset sales exceeding expectations.  Net profit was €1.4 billion, reversing a 2003 loss. Asset sales contributed €1.17 billion to the profit and reduced debt to €35.8 billion. T-Mobile USA played a key role in driving this success. The company plans to resume paying dividends after focusing on debt reduction for two years. \n", "qwen2.5:0.5b": "Deutsche Telekom reported strong fourth-quarter profits and favorable mobile earnings data that contributed to a lower loss than the previous year. Sales increased by 28% to EUR 14.96 billion, while the sale of stakes in Russian companies including OAO Mobile Telesystems raised sales by an additional 1.17 billion euros. This was more than expected and helped keep debt levels at a manageable level of 35.8 billion euros. Previously, Deutsche Telekom had been struggling with high debt levels that made it difficult to invest in growth. The company also announced plans to resume paying dividends.", "qwen2.5:1.5b": "German telecommunications giant Deutsche Telekom reported strong fourth-quarter profits driven by improved US mobile earnings and asset sales, marking a significant turnaround from losses the previous year. Net profit reached 1.4 billion euros, up sharply from 364 million euros in 2003. Sales increased by 2.8% to 14.96 billion euros, with an additional 1.17 billion euros generated from asset sales. Debt fell significantly, dropping to 35.8 billion euros from over 11 billion euros a year earlier. T-Mobile USA was particularly influential in boosting profits, and the company plans to resume dividend payments after two years focused on reducing debt.", "qwen2.5:3b": "Deutsche Telekom reported strong fourth quarter profits of 1.4bn euros, up from a loss of 364m euros in 2003. Sales rose 2.8% to 14.96bn euros, with asset sales contributing 1.17bn euros, bringing debt down to 35.8bn euros (from more than 11bn higher a year ago). T-Mobile USA's strong performance contributed significantly to profits, helping Deutsche Telekom cut its debt substantially. The company also announced resuming dividend payments after two years focused on reducing debt.", "opencoder:1.5b": "Deutsche Telekom sees mobile gain saw strong fourth quarter profits on the back of upbeat US mobile earnings and better-than-expected asset sales.\nThis report focuses on Deutsche Telekom's financial performance during the year, highlighting their key growth points and losses. The company experienced positive net profits of 1.4 billion euros (around £960 million) in the fourth quarter compared to 2003, a dramatic change that was expected given the upward trend in mobile sales.\nThe increase came from expected increases in asset sales of 14.96 billion euros, with companies like Russia's OAO Mobile Telesystems also raising profits. This increased margin helped bring down debt, which is a key aspect for growth and investment decisions. The company also contributed to overall profit by making significant contributions to the dividend.\nT-Mobile USA, the company's American mobile business, made a strong contribution in the first quarter of 2018, following the fiscal year ending March 31st, providing substantial sales growth and helping to maintain the debt level.\n", "smollm:1.7b": "Deutsche Telekom saw strong fourth quarter profits on the back of upbeat US mobile earnings and better-than-expected asset sales. Net profit came in at 1.4bn euros (£960m; $1.85bn), a dramatic change from the loss of 364m euros in 2003. Sales rose 2.8% to 14.96bn euros. Sales of stakes in firms including Russia's OAO Mobile Telesystems raised 1.17bn euros. This was more than expected and helped to bring debt down to 35.8bn euros.\n\nA year ago, debt was more than 11bn euros higher. T-Mobile USA, the company's American mobile business, made a significant contribution to profits. \"It's a seminal achievement that they cut debt so low,\" said Hannes Wittig, telecoms analyst at Dresdner Kleinwort Wasserstein. The company also said it would resume paying a dividend, after two years in which it focused on cutting debt.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help the user summarize the given text concisely. Let's see what information is provided.\n\nThe text is about Deutsche Telekom's fourth quarter performance. It mentions strong profits, upbeat mobile earnings, better asset sales, and a significant increase in sales. The key figures are net profit of 1.4 billion euros, which is way higher than the previous year when it was a loss. Sales rose by 2.8%, with some stake sales contributing to lower debt levels.\n\nI should focus on capturing these main points: strong profits, rising sales, increased asset sales, debt relief from high leverage. Also, include the contribution of T-Mobile USA and their financial strategy regarding debt repayment.\n\nWait, the user said to only output the summary as plain text without explanations or formatting. So I need to keep it concise but retain all critical details.\n</think>\n\nDeutsche Telekom saw robust fourth-quarter profits driven by strong US mobile performance, better-than-expected asset sales, and a significant increase in sales. Net profit of 1.4 billion euros marked a dramatic shift from the previous year's loss. Sales rose 2.8% to 14.96 billion euros, with stake sales boosting debt relief to 35.8 billion euros. T-Mobile USA contributed significantly to profits, and Deutsche Telekom is poised to pay a dividend after reducing debt for two years.", "tinyllama:1.1b": "German telecoms firm Deutsche Telekom saw strong fourth-quarter profit on the back of impressive results from its US mobile business and the positive outlook for asset sales. The company's net profit amounted to 1.4bn euro ($1.85bn) in comparison with a loss of 364m euro in 2003. Sales rose by 2.8% to 14.96bn euro, and debt was brought down by more than $1.17bn. The company's investments were supported by a debt reduction of $1.5bn and the resumption of its paying dividend after a two-year hiatus due to focusing on debt reduction.", "tinydolphin:1.1b": " Deutsche Telekom has seen mobile earnings improve and experienced a dramatic change in profits with a significant increase in sales. Sales of stakes in US companies increased by $1.17 billion to $35.8 billion, bringing the total debt reduction by over $1 billion. This allowed Deutsche Telekom to achieve better-than-expected profitability and pay out a dividend after two years focused on cutting debt.", "phi:2.7b": " German telecommunications firm Deutsche Telekom reported strong fourth quarter profits of 1.4 billion euros due to better-than-expected asset sales and improved US mobile earnings. Debt was significantly reduced, allowing for potential growth investments. T-Mobile USA's performance also contributed to the company's profitability. The decision to resume dividend payments was made.\n", "orca-mini:3b": " German telecoms giant Deutsche Telekom saw strong fourth quarter profits with net profit coming in at 1.4bn euros and sales rising by 2.8%. Better-than-expected asset sales and higher US mobile earnings helped to bring debt down to 35.8bn euros. The company also said it would resume paying a dividend after two years of focusing on cutting debt.", "hermes3:3b": "Deutsche Telekom reports 1.4bn euros Q4 profit, mainly due to higher US mobile earnings & lower debt due to asset sales.", "stablelm-zephyr:3b": "Deutsche Telekom made a profit of 1.4 billion euros in the fourth quarter due to positive US mobile earnings and higher-than-expected asset sales. Sales increased by 2.8% to 14.96 billion euros, and the company reduced its debt from over 11 billion euros a year ago to 3.58 billion euros. Deutsche Telekom also announced it would resume paying dividends after two years of focusing on reducing debt. T-Mobile USA contributed significantly to the profit growth.", "stablelm2:1.6b": "German telecom firm Deutsche Telekom posted strong Q4 profits due to US mobile earnings and asset sales. Net profit reached 1.4bn euros (approximately $1.8bn), up from the previous loss of 900 million euros. Sales rose 2.8% to €15.8bn, with stake sales raising a total of 1.8bn euros. T-Mobile USA contributed significantly to profits, and the company plans to resume dividend payments after two years of debt reduction focus.", "granite3.1-dense:2b": "Deutsche Telekom reported robust Q4 2013 financials, with net profit soaring to €1.4 billion (£960m; $1.85bn), a significant improvement from the 2003 loss of €364 million. Sales increased by 2.8% to €14.96 billion, driven primarily by better-than-anticipated asset sales of stakes in firms like Russia's OAO Mobile Telesystems, which generated €1.17 billion. This substantial cash inflow enabled the company to reduce debt from over €46 billion a year ago to €35.8 billion. T-Mobile USA, the firm's key American mobile entity, significantly contributed to these profits. Telecoms analyst Hannes Wittig praised Deutsche Telekom's debt reduction, noting it provides room for future growth investments. The company also announced its intention to reinstate dividend payments after a two-year debt repayment focus.", "chatgpt-4o-latest": "Deutsche Telekom reported strong fourth-quarter profits, driven by robust US mobile earnings and better-than-expected asset sales. Net profit reached 1.4 billion euros, reversing a 364 million euro loss in 2003, while sales rose 2.8% to 14.96 billion euros. The company raised 1.17 billion euros from asset sales, reducing debt to 35.8 billion euros—over 11 billion euros lower than the previous year. T-Mobile USA significantly contributed to profits. Analysts praised the debt reduction, which allows for future investment. Deutsche Telekom also announced it would resume dividend payments after a two-year hiatus.", "reference": "A year ago, debt was more than 11bn euros higher.This was more than expected and helped to bring debt down to 35.8bn euros.Sales rose 2.8% to 14.96bn euros.Sales of stakes in firms including Russia's OAO Mobile Telesystems raised 1.17bn euros."}