{"raw_text": "Chinese wine tempts Italy's Illva\n \n Italy's Illva Saronno has agreed to buy 33% of Changyu, the largest wine maker in China.\n \n Changyu said in a statement to the Shenzhen stock exchange that Illva will pay 481.42m yuan ($58.16m; £30.7m), once the government approves the deal. The Italian liqueur maker will acquire the shares from the Yantai State Asset Management Bureau. Chinese wine sales are growing, the US Agriculture Department said, with wine sales in 2003 up 25% at 61.1bn yuan.\n \n China is encouraging state-owned companies to sell shares to foreign investors. Anheuser-Busch, Heineken and Scottish & Newcastle have all invested in the Chinese beer industry in the last two years and now Illva Saronno is betting on the Chinese wine market. Yantai State Asset Management Bureau - a government agency in the north-eastern city of Yantai - owns 55% of Changyu. The state agency will also sell 10% of its stake in Changyu to another overseas company, although it didn't say who. The remaining 12% will be retained by the Yantai city government. The consumption of wine in China is still low, at just 0.22 litres per capita, said the US Agriculture Department. This compares with 59 litres in France, 12 litres in the US and three litres in Japan.\n", "llama3.2:1b": "Italy's Illva Saronno has agreed to buy a 33% stake in Chinese wine maker Changyu, with the Italian company paying 481.42m yuan (58.16m; £30.7m) for the shares. China is encouraging foreign investors into its wine industry and Yantai State Asset Management Bureau owns 55% of Changyu.", "llama3.2:3b": "Illva Saronno to buy 33% of Changyu, largest Chinese wine maker, for $58.16m, following trend of foreign investment in China's growing wine market as consumption remains low at 0.22 litres per capita.", "gemma2:2b": "Illva Saronno, an Italian liqueur maker, will buy a 33% stake in Changyu, China's largest wine producer, for $58 million. The deal is subject to government approval and involves selling shares from the Yantai State Asset Management Bureau. This investment follows similar deals by other foreign companies in the Chinese beer industry. Despite low per capita wine consumption (0.22 liters), Chinese wine sales are growing rapidly. \n", "qwen2.5:0.5b": "Italian company Illva Saronno has agreed to buy 33% of Changyu, a major Chinese wine maker. China is encouraging state-owned companies to sell shares to foreign investors, as it sees this market growing. The Yantai State Asset Management Bureau owns 55% of Changyu and will also sell 10% of its stake. Another overseas company will retain the remaining 12%. Wine consumption in China still ranks low at just 0.22 litres per capita compared to France's 59, US' 12, and Japanese' three litres.", "qwen2.5:1.5b": "Italian liqueur maker Illva Saronno agrees to buy 33% of Changyu, China's largest wine company, for 481.42 million yuan (US$58.16 million). The deal involves a government-owned Chinese asset management agency selling shares to foreign investors. China is promoting state-owned companies' share sales to foreigners, with Anheuser-Busch and others investing in the beer industry. Changyu's consumption of wine remains low at 0.22 liters per capita compared to 59 liters in France, despite growing wine sales globally.", "qwen2.5:3b": "Italian Illva Saronno has agreed to acquire 33% of Changyu, China's largest wine maker, for 481.42m yuan after government approval. Changyu reported a 25% increase in wine sales to 61.1bn yuan in 2003. China is encouraging state-owned companies to sell shares to foreign investors with Anheuser-Busch, Heineken, and Scottish & Newcastle already investing in the Chinese beer industry. Illva Saronno now targets the Chinese wine market. Yantai State Asset Management Bureau, which owns 55% of Changyu, will also sell 10% stake to another overseas company, leaving the remaining 12% with the Yantai city government. China's per capita wine consumption is low at just 0.22 litres compared to 59 litres in France, 12 litres in the US and three litres in Japan.", "opencoder:1.5b": "The Chinese wine tempts Italy's Illva Saronno to agree to buy 33% of Changyu, the largest wine maker in China. It is said that Illva will pay $58.16m ($481.42m) in the Shenzhen stock exchange once the government approves the deal. The Italian liqueur maker from Yantai State Asset Management Bureau acquires shares to buy the wines. Chinese wine sales are growing, with wine sales in 2003 up at 25% at 61.1bn yuan. China is encouraging state-owned companies to sell shares to foreign investors. Anheuser-Busch, Heineken and Scottish & Newcastle have all invested in the Chinese beer industry in the last two years, now Illva Saronno is betting on the Chinese wine market with Yantai State Asset Management Bureau's stake in Changyu. The remaining 12% will be retained by the Yantai city government, where consumption of wine in China has been low at $0.22 litres per capita.\n", "smollm:1.7b": "Italian wine has been a significant driver for Chinese wine sales growth over the past few years. The Italian government has been actively encouraging foreign investors to invest in the Chinese wine industry through various policies and incentives. One of these is the \"Chinese Wine Investment Plan\" launched by the Chinese government in 2015, which aims to increase domestic wine production capacity by 30% within five years.\n\nThe Chinese government's support for the wine industry has been instrumental in attracting foreign investors to the sector. In 2017, Changyu, a Chinese wine maker, signed an agreement with the Italian government to purchase 33% of the company, which is one of the largest wine makers in China. The deal was seen as a significant step towards increasing Chinese wine production capacity and promoting exports.\n\nThe Italian government has also been actively involved in promoting Chinese wine exports through various initiatives such as the \"Italian Wine for All\" program, which aims to increase the consumption of Italian wines among Chinese consumers. In 2019, the Italian government launched a new wine brand, \"Il Cielo,\" which is specifically designed to appeal to Chinese consumers.\n\nThe Chinese government's support for the wine industry has been particularly significant in recent years, as China's wine market has seen rapid growth driven by increasing demand from domestic consumers and foreign investors. According to a report by the US Agriculture Department, China's wine sales grew by 25% in 2003, reaching $61.1bn (£48.9m). The Chinese government has been actively encouraging foreign investment in the sector through various policies and incentives, which is expected to contribute to further growth in the sector.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about the deal between Chinese wine company Illva Saronno and China's largest wine maker Changyu. Let me read through it carefully.\n\nFirst, the key points are that Changyu is agreeing to buy 33% of Illva for around 481.42 million yuan. Then, I should check if there are any additional details or nuances that need mentioning, like the government approval process and the specifics of where the shares are being transferred from.\n\nAlso, it's important to note that China is encouraging state-owned companies to sell their shares in foreign markets, which seems to be a trend here as well. The US agriculture department mentions that Chinese wine sales are growing at 25%, which is a positive sign for the market. The investments by Anheuser-Busch, Heineken, and Scottish & Newcastle all point towards expanding into the Chinese beer industry through wine.\n\nI should make sure to include that Yantai State Asset Management Bureau owns 55% of Changyu and will sell 10% to another company, while retaining 12%. The data on wine consumption in different countries is provided to give context about market demand. Overall, the summary should capture all these elements without going into too much detail.\n</think>\n\nIlva Saronno has agreed to purchase 33% of Changyu, the largest Chinese wine maker, valued at approximately 481.42 million yuan. The acquisition is expected from Yantai State Asset Management Bureau, which owns 55% of Changyu and will sell 10% to another foreign company while retaining 12%. China's state-owned companies are increasingly selling shares in foreign markets, as seen with Anheuser-Busch, Heineken, and Scottish & Newcastle investing in the Chinese beer industry. Wine consumption in China remains low at around 0.22 liters per capita, compared to higher figures in other countries like France (59 litres) and the US (12 litres).", "tinyllama:1.1b": "Italian wine maker Illva has agreed to buy a third of Changyu, China's largest wine producer. The sale price is worth $58m, including the government approval required for the acquisition. This comes as Chinese consumers are increasingly becoming interested in wine, with annual sales growing by 25% to 61.1bn yuan in 2003. This follows a two-year period in which state-owned companies such as Anheuser-Busch and Heineken have invested in the Chinese beer market. The sale is part of Illva's strategy to expand its operations in China, where wine sales are growing at around 25%. Yantai State Asset Management Bureau owns 55% of Changyu but agreed to sell a further 10% stake to another overseas company. The remaining 12% will be held by the city government of Yantai. This comes as China's consumption of wine is still low, at just 0.22 litres per capital compared with France, the US, and three litres in Japan.", "tinydolphin:1.1b": " Chinese wine tempts Italy's Illva Saronno to buy a stake from Changyu, China's largest wine maker, for an estimated 481.42 million yuan ($58.16 million; £30.7 million). This acquisition is part of the company's efforts to expand their beverage portfolio, especially in the area of alcoholic beverages. The Italian liqueur maker plans to invest heavily in its Chinese wine production and sales as well. Changyu has seen a strong growth in recent years with sales reaching 25% higher at 61.1 billion yuan ($8.07 billion) in 2003. This is encouraging the state-owned companies to sell their shares to foreign investors, especially those from overseas.", "phi:2.7b": " Illva Saronno will purchase 33% of Changyu, China's largest wine maker, for $58 million. The company plans to increase its presence in the Chinese wine market as it is growing at a rapid pace. Yantai State Asset Management Bureau, the government agency that currently owns 55% of Changyu, has agreed to sell 10% of its stake to an overseas company and retain 12%.\n", "orca-mini:3b": " Italian liqueur maker Illva will acquire a 33% stake in Changyu, China's largest wine maker, for $58.16m. The Chinese government agency owning 55% of Chang Yu will sell another 10% stake to an overseas company, while the Yantai city government will retain 12%. Despite low consumption levels in China, wine sales have been growing at a rate of 25% per year over the last decade. The US Agriculture Department estimates that China consumed just 0.22 litres of wine per person in 2018, compared with 59 litres in France, 12 litres in the US and three litres in Japan.", "hermes3:3b": "Illva buys 33% of Chinese wine maker Changyu.", "stablelm-zephyr:3b": "Italy's Illva Saronno has agreed to buy 33% of China's largest wine maker, Changyu, for $58.16m. Chinese wine sales grew by 25% in 2003 to reach 61.1bn yuan. This acquisition is part of China's encouragement of state-owned companies to sell shares to foreign investors. Yantai State Asset Management Bureau, a government agency that owns 55% of Changyu, will also sell 10% of its stake to another overseas company but retains 12% for the Yantai city government.", "stablelm2:1.6b": "Italy's Illva Saronno has acquired a 15% stake in China's largest wine maker, Changyu, for $7m. The deal comes as Chinese wine sales are growing, spurred on by the government encouraging state-owned companies to sell shares to foreign investors. Anheuser-Busch, Heineken and Scottish & Newcastle have already invested in the Chinese beer industry.", "granite3.1-dense:2b": "Italian liqueur company Illva Saronno has agreed to purchase a 33% stake in Changyu, China's largest wine producer, for approximately $58.16 million from Yantai State Asset Management Bureau. This deal, subject to government approval, will enable Illva to acquire shares from the state agency, which currently holds a 55% stake in Changyu. Another overseas entity is also set to buy a 10% portion of Changyu's shares from Yantai State Asset Management Bureau. The remaining 12% will remain with the Yantai city government.\n\nChangyu, a leading Chinese wine producer, reported a 25% increase in wine sales in 2003 to 61.1 billion yuan according to the US Agriculture Department. Despite growing interest from international investors like Anheuser-Busch, Heineken, and Scottish & Newcastle in China's beer market, Illva's investment underscores its confidence in China's burgeoning wine sector, with per capita consumption currently at 0.22 liters, significantly lower than global averages of 59 liters (France), 12 liters (US), and three liters (Japan).", "chatgpt-4o-latest": "Italy's Illva Saronno will acquire a 33% stake in China's largest wine maker, Changyu, for 481.42 million yuan ($58.16 million), pending government approval. The shares will be purchased from the Yantai State Asset Management Bureau, which is also selling 10% to another foreign investor while retaining 12%. China is encouraging foreign investment in state-owned firms, with companies like Anheuser-Busch and Heineken already investing in its beer industry. Wine sales in China grew 25% in 2003, though per capita consumption remains low at 0.22 litres compared to 59 litres in France.", "reference": "Yantai State Asset Management Bureau - a government agency in the north-eastern city of Yantai - owns 55% of Changyu.The consumption of wine in China is still low, at just 0.22 litres per capita, said the US Agriculture Department.Italy's Illva Saronno has agreed to buy 33% of Changyu, the largest wine maker in China.Chinese wine sales are growing, the US Agriculture Department said, with wine sales in 2003 up 25% at 61.1bn yuan.The Italian liqueur maker will acquire the shares from the Yantai State Asset Management Bureau."}