{"raw_text": "Parmalat to return to stockmarket\n \n Parmalat, the Italian dairy company which went bust after an accounting scandal, hopes to be back on the Italian stock exchange in July.\n \n The firm gained protection from creditors in 2003 after revealing debts of 14bn euros ($18.34bn; £9.6bn). This was eight times higher than it had previously stated. In a statement issued on Wednesday night, Parmalat Finanziaria detailed administrators' latest plans for re-listing the shares of the group.\n \n As part of the re-listing on the Italian stock exchange, creditors' debts are expected to be converted into shares through two new share issues amounting to more than 2bn euros. The company's creditors will be asked to vote on the plan later this year. The plan is likely to give creditors of Parmalat Finanziaria shares worth about 5.7% of the debts they are owed. This is lower than the 11.3% creditors previously hoped to receive. Creditors of Parmalat, the main operating company, are likely to see the percentage of debt they receive fall from 7.3% to 6.9%.\n \n Several former top Parmalat executives are under investigation for the fraud scandal. Lawmakers said on Wednesday night Enrico Bondi, the turnaround specialist appointed by the Italian government as Parmalat's chief executive, spoke positively about the company during a closed-door hearing of the Chamber of Deputies industry commission. \"Bondi supplied us with elements of positive results on the industrial positions and on the history of debt which will find a point of solution through the Parmalat group's quotation on the market in July,\" Italian news agency Apcom quoted several lawmakers as saying in a statement.\n", "llama3.2:1b": "Parmalat to return to stockmarket in July\nParmalat, an Italian dairy company, hopes to be back on the Italian stock exchange by July after gaining protection from creditors in 2003. The company is expected to issue two new share issues amounting to more than €2 billion to convert its creditors' debts into shares.\nThe plan is likely to give creditors about 5.7% of their owed debt, down from an initial estimate of 11.3%. Creditors are also set to receive a lower percentage of debt, from 7.3% to 6.9%.\nSeveral former Parmalat executives are under investigation for the fraud scandal.", "llama3.2:3b": "Parmalat to return to stockmarket, expected to re-list on Italian exchange in July, creditors' debts to be converted into shares through two new share issues totaling over 2bn euros, deal to give creditors about 5.7% of the debt they are owed.", "gemma2:2b": "Parmalat, an Italian dairy company, plans to return to the stock exchange in July. They plan to convert creditors' debts into shares through two new share issues worth over 2 billion euros.  The company’s creditors will vote on this plan later this year. This plan will likely give creditors of Parmalat Finanziaria about 5.7% of their debt as shares, lower than the previous hope for 11.3%. Several former top executives are under investigation for the accounting scandal. Enrico Bondi, appointed by the government, gave positive information about the company's progress during a parliamentary hearing.  \n", "qwen2.5:0.5b": "Parmalat hopes to return to the stock exchange by July, after completing a restructuring plan that includes creditors' debts being re-listed with new share issues. A senior Parmalat executive, Enrico Bondi, spoke positively about the company's history and positions during a hearing. The Italian government's close-watch law was likely to have positive effects on the outcome.", "qwen2.5:1.5b": "Parmalat plans to re-list shares, converting creditors' debts into new shares, with an expected 5.7% share valuation for those owed by Parmalat Finanziaria and lower percentages for Parmalat itself. Former executives are under investigation over an accounting scandal. The company hopes to be listed on the Italian stock exchange in July.", "qwen2.5:3b": "Parmalat, an Italian dairy company that defaulted due to an accounting scandal, aims to return to the Italian stock exchange by July. It gained creditor protection in 2003 after revealing debts of 14 billion euros ($18.34 billion; £9.6 billion), eight times higher than initially stated. The firm plans a re-listing on the stock exchange with two share issues amounting to more than 2 billion euros, converting creditors' debts into shares. Creditors are expected to receive about 5.7% of their debt in new Parmalat Finanziaria shares and slightly less than previously hoped (11.3%) for main operating company creditors. Several former top executives involved in the scandal have been investigated; however, lawmakers indicated that a turnaround specialist appointed by the Italian government supports the company's potential re-listing in July.", "opencoder:1.5b": "Parmalat to return to stockmarket\n\nThe Italian dairy company, Parmalat, has gone bust due to an accounting scandal that affected its business. The firm hoped to be back in the stock exchange for July, but it struggled financially. In a statement released on Wednesday night, Parmalat Finanziaria described the administration's latest plans for re-listing shares, which included a debt conversion plan. Creditors' debts are expected to be converted into shares through new share issues, totaling more than 2bn euros. The plan will likely allow them to vote on the company's plans in the upcoming year. The percentage of debt they receive might fall from 7.3% to 6.9%. Several executives have been investigated for possible fraudulent activities.\n", "smollm:1.7b": "Parmalat, the Italian dairy company that went bust after an accounting scandal, hopes to be back on the Italian stock exchange in July. The firm gained protection from creditors in 2003 after revealing debts of 14bn euros ($18.34bn; £9.6bn). This was eight times higher than it had previously stated. In a statement issued on Wednesday night, Parmalat Finanziaria detailed administrators' latest plans for re-listing the shares of the group.\nAs part of the re-listing on the Italian stock exchange, creditors' debts are expected to be converted into shares through two new share issues amounting to more than 2bn euros. The company's creditors will be asked to vote on the plan later this year. The plan is likely to give creditors of Parmalat Finanziaria shares worth about 5.7% of the debts they are owed. This is lower than the 11.3% creditors previously hoped to receive. Creditors of Parmalat, the main operating company, are likely to see the percentage of debt they receive fall from 7.3% to 6.9%.\nSeveral former top Parmalat executives are under investigation for the fraud scandal. Lawmakers said on Wednesday night Enrico Bondi, the turnaround specialist appointed by the Italian government as Parmalat's chief executive, spoke positively about the company during a closed-door hearing of the Chamber of Deputies industry commission. \"Bondi supplied us with elements of positive results on the industrial positions and on the history of debt which will find a point of solution through the Parmalat group's quotation on the market in July,\" Italian news agency Apcom quoted several lawmakers as saying in a statement.\nThe Parmalat scandal, which led to the bankruptcy of the dairy company, was triggered by a series of accounting scandals and mismanagement. In 2003, the company was found to have hidden debts worth 14bn euros ($18.34bn; £9.6bn) from its balance sheet. The scandal led to the resignation of Bondi and the appointment of a new chief executive, Giovanni Greco.\nIn recent years, Parmalat has made efforts to restore investor confidence and rebuild its reputation. In 2015, the company was listed on the Italian stock exchange for the first time since its bankruptcy in 2003. The listing was seen as a sign of progress towards recovery, but it also highlighted the challenges that still lie ahead.\nThe Parmalat scandal led to the resignation of Bondi and the appointment of Giovanni Greco, who has been credited with helping to restore investor confidence. However, many investors remain wary of the company's financial health and have questioned its ability to recover from further scandals.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Parmalat and their situation with the stock exchange. Let me read it carefully.\n\nFirst, Parmalat is a dairy company that went bankrupt due to an accounting scandal. They're hoping to return to the Italian stock exchange by July. They were protected from creditors in 2003, but their debt was much higher than what was previously stated—14 billion euros compared to 1.83 billion euros. Now they're dealing with restructuring plans.\n\nThey have two new share issues totaling more than 2 billion euros. Creditors will vote on this plan later this year, and if successful, they might get shares worth about 5.7% of their debts, which is lower than the previous target of 11.3%. Also, creditors of the main company are seeing their percentage fall from 7.3% to 6.9%.\n\nThey've had several top executives investigated for fraud. The CEO was appointed by law, and some lawmakers said positively about his performance during a hearing.\n\nI need to make sure I capture all these points without adding anything extra.\n</think>\n\n Parmalat, the Italian dairy company known for its profit-making business, faced significant challenges due to an accounting scandal that caused it to go bankrupt. Despite this, they hope to return to the Italian stock exchange by July. In 2003, creditors were protected but their debt was eight times higher than what was initially reported. Parmalat is now restructuring plans to re-list shares on the Italian stock exchange. They plan to convert creditors' debts into shares worth over 2 billion euros, with their share value dropping from 11.3% to 5.7%. Some top executives have been investigated for fraud, and a former CEO was appointed by law as CEO.", "tinyllama:1.1b": "Parmalat, Italy's largest dairy company, hopes to be back on the stock market in July after it gained protection from creditors in 2003 and revealed debts of 14bn euros ($18.34bn; £9.6bn). The firm has proposed two new share issues for more than 2bn euro in creditor debt, which is expected to give them a 5.7% stake in the company's operating company (Parmalat Finanziaria). Many former top executives are under investigation for fraud, and lawmakers have reportedly expressed confidence that Parmalat will be able to attract investors despite the recent financial woes faced by the dairy giant.", "tinydolphin:1.1b": " In summary, Parmalat has announced plans to return to the stock exchange and will re-list its shares with creditors owed more than 14 billion euros (US$18.34bn; £9.6bn). The creditor's votes on the re-listing plan will take place later this year, with Parmalat expected to receive a lower percentage of debt for its shares compared to previous expectations. This decision is likely to please creditors, who were initially expecting much higher percentages from their investments in the company. However, former top executives, including Enrico Bondi, are still under investigation and could face further scrutiny into the reasons behind the company's colossal debt problem.", "phi:2.7b": " In 2003, Parmalat, an Italian dairy company that went bankrupt after an accounting scandal, regained protection from creditors and plans to re-list its shares in July. The plan involves issuing new shares for debt conversion, with the amount likely to be around 2 billion euros. Creditors will have a say in this decision later this year. Several former top Parmalat executives are under investigation for the fraud scandal. Lawmakers said that Enrico Bondi, who was appointed as the company's CEO after the bankruptcy, spoke positively about the company during a closed-door hearing of the Chamber of Deputies industry commission.\n", "orca-mini:3b": " Parmalat, an Italian dairy company, went bankrupt after an accounting scandal and is planning to return to the stockmarket. The company hopes to raise more than 2bn euros by issuing new shares to creditors and converting their debts into shares. Former top executives are under investigation for fraud. Bondi, the new CEO, spoke positively about the company during a closed-door hearing of the Chamber of Deputies industry commission.", "hermes3:3b": "Parmalat to return to stockmarket in July, creditors' debts converted into shares over 2bn €.", "stablelm-zephyr:3b": "Parmalat, an Italian dairy company that collapsed due to an accounting scandal, is aiming to return to the stock market in July. The firm gained protection from creditors in 2003 after revealing debts of €14 billion ($18.34 billion; £9.6 billion). To re-list on the Italian stock exchange, creditors' debts will be converted into shares through two new share issues totaling more than €2 billion. Creditors will be asked to vote on the plan later this year, potentially giving them 5.7% of the debts they are owed, which is lower than the 11.3% previously hoped for. Former top Parmalat executives are under investigation for the fraud scandal.", "stablelm2:1.6b": "Parmalat, an Italian dairy company facing an accounting scandal, aims to return to the stock market by July. It currently owes around 2bn euros ($9.6bn; £18.4bn), eight times higher than previously reported. The company plans to convert creditors' debts into shares through two new issues amounting to more than 2bn euros. Creditors will vote on the plan later this year, with a potential increase of 0.3% in the percentage of debt they receive compared to previous estimates. Former top executives are under investigation for the fraud scandal.", "granite3.1-dense:2b": "Parmalat, an Italian dairy company that declared bankruptcy due to an accounting scandal in 2003 with debts of 14bn euros, aims to re-list its shares on the Italian stock exchange by July. This re-listing will involve converting creditors' debts into new Parmalat shares through two share issues totaling over 2bn euros. The plan is expected to grant creditors approximately 5.7% of their owed debts, lower than the 11.3% they previously sought. Similarly, creditors of the main operating company will receive around 6.9% of their debts. Former top Parmalat executives are under investigation for the fraud. Enrico Bondi, appointed as Parmalat's CEO by the Italian government, reportedly optimistically discussed potential positive outcomes during a parliamentary hearing.", "chatgpt-4o-latest": "Parmalat, the Italian dairy company that collapsed due to an accounting scandal, plans to return to the Italian stock exchange in July. After revealing debts of 14bn euros in 2003, the company gained creditor protection. As part of its re-listing, creditors' debts will be converted into shares through two new share issues worth over 2bn euros. Creditors of Parmalat Finanziaria will receive shares worth about 5.7% of their owed debts, lower than the previously expected 11.3%, while creditors of Parmalat, the main operating company, will see their recovery rate drop from 7.3% to 6.9%. Several former executives remain under investigation. Enrico Bondi, the government-appointed CEO, expressed optimism about the company's recovery, stating that the stock market listing would help resolve its debt issues.", "reference": "The plan is likely to give creditors of Parmalat Finanziaria shares worth about 5.7% of the debts they are owed.Creditors of Parmalat, the main operating company, are likely to see the percentage of debt they receive fall from 7.3% to 6.9%.As part of the re-listing on the Italian stock exchange, creditors' debts are expected to be converted into shares through two new share issues amounting to more than 2bn euros.In a statement issued on Wednesday night, Parmalat Finanziaria detailed administrators' latest plans for re-listing the shares of the group.Parmalat, the Italian dairy company which went bust after an accounting scandal, hopes to be back on the Italian stock exchange in July."}