{"raw_text": "Hyundai to build new India plant\n \n South Korea's Hyundai Motor has announced that it plans to build a second plant in India to meet the country's growing demand for cars.\n \n The company didn't give details of its investment but it said the new plant would produce 150,000 cars a year. This will boost the annual production capacity of the company - India's second-largest car manufacturer - to 400,000 units. Hyundai expects its sales in India to grow 16% to 250,000 in 2005. By 2010, it expects to nearly double sales to 400,000 cars. The new plant will be built close to the existing one in Chennai, in the southern province of Tamil Nadu.\n \n South Korea's top car maker estimates that the Indian market will grow 15% this year, to 920,000 vehicles, reaching 1.6 million vehicles by 2010. Demand in India has been driven by the poor state of public transport and the very low level of car ownership, analysts said. Figures show that currently only eight people per thousand are car owners. \"We desperately need to expand our production in order to meet growing demand in the Indian auto market, which is growing over 12 percent every year, and to top our competitors,\" chairman Chung Mong-koo said in the statement. He said the company plans to use India as a base for exports to Europe, Latin America and the Middle East. The company - which controls half of the South Korean's market - aims to become a global top five auto maker by 2010.\n", "llama3.2:1b": "Hyundai Motor plans to build a second plant in India, producing 150,000 cars per year, increasing its annual production capacity by 400,000 units. The new plant will be built near Chennai in Tamil Nadu and aim to expand Hyundai's sales in India, which is expected to grow 16% to 250,000 in 2005 and nearly double to 400,000 in 2010.", "llama3.2:3b": "Hyundai Motor plans to build a new plant in Chennai, India to meet growing demand for cars, boosting annual production capacity to 400,000 units. The new plant will produce 150,000 cars per year and is expected to contribute to the company's goal of becoming a global top five auto maker by 2010.", "gemma2:2b": "Hyundai Motor is building a new plant in India to increase car production capacity from 150,000 units per year to 400,000 units. This will boost Hyundai's sales in India by 16% to reach 250,000 units by 2005 and nearly double that to 400,000 units by 2010.  The new plant will be located near the existing plant in Chennai, Tamil Nadu. Hyundai expects strong growth in India's car market, driven by public transport needs and low car ownership levels. The company plans to use India as a base for exports to other markets including Europe, Latin America, and the Middle East. \n", "qwen2.5:0.5b": "South Korea's Hyundai Motor is planning to build a second car plant in India, where it expects to produce around 400,000 cars per year. This will boost the company's annual production capacity for India, which is its second-largest auto maker after India. The new plant will be built close to the existing Chennai plant and is expected to start operations by 2015. Hyundai estimates that Indian demand will grow at a rate of 15% annually until 2010.", "qwen2.5:1.5b": "South Korea's Hyundai Motor plans to build a second plant in India, increasing its production capacity there from 400,000 units to 550,000 and aiming for double-digit growth of sales in the country over the next decade, including exports to Europe, Latin America, and the Middle East. This expansion comes as India's car market is projected to grow by 12-15% annually.", "qwen2.5:3b": "Hyundai Motor plans to build a second plant in Chennai, Tamil Nadu, India to meet growing car demand. This new facility will produce 150,000 cars annually and increase Hyundai’s total production capacity to 400,000 units. Hyundai expects its sales in India to grow from 250,000 in 2005 to nearly 400,000 by 2010. The company estimates the Indian car market will reach 920,000 vehicles this year and 1.6 million by 2010. Hyundai aims to expand production for domestic use and export markets in Europe, Latin America, and the Middle East, with a goal of becoming one of the top five global auto makers by 2010.", "opencoder:1.5b": "Hyundai is planning to build a new India plant for South Korea. The new plant will produce approximately 150,000 cars per year and expect an increase in sales capacity to be 16% over the previous year. The Indian car market is projected to grow 15% this year, bringing the total count to about 920,000 vehicles. It is anticipated that growth would reach 1.6 million by 20XX.\n", "smollm:1.7b": "The summary is concise and focuses on key points:\n\n1. Hyundai will build a new India plant to meet growing demand for cars in the country.\n2. The company plans to produce 150,000 cars per year at the new plant.\n3. The new plant will boost the annual production capacity of Hyundai's Indian subsidiary - currently the second-largest car manufacturer in South Korea - to 400,000 units by 2005.\n4. By 2010, Hyundai expects sales in India to grow from 920,000 vehicles per year (current level) to nearly 1.6 million vehicles.\n5. The Indian market is expected to grow at a rate of 15% this year, reaching 920,000 vehicles by 2010.\n6. Demand in India has been driven by the poor state of public transport and low car ownership rates among Indians.\n7. Hyundai aims to use India as a base for exports to Europe, Latin America and the Middle East.\n8. The company plans to become a global top five auto maker by 2010.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Hyundai building a new plant in India. Let me read through it carefully.\n\nFirst, Hyundai announced they'll build a second plant in India to meet the growing demand for cars there. They said the new plant will produce 150,000 cars annually, which is expected to boost their total production capacity by 67% to reach 400,000 units. That's one of the largest car manufacturers in South Korea.\n\nThe target sales are ambitious: they aim for 250,000 cars in 2005 and nearly double that to 400,000 in 2010. The plant will be built near Chennai in Tamil Nadu, which is south of the existing plant there. That makes sense because if it's next door, they might share some operations.\n\nThe growth estimates say India's market grows by 15% annually and reaches 1.6 million cars by 2010. But the market is due to poor public transport and low car ownership. Only eight people per thousand are car owners, so demand is high but in a vulnerable area.\n\nHyundai's chairman emphasized expanding production for their competitive edge, especially as they become one of the top five auto companies. They plan to export to Europe, Latin America, and the Middle East and aim to be a global leader by 2010.\n\nI need to make sure I include all these key points: their target production numbers, growth projections, market conditions affecting demand, the location of the plant, and the vision for expanding globally. Also, note that they control half of South Korea's market.\n\nLet me structure this concisely without any explanations or formatting. Just the summary in plain text.\n</think>\n\nHyundai Motor plans to build a second plant in India, expected to produce 150,000 cars annually and boost production capacity to reach 400,000 units by 2010. Sales are projected to grow 16% to 250,000 cars in 2005 and nearly double to 400,000 in 2010. The plant will be located near Chennai in Tamil Nadu. demand is driven by low car ownership and infrastructure issues in India. Hyundai aims to become a global top-five automaker by 2010 after controlling half of South Korea's market.", "tinyllama:1.1b": "Hyundai Motor has announced plans to build a new car plant in India, which will boost its annual production capacity from 400,000 units to over 400,000 units. This will enable the company to meet growing demand for cars in India, which is currently only served by eight people per thousand. The new factory will be built near the existing one in Chennai, in the southern province of Tamil Nadu. Hyundai's CEO Chung Mong-koo stated that the company plans to use India as a base for exports to Europe, Latin America, and the Middle East, aiming to become a top five global auto maker by 2010. The company expects annual sales of over 250,000 units in India within 2005.", "tinydolphin:1.1b": " South Korea's Hyundai Motor has announced plans to build a new car plant in India, aiming to produce over 150,000 cars annually. This will boost its annual production capacity from the current 400,000 units to an estimated 400,000 cars per year by 2010. By 2010, Hyundai anticipates achieving nearly double sales in India compared to the previous forecast of 400,000 cars. The new plant will be built close to the existing one in Chennai, Tamil Nadu.\n", "phi:2.7b": " Hyundai Motor is building a second plant in India to meet growing demand for cars. The new plant will produce 150,000 cars per year and boost the annual production capacity to 400,000 units. The company expects sales in India to grow 16% to 250,000 in 2005 and nearly double by 2010 to 400,000 cars. South Korea's top car maker estimates that the Indian market will grow 15% this year to 920,000 vehicles, reaching 1.6 million by 2010. Demand in India has been driven by poor public transport and low car ownership.\n", "orca-mini:3b": " Hyundai plans to build a second plant in India to meet growing demand for cars. The new plant will produce 150,000 cars annually and boost the company's annual production capacity to 400,000 units. By 2010, Hyundai expects to nearly double sales to 400,000 cars. The Indian market is growing at 12% per year, and Hyundai aims to use India as a base for exports to Europe, Latin America, and the Middle East. The company plans to become a global top five auto maker by 2010.", "hermes3:3b": "Hyundai builds 2nd plant in India to produce 150,000 cars annually, boosting annual production capacity to 400k units; aims to nearly double sales to 400k cars by 2010.", "stablelm-zephyr:3b": "Hyundai plans to build a second plant in India to meet increasing demand for cars. The new plant, estimated to produce 150,000 cars a year, will boost the company's annual production capacity to 400,000 units and expand their market share in India. Hyundai expects sales growth of 16% in 2005 and nearly doubling that by 2010. The Indian car market is expected to grow 15% this year to 920,000 vehicles, reaching 1.6 million by 2010 due to low levels of public transport and car ownership. Hyundai aims to use India as a base for exports to Europe, Latin America, and the Middle East, with plans to become a global top five auto maker by 2010.", "stablelm2:1.6b": "Hyundai plans to build a second plant in India to increase production capacity, following the country's growing demand for cars. The new plant will manufacture 1 million vehicles annually and nearly double Hyundai's sales to 1.6 million vehicles by 2050. The company aims to use India as a base for exports and hopes that the Indian market will grow 1% this year, reaching 1.6 million vehicles. Demand in India has been driven by poor public transport and low car ownership rates.", "granite3.1-dense:2b": "Hyundai Motor, South Korea's second-largest car manufacturer in India, intends to establish a new plant near its existing one in Chennai, Tamil Nadu. This expansion will increase annual production capacity to 400,000 vehicles by 2010, with the new facility projected to produce 150,000 cars annually. The company anticipates Indian auto sales growth of 16% in 2005, reaching 250,000 units, and aims to nearly double this figure by 2010, targeting 400,000 vehicles sold. Hyundai forecasts the Indian market to expand from 920,000 vehicles in 2005 to 1.6 million by 2010, driven by limited public transport and low car ownership rates (eight people per thousand).\n\nChairman Chung Mong-koo emphasized the need for this expansion to meet growing demand and outperform competitors. Hyundai plans to utilize India as a base for exports to Europe, Latin America, and the Middle East, striving to become one of the top five global automakers by 2010.", "chatgpt-4o-latest": "Hyundai Motor plans to build a second plant in India to meet rising car demand, increasing its annual production capacity to 400,000 units. The new plant, near its existing Chennai facility, will produce 150,000 cars annually. Hyundai expects its Indian sales to grow 16% in 2005 and nearly double to 400,000 by 2010. The Indian car market is projected to grow 15% in 2005 and reach 1.6 million vehicles by 2010, driven by poor public transport and low car ownership. Hyundai aims to expand production to stay competitive and use India as an export base for Europe, Latin America, and the Middle East. The company seeks to become a global top five automaker by 2010.", "reference": "The company didn't give details of its investment but it said the new plant would produce 150,000 cars a year.South Korea's Hyundai Motor has announced that it plans to build a second plant in India to meet the country's growing demand for cars.South Korea's top car maker estimates that the Indian market will grow 15% this year, to 920,000 vehicles, reaching 1.6 million vehicles by 2010.Hyundai expects its sales in India to grow 16% to 250,000 in 2005.Demand in India has been driven by the poor state of public transport and the very low level of car ownership, analysts said."}