{"raw_text": "Wembley firm won't make a profit\n \n Shares in Multiplex Group, which is building the new Wembley stadium, fell as much as 19% after it said it would not make any money on the project.\n \n The Australian firm said it would only break even on the 1.2bn Australian dollars (£458m; $874m) rebuild, after a rise in costs on the work. Any profits would depend on the outcome of legal cases resulting from a change in steel contractor, it added. It cut A$68m from profit targets for Wembley and another UK project.\n \n Investors were shaken by the news and the firm's shares fell to a four month low of A$4.50, before recovering to close 16% down at A$4.67. The decline came despite Multiplex reporting an 11% rise in pre-tax profits to A$67.7m for 2004 and reaffirming its 2005 profit forecasts. Increased costs at Wembley and a separate development in London's Docklands saw Multiplex's construction division report profits of A$35.1m.\n \n The firm said the result was below expectations but stressed that the majority of its UK projects - which also include the White City redevelopment scheme in west London - were performing strongly.\n \n To recoup any profit from Wembley, where the firm changed its steel contractor due to a legal dispute, Multiplex will have to win legal claims against subcontractors. These claims could take up to two years to resolve. \"Multiplex believes its claim are sound and ultimately will exceed the level needed to support the break even position,\" it said. \"It is expected that profits will be possible in future periods as the claims are finalised.\" Wembley Stadium is to due to be completed in January and will officially open for the 2006 FA Cup Final. Analysts expressed concern at the unexpected paring back in profit. \"Such a big writeback on the Wembley project in such a short period has impacted on management credibility,\" Simon Wheatley, from Goldman Sachs, told Reuters.\n", "llama3.2:1b": "Wembley firm Multiplex Group's shares fell 19% after announcing it would not make any money on its new Wembley stadium project due to rising costs and a change in steel contractor. The company cut A$68m from profit targets for Wembley and another UK project, despite reporting an 11% rise in pre-tax profits.", "llama3.2:3b": "Multiplex Group said it will not make a profit on its £458m rebuild of the new Wembley stadium due to increased costs and a change in steel contractor, which may take up to two years to resolve.", "gemma2:2b": "Multiplex Group's shares fell as much as 19% after it announced it would break even on the Wembley Stadium rebuild. The company cited increased costs and pending legal claims for profit reduction. While they reported strong profits for 2004, the firm cut its profit targets for Wembley and another UK project.  The company expects to make a profit in the future after legal claims related to the steel contractor are resolved. Analysts expressed concern about this unexpected profit decrease impacting their credibility. \n", "qwen2.5:0.5b": "Multiplex Group, which is building the new Wembley stadium in London, announced that it would not make any money on the project, and shares in its stock fell to a four-month low of A$4.50 before recovering to 16% down at A$4.67. The firm's profit targets for 2004 were also lower than expected but reaffirmed its 2005 predictions, with profits exceeding the break-even position by $35.1m.\nAn Australian firm building Wembley Stadium said it would only make a profit of A$67.7m on the project after costs rose and legal cases were brought against steel contractors. The firm's shares fell to a four-month low of A$4.50 before recovering to 16% down at A$4.67.\nThe deal is seen as an attempt by Wembley Group to reduce costs, but the company also faces increased costs from other projects such as London's Docklands development and construction in west London. Analysts expressed concern about the writeback on the Wembley stadium project and its impact on management credibility.", "qwen2.5:1.5b": "Multiplex Group's shares fell 19% after predicting it wouldn't make money on its Wembley stadium rebuild project worth $458 million. The firm said costs would rise and profits would depend on legal outcomes for a steel contractor change. Shares dropped to an 11-month low but recovered, down 6%, closing at A$4.67 despite improved financials from the previous year's pre-tax profit of $67.7m.", "qwen2.5:3b": "Wembley firm Multiplex Group won't make money on its $874m stadium rebuild due to increased costs and legal disputes with steel contractor. Despite an overall 11% rise in pre-tax profits for the year, shares fell sharply as investors reacted negatively. The decline was exacerbated by a cut of A$68m from profit targets, primarily related to Wembley project. Multiplex expects future profit recovery through winning claims against subcontractors, which could take up to two years. Analysts were concerned about management credibility after the unexpected reduction in projected profits for the stadium project.", "opencoder:1.5b": "The Wembley firm won't make a profit after the announcement. Shares in Multiplex Group fell as much as 19% due to the loss of profits after legal cases were resolved. Investors were shaken by the news but the shares remained low at around A$4.50. The company reported increased costs and a new development in Docklands, which had boosted profit targets for Wembley. Despite the majority UK projects performed well, Multiplex Group has seen an increase in profits after legal disputes over the steel contractor. It is expected to recoup any potential profit from the project in future periods as the claims are finalised.\n", "smollm:1.7b": "The summary is concise and to the point, preserving key ideas and details while omitting unnecessary information. It provides an overview of the main points covered in the text, including:\n\n1. The Wembley firm's decision not to make any money on the rebuild project.\n2. The impact of this decision on the firm's profits.\n3. The reasons behind the firm's decision and its potential consequences.\n4. The impact of the news on investors and the firm's share price.\n5. The firm's response to the news, including its statement about the Wembley rebuild project and its 16% profit target for 2004.\n6. The impact of the news on the firm's profits in 2005 and 2006.\n7. The reasons behind the firm's decision to make a profit from the Wembley build-up project, including the outcome of legal cases related to the steel contractor dispute.\n8. The firm's response to the news and its potential impact on future profits.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text about Multiplex Group's announcement regarding the Wembley stadium project. Let me read through it carefully.\n\nFirst, the text mentions that Wembley firm hasn't made a profit. The shares fell by nearly 19% because of this news. They said they wouldn't make any money on the project and that the rebuild would cost around $458 million.\n\nThen, there's an Australian firm mentioned who is planning to break even on their $1.2 billion project. After costs, they expect only a small profit, up to $677 million. They cut their profits for Wembley by $68 million due to legal cases from a steel contractor change. There were other UK projects involved too.\n\nInvestors were worried and the stock fell lower to A$4.50, then went back up. Multiplex reported an 11% increase in pre-tax profits to $67.7 million for 2004. Increased costs at Wembley and a separate project in London added another $35.1 million to their profits.\n\nThey said the result was below expectations but noted that most UK projects are doing well, especially White City in London. To recover from Wembley's profit changes, they have to win legal claims against subcontractors for up to two years.\n\nSo, putting it all together, the key points are:\n1. Wembley hasn't made a profit and shares fell.\n2. The Australian firm broke even on their project costed at $1.2 billion.\n3. Multiplex had to cut profits by $68 million because of legal changes.\n4. Other projects like White City in London were performing well.\n5. Investors are worried due to the profit writeback and legal issues.\n6. They plan to win legal claims, which could take two years.\n\nI need to make sure I include all these points concisely without adding any extra information.\n</think>\n\nMultiplex Group's Wembley stadium project has resulted in a lack of profit, with shares falling as much as 19%. The Australian firm is expected to break even on their $1.2 billion rebuild after increased costs, but they will cut profits by $68 million for Wembley due to legal changes. Other projects, including White City in London, were performing well. Investors are concerned about the profit writeback and legal issues. To recover, Multiplex needs to win legal claims against subcontractors, potentially taking up to two years.", "tinyllama:1.1b": "Shares in Australian firm Multiplex Group have fallen after it announced that the investors were shaken by its decision to not make any profit on the new Wembley stadium project due to rising costs and a legal dispute with the steel contractor. The company also announced a reduction in profit targets for its other UK projects, which includes developments in London's Docklands and a subcontractor dispute at Weymouth Stadium. Multiplex reiterated that it believes that the claims against subcontractors will be resolved within two years, allowing it to support future profit potential. Investors expressed concern at the sudden writeback on the Weymouth project, but Multiplex maintained its 2005 profit forecasts.", "tinydolphin:1.1b": " The company responsible for building Wembley Stadium has been reported to have lost millions of dollars due to a change in steel contractor and its decision not to make any profits on the project. This comes as a surprise to investors who had anticipated a solid performance from the company, which owns shares in Multiplex Group. The company is now facing legal challenges related to the steel work for Wembley and another UK project, which could cause further setbacks in terms of profits and shareholder value. Despite these setbacks, analysts believe that the company has strong claims against subcontractors involved in the Wembley project. This situation indicates poor management and could have serious implications for the company's future performance.", "phi:2.7b": " Shares in Multiplex Group fell as much as 19% after it said it would not make any money on the new Wembley Stadium and that it would only break even on the project after a rise in costs. The Australian firm cut A$68m from profit targets for Wembley and another UK project, despite reporting an 11% increase in pre-tax profits for 2004 and reaffirming its 2005 profit forecasts. Increased costs at Wembley and a separate development in London' Docklands led to Multiplex's construction division reporting profits of A$35.1m. The firm said that it would have to win legal claims against subcontractors to recoup any profit from Wembley, which could take up to two years to resolve. Despite this, Multiplex believes its claim are sound and will ultimately exceed the level needed to support the break even position.\n", "orca-mini:3b": " The Wembley firm said it would not make any money on the project and would only break even. Costs rose at Wembley and a London redevelopment scheme, and Multiplex's construction division reported profits of A$35.1m. Legal cases are expected to result in profits. The company will have to win legal claims against subcontractors to recoup any profit from Wembley. Analysts expressed concern at the unexpected news.", "hermes3:3b": "Multiplex Group shares fall 16% after announcing it won't make a profit on £458m Wembley stadium build, despite rising pre-tax profits to A$67.7m for 2004.", "stablelm-zephyr:3b": "Multiplex Group's shares fell 19% after it announced that it would not make a profit on the new Wembley stadium project. The Australian firm said it would only break even on the $1.2bn rebuild following a rise in costs and any profits would depend on the outcome of legal cases resulting from a change in steel contractor. Multiplex had to cut its profit targets for Wembley and another UK project due to increased costs at Wembley and a separate development in London's Docklands, leading to a four month low for shares before recovering to close 16% down at $4.67. The firm stressed that the majority of its UK projects were performing strongly, but expects legal claims related to the steel contractor dispute to take up to two years to resolve.", "stablelm2:1.6b": "Multiplex Group, building the new Wembley stadium, did not expect to make any profit on the project due to increased costs and legal cases related to changing steel contractor. The firm cut A$ from profit targets and affirmed its plans for future profits, depending on legal outcomes. Despite a 4% drop in shares, the company reported an increase of 15% in pre- tax profits. Multiplex's construction division had profits of $1 million. The company is still working to recoup any profit from Wembley, which changed its steel contractor for legal disputes, with potential future profits depending on final resolution of claims against subcontractors.", "granite3.1-dense:2b": "Multiplex Group, an Australian firm responsible for building Wembley Stadium's new £458m (A$1.2bn) renovation, announced it would not generate profit from the project due to increased costs and a legal dispute with steel contractors. The company's shares plummeted 19% as a result, hitting a four-month low of A$4.50 before recovering at A$4.67 down 16%. Despite reporting a 11% rise in pre-tax profits to A$67.7m for 2004 and maintaining 2005 profit forecasts, the unexpected loss of £68m from Wembley and another UK project caused investor unease. Multiplex expects to recover any potential profit through successful legal claims against subcontractors, anticipated to take up to two years to resolve. Analysts expressed concern over the sudden reduction in Wembley project profitability, impacting management credibility. The new Wembley Stadium is scheduled for completion and opening in January 2006 for the FA Cup Final.", "chatgpt-4o-latest": "Shares in Multiplex Group fell up to 19% after the company announced it would not make a profit on the £458m Wembley Stadium rebuild due to rising costs. Any potential profit depends on legal claims related to a change in steel contractor, which could take up to two years to resolve. The firm cut A$68m from profit targets for Wembley and another UK project, despite reporting an 11% rise in pre-tax profits for 2004. Investors reacted negatively, with shares hitting a four-month low before closing 16% down. Multiplex stated that most of its UK projects were performing well and expressed confidence in its legal claims. Analysts raised concerns over the unexpected profit revision, impacting management credibility. Wembley Stadium is set to be completed in January and open for the 2006 FA Cup Final.", "reference": "To recoup any profit from Wembley, where the firm changed its steel contractor due to a legal dispute, Multiplex will have to win legal claims against subcontractors.It cut A$68m from profit targets for Wembley and another UK project.Shares in Multiplex Group, which is building the new Wembley stadium, fell as much as 19% after it said it would not make any money on the project.The decline came despite Multiplex reporting an 11% rise in pre-tax profits to A$67.7m for 2004 and reaffirming its 2005 profit forecasts.\"It is expected that profits will be possible in future periods as the claims are finalised.\"Any profits would depend on the outcome of legal cases resulting from a change in steel contractor, it added."}