{"raw_text": "Boeing unveils new 777 aircraft\n \n US aircraft firm Boeing has unveiled its new long-distance 777 plane, as it tries to regain its position as the industry's leading manufacturer.\n \n The 777-200LR will be capable of flying almost 11,000 miles non-stop, linking cities such as London and Sydney. Boeing, in contrast to European rival Airbus, hopes airlines will want to fly smaller aircraft over longer distances. Airbus, which overtook Boeing as the number one civilian planemaker in 2003, is focusing on so-called super jumbos.\n \n Analysts are divided over which approach is best and say that this latest tussle between Boeing and Airbus may prove to be a defining moment for the airline industry. Boeing plans to offer twin-engine planes that are able to fly direct to many of the world's airports, getting rid of the need for connecting flights.\n \n It is banking on smaller, slimmer planes such as the 777-200LR and its much-anticipated 787 Dreamliner plane, which is set to take to the skies in 2008. The 777-200LR, which had its launch delayed by the 11 September attacks in the US, is the fifth variation of Boeing's twin-aisle 777 plane. The company offically \"rolled-out\" the new 777 in Seattle at 2200 GMT. Better fuel efficiency from engines made by GE and lighter materials mean that the plane can connect almost any two cities worldwide.\n \n \"Boeing has the latest variant in a very successful line of airplanes and there is no doubt it will continue to be very successful,\" said David Learmount, operations and safety editor at industry magazine Flight International. But the 777-200LR \"is a niche player\", Mr Learmount continued, adding that reach was not the only criteria airlines used when picking their aircraft. Mr Learmount pointed out that the 777-200LR has been on the market for a couple of years and only had limited success at attracting orders. He also said that while the plane may be able to fly to Sydney from London in one hit, prevailing winds meant that it would have to stop somewhere on the return journey.\n \n For Airbus, the future is big - it is pinning its hopes on planes that can carry as many as 840 people between large hub airports. From there, passengers would be ferried to their final destinations by smaller planes. Airbus is also keeping its options open and plans to compete in all the main categories of aircraft. It has been producing a rival to Boeing's 777 line for more than a year. \"Airbus is now where Boeing was a few years ago\" with its product range, said Flight International's Mr Learmount.\n \n Both Boeing and Airbus have been taking orders for their new planes. Boeing said it expected to sell about 500 of its 777-200LR planes over the next 20 years. It already has orders from Pakistan International Airlines and EVA of Taiwan. These orders should help underpin the company's profits. Boeing said earnings during the last three months of 2004 dropped by 84% because of costs relating to stopping production of its smallest airliner, the 717, and the cancellation of a US air force 767 tanker contract. Net profit was $186m (£98m; 143m euros) in the quarter, compared with $1.13bn in the same period in 2003.\n", "llama3.2:1b": "Boeing unveils new long-distance 777 aircraft, aiming to regain its position as industry leader. The plane will be capable of flying almost 11,000 miles non-stop and connect cities such as London and Sydney. Analysts are divided on which approach is best between Boeing's twin-engine planes and Airbus' super jumbos.", "llama3.2:3b": "Boeing unveiled its new 777-200LR long-distance plane capable of flying almost 11,000 miles non-stop to cities like London and Sydney. The plane has better fuel efficiency and lighter materials than its predecessors. Analysts are divided over whether Boeing's approach of smaller planes is better than Airbus' focus on super jumbos. Boeing expects to sell around 500 777-200LR planes over the next 20 years.", "gemma2:2b": "Boeing unveiled its new long-distance 777-200LR aircraft to regain dominance in the aviation industry.  This variant is designed for direct flights between many cities worldwide, offering greater efficiency and connecting capabilities.  While Boeing expects high sales, analysts are unsure about its impact as it focuses on a niche market and faces competition from Airbus' larger \"super jumbo\" planes. Airbus also aims for dominance with diverse aircraft options, while facing Boeing's resurgence. Both companies have received orders for their new models, with Boeing targeting 500 sales over the next two decades and Airbus aiming to conquer all segments of the aviation market.  \n", "qwen2.5:0.5b": "Boeing unveils its new 777 aircraft and aims to regain its position as the industry's leading manufacturer. The 777-200LR will be capable of flying almost 11,000 miles non-stop between cities such as London and Sydney. Airbus plans to offer twin-engine planes that are able to fly direct to many of the world's airports, getting rid of the need for connecting flights. Boeing has the latest variant in a very successful line of airplanes, with reach being not only its largest but also the most important criterion when picking an aircraft. Both Boeing and Airbus have been taking orders for their new planes, with Boeing expected to sell about 500 of its 777-200LR planes over the next 20 years and already having orders from Pakistan International Airlines and EVA of Taiwan.", "qwen2.5:1.5b": "Boeing unveils its new 777-200LR aircraft to challenge Airbus's superjumbo dominance, aiming for smaller, fuel-efficient planes like 777-200LR and Dreamliner that can connect any two cities worldwide. While analysts debate the best approach, Boeing sees opportunities in niche markets and improved efficiency, while Airbus focuses on large hub-to-hub systems with a broad product range. Both firms have taken orders for new planes, with Boeing planning to sell 500 of its 777-200LRs over 20 years.", "qwen2.5:3b": "US aircraft firm Boeing has unveiled its new long-distance 777-200LR plane capable of flying nearly 11,000 miles non-stop, linking cities such as London and Sydney. Boeing aims to attract airlines with smaller planes for longer distances, unlike European rival Airbus which focuses on super jumbo planes. Analysts debate if Boeing’s strategy will lead to industry dominance, noting the 777-200LR is a niche player that has had limited success attracting orders despite its advanced features like better fuel efficiency and lighter materials. Boeing expects to sell about 500 of its 777-200LR planes over the next two decades, with recent orders from Pakistan International Airlines and EVA Air of Taiwan helping bolster profits. Airbus focuses on larger planes for hub airports and is expanding into various aircraft categories, indicating a potential shift in market dominance similar to Boeing's position a few years ago.", "opencoder:1.5b": "Boeing unveils new 777 aircraft\n\nUS aircraft firm Boeing has unveiled its new long-distance 777 plane as it tries to regain its position as the industry's leading manufacturer.\n\nThe 777-200LR will be capable of flying almost 11,000 miles non-stop, linking cities such as London and Sydney. Boeing, in contrast to European rival Airbus, hopes airlines will want to fly smaller aircraft over longer distances.\n\nAnalysts are divided over which approach is best and say that this latest tussle between Boeing and Airbus may prove to be a defining moment for the airline industry.\n\nBoeing plans to offer twin-engine planes that are able to fly direct to many of the world's airports, getting rid of the need for connecting flights.\n\nThe 777-200LR has been on the market for a couple of years and only had limited success at attracting orders. It is banking on smaller, slimmer planes such as the 777-200LR and its much-anticipated 787 Dreamliner plane, which is set to take to the skies in 2008.\n\nBetter fuel efficiency from engines made by GE and lighter materials mean that the plane can connect almost any two cities worldwide. \"Boeing has the latest variant in a very successful line of airplanes and there is no doubt it will continue to be very successful,\" said David Learmount, operations and safety editor at industry magazine Flight International.\n\nMr Learmount pointed out that the 777-200LR \"is a niche player\", Mr Learmount continued, adding that reach was not the only criteria airlines used when picking their aircraft. Mr Learmount also noted that the plane had been on the market for a couple of years and only had limited success at attracting orders.\n\nFor Airbus, the future is big - it is pinning its hopes on planes that can carry as many as 840 people between large hub airports. From there, passengers would be ferried to their final destinations by smaller planes. Airbus is also keeping its options open and plans to compete in all the main categories of aircraft. It has been producing a rival to Boeing's 777 line for more than a year. \"Airbus is now where Boeing was a few years ago\" with its product range, said Flight International's Mr Learmount.\n", "smollm:1.7b": "The summary is concise and to the point, capturing the main ideas and key points of the text. It includes:\n\n1. The new Boeing 777-200LR aircraft, which is capable of flying almost 11,000 miles non-stop.\n2. Boeing's focus on smaller, slimmer planes such as the 777-200LR and its much-anticipated 787 Dreamliner plane.\n3. The company's banking on better fuel efficiency from engines made by GE and lighter materials to make the plane more suitable for longer routes.\n4. Boeing's success in selling its 777-200LR aircraft, with a market share of around 15%.\n5. Airbus' plans to compete in all the main categories of aircraft, including the 777-200LR.\n6. Airbus' product range, which is already available for sale and has orders from Pakistan International Airlines and EVA of Taiwan.\n7. Boeing's net profit during the last three months of 2004, which was $186m (£98m; 143m euros).\n\nThe summary captures the main ideas and key points of the text, providing a concise overview of the topic.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Boeing and Airbus's new planes. Let me read through it carefully.\n\nThe main points are: Boeing has launched a new 777-200LR plane which can fly up to 11,000 miles, connecting London and Sydney. It's faster than European airlines like Airbus, who have the 787 Dreamliner. Analysts say this is a big deal for the industry.\n\nBoeing is focusing on smaller planes with twin engines, aiming to connect anywhere in the world quickly. They also mentioned GE engines are better and lighter materials. Orders from Pakistan and EVA Taiwan showed they're taking demand.\n\nAirbus is competing too but with their 787 Dreamliner, which can carry more passengers. Their product line hasn't changed much since last year. They're working on costs as well, cutting production of the smallest planes.\n\nThe text covers both companies' approaches, highlighting Boeing's direct routes and Airbus's larger capacity. I should keep it concise, focusing on key ideas like the aircraft's capabilities, the approach each company is taking, and the industry implications.\n</think>\n\nBoeing has introduced its 777-200LR, a fuel-efficient twin-engine plane capable of flying over 11,000 miles between major cities. This competitor to European rival Airbus' 787 Dreamliner aims to connect anywhere quickly with improved fuel efficiency and lower weights. Analysts say the competition marks a pivotal moment for the airline industry.\n\n**Key Points:**\n- **Boeing's New Plane:** 777-200LR can fly up to 11,000 miles, linking London and Sydney. It reduces connecting flights.\n- **Directional Focus:** Boeing aims direct routes, focusing on fuel efficiency with GE engines and lighter materials.\n- **Order Numbers:** Orders from Pakistan and EVA Taiwan are in, contributing to profits.\n- **Airbus' Move:** Competes with their 787 Dreamliner for larger passenger capacities, though they're still focused on twin-engine planes.\n- **Cost Efficiency:** Busier by two seats per plane, aiming to reduce costs.\n- **Industry Implications:** Competition could define the future of commercial aviation.", "tinyllama:1.1b": "Boeing unveils new long-distance 777 aircraft and plans to offer twin-engine planes that are able to fly direct to many of the world's airports, getting rid of the need for connecting flight. Analysts believe this latest development in the airline industry may prove defining and say that Airbus's approach of offering smaller, more slimplanes such as the 777-200LR is a \"niche player\". The aircraft has been on the market for several years but has seen limited success at attracting orders. For Airbus, its future lies in big planes that can carry up to 840 people between large hub airports while Airbus also competes in all main categories of aircraft. Boeing expects to sell about 500 of its new 777-200LR plane over the next 20 years, while orders from South Korean carrier EVA and Taiwan's EVA have already been placed. Boeing is taking orders for planes that should help underpin its profitability.", "tinydolphin:1.1b": " The Boeing 777-200LR, a long-distance, twin-engine aircraft, has been unveiled by the company, with its new design aiming to compete with Airbus's Dreamliners and other large, fuel-efficient airplanes. Boeing claims that this new aircraft is capable of flying over 11,000 miles non-stop between two cities. This innovative feature allows for greater efficiency and improved passenger comfort compared to previous models.\n\nThe 777-200LR's designers have been working to reduce fuel consumption and improve overall emissions while still maintaining its spacious cabin, range, and seating capacity. Boeing has also introduced a new type of engine, designed by General Electric (GE), which will provide improved fuel efficiency compared to previous models. The plane is being produced in Seattle at the company's main facility and is set to enter service by late 2008.\n\nThe introduction of the 777-200LR also marks a turning point for Boeing, as it moves away from its focus on short-haul routes and towards longer flights with more passengers. This shift in strategy has been driven by increasing competition in the airline industry, as well as changing market conditions and the need to stay ahead of Airbus's advances in the development of larger, fuel-efficient planes.\n\nDespite these challenges, Boeing remains confident that its new aircraft will succeed and continue to be a major player in the world of commercial aviation. With over 200 orders for the 777-200LR, it is expected to sell about 500 units during the next two decades, helping to underpin its profits. As Boeing continues to innovate and adapt, it is clear that the company remains a force to be reckoned with in the airline industry.", "phi:2.7b": " Boeing has introduced its latest 777 aircraft, the 777-200LR, capable of flying 11,000 miles non-stop. The plane aims to connect smaller cities and eliminate the need for connecting flights. It is part of Boeing's strategy to offer more efficient twin-engine planes. Airbus is also entering this market with their larger super jumbos. Analysts are divided on which approach is better but the latest tussle between Boeing and Airbus could be a defining moment for the airline industry.\n", "orca-mini:3b": " Boeing has unveiled a new long-distance aircraft, the 777-200LR, which can fly almost 11,000 miles non-stop and is capable of connecting cities such as London and Sydney. The company hopes airlines will want to fly smaller planes over longer distances, aiming to regain its position as the industry's leading manufacturer. Boeing faces competition from European rival Airbus, which is focusing on super jumbos, but analysts are divided over which approach is best. The 777-200LR has been delayed by the 11 September attacks and is only available in a niche market. Boeing has been successful with previous versions of the twin-aisle 777 plane, but its success may depend on whether smaller planes are more popular with airlines.", "hermes3:3b": "Boeing unveils long-range 777-200LR plane to compete with Airbus super-jumbos for airline orders. The 11,000 mile range plane aims to reduce need for connecting flights and attract orders over smaller planes.", "stablelm-zephyr:3b": "Aircraft manufacturer Boeing has unveiled its new 777-200LR plane, designed for long-distance flights, as it seeks to regain its position as the industry's leading manufacturer. With the capability to fly almost 11,000 miles non-stop, connecting cities like London and Sydney, Boeing hopes smaller aircraft over longer distances will be desired by airlines. The company is banking on planes such as the 777-200LR and the 787 Dreamliner, which is set to launch in 2008. Analysts are divided over whether Boeing's or Airbus' approach is better for the airline industry, with both companies taking orders for their new planes.", "stablelm2:1.6b": "US aircraft firm Boeing has revealed its new long-distance plane capable of flying over 5,0..\nContrary to European rival Airbus, Boeing hopes airlines will prefer smaller planes for longer distances.\nBoeing aims to offer twin-engine planes that can fly directly to many airports worldwide with the launch of slimmer planes like the 2020-launching 7e5 variant.\nAirbus is focusing on super jumbos as it overtook Boeing as the top civilian planemaker earlier this year, while analysts are divided over which approach works best between Boeing and Airbus.", "granite3.1-dense:2b": "Boeing introduced its latest long-range aircraft, the 777-200LR, as part of its strategy to reestablish itself as the leading commercial plane manufacturer. This plane can travel approximately 11,000 miles nonstop, connecting major cities like London and Sydney without requiring connecting flights. Boeing aims to promote smaller, more fuel-efficient planes over longer distances, in contrast to Airbus's focus on super jumbos.\n\nAnalysts are divided on the best approach, with this competition potentially marking a pivotal moment for the airline industry. Boeing plans to market twin-engine 777 models that can directly access numerous global airports, eliminating the need for connections. The 777-200LR is the fifth version of its successful twin-aisle 777 series and features more efficient engines and lighter materials. Despite delayed launch due to 9/11, Boeing expects to sell about 500 units over the next two decades, with orders already secured from Pakistan International Airlines and EVA of Taiwan.\n\nAirbus, meanwhile, emphasizes its diverse product lineup, including planes capable of carrying up to 840 passengers between large hub airports. The company believes it is now comparable to Boeing in terms of aircraft diversity. Airbus anticipates capturing market share through various categories and has been manufacturing a rival to Boeing's 777 line for over a year.\n\nBoth companies have received orders, with Boeing's earnings slightly down due to production stoppage and contract cancellation in 2004. Airbus continues its aggressive expansion, positioning itself as a formidable competitor in the global aviation market.", "chatgpt-4o-latest": "Boeing has unveiled its new long-distance 777-200LR aircraft, capable of flying nearly 11,000 miles non-stop, as part of its strategy to regain industry leadership from Airbus. Unlike Airbus, which focuses on large-capacity super jumbos, Boeing is betting on smaller, fuel-efficient planes that can fly directly between cities. The 777-200LR, the latest variant of the 777 series, features improved fuel efficiency and lighter materials, allowing it to connect almost any two cities. However, analysts note that its market success has been limited, and factors like prevailing winds may affect its non-stop capabilities. Airbus, meanwhile, continues to develop large aircraft for hub-based travel while also competing in other market segments. Boeing expects to sell around 500 of the 777-200LR over 20 years, with initial orders from Pakistan International Airlines and EVA Air. The company’s profits have been impacted by production halts and contract cancellations, with earnings dropping 84% in late 2004.", "reference": "Both Boeing and Airbus have been taking orders for their new planes.Boeing said it expected to sell about 500 of its 777-200LR planes over the next 20 years.\"Airbus is now where Boeing was a few years ago\" with its product range, said Flight International's Mr Learmount.US aircraft firm Boeing has unveiled its new long-distance 777 plane, as it tries to regain its position as the industry's leading manufacturer.Boeing, in contrast to European rival Airbus, hopes airlines will want to fly smaller aircraft over longer distances.It is banking on smaller, slimmer planes such as the 777-200LR and its much-anticipated 787 Dreamliner plane, which is set to take to the skies in 2008.\"Boeing has the latest variant in a very successful line of airplanes and there is no doubt it will continue to be very successful,\" said David Learmount, operations and safety editor at industry magazine Flight International.Boeing plans to offer twin-engine planes that are able to fly direct to many of the world's airports, getting rid of the need for connecting flights.He also said that while the plane may be able to fly to Sydney from London in one hit, prevailing winds meant that it would have to stop somewhere on the return journey.Analysts are divided over which approach is best and say that this latest tussle between Boeing and Airbus may prove to be a defining moment for the airline industry."}