{"raw_text": "Worldcom boss 'left books alone'\n \n Former Worldcom boss Bernie Ebbers, who is accused of overseeing an $11bn (£5.8bn) fraud, never made accounting decisions, a witness has told jurors.\n \n David Myers made the comments under questioning by defence lawyers who have been arguing that Mr Ebbers was not responsible for Worldcom's problems. The phone company collapsed in 2002 and prosecutors claim that losses were hidden to protect the firm's shares. Mr Myers has already pleaded guilty to fraud and is assisting prosecutors.\n \n On Monday, defence lawyer Reid Weingarten tried to distance his client from the allegations. During cross examination, he asked Mr Myers if he ever knew Mr Ebbers \"make an accounting decision?\". \"Not that I am aware of,\" Mr Myers replied. \"Did you ever know Mr Ebbers to make an accounting entry into Worldcom books?\" Mr Weingarten pressed. \"No,\" replied the witness. Mr Myers has admitted that he ordered false accounting entries at the request of former Worldcom chief financial officer Scott Sullivan. Defence lawyers have been trying to paint Mr Sullivan, who has admitted fraud and will testify later in the trial, as the mastermind behind Worldcom's accounting house of cards.\n \n Mr Ebbers' team, meanwhile, are looking to portray him as an affable boss, who by his own admission is more PE graduate than economist. Whatever his abilities, Mr Ebbers transformed Worldcom from a relative unknown into a $160bn telecoms giant and investor darling of the late 1990s. Worldcom's problems mounted, however, as competition increased and the telecoms boom petered out. When the firm finally collapsed, shareholders lost about $180bn and 20,000 workers lost their jobs. Mr Ebbers' trial is expected to last two months and if found guilty the former CEO faces a substantial jail sentence. He has firmly declared his innocence.\n", "llama3.2:1b": "Worldcom's former boss Bernie Ebbers did not oversee accounting decisions at the company due to prosecution claims, despite being accused of overseeing $11bn in losses that were hidden to protect shares. David Myers, who pleaded guilty to fraud and is assisting prosecutors, questioned whether Ebbers made accounting decisions or had knowledge of them. Ebbers' trial will last two months with a potential substantial jail sentence if found guilty.", "llama3.2:3b": "Former Worldcom boss Bernie Ebbers was never responsible for accounting decisions according to witness David Myers, who pleaded guilty to fraud and is assisting prosecutors in testimony that paints Scott Sullivan as the mastermind behind the company's accounting issues.", "gemma2:2b": "Bernie Ebbers, accused of overseeing an $11 billion fraud at Worldcom, never made accounting decisions according to a witness. David Myers, who pleaded guilty to fraud and is assisting prosecutors, testified that he never saw Ebbers make an accounting decision or enter false information into the company's books. Myers admitted to ordering false entries at Scott Sullivan's request, who will testify in the trial.  Ebbers' defense team is attempting to portray him as a non-accounting professional who transformed Worldcom into a giant but failed to adapt when the telecom boom ended. If convicted, Ebbers faces a potential lengthy jail sentence. \n", "qwen2.5:0.5b": "Worldcom boss Bernie Ebbers' team's views on him: They believe he made accounting entries in Worldcom's books, but did not actually do so or become aware of them. Mr. Ebbers is accused of overseeing Worldcom's $11 billion financial fraud and now faces a trial where he will be asked about his alleged role in the company's problems.", "qwen2.5:1.5b": "Bernie Ebbers never made accounting decisions at Worldcom; defense lawyers claim he was not responsible for losses hidden by Scott Sullivan, who they say masterminded the company's collapse in 2002.", "qwen2.5:3b": "Former Worldcom boss Bernie Ebwers was not involved in making accounting decisions, according to witness David Myers who pleaded guilty to fraud. Defence lawyers argue Mr. Ebbers should not be held responsible for Worldcom's financial problems. Myers stated he never knew Ebwers to make an accounting entry or decision into the company’s books. Prosecutors claim losses were hidden to protect shares and that Sullivan, former CFO, was behind the accounting irregularities. The defense aims to portray Ebwers as a competent business leader who oversaw Worldcom's growth but not responsible for its collapse due to fraudulent practices. Ebwers maintains his innocence and is expected to face a lengthy trial.", "opencoder:1.5b": "The Worldcom boss, 'left books alone', is an anonymous individual who is accused of overseeing an $11bn (£5.8bn) fraud. The former Worldcom boss, Bernie Ebbers, made accounting decisions, and the witness gives evidence that Mr Ebbers was not responsible for Worldcom's problems. David Myers made inquiries by defence lawyers about Mr Ebbers' actions. The phone company collapsed in 2002 and the firm's losses were hidden to protect the firm's shares. On Monday, Reid Weingarten tried to dissuade Mr Myers from his accusations. During cross examination, he asked if Mr Myers ever knew Mr Ebbers making an accounting decision. He replied that he did not know. \"Did you ever know Mr Ebbers to make an accounting entry into Worldcom books?\" Weingarten responded. \"No,\" Mr Myers replied. In response, Mr Myers has admitted that he ordered false accounting entries at the request of former Worldcom chief financial officer Scott Sullivan. The defense lawyer attempts to paint Mr Sullivan as a fraudster and will testify later in the trial. Mr Ebbers' team are looking for a new boss who is more professional and entrepreneurial than their peers.\n", "smollm:1.7b": "Summarize the text concisely by highlighting key ideas and details:\n\n1. Bernie Ebbers, former Worldcom boss, never made accounting decisions.\n2. David Myers made the comments under questioning by defense lawyers who have been arguing that Mr Ebbers was not responsible for Worldcom's problems.\n3. On Monday, defense lawyer Reid Weingarten tried to distance his client from the allegations.\n4. During cross examination, he asked Mr Myers if he ever knew Mr Ebbers \"make an accounting decision\"?\n5. Mr Ebbers' team, meanwhile, are looking to portray him as an affable boss, who by his own admission is more PE graduate than economist.\n6. Whatever his abilities, Mr Ebbers transformed Worldcom from a relative unknown into a $160bn telecoms giant and investor darling of the late 1990s.\n7. When the firm finally collapsed, shareholders lost about $180bn and 20,000 workers lost their jobs.\n8. Mr Ebbers' trial is expected to last two months and if found guilty the former CEO faces a substantial jail sentence. He has firmly declared his innocence.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text about Bernie Ebbers, the Worldcom boss. Let me read through it carefully.\n\nOkay, first paragraph: \"Worldcom boss 'left books alone'.\" That's interesting. So, they called him a \"left books alone,\" which probably means they thought he was going after financial fraud. Then there's some witness saying he never made accounting decisions and that he ordered false accounting by Scott Sullivan, who has admitted to fraud.\n\nNext, defense lawyers are trying to paint him as an affable boss, but they might be wrong because he was actually the one doing the accounting stuff. They're looking for someone else to blame for Worldcom's collapse because of competition too much and the boom petering out. \n\nFinally, Ebbers' trial is expected to take two months, and if he's found guilty, he'll face a big jail sentence. He hasn't committed anything himself, so they think him innocent.\n\nI need to make sure I capture the main points: his supposed innocence, the fraud accusations, false accounting by someone else, the company's collapse due to competition, and the trial plan.\n</think>\n\nWorldcom boss Bernie Ebbers was accused of overseeing $11 billion in fraud. A witness confirmed he never made accounting decisions and ordered false accounting by Scott Sullivan, who admitted fraud. Defense lawyers tried to portray him as an affable figure but found him more likely to blame others for Worldcom's collapse from a telecoms perspective. Ebbers' trial is set to last two months with a potential $180 billion loss if guilty, though he claims innocence.", "tinyllama:1.1b": "The key details in this excerpt from an article about the Worldcom Bossiess, who is accused of overseeing a $11bn fraud, include statements made by former CEO Bernie Ebbers, who denies any responsibility for the company's problems. Ebbers was accused of hiding losses to protect the firm's shares during his tenure as executive vice-president and treasurer. During cross-examination by defense lawyer Reid Weinberg, Ebberts responded that he had no knowledge of Ebber's \"make an accounting decision\" at the behest of former CFO Scott Sulliblanco. The defense is portraying Ebber as a more PE graduate than economist and attempting to paint him as the mastermind behind Worldcom's accounting house of cards. Ebber's trial, which will likely last two months, faces a substantial jail sentence if found guilty.", "tinydolphin:1.1b": " The text provided describes the accounting practices at Worldcom Corporation led by Bernie Ebbers. It mentions that Ebbers, the former boss, did not make any significant decisions about the company's financial statements. His team is presenting this information to convince the jury that he was not responsible for the collapse of Worldcom.", "phi:2.7b": " Worldcom's former boss, Bernie Ebbers, is accused of overseeing an $11 billion fraud and hiding losses from shareholders. However, he never made any accounting decisions, according to a witness who pleaded guilty to fraud and assisted prosecutors. Defense lawyers have been trying to paint the former CEO as affable but will focus on his former CFO's alleged role in the scandal during the trial that is expected to last two months.\n", "orca-mini:3b": " The former Worldcom boss Bernie Ebbers never made accounting decisions, according to a witness who has pleaded guilty to fraud and is assisting prosecutors. David Myers said under questioning by defence lawyers that he did not know if Mr Ebbers made accounting decisions. The phone company collapsed in 2002 due to losses that were hidden to protect the firm's shares.", "hermes3:3b": "Worldcom ex-CEO Ebbers not known to make accounting decisions. Defense tries to portray him as affable boss who transformed company.", "stablelm-zephyr:3b": "Bernie Ebbers, former Worldcom boss, is accused of overseeing an $11bn fraud but a witness testified that he never made accounting decisions. David Myers' testimony was used by defense lawyers to argue that Ebbers wasn't responsible for the company's collapse. Myers admitted to ordering false accounting entries at the request of former CFO Scott Sullivan. Ebbers' team is attempting to portray him as an affable boss, transforming Worldcom into a $160bn telecoms giant before its collapse in 2002 which resulted in significant shareholder losses and job losses.", "chatgpt-4o-latest": "Former Worldcom boss Bernie Ebbers, accused of overseeing an $11bn fraud, never made accounting decisions, according to witness David Myers. Myers, who has pleaded guilty to fraud, testified that he ordered false accounting entries at the request of former CFO Scott Sullivan, whom the defense is portraying as the mastermind. Ebbers' lawyers argue he was unaware of fraudulent activities, emphasizing his background as a businessman rather than an economist. Worldcom collapsed in 2002, costing shareholders $180bn and 20,000 jobs. If convicted, Ebbers faces a lengthy prison sentence but maintains his innocence.", "stablelm2:1.6b": "Former Worldcom boss Bernie Ebbers never made accounting decisions, according to witness David Myers. Defence lawyers argue that Ebbers was not responsible for the company's problems as losses were hidden to protect its shares. Former CFO Scott Sullivan admitted fraud and will testify later in the trial. The case is expected to last two months, with potential jail time if found guilty.", "granite3.1-dense:2b": "Former Worldcom CEO Bernie Ebbers, accused of orchestrating an $11bn fraud that led to the company's collapse in 2002, did not personally make accounting decisions, according to a witness who has pleaded guilty to fraud and is assisting prosecutors. Witness David Myers testified that he never saw Ebbers make accounting entries or decisions for Worldcom. The defense aims to portray Ebbers as an affable executive rather than the alleged mastermind, while emphasizing former CFO Scott Sullivan's role in the fraudulent activities. If convicted, Ebbers faces significant jail time; he has maintained his innocence throughout the trial.", "reference": "During cross examination, he asked Mr Myers if he ever knew Mr Ebbers \"make an accounting decision?\".\"Not that I am aware of,\" Mr Myers replied.\"Did you ever know Mr Ebbers to make an accounting entry into Worldcom books?\"Mr Myers has admitted that he ordered false accounting entries at the request of former Worldcom chief financial officer Scott Sullivan.David Myers made the comments under questioning by defence lawyers who have been arguing that Mr Ebbers was not responsible for Worldcom's problems.Defence lawyers have been trying to paint Mr Sullivan, who has admitted fraud and will testify later in the trial, as the mastermind behind Worldcom's accounting house of cards.Mr Myers has already pleaded guilty to fraud and is assisting prosecutors.Former Worldcom boss Bernie Ebbers, who is accused of overseeing an $11bn (£5.8bn) fraud, never made accounting decisions, a witness has told jurors."}