{"raw_text": "Iranian MPs threaten mobile deal\n \n Turkey's biggest private mobile firm could bail out of a $3bn ($1.6bn) deal to build a network in Iran after MPs there slashed its stake in the project.\n \n Conservatives in parliament say Turkcell's stake in Irancell, the new network, should be cut from 70% to 49%. They have already given themselves a veto over all foreign investment deals, following allegations about Turkish firms' involvement in Israel. Turkcell now says it may give up on the deal altogether.\n \n Iran currently has only one heavily congested mobile network, with long waiting lists for new subscribers. Turkcell signed a contract for the new network in September. The new operator planned to offer subscriptions for about $180, well below the existing firm's $500 price tag. But a parliamentary commission has now ruled that Turkcell's 70% controlling stake is too high. They say that Turkcell is a security risk because of alleged business ties with Israel. Parliament as a whole - dominated by religious conservatives - will vote on the ruling on Tuesday.\n \n Turkcell said the ruling would \"make more difficult... Turkcell's financial consolidation of Irancell\" because its stake would be reduced to less than 50%. \"If management control and financial consolidation of Irancell cannot be achieved... the realisation of the project will become risky,\" it warned in a statement. The firm has refused to comment on whether it has business dealings in Israel, although like almost all GSM operators worldwide it has an interconnection deal with Israeli networks so that its customers can use their phones there. The two countries strengthened ties in both defence and economic issues in 2004. Israeli industry minister Ehud Olmert was reported in June to have attended a meeting between Ruhi Dogusoy, Turkcell's chief operating officer, and executives from Israeli telecoms firms. Telecoms is one of two areas specifically targeted by the new veto law on foreign investments, passed earlier in September. The other is airports, a source of controversy after the army closed Tehran's new Imam Khomeini International Airport on its opening day in May 2004. Again, the allegation was that the part-Turkish TAV consortium which built and ran it had links with Israel.\n", "llama3.2:1b": "Iranian MPs have threatened to cut Turkey's stake in a $3bn deal to build an Iranian mobile network after parliament approved a ruling on foreign investment deals, citing alleged business ties with Israel as a security risk.", "llama3.2:3b": "Iranian MPs are threatening to slash Turkcell's stake in a $3bn mobile deal from 70% to 49%, potentially forcing the Turkish firm to bail out of the project due to allegations of business ties with Israel, sparking concerns over security risks and foreign investment vetoes.", "gemma2:2b": "Iranian MPs are threatening to block a $3 billion mobile network deal by cutting Turkcell's stake from 70% to 49%. The move is driven by allegations of Turkish business ties with Israel, leading to political control over foreign investment deals in the country.  Turkcell may withdraw from the project if the ruling stands. \n", "qwen2.5:0.5b": "Iranian MPs are threatening to force Turkcell, the largest private mobile firm, out of an $3bn deal to build a new network in Iran. The company's stake in Irancell, the existing network, has already been slashed by 70% and is now under scrutiny from parliament. The company claims that its stake is too high due to allegations of business ties with Israel. Turkcell, however, denies any such ties, saying the ruling could make it more difficult for the firm to realise the project.", "qwen2.5:1.5b": "Iranian MPs threaten to cut Turkish firm Turkcell's stake from 70% to 49%, leaving management control riskier, prompting potential project abandonment or withdrawal of investment due to security concerns linked to alleged business ties between Turkcell and Israeli firms.", "qwen2.5:3b": "Iranian MPs have reduced Turkcell's stake in Irancell, a proposed mobile network to be built in Iran, from 70% to 49%. This decision has led Turkcell to consider abandoning the deal due to concerns about its security risk linked to alleged business ties with Israel. The move complicates Turkcell's financial consolidation of Irancell and increases the risk of project failure. Parliament, dominated by religious conservatives, is set to vote on this ruling on Tuesday.", "opencoder:1.5b": "Iranian MP's threaten mobile deal\n\nTurkey's biggest private mobile firm could bail out of a $3bn ($1.6bn) deal to build a network in Iran after MPs there slashed its stake in the project.\n\nConservatives in parliament say Turkcell's stake in Irancell, the new network, should be cut from 70% to 49%. They have already given themselves a veto over all foreign investment deals, following accusations about Turkish firms' involvement in Israel. Turkcell now says it may give up on the deal altogether.\n\nIran currently has only one heavily congested mobile network, with long waiting lists for new subscribers. Turkcell signed a contract for the new network in September. The new operator planned to offer subscriptions for about $180, well below the existing firm's $500 price tag. But a parliamentary commission ruled that Turkcell's 70% controlling stake is too high. They say that Turkcell is a security risk because of alleged business ties with Israel.\n\nParliament as a whole - dominated by religious conservatives - will vote on the ruling on Tuesday.\n\nTurkcell said the ruling would \"make more difficult... Turkcell's financial consolidation of Irancell\" because its stake would be reduced to less than 50%. \"If management control and financial consolidation of Irancell cannot be achieved... the realisation of the project will become risky,\" it warned in a statement. The firm has refused to comment on whether it has business dealings in Israel, although like almost all GSM operators worldwide it has an interconnection deal with Israeli networks so that its customers can use their phones there. The two countries strengthened ties in both defence and economic issues in 2004.\n", "smollm:1.7b": "Iranian MPs threaten mobile deal", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this news article about Iran and Turkey's mobile network deal. Let me read through it carefully.\n\nFirst, I see that Iranian MPs are threatening a mobile deal. They've slashed their stake in the project, which is supposed to build a new network in Iran. The deal was worth $3 billion in 2017, but now they're reducing it to $1.6 billion.\n\nNext, the Turkey's largest private mobile firm, Turkcell, has already given themselves a veto over foreign investment deals after they were involved with Israel. Now they say they'll give up on this deal entirely because their stake is too high—70% instead of 49%.\n\nTurkcell's main competitor, Irancell, signed the contract in September for $180 instead of the original $500 price tag. But there was a parliamentary commission that ruled their controlling stake is too high. They warned that Turkcell is a security risk because of business ties with Israel.\n\nThe government is dominated by religious conservatives and will vote on this deal tomorrow. They're worried about how the reduction in stake would affect the project's financial consolidation, making it more risky.\n\nTurkcell didn't comment on whether they have any business links with Israel yet. However, their deal has some cross-border connections since 2004, which helped Irancell. There were also reports about ties with Israeli telecom firms for Irancell and TAV. This controversy happened after the army closed Tehran's airport.\n\nOverall, the summary needs to capture the key points: MPs threatening the deal, reduction in stake, risk of reducing it too much, financial issues, government decision deadline, concerns about security risks, business connections from 2004.\n</think>\n\nThe Iranian government has announced that its largest private mobile firm, Turkcell, is threatening a $3 billion deal for building a new network in Iran. The government has slashed its stake in the project, reducing it to 70% instead of 49%. Meanwhile, Turkey's public carrier, Irancell, signed the contract for $180 million, which was previously set at $500 million. The parliamentary committee ruled that Turkcell's controlling stake is too high due to potential business risks with Israel. The government will vote on this decision tomorrow, following concerns about financial consolidation and security risks. Despite ongoing cross-border connections from 2004, there were reports of ties with Israeli telecom firms.", "tinyllama:1.1b": "The Iranian MPs have threatened to cut Turkcell's stake in a new mobile network deal worth $3bn (£1.6bn) in Iran, citing alleged security risks due to alleged business ties with Israel. The MPs say that the Turkish private mobile firm needs to sell its 70% holding, which is too high given current prices for subscriptions. Turkcell has warned that the proposed change in control could make it difficult for it to consolidate Irancell and risk being seen as risky due to business ties with Israel. The ruiling was passed by a parliamentary committee earlier this month, but will now be voted on by the whole chamber on December 12th.", "tinydolphin:1.1b": " Iranian MPs threaten to derail a $3 billion deal between Turkcell, one of Turkey's largest mobile phone companies, and Irancell, the country's largest network, unless they lower the stake of their control in the project. According to the conservatives in parliament, the new network should have a 49% stake in Turkish firms' involvement in Israel. The issue has raised concerns over the security risk posed by Turkish-Israeli business ties and prompted Parliament to vote on whether to reduce Turkcell's control or postpone the deal altogether. If Turkcell can't secure management control and financial consolidation of Irancell, it would be difficult to achieve the realization of the project. This could impact Turkcell's profitability, as customers may not use their phones on the network if their data is transferred through an interconnection with Israeli networks.", "phi:2.7b": " Iranian MPs are threatening to cut Turkcell's stake in a mobile network deal worth $3bn. The deal is being affected by allegations of ties between Turkish companies and Israel. Iran currently has only one heavily congested mobile network, and the new operator planned to offer subscriptions for about $180, well below the existing firm'$500 price tag. However, a parliamentary commission has ruled that Turkcell's controlling stake should be reduced to less than 50%. The ruling would make it more difficult to complete the project, and could potentially make it risky. Turkcell is a security risk because of alleged business ties with Israel, and may abandon the deal altogether.\n", "orca-mini:3b": " Iranian MPs have threatened to cancel a $3 billion deal between Turkcell, Turkey's biggest private mobile firm, and Iran's new mobile network because the company's stake in the project was too high. The move comes after allegations of ties between Turkish firms and Israel.", "hermes3:3b": "Iranian MPs reduce Turkcell's stake in $3b mobile deal in Iran, threatening to abandon project due to reduced control and financial risks.", "stablelm-zephyr:3b": "Turkey's conservative Iranian MPs have cut Turkcell's stake in Irancell, Iran's new mobile network, from 70% to 49%. This deal was initially made for $3bn to build the network, but now may be abandoned altogether. The parliament has accused Turkcell of being a security risk due to alleged business ties with Israel; however, Turkcell has refused to comment on this claim. The reduced stake and potential cancellation of the project make it more difficult for Turkcell to consolidate its financial control over Irancell and raise concerns about the project's feasibility.", "chatgpt-4o-latest": "Turkish mobile firm Turkcell may withdraw from a $3 billion deal to build a network in Iran after Iranian MPs reduced its stake in the project from 70% to 49%. Conservative lawmakers, citing alleged business ties with Israel, argue that Turkcell poses a security risk. Iran currently has only one congested mobile network, and Turkcell's planned service would have significantly lowered subscription costs. However, a parliamentary commission's ruling threatens Turkcell's financial control over the project, making it risky. The Iranian parliament, dominated by religious conservatives, will vote on the decision. The controversy is part of broader restrictions on foreign investments, particularly in telecoms and airports, due to concerns over Israeli connections.", "stablelm2:1.6b": "Iranian MPs threaten Turkcell's mobile deal: After conservative lawmakers cut Turkcell's stake from 25% to 20% in Iran's new network project, Turkey's largest private mobile firm may abandon the $3bn ($1.6bn) deal. The parliament also considers Turkish firms' alleged business ties with Israel as a security risk, and it will vote on the ruling on Tuesday.", "granite3.1-dense:2b": "Iranian MPs threaten Turkey's largest private mobile firm, Turkcell, to abandon a $3bn deal to construct a new network in Iran by reducing its stake from 70% to 49%. Conservative MPs allege Turkcell has ties with Israel, deeming it a security risk. This decision follows similar vetoes on foreign investments, including those in airports, due to purported connections between Turkish and Israeli entities. Turkcell had planned to offer competitive plans for the new network, priced at $180, compared to Iran's existing firm's $500 price. The parliamentary commission's ruling complicates Turkcell's financial integration with Irancell, potentially jeopardizing the project. Turkcell has not confirmed or denied any business ties with Israel but acknowledges an interconnection agreement for customers' global roaming. This development coincides with broader concerns over alleged Israeli involvement in Iran's defense and economic sectors, such as the Imam Khomeini International Airport project.", "reference": "Conservatives in parliament say Turkcell's stake in Irancell, the new network, should be cut from 70% to 49%.Turkcell signed a contract for the new network in September.Iran currently has only one heavily congested mobile network, with long waiting lists for new subscribers.They say that Turkcell is a security risk because of alleged business ties with Israel.Turkcell said the ruling would \"make more difficult... Turkcell's financial consolidation of Irancell\" because its stake would be reduced to less than 50%.The firm has refused to comment on whether it has business dealings in Israel, although like almost all GSM operators worldwide it has an interconnection deal with Israeli networks so that its customers can use their phones there.Turkcell now says it may give up on the deal altogether.Telecoms is one of two areas specifically targeted by the new veto law on foreign investments, passed earlier in September."}