{"raw_text": "Profits slide at India's Dr Reddy\n \n Profits at Indian drugmaker Dr Reddy's fell 93% as research costs rose and sales flagged.\n \n The firm said its profits were 40m rupees ($915,000; £486,000) for the three months to December on sales which fell 8% to 4.7bn rupees. Dr Reddy's has built its reputation on producing generic versions of big-name pharmaceutical products. But competition has intensified and the firm and the company is short on new product launches. The most recent was the annoucement in December 2000 that it had won exclusive marketing rights for a generic version of the famous anti-depressant Prozac from its maker, Eli Lilly. It also lost a key court case in March 2004, banning it from selling a version of Pfizer's popular hypertension drug Norvasc in the US. Research and development of new drugs is continuing apace, with R&D spending rising 37% to 705m rupees - a key cause of the decrease in profits alongside the fall in sales. Patents on a number of well-known products are due to run out in the near future, representing an opportunity for Dr Reddy, whose shares are listed in New York, and other Indian generics manufacturers.\n \n Sales in Dr Reddy's generics business fell 8.6% to 966m rupees. Another staple of the the firm's business, the sale of ingredients for drugs, also performed poorly. Sales were down more than 25% from the previous year to 1.4bn rupees in the face of strong competition both at home, and in the US and Europe. Dr Reddy's Indian competitors are gathering strength although they too face heavy competitive pressures.\n", "llama3.2:1b": "Dr Reddy's profits fell by 93% due to increased research costs and declining sales of its generic pharmaceutical products. The firm's revenue decreased by 8.6% to $915,000 in the three months to December from a year earlier. \n\nSales of generics decreased by 8.6% to 966m rupees, while sales of ingredients for drugs fell more than 25% to 1.4bn rupees due to strong competition both domestically and internationally.", "llama3.2:3b": "Dr Reddy's profits fell 93% due to rising research costs and declining sales. Sales declined 8% to 4.7bn rupees, with generics business down 8.6%. Research and development spending rose 37% as patents on well-known products are set to expire soon.", "gemma2:2b": "Dr Reddy's profits fell 93% due to increased research costs and declining sales.  The company, known for producing generic versions of branded drugs, is facing intensified competition and has had setbacks with product launches.  R&D spending has risen but hasn't offset the impact on profits.  Sales of generics and ingredients are down, reflecting intense competition from Indian rivals. \n", "qwen2.5:0.5b": "Dr. Reddy’s profits fell by 93%, with research costs increasing as sales declined and new drug developments lagging behind. Key issues include falling generic drugs market share, lack of key products under development, R&D spending surge and patent expiration. India's generics manufacturing industry is facing competition from other companies in the US, Europe and Asia.", "qwen2.5:1.5b": "Dr Reddy's Indian pharmaceutical company saw profits plummet by 93% due to increased research costs and declining sales, resulting in a loss of 40 million rupees over three months ending December. Despite its reputation for producing generic drugs, competition has intensified, with limited new product launches and a key court case lost that restricted their market presence globally. Profits fell alongside rising R&D expenses (37% increase to 705 million rupees). Products such as Norvasc and Prozac were discontinued in the U.S., while patent expiration looms for several well-known drugs, potentially opening opportunities for generics manufacturers. Sales of generic products and drug ingredients both declined by double-digit percentages due to strong domestic competition.", "qwen2.5:3b": "Profits at Indian drugmaker Dr Reddy's declined by 93% due to rising research costs and falling sales. Sales fell 8% to Rs4.7 billion, while R&D spending increased 37% to Rs705 million, a key factor contributing to the profit decrease alongside sales decline. The firm has won exclusive rights for a generic Prozac version but faced setbacks with a court case banning its Norvasc sales in the US. Dr Reddy's generics business saw an 8.6% drop in sales to Rs966 million and ingredient sales fell more than 25% from previous year levels, attributed to strong competition both domestically and internationally. Despite facing stiff competition, India's generics manufacturers are strengthening their position.", "opencoder:1.5b": "Profits slide at India's Dr Reddy.\n\nThe firm earned a 93% profit from research costs and sales increased by 8%. The firm reported revenue of $915,000 ($486,000 in the US) for three months to December on sales which fell by 8%.\n\nDr Reddy's has built its reputation with producing generic versions of big-name pharmaceutical products. But competition has intensified and the firm is short on new product launches.\n\nThe most recent announcement was in December 2,000 that it had won exclusive marketing rights for a generic version of Prozac from Dr Eli Lilly, which also banned it from selling Norvasc in the US, complicating the case. \n\nThe company continues to grow with R&D spending increasing to 705m rupees - up from 43% previously. Patents on well-known products are due to run out and another number of Indian generics manufacturers report have been listed for sale.\n\nSales in Dr Reddy's generics business fell by 8.6% to 966,000 rupees. The company's selling ingredients has also struggled to gain traction, down more than 25% compared with the previous year to just $1,400,000.\n\nDr Reddy's Indian competitors are inching closer but they face heavy competition pressures making them weaker in the long run.\n", "smollm:1.7b": "The summary should be: Profits at Indian drugmaker Dr Reddy's fell 93% as research costs rose and sales flagged. The firm said its profits were 40m rupees ($915,000; £486,000) for the three months to December on sales which fell 8% to 4.7bn rupees. Dr Reddy's has built its reputation on producing generic versions of big-name pharmaceutical products. But competition has intensified and the firm and the company are short on new product launches. The most recent was the annoucement in December 2000 that it had won exclusive marketing rights for a generic version of the famous anti-depressant Prozac from its maker, Eli Lilly. It also lost a key court case in March 2004, banning it from selling a version of Pfizer's popular hypertension drug Norvasc in the US. Research and development of new drugs is continuing apace, with R&D spending rising 37% to 705m rupees - a key cause of the decrease in profits alongside the fall in sales. Patents on a number of well-known products are due to run out in the near future, representing an opportunity for Dr Reddy's Indian generics manufacturers. Sales in Dr Reddy's generics business fell 8.6% to 966m rupees. Another staple of the firm's business, the sale of ingredients for drugs, also performed poorly. Sales were down more than 25% from the previous year to 1.4bn rupees in the face of strong competition both at home, and in the US and Europe. Dr Reddy's Indian competitors are gathering strength although they too face heavy competitive pressures.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely while preserving key ideas and details. Let me start by reading through the entire paragraph carefully.\n\nSo, the main topic is profits at Dr Reddy's in India. The profit fell by 93%, primarily due to rising research costs and sales dropping by 8%. They made 40 million rupees for three months on sales that were down by 8% to around 4.7 billion rupees.\n\nThey are known for making generic drugs, but competition has intensified. They had a successful marketing deal with Eli Lilly in 2000 and lost a court case with Pfizer in 2004. R&D is up 37%, which affects their profits. There's an opportunity as their patents expire soon.\n\nSales in generics are down 8.6% to 966 million rupees, ingredients sales worse by 25% to 1.4 billion. Competitors are struggling too. They're listed on the NYSE but others have similar issues.\n\nI need to condense this into a summary that covers the profit drop, reasons for it, competition, R&D status, and specific sales figures. I'll make sure to include the key points without getting too detailed.\n</think>\n\nProfits at Indian drugmaker Dr Reddy's fell 93% due to rising research costs and 8% decline in sales. They reported 40 million rupees in profits for three months on 4.7 billion rupees in sales. Known for generic drugs, they faced intense competition with a successful marketing deal with Eli Lilly and a court loss against Pfizer. R&D spending up by 37%, an opportunity as patents expire. Sales in generics down 8.6% to 966 million, ingredients worse by 25% to 1.4 billion. Competitors are struggling too.", "tinyllama:1.1b": "Profit slips at Indian drugmaker Dr Reddy's amid research costs spike and sales flagging\n\nDr Reddy's saw a fall in profit margins as research and development costs continued to rise, while its generic drugs unit recorded an increase in sales but underperformed against its rivals. The company said it expects research and development spend to continue rising until 2014 as the industry faces \"heavy competition\". Dr Reddy's Indian competitors are facing intense competition, with a number of well-known products due to run out soon. While R&D spending rose 37% from January 2012 to $705m (£389m), sales fell 8.6% to $966m in 2012, despite strong generic drug sales. The firm's generic drug unit also saw a drop in sales of ingredients for drugs, with its sales dropping by more than 25%. Meanwhile, Dr Reddy's generic drugs division was hit hard by competition, with the company losing patents on some of its well-known products. The firm also faced tough competition from Indian competitors, which are gathering strength despite increased pressure from global pharmaceutical giants.", "tinydolphin:1.1b": " Dr. Reddy's recent profits slump reflects escalating research and development costs along with a decline in sales due to intense competition and limited new product launches. In addition, patents on several popular medications are set to expire over the next few years, giving Indian generics manufacturers a golden opportunity to consolidate their market share. Sales of generic ingredients also fell by more than 25% in the face of strong competition at home and in international markets. Dr. Reddy's rival pharmaceutical companies are ramping up production to better compete against his company, despite facing heavy pressure from larger players.", "phi:2.7b": " Profits at India's drugmaker Dr Reddy's fell 93%, due to rising research costs and declining sales. The company has built its reputation on producing generic versions of big-name pharmaceutical products, but competition is intensifying. Research and development spending increased 37% while patents on popular products are set to run out in the near future, presenting an opportunity for Dr Reddy's and other Indian generics manufacturers. Sales in their generics business fell 8.6% and sales of ingredients for drugs also performed poorly.\n", "orca-mini:3b": " India's Dr Reddy saw a 93% drop in profits due to higher research costs and flagging sales. Sales fell 8% to 4.7 billion rupees while the generics business saw a 25% drop in sales, while the sale of ingredients for drugs was down more than 25%. The company has been losing key court cases and is facing challenges from Indian generics manufacturers who are gaining strength.", "hermes3:3b": "Dr Reddy's India profits drop 93%, due to 8% fall in sales, higher research costs, no new product launches, and loss of key court case.", "stablelm-zephyr:3b": "Indian drugmaker Dr Reddy's profits fell 93% due to rising research costs and falling sales. The company, known for producing generic versions of pharmaceutical products, is facing intense competition and short new product launches. Its R&D spending increased 37%, causing a decrease in profits alongside falling sales. Sales in the generics business and the sale of drug ingredients also performed poorly, faced with strong competition both at home and internationally.", "chatgpt-4o-latest": "Profits at Indian drugmaker Dr Reddy's fell 93% due to rising research costs and declining sales. The company reported profits of 40 million rupees for the three months to December, with sales down 8% to 4.7 billion rupees. Dr Reddy's, known for producing generic drugs, faces intensified competition and a lack of new product launches. It previously secured exclusive marketing rights for a generic version of Prozac but lost a key court case in 2004, preventing it from selling a version of Pfizer's Norvasc in the US. Research and development spending rose 37% to 705 million rupees, contributing to the profit decline. However, upcoming patent expirations on well-known drugs present future opportunities. Sales in its generics business fell 8.6% to 966 million rupees, while sales of drug ingredients dropped over 25% to 1.4 billion rupees due to strong competition in India, the US, and Europe. Indian competitors are also growing but face similar competitive pressures.", "stablelm2:1.6b": "Dr Reddy's profits fell by 8% due to increased research costs and slower sales. Sales for the generics business dropped 8.6%, while ingredient sales also struggled against strong competition. The company faces challenges in new product launches, including winning exclusive marketing rights for Prozac and a ban on Norvasc in the US. R&D spending is increasing, with patents on some well-known products due to expire soon as opportunities for growth presented themselves. Sales of ingredients for drugs were down 15% from the previous year.", "granite3.1-dense:2b": "Dr Reddy's, an Indian pharmaceutical company known for generic drug production, experienced a 93% drop in profits to 40 million rupees ($915,000; £486,000) for Q4 2000. Sales declined by 8% to 4.7 billion rupees as competition intensified and the company struggled with limited new product launches, including a dispute over exclusive marketing rights for Prozac in the US. Research and development expenses rose 37% to 705 million rupees, contributing to the profit decline alongside lower sales. The firm's patents on well-known drugs are set to expire soon, potentially opening opportunities for Dr Reddy and other Indian generic manufacturers. Sales in generics and ingredient sales also fell significantly, reflecting robust competition from both domestic and international sources.", "reference": "Sales in Dr Reddy's generics business fell 8.6% to 966m rupees.Profits at Indian drugmaker Dr Reddy's fell 93% as research costs rose and sales flagged.Dr Reddy's has built its reputation on producing generic versions of big-name pharmaceutical products.The firm said its profits were 40m rupees ($915,000; £486,000) for the three months to December on sales which fell 8% to 4.7bn rupees.Dr Reddy's Indian competitors are gathering strength although they too face heavy competitive pressures."}