{"raw_text": "US insurer Marsh cuts 2,500 jobs\n \n Up to 2,500 jobs are to go at US insurance broker Marsh & McLennan in a shake up following bigger-than-expected losses.\n \n The insurer said the cuts were part of a cost-cutting drive, aimed at saving millions of dollars. Marsh posted a $676m (£352m) loss for the last three months of 2004, against a $375m (£195.3m) profit a year before. It blamed an $850m payout to settle a price-rigging lawsuit, brought by New York attorney general Elliot Spitzer. Under the settlement announced in January, Marsh took a pre-tax charge of $618m in the October-to-December quarter, on top of the $232m charge from the previous quarter. \"Clearly 2004 was the most difficult year in MMC's financial history,\" Marsh chief executive Michael Cherkasky said.\n \n An ongoing restructuring drive at the group also led to a $337m hit in the fourth quarter, the world's biggest insurer said.\n \n Analysts expect its latest round of cuts to focus on its brokerage unit, which employs 40,000 staff. The latest layoffs will take the total number of jobs to go at the firm to 5,500 and are expected to lead to annual savings of more than $375m. As part of its efforts to cut costs, the company said it was halving its dividend payment to 17 cents a shares from 34 cents, a move which should enable it to save $360m. Looking ahead, Mr Cherkasky forecast profitable growth for the year ahead \"with an operating margin in the upper-teens, and with the opportunity for further margin expansion\". Meanwhile, the company also announced it would spin-off its MMC Capital private equity unit, which manages the $3bn Trident Funds operation, to a group of employees. Marsh did not say when the move would take place, but said it had signed a letter of intent.\n \n The insurer hit the headlines in October last year when it faced accusations of price rigging. New York Attorney General Elliot Spitzer sued the company, accusing it of receiving illegal payments to steer clients to selected firms as well as rigging bids and fixing prices. In January, Marsh agreed to pay $850m to settle the suit - a figure in line with the placement fees it collected in 2003 - and agreed to change its business practices. In February, a former senior executive pleaded guilty to criminal charges in a wide-ranging probe of fraud and bid-rigging in the insurance industry. In January, a former senior vice president also pleaded guilty to criminal charges related to the investigation. In an effort to reform its business practises, Marsh said it has already introduced new leadership, new compliance procedures and new ways of dealing with customers. \"As a result, we are ready to put these matters behind us and move ahead in 2005 to restore the trust our clients have placed in us and to rebuild shareholder value,\" Mr Cherkasky said.\n", "llama3.2:1b": "US insurer Marsh cuts 2,500 jobs as part of cost-cutting drive due to $676m loss in 2004. The job losses are expected to lead to annual savings of over $375m. Marsh is also halving its dividend payment and spinning off its private equity unit to a group of employees.", "llama3.2:3b": "Marsh & McLennan cuts up to 2,500 jobs as part of cost-cutting drive due to $676m loss, partly caused by $850m payout to settle price-rigging lawsuit; company also halves dividend payment and announces spin-off of private equity unit; CEO forecasts profitable growth for 2005.", "gemma2:2b": "Marsh & McLennan is cutting 2,500 jobs as part of cost-cutting efforts due to significant losses in the last quarter (including a $850m settlement for price-rigging).  The layoffs are expected to save over $375m annually and will bring the total number of job cuts to 5,500. The company is also halving its dividend payment to conserve capital, and plans to spin off its private equity unit to employees. Marsh predicts profitable growth for the year ahead with higher operating margins.  \n", "qwen2.5:0.5b": "The US insurer Marsh has laid off 2,500 employees following major financial losses. The company announced a $676 million ($352 million) loss for its third-quarter fiscal year, up from a $375 million profit in the previous quarter. It blamed an $850 million payout to settle a lawsuit brought by New York's attorney general, Elliot Spitzer. Under this settlement, Marsh paid out a pre-tax charge of $618 million ($232 million) in the October-to-December quarter, bringing its total loss for the quarter to $375 million. Analysts expect Marsh to reduce its workforce by 5,500 jobs over the coming years and save $375 million annually.\n\nIn a recent restructuring drive at the group, Marsh also cut its brokerage unit, which employs 40,000 staff. The latest layoffs will take the total number of job cuts to 5,500 jobs. This represents an increase in workforce from the previous fiscal year, when there were fewer than 2,000 job positions.\n\nMeanwhile, Marsh has announced that it is spinning off its private equity arm MMC Capital, which manages Trident Funds, to a new group of employees. The plan involves restructuring and introducing new leadership and compliance procedures to restore trust in the company.", "qwen2.5:1.5b": "Marsh & McLennan, a US insurance broker, is cutting 2,500 jobs following $676 million loss from last year's price-rigging lawsuit settlement, citing cost-cutting measures aimed at saving millions of dollars, particularly focusing on its brokerage unit with over 40,000 employees. The company plans to save an additional $375 million through restructuring and will halve its dividend payment by 17 cents per share, expected to result in a savings of $360 million.", "qwen2.5:3b": "US insurer Marsh & McLennan is cutting up to 2,500 jobs due to losses totaling $676m for the fourth quarter of 2004, including a $850m payout from settling a price-rigging lawsuit with New York attorney general Elliot Spitzer. The cuts are part of a cost-cutting drive aimed at saving millions of dollars. Marsh's brokerage unit employs 40,000 staff and is expected to see the latest layoffs focus on this division, totaling over 5,500 job losses leading to annual savings of more than $375m. The company announced halving its dividend from 34 cents to 17 cents per share, saving $360m. Marsh also plans to spin off its MMC Capital private equity unit into a group of employees, without specifying timing.", "opencoder:1.5b": "The US insurer Marsh has cut 2,500 jobs by strategically focusing on its brokerage unit. The cuts aimed at saving millions of dollars, and it has announced a $337m hit in the fourth quarter. It has also announced that it will halve its dividend payment to 17 cents a shares from 34 cents. Looking ahead, it has also announced a spin-off operation of MMC Capital, which manages the $3bn Trident Funds.\n", "smollm:1.7b": "The summary should be:\nUp to 2,500 jobs will go at US insurance broker Marsh & McLennan in a cost-cutting drive aimed at saving millions of dollars. The insurer blamed the $850m loss for the last three months of 2004 against a $375m profit from the previous quarter on larger losses and stricter financial controls. Analysts expect its latest round of cuts to focus on its brokerage unit, which employs 40,000 staff. The company said it will halve its dividend payment to 17 cents a share from 34 cents, a move which should enable it to save $360m. In addition, the company also announced it would spin-off its MMC Capital private equity unit, which manages the $3bn Trident Funds operation, to a group of employees.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Marsh cutting jobs. Let me read through it carefully.\n\nFirst, the main point is that Marsh cut 2,500 jobs at their insurance broker division. They're part of a cost-cutting drive aimed at saving money, probably millions in savings. The company blamed an $850m payout from a lawsuit, which was $618m in Q3 and $232m in Q2. They had a loss last year, so this is significant.\n\nThen, they laid off another 337 million people during the fourth quarter, totaling around 45k jobs now? Or wait, no, let me check: they started at 40k and went down to 5k after layoffs. But the latest cuts were about 25k in Q1, adding up to a total of around 5k. Wait, no, the text says \"to 5,500,\" so it's 40k initially minus some number to get there. Anyway, they expect annual savings over $375m.\n\nThey plan to focus on their brokerage unit, which has 40k employees. So they're reducing their headcount there and maybe other parts too? They also mention cutting dividend payments from $34 cents to 17 cents per share, saving around $360m, which could help with profits.\n\nThey said something about restructuring and spinning off the private equity unit, but didn't specify when. They'll likely spin it out soon.\n\nI need to make sure all key points are included: 25k cuts, main reasons (liability, lawsuit, customer issues), outlook on savings, strategic changes, including a new leadership and compliance stuff.\n\nI should structure this into a clear summary without too much explanation.\n</think>\n\nMarsh cut 2,500 jobs at its insurance broker division in 2004 due to high losses, blaming $850m from a suit. They had a $676m loss last year and expected annual savings of around $375m. The layoffs included another 337 million during the fourth quarter, totaling approximately 5,500 jobs now. The company plans to focus on their brokerage unit with 40k employees, aiming for $375m in savings. They will reduce dividend payments from $34 cents to 17 cents per share, expected to save $360m. They also announced spinning off a private equity unit managed by $3bn funds.", "tinyllama:1.1b": "The US insurer Marsh & McLennan has cut around 2,500 jobs as part of a cost-cutting drive aimed at saving millions of dollars. The layoffs will take the total number of job losses to go to around 5,500. In addition, the company announced that it would spin off its MMC Capital private equity unit and employees for $12m in shareholder value. This move will enable Marsh to save a further $375m, as well as halve its payments to 17 cents per share, and achieve operating margins of between the upper-teens and lower-tens percentages for the year ahead. The company also agreed to pay a $850m settlement in the ongoing price rigging lawsuit brought against it by New York Attorney General Elliot Spitzer.", "tinydolphin:1.1b": " Marsh & McLennan, a US insurer, has cut approximately 2,500 jobs as part of a cost-saving drive following larger-than-expected losses. The company reported a $676m loss for the last three months of 2004 against a $375m profit a year before. In response to the losses, Marsh & McLennan announced plans to cut jobs in its brokerage unit and set up a spinoff to sell off its MMC Capital private equity fund. The layoffs are expected to save the company $375m in annual costs. Analysts expect further job cuts in the coming months, but CEO Michael Cherkasky hopes for profitable growth in the year ahead.", "phi:2.7b": " Marsh & McLennan Insurance Company announced that it will cut up to 2,500 jobs due to significant losses of more than $700 million for the last three months of 2004. The insurer's restructuring drive has already resulted in a $337 million loss in the fourth quarter, making this its most expensive year on record. Additionally, the company is expected to save over $400 million per annum through job cuts, with the majority of those cuts targeted at their brokerage unit. The company also announced that it will be halving its dividend payment to 17 cents a share and spinning off its private equity unit. Despite these changes, Marsh remains optimistic about the year ahead and expects profitable growth. \n", "orca-mini:3b": " Marsh & McLennan cuts 2,500 jobs, blaming $850 million payout to settle price-rigging lawsuit. The insurer also halves its dividend payment to save $375 million and spin off its MMC Capital private equity unit to employees.", "hermes3:3b": "Marsh & McLennan cuts 2500 jobs after $676m loss; cost-cutting drive aimed at saving millions, following price rigging lawsuit settlement.", "stablelm-zephyr:3b": "Marsh & McLennan, a US insurance broker, is set to cut up to 2,500 jobs as part of a cost-cutting drive. The company blamed larger-than-expected losses, which saw it post a $676m loss for the last quarter of 2004, on an $850m payout to settle a price-rigging lawsuit by New York attorney general Elliot Spitzer. Analysts predict the latest round of cuts will focus on the brokerage unit, with a total of 5,500 jobs expected to go and annual savings of more than $375m. The company also announced it would spin off its MMC Capital private equity unit.", "chatgpt-4o-latest": "US insurance broker Marsh & McLennan is cutting up to 2,500 jobs as part of a cost-cutting drive following a $676 million loss in the last quarter of 2004, largely due to an $850 million settlement for a price-rigging lawsuit. The restructuring, which has already led to 5,500 job cuts, aims to save over $375 million annually. The company is also halving its dividend to save $360 million and plans to spin off its MMC Capital private equity unit. Marsh faced accusations of bid-rigging and illegal payments, leading to legal settlements and guilty pleas from former executives. In response, the company has introduced new leadership and compliance measures to restore trust and rebuild shareholder value.", "stablelm2:1.6b": "US insurer Marsh is cutting up to 2,0..\nlosses, amounting to a $m loss for Q4 2013 against a $m profit the year before. The firm blamed a payout to settle a price-rigging lawsuit brought by New York attorney general Elliot Spitzer. The latest job cuts are expected to result in annual savings of over $m and will take the total number of staff affected to 5,000 from 6,000 previously stated. Marsh plans to halve its dividend payment from $c a share to 10 cents and spin off its private equity unit as part of its cost-cutting drive.", "granite3.1-dense:2b": "Marsh & McLennan, a leading US insurance broker, plans to cut up to 2,500 jobs as part of a broader restructuring effort due to significant losses and a $850m price-rigging settlement by New York's attorney general. The company reported a $676m loss in Q4 2004, compared to a $375m profit in the previous year, primarily attributed to this payout. Marsh aims to save over $375m annually through these layoffs, focusing on its brokerage unit of 40,000 employees. The cuts will also involve halving the dividend payment to 17 cents per share from 34 cents. Marsh forecasts profitable growth in 2005 with an operating margin in the upper-teens and potential for further expansion. To address past scandals, Marsh has introduced new leadership, compliance procedures, and customer management practices. Additionally, the company plans to spin off its MMC Capital private equity unit to a group of employees.", "reference": "\"Clearly 2004 was the most difficult year in MMC's financial history,\" Marsh chief executive Michael Cherkasky said.Marsh did not say when the move would take place, but said it had signed a letter of intent.An ongoing restructuring drive at the group also led to a $337m hit in the fourth quarter, the world's biggest insurer said.The insurer said the cuts were part of a cost-cutting drive, aimed at saving millions of dollars.In an effort to reform its business practises, Marsh said it has already introduced new leadership, new compliance procedures and new ways of dealing with customers.As part of its efforts to cut costs, the company said it was halving its dividend payment to 17 cents a shares from 34 cents, a move which should enable it to save $360m.Under the settlement announced in January, Marsh took a pre-tax charge of $618m in the October-to-December quarter, on top of the $232m charge from the previous quarter.Marsh posted a $676m (£352m) loss for the last three months of 2004, against a $375m (£195.3m) profit a year before."}