{"raw_text": "Nigeria to boost cocoa production\n \n The government of Nigeria is hoping to triple cocoa production over the next three years with the launch of an ambitious development programme.\n \n Agriculture Minister Adamu Bello said the scheme aimed to boost production from an expected 180,000 tonnes this year to 600,000 tonnes by 2008. The government will pump 154m naira ($1.1m; £591,000) into subsidies for farming chemicals and seedlings. Nigeria is currently the world's fourth-largest cocoa producer.\n \n Cocoa was the main export product in Nigeria during the 1960s. But with the coming of oil, the government began to pay less attention to the cocoa sector and production began to fall from a peak of about 400,000 tonnes a year in 1970. At the launch of the programme in the south-western city of Ibadan, Mr Bello explained that an additional aim of the project is to encourage the processing of cocoa in the country and lift local consumption. He also announced that 91m naira of the funding available had been earmarked for establishing cocoa plant nurseries. The country could be looking to emulate rival Ghana, which produced a bumper crop last year. However, some farmers are sceptical about the proposals. \"People who are not farming will hijack the subsidy,\" said Joshua Osagie, a cocoa farmer from Edo state told Reuters. \"The farmers in the village never see any assistance,\" he added.\n \n At the same time as Nigeria announced its new initiative, Ghana - the world's second largest cocoa exporter - announced revenues from the industry had broken new records. The country saw more than $1.2bn-worth of the beans exported during 2003-04. Analysts said high tech-production techniques and crop spraying introduced by the government led to the huge crop, pushing production closer to levels seen in the 1960s when the country was the world's leading cocoa grower.\n", "llama3.2:1b": "Nigeria plans to triple its cocoa production over three years through a development programme launched at Ibadan. The government will spend 154m naira on subsidies for farming chemicals and seedlings, aiming for 600,000 tonnes by 2008. The country is fourth-largest cocoa producer worldwide.", "llama3.2:3b": "Nigeria plans to triple its cocoa production from 180,000 tonnes this year to 600,000 tonnes by 2008 with a 154m naira ($1.1m) subsidy for farming chemicals and seedlings. The government aims to encourage local processing and consumption, while Ghana's new high-tech-production techniques resulted in a record-breaking $1.2bn export of cocoa beans in the 2003-04 year.", "gemma2:2b": "Nigeria plans to triple cocoa production over three years with a $1.1 million program funding subsidies for farming chemicals and seedlings. They aim to increase output from 180,000 tonnes this year to 600,000 tonnes by 2008.  The government also seeks to promote processing and domestic consumption.  While the plan is welcomed, some farmers are skeptical about its effectiveness. Ghana, meanwhile, saw record-breaking cocoa exports exceeding $1.2 billion during 2003-04 due to advanced production techniques and crop spraying.  \n", "qwen2.5:0.5b": "Nigeria plans to boost cocoa production by tripleting it over three years with a development programme. The government will help farmers by offering subsidies for farming chemicals and seedlings. Nigeria is currently the world's fourth-largest cocoa producer. Some farmers are skeptical, believing that people who don't farm will hijack the subsidy, while others see it as a way to encourage processing in Ghana. Analysts say high tech-production techniques led to the massive crop of 2003-04 during which Nigeria surpassed its leading position.", "qwen2.5:1.5b": "Nigeria plans to triple its cocoa production from 180,000 tonnes to 600,000 tonnes over three years through subsidies and new plant nurseries, aiming to boost local processing and consumption while becoming a major producer again. However, some farmers are skeptical about the program's impact.", "qwen2.5:3b": "Nigeria aims to triple cocoa production from 180,000 tonnes to 600,000 tonnes by 2008 through a government development program funded with subsidies for farming chemicals and seedlings. The goal includes boosting local consumption and processing within the country. Initial funding of 154m naira ($1.1m) has been allocated towards establishing cocoa plant nurseries. However, some farmers remain skeptical about the project's success. Nigeria currently ranks fourth in world cocoa production, having previously dominated in the 1960s until oil became a primary export. Simultaneously, Ghana saw record-breaking revenues from its cocoa exports, attributing this to advanced production techniques and government intervention.", "opencoder:1.5b": "The government of Nigeria is hoping to triple cocoa production over the next three years with the launch of an ambitious development programme. The agriculture Minister Adamu Bello said the scheme aimed to boost production from an expected 180,000 tonnes this year to 600,000 tonnes by 2008. The government will pump 154m naira ($1.1m; £591,000) into subsidies for farming chemicals and seedlings. Nigeria is currently the world's fourth-largest cocoa producer. Cocoa was the main export product in Nigeria during the 19th century. But with the coming of oil, the government began to pay less attention to the cocoa sector and production began to fall from a peak of about 400,000 tonnes a year in 19th century. At the launch of the programme in the south-western city of Ibadan, Mr Bello explained that an additional aim of the project is to encourage the processing of cocoa in the country and lift local consumption. He also announced that 91m naira of the funding available had been earmarked for establishing cocoa plant nurseries. The country could be looking to emulate rival Ghana which produced a bumper crop last year. However, some farmers are sceptical about the proposals. \"People who are not farming will hijack the subsidy,\" said Joshua Osagie, a cocoa farmer from Edo state told Reuters. \"The farmers in the village never see any assistance,\" he added.\n", "smollm:1.7b": "The summary should be: Nigeria is hoping to boost cocoa production over the next three years with a development programme that will pump $154 million into subsidies for farming chemicals and seedlings, while also aiming to increase local consumption by encouraging processing of cocoa in the country. The government has announced plans to double cocoa production from 180,000 tonnes this year to 600,000 tonnes by 2008 through a new development scheme.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Nigeria boosting cocoa production. Let me read through it carefully first.\n\nThe main points are: Nigeria aims to triple cocoa production over three years with an ambitious development plan. Agriculture Minister Adamu Bello said they'll pump 154 million naira into subsidies for chemicals and seedlings. They currently produce around 600,000 tonnes of cocoa by 2008. Currently, Nigeria is the fourth-largest cocoa producer. Cocoa was main export during the 60s but fell from over 400k tonnes in '70 to about that same number later.\n\nThey plan to launch a program in Ibadan to encourage processing and lift local consumption. They already used 91 million naira for setting up cocoa nurseries. Some farmers are skeptical, especially those who don't farm. On Ghana's side, they broke new records with more than $1.2 billion exported in 2003-04 using advanced tech and spraying.\n\nSo the summary needs to capture these key points: goal of tripling production, funding from 154m naira, current 600k tonnes by 2008, cocoa being fourth-largest, cocoa's decline from '70, new initiative in Nigeria, planned use for nurseries, farmers' skepticism on '70s export, Ghana breaking records with advanced tech, and the contrast between Nigeria's cocoa production and Ghana's record.\n\nI should make sure to include all these elements but keep it concise. Maybe start with the government's aim, then the plan details like funding and new initiatives, agricultural performance before and after, and compare with other countries.\n</think>\n\nNigeria aims to triple cocoa production over three years with an ambitious development plan. Agriculture Minister Adamu Bello stated their initiative will pump 154 million naira for subsidies, aiming to increase production from 180,000 tonnes in '70 to 600,000 tonnes by '08. Nigeria is the fourth-largest cocoa producer currently, but cocoa declined from over 400,000 tonnes in '70. They plan to launch a program in Ibadan to encourage processing and lift local consumption. Already using 91 million naira for nurseries, they aim to emulate Ghana's record of breaking new cocoa export records with advanced tech. Some farmers are skeptical about Nigeria's agricultural decline from the '60s.", "tinyllama:1.1b": "The Nigerian government has launched a new development programme aimed at boosting coconut production, hoping to triple production over the next three years. The scheme will invest 154m naira into subsidiaries for farm chemicals and seedlings, with the aim of increasing production from an expected 180,000 tonnes this year to 600,000 tonnes by 2008. Coconut is currently the fourth-largest export product in Nigeria, but the government began paying less attention to the industry during the 1970s, resulting in a decline in production levels. The latest project includes establishing cocona plant nurseries worth an additional 91m naira, aimed at encouraging the processing of coconuts and raising local consumption. Farmers have expressed concerns that plans to allocate subsidies will be hijacked by non-farmers, with a producer in Edo state stating that \"people who are not farming will hijack this subsidy.\" Ghana, second largest coconut exporter, has seen record revenue of more than $1.2bn during 2003-04, driven by high production techniques introduced by the government.", "tinydolphin:1.1b": " Nigeria has announced plans to triple cocoa production over the next three years with the launch of an ambitious development programme. The government aims to boost production from an estimated 180,000 tonnes this year to 600,000 tonnes by 2008. The agriculture minister, Adamu Bello, has praised the government's commitment to agriculture and pledged $154m in subsidies for farming chemicals and seedlings. \n\nCocoa was the main export product in Nigeria during the 1960s, but with the introduction of oil, production began to fall. The government has now decided to encourage the processing of cocoa in the country by establishing cocoa plant nurseries, earmarked for $91m. Some local farmers are sceptical about these plans, with Joshua Osagie, a cocoa farmer from Edo state, stating that if successful, it could lead to \"hijacking of subsidies.\" \n\nGhana, the world's second largest cocoa exporter, has seen record revenues in recent years. The country reported earnings of more than $1.2bn-worth of the beans exported during 2003-04, up from $867m a year earlier. This highlights the importance of investing in agriculture to boost production and improve cocoa prices.", "phi:2.7b": " The Nigerian government is planning to triple its cocoa production over the next three years with a development program that includes subsidies for farming chemicals and seedlings. Nigeria's cocoa production had fallen after oil became a priority, but this initiative aims to increase it from 180,000 tonnes to 600,000 tonnes by 2008. Another goal is to encourage local consumption of processed cocoa products. Nigeria could be looking to Ghana as an example, which produced a bumper crop last year due to high tech-production techniques and crop spraying introduced by the government. However, some Nigerian farmers are skeptical about the subsidies, saying that the money might not reach the intended recipients.\n", "orca-mini:3b": " Nigeria plans to triple cocoa production over the next three years with a new development program that includes subsidies for farming chemicals and seedlings. The program will cost 154 million naira ($1.1 million; £591,000) and will encourage processing of cocoa in the country and boost local consumption. However, farmers are skeptical about the plans, saying they will receive little benefit from the subsidies. Despite this, Nigeria remains a major player in the global cocoa industry, with Ghana also reporting high crop yields.", "hermes3:3b": "Nigeria aims to triple cocoa production (180k t to 600k t by 2008) with 154m naira subsidy for farming chemicals and seedlings.", "stablelm-zephyr:3b": "Nigeria plans to triple its cocoa production over the next three years through an ambitious development program launched by Agriculture Minister Adamu Bello. The scheme aims to increase production from 180,000 tonnes expected this year to 600,000 tonnes by 2008, with a subsidy of 154 million naira ($1.1m; £591,000) for farming chemicals and seedlings. Nigeria was once the world's fourth-largest cocoa producer but production fell due to reduced government attention during the 1960s. The program also aims to encourage local processing and consumption. While some farmers are skeptical about the plans, a successful crop in neighboring Ghana indicates potential for success.", "chatgpt-4o-latest": "Nigeria plans to triple cocoa production to 600,000 tonnes by 2008 through a government-backed development program. Agriculture Minister Adamu Bello announced a 154 million naira subsidy for farming chemicals and seedlings, with 91 million naira allocated for cocoa plant nurseries. Once Nigeria’s main export, cocoa production declined after the rise of the oil industry. The initiative also aims to boost local processing and consumption. However, some farmers doubt the subsidies will reach them. Meanwhile, Ghana, the world's second-largest cocoa exporter, reported record revenues of over $1.2 billion due to improved farming techniques and crop spraying.", "stablelm2:1.6b": "Nigeria plans to triple cocoa production over three years through a development program with $1.1 million investment for farming subsidies and seedlings. As the fourth-largest cocoa producer, the country aims to boost from an estimated 200,0 S tonnes this year to 400,000 tonnes by 2028. Cocoa was previously the main export product; however, with oil, the focus shifted to the agriculture sector. Nigeria hopes to encourage processing and local consumption alongside plant nurseries for establishing cocoa plants. Ghana's recent bumper crop follows government-led techniques and increased spraying in the country.", "granite3.1-dense:2b": "Nigeria plans to triple its cocoa production from 180,000 tonnes annually to 600,000 tonnes by 2008 through an ambitious agricultural program costing 154 million naira ($1.1m; £591,000). The initiative, led by Agriculture Minister Adamu Bello, aims to boost subsidies for farming chemicals and seedlings, enhance cocoa processing domestically, and increase local consumption. While 91 million naira is allocated for nurseries, concerns persist among some farmers about potential misuse of subsidies by non-farmers. Meanwhile, Ghana, the world's second-largest cocoa exporter, reported record revenues of over $1.2bn from exports in 2003-04, attributed to advanced production techniques and crop spraying, returning production levels similar to those seen in the 1960s when Ghana was the leading cocoa producer.", "reference": "The government of Nigeria is hoping to triple cocoa production over the next three years with the launch of an ambitious development programme.Analysts said high tech-production techniques and crop spraying introduced by the government led to the huge crop, pushing production closer to levels seen in the 1960s when the country was the world's leading cocoa grower.\"People who are not farming will hijack the subsidy,\" said Joshua Osagie, a cocoa farmer from Edo state told Reuters.Nigeria is currently the world's fourth-largest cocoa producer.Cocoa was the main export product in Nigeria during the 1960s.But with the coming of oil, the government began to pay less attention to the cocoa sector and production began to fall from a peak of about 400,000 tonnes a year in 1970."}