{"raw_text": "Train strike grips Buenos Aires\n \n A strike on the Buenos Aires underground has caused traffic chaos and large queues at bus stops in the Argentine capital.\n \n Tube workers walked out last week demanding a 53% pay rise and in protest against the installation of automatic ticket machines. Metrovias, the private firm which runs the five tube lines in the city, has offered an 8% increase in wages. The firm promised no jobs would be lost as a result of new ticket machines. It said it would put this commitment on paper.\n \n Underground staff have warned they will continue with the protests until the management put an acceptable offer on the table. The Argentine Work Ministry has been mediating in the conflict and it could call an \"obligatory conciliation\", which would force both sides to find a solution and put an end to the conflict. Some tube commuters have not hidden their frustration at the ongoing strike and have broken the windows of the underground trains, according to the local press. \"We are taken as hostages. I don't know who is right, but the harm ones are us,\" said accountant Jose Lopez.\n", "llama3.2:1b": "A train strike in Buenos Aires has caused traffic chaos and traffic congestion due to queues at bus stops. The striking workers demanded a 53% pay rise, while Metrovias offered an 8% increase. The dispute continues with both sides refusing to meet. The Argentine Work Ministry is mediating the conflict and may call for an \"obligatory conciliation\" to resolve the issue.", "llama3.2:3b": "A strike by Buenos Aires underground workers has caused traffic chaos, with long queues at bus stops and broken train windows. The strike began last week over a 53% pay rise and automatic ticket machines, with Metrovias offering an 8% increase in wages. Workers have warned of continuing protests until a satisfactory offer is made, while the Argentine Work Ministry may intervene to force a resolution.", "gemma2:2b": "Train workers in Buenos Aires went on strike demanding a 53% pay raise and protesting new ticket machines. The private company offering an 8% increase has promised no job losses.  The conflict continues with commuters facing disruptions.  Argentina's work ministry is mediating and could force both sides to find a solution. \n", "qwen2.5:0.5b": "A large number of workers in Buenos Aires are striking, leading to traffic chaos on buses and queues at bus stops, with an offer from Metrovias, a private firm operating the five tube lines in the city. Despite a promise by Metrovias not losing jobs, subway staff have insisted on continued strikes until both sides can reach an agreement. Some commuters have broken windows at their trains to express their frustration.", "qwen2.5:1.5b": "Buenos Aires subway workers went on strike over a 53% pay raise and new ticket machines installation, leading to traffic chaos and protests that could potentially lead to an \"obligatory conciliation\" mediation call by the Argentine Work Ministry.", "qwen2.5:3b": "A train strike in Buenos Aires has caused traffic chaos and long queues at bus stops due to Tube workers' demands for a 53% pay rise and protest against automatic ticket machines. Metrovias offers an 8% wage increase, but staff continue protests until they receive an acceptable offer. The Argentine Work Ministry mediates; an \"obligatory conciliation\" could be called to resolve the conflict. Some commuters have vandalized trains in frustration.", "opencoder:1.5b": "Train strike grips Buenos Aires\n\nA strike on the Buenos Aires underground has caused traffic chaos and large queues at bus stops in the Argentine capital. Tube workers walked out last week demanding a 53% pay rise and in protest against the installation of automatic ticket machines. Metrovias, the private firm which runs the five tube lines in the city, has offered an 8% increase in wages. The firm promised no jobs would be lost as a result of new ticket machines. It said it would put this commitment on paper. Underground staff have warned they will continue with the protests until the management put an acceptable offer on the table. The Argentine Work Ministry has been mediating in the conflict and it could call an \"obligatory conciliation\", which would force both sides to find a solution and put an end to the conflict. Some tube commuters have not hidden their frustration at the ongoing strike and have broken the windows of the underground trains, according to the local press.\n", "smollm:1.7b": "The strike on the Buenos Aires underground has caused traffic chaos and large queues at bus stops in the Argentine capital. Tube workers walked out last week demanding a 53% pay rise and in protest against the installation of automatic ticket machines. Metrovias, the private firm which runs the five tube lines in the city, has offered an 8% increase in wages. The firm promised no jobs would be lost as a result of new ticket machines. It said it would put this commitment on paper.\nThe underground staff have warned they will continue with the protests until the management puts an acceptable offer on the table. The Argentine Work Ministry has been mediating in the conflict and it could call an \"obligatory conciliation\", which would force both sides to find a solution and put an end to the conflict. Some tube commuters have not hidden their frustration at the ongoing strike and have broken the windows of the underground trains, according to the local press. \"We are taken as hostages. I don't know who is right, but the harm ones are us,\" said accountant Jose Lopez.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about a train strike in Buenos Aires. Let me read through it again carefully.\n\nThe user provided a pretty detailed summary already, but maybe I can think of some points that could be included or expanded upon while keeping it concise.\n\nFirst, the main event is the train strike in Buenos Aires. It caused traffic chaos and large queues at bus stops. The underground workers walked out last week demanding a 53% pay increase. They are protesting against new automatic ticket machines installed by metrovias. Metrovias promised an 8% wage raise but said they'd put it on paper, hoping to avoid any job losses.\n\nThe work government has been mediating the conflict and could end it with \"obligatory conciliation.\" Some commuters have not hidden their frustration; in fact, some are taking their train as hostages because of the ongoing strike. They warn they don't know who is right but are worried about harm to others' jobs.\n\nWait, did I miss anything? The summary included all these points—event description, workers' demand for pay rise, metrovias' offer, work government mediation, commuters taking their trains as hostages due to the strike, and some commuters not hiding their frustration. That seems comprehensive.\n\nI should make sure that each key idea is covered without adding extra details unless necessary. Also, keeping it in plain text with just the summary without any explanations or formatting.\n\nHmm, I think that covers all the important aspects of the text provided. Maybe I can check if there are any other points like local press reports or more about the metrovias' response but those aren't mentioned as central to the summary. So sticking to what's given seems best.\n</think>\n\nTrain strike in Buenos Aires caused traffic chaos and queues at underground bus stops. Underground workers walked out last week, demanding a 53% pay increase and protesting against new automatic ticket machines installed by metrovias, offering an 8% wage raise but promising no job losses. The Argentine Work Ministry mediates the conflict, possibly leading to \"obligatory conciliation,\" forcing both sides to resolve the conflict. Some commuters took their trains as hostages due to ongoing strikes, warning of potential job losses.", "tinyllama:1.1b": "The city of Buenos Aires has witnessed a train strike that has caused traffic jams and large queues at bus stops. The TuBe workers have walked out last week demanding a 53% pay raise, while the private firm, MetroVia, has offered an 8% increase in wages. However, the management also promised that there would be no job losses as a result of new ticket machines being installed. The local Work Ministry has been mediating in the conflict and has called on both sides to find a solution. Some commuters have broken the windows of underground trains, but passengers seem to have accepted the situation without any significant change to their daily commute. Despite the frustration expressed by some, it is clear that the strike remains ongoing, with no immediate end in sight.", "tinydolphin:1.1b": " In Buenos Aires, a city in Argentina, a train strike has left traffic congested and caused long lines at bus stops due to the use of automatic ticket machines installed by private company Metrovias. The workers' union, Tube Workers Union (UTA), demanded an increase of 53% in wages while private firm Metrovias offered an 8% pay hike. However, UTA warned that job losses would result from these changes. Underground staff have gone on strike in protest against the installation of ticket machines and the lack of a fair offer from Metrovias management.", "phi:2.7b": " The public transport system in Buenos Aires was disrupted by a strike on the metro caused by a demand for higher wages and opposition to automated ticketing machines. Underground staff have threatened further protests until an acceptable offer is made, while the Argentine government has stepped in to mediate the conflict. Passengers have expressed frustration and some have vandalized trains.\n", "orca-mini:3b": " A strike on the Buenos Aires underground caused traffic chaos and large queues at bus stops in the Argentine capital. Tube workers walked out demanding a 53% pay rise and protesting against the installation of automatic ticket machines. Metrovias offered an 8% increase in wages, but tube staff threatened to continue with protests until their demands were met. The government mediated in the conflict and could call an \"obligatory conciliation,\" which would force both sides to find a solution. Some commuters broke the windows of underground trains, and one person stated that \"we are taken as hostages\" and that they don't know who is right.", "hermes3:3b": "Buenos Aires underground strike causes traffic disruption, as workers demand 53% pay rise and automated ticket machine protests.", "stablelm-zephyr:3b": "A strike by Buenos Aires subway workers has caused traffic chaos and long lines at bus stops in the city. The workers walked out last week demanding a 53% pay raise and protesting the installation of automatic ticket machines. Metrovias, the private firm managing the subway system, offered an 8% wage increase but promised no jobs would be lost with the new machines. Underground staff warned they will continue protests until they receive an acceptable offer. The Argentine Work Ministry is mediating the conflict and could impose obligatory conciliation to resolve the issue. Commuters have expressed frustration, with some breaking windows of the affected trains.", "chatgpt-4o-latest": "A strike by Buenos Aires underground workers has caused major traffic disruptions and long bus queues. Workers demand a 53% pay rise and oppose automatic ticket machines, while Metrovias, the private operator, has offered only an 8% wage increase and assured no job losses. The strike will continue until an acceptable offer is made. The Argentine Work Ministry may intervene with an \"obligatory conciliation\" to resolve the dispute. Frustrated commuters have vandalized trains, expressing anger over the ongoing conflict.", "stablelm2:1.6b": "A train strike in Buenos Aires has caused traffic chaos and large queues at bus stops. Tube workers walked out demanding a pay rise and opposed the installation of automatic ticket machines. Metrovías, the company running five tube lines, offered an 8% wage increase but no job losses. The strike continues as staff threaten to continue until an acceptable offer is made by management. The Work Ministry is mediating the conflict, with the potential for an \"obligatory conciliation\" to bring a resolution and end the strike. Commuters are expressing frustration at the ongoing strike, with some even breaking train windows.", "granite3.1-dense:2b": "A train strike in Buenos Aires has disrupted public transportation, causing traffic jams and long lines at bus stops. Workers, employed by Metrovias, are demanding a 53% pay rise and opposing the introduction of automatic ticket machines. The company countered with an 8% wage increase pledge, assuring no job losses due to these machines. Underground staff have vowed to persist in their protest until an acceptable deal is reached. The Argentine Work Ministry is mediating the dispute, potentially imposing \"obligatory conciliation\" to resolve the conflict. Some commuters have expressed frustration by damaging subway train windows. Accountant Jose Lopez expressed his feelings of being a \"hostage,\" emphasizing the impact on regular people rather than focusing on who is right in the argument.", "reference": "It said it would put this commitment on paper.The Argentine Work Ministry has been mediating in the conflict and it could call an \"obligatory conciliation\", which would force both sides to find a solution and put an end to the conflict.The firm promised no jobs would be lost as a result of new ticket machines.Underground staff have warned they will continue with the protests until the management put an acceptable offer on the table."}