{"raw_text": "Bargain calls widen Softbank loss\n \n Japanese communications firm Softbank has widened losses after heavy spending on a new cut-rate phone service.\n \n The service, launched in December and dubbed \"Otoku\" or \"bargain\", has had almost 900,000 orders, Softbank said. The firm, a market leader in high-speed internet, had an operating loss for the three months to December of 7.5bn yen ($71.5m; £38.4m). But without the Otoku marketing spend it would have made a profit - and expects to move into the black in 2006. The firm did not give a figure for the extent of profits it expected to make next year. It was born in the 1990s tech boom, investing widely and becoming a fast-rising star, till the end of the tech bubble hit it hard. Its recent return to a high profile came with the purchase of Japan Telecom, the country's third-biggest fixed-line telecoms firm. The acquisition spurred its broadband internet division to pole position in the Japanese market, with more than 5.1 million subscribers at the end of December.\n", "llama3.2:1b": "Softbank loses ¥7.5bn due to heavy spending on \"Otoku\" phone service and expected profit from reduced marketing expenses of ¥900m if launched. The company has an operating loss for three months ending December, which would be profitable without the service but costs are higher than anticipated. Softbank was a market leader in high-speed internet before the tech bubble hit it hard and recently acquired Japan Telecom to increase its broadband market share.", "llama3.2:3b": "Softbank widened losses by $71.5m after launching a new cut-rate phone service called \"Otoku\", which has had almost 900,000 orders. The company expects to turn a profit in 2006 without marketing spend and recently acquired Japan Telecom, making its broadband internet division the market leader.", "gemma2:2b": "Softbank expanded their losses due to heavy investment in a low-cost phone service called \"Otoku\".  While the service has been successful (900,000 orders), it contributed to Softbank's operating loss. Without this spending, they expected to reach profitability. \n", "qwen2.5:0.5b": "Softbank has experienced losses due to heavy spending on a new cut-rate phone service called \"Otoku\". The company had over 900, 000 orders for this service when it launched in December. However, without the marketing spend of the Otoku service, it would have made a profit and expects to enter the black in 2006. Softbank's operating loss is around 7.5 billion yen or $71.5 million (£38.4 million). It was initially an emerging tech company with investments in high-speed internet but later became a fast-growing star, investing widely and rising to prominence.", "qwen2.5:1.5b": "Softbank suffered losses due to a major advertising campaign failure and expects to turn profit next year.", "qwen2.5:3b": "Japanese communications firm Softbank has widened losses due to heavy spending on a new cut-rate phone service \"Otoku\" launched in December. Despite having an operating loss of 7.5bn yen ($71.5m; £38.4m) for Q4, Softbank expects to turn profitable in 2006 without the Otoku marketing spend. The firm was previously a market leader in high-speed internet and became prominent again through acquiring Japan Telecom, now at the forefront of Japanese broadband internet with over 5.1 million subscribers as of December.", "opencoder:1.5b": "Bargain calls widen Softbank loss. Softbank has experienced a significant increase in losses following heavy spending on new cut-rate phone service.\nAfter launching the service as \"Otoku\", Softbank had incurred approximately 9,000,000 orders in three months - an impressive figure that accounted for a loss of approximately $71.5 million ($38.4 million). Despite this, without marketing efforts, it would have made profits and moved into the financial domain of next year. The firm did not provide specific figures for profits it expected to make.\nThe company had invested widely and has become increasingly influential in the tech boom, investing in growth and becoming a leader in high-speed internet business till hitting the end of the tech bubble. The recent success came with the acquisition by Japan Telecom, a leading fixed-line telecoms firm - which enabled more than 5.1 million subscribers to reach the end of December.\n", "smollm:1.7b": "Softbank Communications has widened losses after heavy spending on a new cut-rate phone service. The service, launched in December and dubbed \"Otoku\" or \"bargain\", has had almost 900,000 orders, Softbank said. The firm, a market leader in high-speed internet, did not give a figure for the extent of profits it expected to make next year. It was born in the 1990s tech boom, investing widely and becoming a fast-rising star, till the end of the tech bubble hit it hard. Its recent return to a high profile came with the purchase of Japan Telecom, the country's third-biggest fixed-line telecoms firm. The acquisition spurred its broadband internet division to pole position in the Japanese market, with more than 5.1 million subscribers at the end of December.", "deepseek-r1:1.5b": "<think>\nOkay, so I have this user query where they provided a detailed text about Softbank's situation and want me to summarize it concisely. Let me break down what they're asking for.\n\nFirst, looking at the original text: It talks about Softbank's loss after investing in Otoku, a cut-rate phone service. They mention spending around 900k orders and expecting some profits without that spend. They also talk about their tech history and recent acquisition.\n\nThe user wants only the summary as plain text with no explanations or formatting. So I need to capture the key points: the expansion of losses due to Otoku, the profit expectation even without it, Softbank's market leadership in internet, their tech success before thebubble, and the big acquisition into Japan Telecom.\n\nI should make sure each main point is included clearly. Maybe list them as bullet points or separate sentences. Also, I need to preserve details like the number of orders and profits expected.\n\nLet me structure this: Start with the loss after Otoku, mention profit expectation without it, highlight their leadership in internet, tech background, and recent acquisition. That should cover all important aspects succinctly.\n</think>\n\nSoftbank lost money due to a significant expansion into a new cut-rate phone service called Otoku, which saw over 900,000 orders. Softbank expected an operating profit of around 7 billion yen (US$715 million and GBP384 million) without the Otoku marketing spend, and expects next year's profits to move into the black. Softbank, a leading high-speed internet company, emerged during a tech boom in the 1990s before the global internet boom of the late 20th century. Otoku was launched in December and saw its broadband internet division rise to prominence in Japan, with over 5.1 million subscribers at year-end. Softbank purchased Japan Telecom in the early 2000s as part of their growth into a leading Japanese mobile communications firm.", "tinyllama:1.1b": "Softbank, a Japanese communication and internet company, has reported a net loss after heavy investments in the launch of its own broadband service, which was dubbed \"Otoku\" and had nearly 900,000 orders. Softbank also saw an operating loss for the three months to December, but without Otoku marketing expenses, it is expected to post a profit in 2006. The company did not provide a figure for its expected net income in the next year. Softbank's recent return to a high profile was with the purchase of Japan Telecom, one of Japan's three largest telecommunications firms.", "tinydolphin:1.1b": " Japanese communications firm Softbank has widened its losses after a major promotion for a new cut-rate phone service. The company, known for its high-speed internet services, had an operating loss of $71.5m (£38.4m) in the three months to December. However, without the Otoku marketing spend, it would have made a profit and predicted to move into the black in 2006. Despite being one of the fastest-rising stars in technology, Softbank's recent return to prominence was brought about by the acquisition of Japan Telecom, one of the country's largest telecommunications companies.", "phi:2.7b": " SoftBank has widened losses due to heavy spending on a new cut-rate phone service called \"Otoku\", but expects to make a profit in 2006 without it. The firm's recent return to high profile came after acquiring Japan Telecom, which boosted its broadband internet division's market position.\n", "orca-mini:3b": " Softbank widened its losses after investing heavily in a new cut-rate phone service and has struggled to make a profit due to the spending. However, the company expects to turn a profit next year and has plans to move into the black in 2006. The Otoku service had almost 900,000 orders and was launched in December. Softbank had an operating loss of 7.5bn yen for the three months to December, but expects to make a profit in 2006 due to its investment in broadband internet. The company's recent purchase of Japan Telecom has helped its broadband internet division become the country's third-biggest fixed-line telecoms firm.", "hermes3:3b": "Softbank widens losses after launching cost-cutting phone service \"Otoku\", increasing orders but resulting in increased expenses.", "stablelm-zephyr:3b": "Softbank, a Japanese communications company, expanded its losses due to heavy investment in its new low-priced phone service, \"Otoku.\" Despite having nearly 900,000 orders for the service, Softbank reported an operating loss of 7.5 billion yen ($71.5 million; £38.4 million). The firm expects to turn profitable in 2006, although it did not reveal exact annual profits expectations. In the 1990s, Softbank invested widely during the tech boom and became a prominent company before facing difficulties until its recent resurgence, driven by the acquisition of Japan Telecom, which placed its broadband internet division in third position in the Japanese market with over 5.1 million subscribers at the end of December.", "chatgpt-4o-latest": "Softbank reported widened losses due to heavy spending on its new discount phone service, \"Otoku,\" which has received nearly 900,000 orders since its December launch. The company posted a 7.5 billion yen operating loss for the quarter but stated it would have been profitable without the Otoku marketing costs and expects to return to profitability in 2006. Originally a rising star during the 1990s tech boom, Softbank struggled after the bubble burst but regained prominence with its acquisition of Japan Telecom, boosting its broadband division to market leadership with over 5.1 million subscribers by December.", "stablelm2:1.6b": "Softbank's losses expanded due to heavy investment in a cut-price phone service called \"Otoku,\" which has garnered nearly all orders since its launch in December and contributed significantly to their operating loss of ¥7.5bn ($½m, £½m) for Q3 2019. Without the Otoku marketing spend, the firm's operating profit would have been positive. They anticipate moving into profitability within a year. Softbank was once a rising star in the tech industry but faced challenges after the tech bubble burst; however, they gained a high-profile return with their acquisition of Japan Telecom, a top telecoms company. Their broadband internet division reached pole position in Japan by December 2019 with over 5.1 million subscribers.", "granite3.1-dense:2b": "Softbank, a prominent Japanese communications company and high-speed internet provider, expanded its losses by 7.5 billion yen (approximately $71.5 million or £38.4 million) in Q4 2005 due to substantial investments in its low-cost phone service, \"Otoku\". Despite garnering nearly 900,000 orders for the bargain service launched in December, Softbank anticipates turning a profit from its broadband internet division by 2006. The company's financial struggles can be traced back to the 1990s tech boom, which left it reeling after the subsequent collapse of the dot-com bubble. Its recent resurgence was marked by the acquisition of Japan Telecom, the third-largest fixed-line telecommunications firm in Japan, enabling Softbank's broadband internet division to amass over 5.1 million subscribers by December 2005.", "reference": "The firm, a market leader in high-speed internet, had an operating loss for the three months to December of 7.5bn yen ($71.5m; £38.4m).Japanese communications firm Softbank has widened losses after heavy spending on a new cut-rate phone service.The service, launched in December and dubbed \"Otoku\" or \"bargain\", has had almost 900,000 orders, Softbank said.The acquisition spurred its broadband internet division to pole position in the Japanese market, with more than 5.1 million subscribers at the end of December."}