{"raw_text": "Aviation firms eye booming India\n \n India's defence minister has opened the country's Aero India 2005 air show with an invitation for global aerospace firms to outsource jobs to the nation.\n \n Pranab Mukherjee said such companies could take advantage of India's highly skilled workers and low wages. More than 240 civil and military aerospace firms from 31 countries are attending the show. Analysts said India could spend up to $35bn (£18.8bn) in the aviation market over the next 20 years. Giants such Boeing and Airbus - on the civil aviation front - as well as Lockheed Martin and France's Snecma - on the military side - are some of the firms attending the show. \"There is tremendous scope for outsourcing from India in areas where the companies are competitive,\" said Mr Mukerjee. \"We are keen to welcome international collaborations that are in conformity with our national goals.\"\n \n Lockheed said it had signed an agreement with state-owned Hindustan Aeronautics (HAL) to share information on the P-3 Orion maritime surveillance aircraft.\n \n In fact, the Indian Armed Force is considering the buying of used P-3 Orion as well as F-16 fighter jets from Lockheed. The US military industry has show a strong interest to open a link with India, now that relations between the two countries have improved a lot. In fact, it is the first time the US Air Force will attend the air show since sanctions imposed in 1998 after India's nuclear tests were lifted. But the Indian Air Force is also considering proposals from other foreign firms such as France's Dassault Aviation, Sweden's Saab and Russia's Mikoyan-Gurevich. Meanwhile, France's Snecma has also said it plans a joint venture with HAL to make engine parts, with an initial investment of $6.5m.\n \n On the civilian front, Boeing announced a deal with India's HCL Technologies to develop a platform for the flight test system of its 787 Dreamliner aircraft. The US company also said it had agreed with a new Indian budget airline the sale of 10 737-800 planes for $630m. The airline, SpiceJet, will also have the option to acquire 10 more aircraft. Airbus has also recently signed fresh deals with two Indian airlines - Air Deccan and Kingfisher. In addition, the European company has plans to open a training centre in India. Meanwhile, flag carrier Air India is considering to buy 50 new aircraft from either Boeing or Airbus. \"No other market is going to see the growth that will be seen here in the coming years,\" said Dinesh Keskar, senior vice president Boeing.\n", "llama3.2:1b": "India's defence minister Pranab Mukherjee has invited global aerospace firms to outsource jobs in the country. The Indian Armed Force is considering buying used P-3 Orion and F-16 fighter jets from Lockheed Martin, while also looking at other foreign companies such as France's Dassault Aviation and Russia's Mikoyan-Gurevich.", "llama3.2:3b": "India's defence minister invites global aerospace firms to outsource jobs to India due to highly skilled workers and low wages. Over 240 firms from 31 countries attend Aero India 2005, including Boeing, Airbus, Lockheed Martin, and Snecma. India may spend up to $35bn in the aviation market over 20 years.", "gemma2:2b": "India's Aero India air show attracted many aerospace firms, with Indian Defense Minister inviting international companies to leverage its skilled workforce and low wages for outsourcing opportunities.  Giants such as Boeing, Airbus, Lockheed Martin, and Snecma are attending the show, discussing collaborations on military projects like P-3 Orion aircraft, fighter jets, and engine parts.  Civil aviation deals include Boeing's partnership with HCL Technologies for the 787 Dreamliner, sales of Boeing and Airbus planes to Indian airlines, and plans by Air India to purchase new aircraft. The market is expected to grow rapidly in India over the next two decades. \n", "qwen2.5:0.5b": "Aviation firms are eyeing large investment opportunities in India due to its skilled workforce and low cost of living, including companies such as Boeing, Airbus, Lockheed Martin, and France's Snecma. Indian firms like Hindustan Aeronautics have also shown interest in buying used aircraft and selling them to multinational aerospace companies for the potential $35 billion market over the next 20 years. Other international aerospace firms are also considering similar deals with India.", "qwen2.5:1.5b": "India's military and defense industries are attracting foreign firms for outsourcing jobs due to skilled labor and lower wages. Major aerospace companies like Boeing and Airbus have agreements with Indian firms to sell aircraft and engine parts. The Indian Air Force is exploring partnerships with other countries including France, Sweden, Russia, and Dassault Aviation.", "qwen2.5:3b": "India's Aero India 2005 air show attracts global aerospace firms with offers of outsourcing jobs due to skilled workers and low wages. The Indian Armed Forces are considering purchasing used P-3 Orion and F-16 fighter jets from Lockheed Martin. In the civilian sector, Boeing has signed a deal with HCL Technologies for the Dreamliner aircraft platform development and sold 10 737-800 planes to SpiceJet worth $630m. Airbus also signed deals with Indian airlines Air Deccan and Kingfisher. Meanwhile, France's Snecma plans a joint venture with HAL for engine parts production. Analysts estimate India could spend up to $35bn on the aviation market over the next 20 years.", "opencoder:1.5b": "Aviation firms eye booming India.\n\nIndia's defence minister has opened the country's Aero India 2005 air show with an invitation for global aerospace firms to outsource jobs to the nation.\n\nPranab Mukherjee said such companies could take advantage of India's highly skilled workers and low wages. More than 240 civil and military aerospace firms from 31 countries are attending the show.\n\nAnalysts said India could spend up to $35bn (£18.8bn) in the aviation market over the next 20 years. Giants such as Boeing and Airbus - on the civil aviation front - as well as Lockheed Martin and France's Snecma - on the military side - are some of the firms attending the show.\n\nLockheed had signed an agreement with state-owned Hindustan Aeronautics (HAL) to share information on the P-3 Orion maritime surveillance aircraft. In fact, the Indian Armed Force is considering the buying of used P-3 Orion as well as F-16 fighter jets from Lockheed.\n\nThe US military industry has shown a strong interest in India's relations since 1998 after India's nuclear tests were lifted. But the Indian Air Force is also considering proposals from other foreign firms such as France's Dassault Aviation, Sweden's Saab and Russia's Mikoyan-Gurevich.\n\nOn the civilian front, Boeing announced a deal with India's HCL Technologies to develop a platform for the flight test system of its 787 Dreamliner aircraft. The US company also agreed on a new Indian budget airline the sale of 10 737-800 planes for $630m.\n\nSpiceJet, the airline, will have the option to acquire 10 more aircraft. Airbus has recently signed fresh deals with two Indian airlines - Air Deccan and Kingfisher. In addition, the European company has plans to open a training centre in India.\n\nMeanwhile, flag carrier Air India is considering to buy 50 new aircraft from either Boeing or Airbus.\n", "smollm:1.7b": "India's defence minister has opened the country's Aero India 2005 air show with an invitation for global aerospace firms to outsource jobs to the nation. The Indian government is keen on welcoming international collaborations that are in conformity with its national goals and is considering proposals from other foreign firms such as France's Dassault Aviation, Sweden's Saab and Russia's Mikoyan-Gurevich. Meanwhile, France's Snecma has also said it plans a joint venture with HAL to make engine parts, with an initial investment of $6.5m. The US military industry is considering the buying of used P-3 Orion as well as F-16 fighter jets from Lockheed and the Indian Air Force (IAF) is considering the buying of 10 737-800 planes for $630m. The IAF has also announced a deal with a new Indian budget airline, SpiceJet, to develop a platform for the flight test system of its 787 Dreamliner aircraft. Airbus has also recently signed fresh deals with two Indian airlines - Air Deccan and Kingfisher - and is considering to buy 50 new aircraft from either Boeing or Airbus. \"No other market is going to see the growth that will be seen here in the coming years,\" said Dinesh Keskar, senior vice president Boeing.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about India's Aero India 2005 air show. First, I'll read through it carefully.\n\nThe main points are: India is hosting a big air show inviting aerospace firms to outsource jobs. There are over 240 companies from around the world attending. The industry will grow up to $35 billion by 2023.\n\nKey companies include Boeing, Airbus, Lockheed Martin, Snecma, Hindustan Aeronautics, and several others.Lockheed had a deal with HCL Technologies for developing parts for their planes. India is also considering buying used P-3 ORions and F-16s from these firms. The US military is interested in this too because relations between the two countries have improved.\n\nOn the civilian side, Boeing agreed to develop a platform for the 787 Dreamliner. India's budget airline sold 10 planes worth $630 million. Air India is looking to buy 50 new planes from either Boeing or Airbus. Indian flag carrier Air India is considering buying some new aircraft.\n\nI need to make sure I include all these key points concisely without adding any extra information.\n</think>\n\nIndia's Aero India 2005 air show will host an invitation for global aerospace firms, with over 240 companies from 31 countries attending. The industry is expected to grow up to $35bn by 2023, including giants like Boeing and Airbus on civil and military fronts. Lockheed Martin signed an agreement with Hindustan Aeronautics (HAL) for sharing information on the P-3 Orion aircraft. India's military force, however, will soon host the event after a tough period due to sanctions lifted in 1998. The US Air Force is also considering buying used P-3 ORions and F-16s from Lockheed Martin. France's Snecma has planned a joint venture with Hindustan Aeronautics for engine parts. Boeings announced a deal with HCL Technologies to develop the flight test system for 787 Dreamliner planes, while India is considering purchasing 10 new planes for $630m and 10 more. Air India is also looking to buy 50 planes from Boeing or Airbus. Dinesh Keskar stated that no other market will see growth as significant in the coming years.", "tinyllama:1.1b": "Aviation firmships eye booming India with an invitation for global aerospace firms to outsource jobs to the nation as they look to capitalize on the country's highly skilled workforce and low wages. Over $35bn is expected to be spent in the aviation market over the next 20 years, with more than 240 civil and military aerospace firms from 31 countries attending the Aerosoft India 2005 air show. In addition, international collaboration agreements have been signed between the Indian Armed Force and American companies including Lockheed Martin to share information on the P-3 Orion surveillance aircraft, F-16 fighter jets, and 787 Dreamliner aircraft. While France's Dassault Avionics has also expressed interest in a joint venture with HAL to make engine parts. Meanwhile, Boeing announced a partnership with HCL Technologies to develop a platform for flight test systems of its Dreamliner aircraft, and a $630m deal with Spicejet for 10 737-800 planes. Airbus has also signed fresh deals with Indian airlines including Kingfisher Airlines to have the option to acquire more planes. The country's flag carrier, Air India, is considering buying up to 50 new aircraft from either Boeing or Airbus.", "tinydolphin:1.1b": " Indian Aero Industry: The Aviation firms eye booming India, attracting global companies. India's defence minister has opened the country's Aero India 2005 air show with an invitation for global aerospace firms to outsource jobs to the nation. More than 240 civil and military aerospace firms from 31 countries are attending the event, highlighting India's potential growth in the aviation sector.", "phi:2.7b": " Aviation firms are eyeing opportunities in India's booming market. The Indian defence minister has invited global aerospace companies to outsource jobs to the nation, with its skilled workers and low wages. More than 240 civil and military aerospace firms from 31 countries will attend Aero India 2005. Analysts predict that India could spend up to $35bn on aviation over the next 20 years. Giants such as Boeing and Airbus are attending the show, while Lockheed Martin and France's Snecma have signed deals with Indian companies. The Indian Armed Force is considering buying used P-3 Orion aircraft and F-16 fighter jets from Lockheed, indicating a strong interest in US military industry collaboration. Other foreign firms like Dassault Aviation, Saab, and Mikoyan-Gurevich are also considering proposals. France's Snecma plans to establish a joint venture with HAL to make engine parts. On the civilian front, Boeing has signed deals with HCL Technologies and SpiceJet, while Airbus has agreed to train Indian airlines. Air India is also exploring options for new aircraft from either company.\n", "orca-mini:3b": " India's defence minister opened the Aero India 2005 air show with an invitation for global aerospace firms to outsource jobs to the nation. Lockheed Martin and France's Snecma are some of the firms attending the show. Analysts said India could spend up to $35bn (£18.8bn) in the aviation market over the next 20 years. Boeing and Airbus - on the civil aviation front - as well as Lockheed Martin and France's Snecma - on the military side - are some of the firms attending the show. India's HCL Technologies and SpiceJet have agreed to develop a platform for the flight test system of Boeing's 787 Dreamliner aircraft, while Air India is considering to buy 50 new aircraft from either Boeing or Airbus. Boeing has also signed fresh deals with two Indian airlines - Air Deccan and Kingfisher.", "hermes3:3b": "Aviation firms interested in India's booming aviation market, as defense minister invites outsourced jobs and collaboration. Potential $35bn investment over next 20yrs from companies like Boeing, Airbus, Lockheed Martin & Snecma.", "stablelm-zephyr:3b": "India's defence minister opened the Aero India 2005 air show by inviting global aerospace firms to outsource jobs to India, citing the country's skilled workers and low wages. Analysts predict India will spend up to $35bn on the aviation market over the next 20 years, with giants like Boeing, Airbus, Lockheed Martin, and France's Snecma attending the show. The Indian Armed Force is considering buying used P-3 Orion and F-16 fighter jets from various companies, including Lockheed and Dassault Aviation. On the civilian front, Boeing signed deals with Indian airlines such as HCL Technologies, SpiceJet, Air Deccan, and Kingfisher, while Airbus plans to open a training center in India.", "chatgpt-4o-latest": "India's defence minister, Pranab Mukherjee, opened Aero India 2005 by inviting global aerospace firms to outsource jobs to India, citing skilled labor and low wages. Over 240 firms from 31 countries attended, with India expected to spend up to $35 billion in aviation over 20 years. Major companies like Boeing, Airbus, Lockheed Martin, and Snecma participated. Lockheed signed an agreement with Hindustan Aeronautics (HAL) and is in talks to sell P-3 Orion and F-16 jets to India. The US military industry is strengthening ties with India, marking the first US Air Force presence at the show since 1998 sanctions were lifted. India is also considering offers from France's Dassault, Sweden's Saab, and Russia's Mikoyan-Gurevich. On the civilian side, Boeing partnered with HCL Technologies for its 787 Dreamliner and secured a $630 million deal with budget airline SpiceJet. Airbus signed agreements with Air Deccan and Kingfisher and plans a training center in India. Air India is evaluating a purchase of 50 aircraft from Boeing or Airbus. Boeing's senior VP highlighted India's unmatched aviation growth potential.", "stablelm2:1.6b": "India's defense minister invites global aerospace firms to outsource jobs due to its skilled workforce and low wages at the Aero India air show. Over 100 civil and military aerospace companies attend, with opportunities for $bn in aviation market growth over the next years. Giants like Boeing, Airbus, Lockheed Martin, and Snecma are present alongside Indian firms. The US military industry shows interest due to improved relations, while French Dassault Aviation also aims for a joint venture with HAL. In the civilian sector, deals include Boeing's partnership with HCL Technologies, and Airbus's agreements with Air Deccan and Kingfisher.", "granite3.1-dense:2b": "India's Defense Minister Pranab Mukherjee has invited global aerospace firms to outsource jobs to India, highlighting the country's skilled workforce and low wages. Over 240 civil and military aerospace companies from 31 nations are attending Aero India 2005 in Bangalore. Analysts project India could invest up to $35 billion in aviation over the next two decades, with major players like Boeing and Airbus on the civilian front and Lockheed Martin, Snecma, Dassault Aviation, Saab, and Mikoyan-Gurevich on the military side.\n\nLockheed has signed an agreement with HAL to share P-3 Orion maritime surveillance data, and India is considering buying used P-3 Orions and F-16 fighter jets from Lockheed. The US Air Force will attend the air show for the first time since 1998 due to improved relations between the two countries. Other foreign firms like Dassault Aviation, Saab, and Mikoyan-Gurevich are also expressing interest in India's market.\n\nOn the civilian side, Boeing has partnered with HCL Technologies for 787 Dreamliner flight test system development and will sell 10 737-800 planes to SpiceJet, with potential for more. Airbus has recently signed deals with Air Deccan and Kingfisher, plans to open a training center in India, and is considering a large purchase of new aircraft by Air India from Boeing or Airbus. Boeing's Dinesh Keskar emphasizes India's potential for significant aviation growth.", "reference": "The US company also said it had agreed with a new Indian budget airline the sale of 10 737-800 planes for $630m.Giants such Boeing and Airbus - on the civil aviation front - as well as Lockheed Martin and France's Snecma - on the military side - are some of the firms attending the show.Airbus has also recently signed fresh deals with two Indian airlines - Air Deccan and Kingfisher.Meanwhile, flag carrier Air India is considering to buy 50 new aircraft from either Boeing or Airbus.India's defence minister has opened the country's Aero India 2005 air show with an invitation for global aerospace firms to outsource jobs to the nation.But the Indian Air Force is also considering proposals from other foreign firms such as France's Dassault Aviation, Sweden's Saab and Russia's Mikoyan-Gurevich.The US military industry has show a strong interest to open a link with India, now that relations between the two countries have improved a lot.Meanwhile, France's Snecma has also said it plans a joint venture with HAL to make engine parts, with an initial investment of $6.5m."}