{"raw_text": "Feta cheese battle reaches court\n \n A row over whether only Greece should be allowed to label its cheese feta has reached the European Court of Justice.\n \n The Danish and German governments are challenging a European Commission ruling which said Greece should have sole rights to use the name. The Commission's decision gave the same legal protection to feta as to Italian Parma ham and French Champagne. But critics of the judgement say feta is a generic term, with the cheese produced widely outside Greece.\n \n The Commission's controversial 2002 ruling gave \"protected designation of origin\" status to feta cheese made in Greece, effectively restricting the use of the feta name to producers there.\n \n From 2007 onwards, Greek firms will have the exclusive use of the feta label and producers elsewhere in Europe must find another name to describe their products. The German and Danish governments argue that feta does not relate to a specific geographical area and that their firms have been producing and exporting the cheese for years. \"In our opinion it is a generic designation and we do not have any other name or term for this type of cheese,\" Hans Arne Kristiansen, a spokesman for the Danish Dairy Board, told the BBC. Denmark is Europe's second largest producer of feta after Greece - producing about 30,000 tonnes a year - and exports its products to Greece. It is concerned that the ruling could threaten the production of other cheeses in Denmark such as brie. \"It would cost millions if we wanted to introduce a new designation,\" Mr Kristiansen said. \"That is just one of the costs.\"\n \n The case will also have a major impact on Britain's sole feta producer, Yorkshire company Shepherds Purse Cheeses.\n \n Judy Bell, the company's founder, said it would cost a huge amount to rebrand its product. \"If we lose we will have to go through a massive re-merchandising process and reorganisation,\" she said. \"We have never tried to pull the wool over anyone's eyes - it's very clear from the label that it's Yorkshire feta.\" The original decision was a victory for Greece, where feta cheese is believed to have been produced for about 6,000 years. Feta is a soft white cheese made from sheep or goat's milk, and is an essential ingredient in Greek cuisine. Greece makes 115,000 tonnes, mainly for domestic consumption. The Court is expected to reach a verdict in the case in the autumn.\n", "llama3.2:1b": "A row over whether Greece should be allowed to use its name on feta cheese has reached the European Court of Justice, challenging a Commission ruling that gave \"protected designation of origin\" status to Greek-made feta.\n\nGreece's claim that feta is only made in Greece and thus deserves sole rights for labeling it. However, critics argue that feta is a generic term with widespread production outside Greece.\n\nThe Danish and German governments are challenging the ruling, citing concerns about the impact on their own cheese producers who have been producing feta since 2007.", "llama3.2:3b": "The European Court of Justice will hear a case over whether Greece has exclusive rights to label its cheese \"feta\". Denmark and Germany are challenging a Commission ruling giving Greece sole protection for the name, citing that feta is a generic term produced outside Greece. The decision could impact British company Shepherds Purse Cheeses and affect other European cheese producers.", "gemma2:2b": "A legal battle over feta cheese labels has reached the European Court of Justice.  The Danish and German governments are challenging a ruling that gave Greek producers exclusive rights to use the \"feta\" name, while critics argue that feta is a generic term used globally. The case will impact UK producer Shepherds Purse Cheeses which relies on the feta label for marketing. \n", "qwen2.5:0.5b": "Greece gained exclusive rights to label feta cheese globally due to a ruling from the European Commission that Greece should have sole access to the term \"feta.\" Critics argue that feta has no specific geographical association and disagree with the decision, citing a 2002 EU ruling which granted protected designation of origin status. Denmark and Germany are challenging this judgement in the European Court of Justice, with Danish dairy firms stating it would be difficult to introduce a new designator for their products without causing major disruptions. This case could impact Britain's feta producer Shepherds Purse Cheeses, whose label warns consumers that they may need to go through rebranding and reorganisation.", "qwen2.5:1.5b": "Greece has lost its exclusive right to label feta cheese as \"Greek\" after European courts ruled that it should be granted generic protection instead, sparking a legal battle between Denmark and Germany over the name. Greece's dairy industry faces increased competition from other EU countries producing similar cheese. In response, Denmark plans significant rebranding costs for producers but maintains its right to market feta cheeses as Danish under the original ruling. The case has implications for Britain's sole producer of authentic Greek feta.", "qwen2.5:3b": "A row over feta cheese labeling has reached the European Court of Justice, with Denmark and Germany challenging a EU Commission ruling granting sole rights to Greece for using \"feta.\" This decision grants similar protection to Italian Parmigiano-Reggiano and French Champagne, but critics argue it restricts use of the term as generic. The Commission's 2002 ruling gave feta cheese from Greece protected designation of origin status, allowing only Greek producers exclusive use of the label. This has affected Denmark, which is Europe’s second-largest feta producer after Greece, while also impacting Britain's sole feta company, Shepherds Purse Cheeses, and potentially other cheeses like brie in Denmark. The case will determine if feta can be exclusively used by Greek producers or more widely across the EU.", "opencoder:1.5b": "The feta cheese battle reached court in response to the Danish government's controversial ruling which said that feta cheese should only be used in Greece. The decision, although protected, would allow for other uses outside of Greece, enhancing the economic potential of the feta cheese market.\n\nFrom 2007 onwards, Greek firms will have the exclusive use of the feta label and producers elsewhere in Europe must find another name to describe their products. However, the Danish and German governments argue that feta does not relate to a specific geographical area, indicating that its production is shared by more European countries than Greece.\n\nIt is critical to consider that the ruling could threaten the production of other international cheese economies such as Denmark where brie is currently produced. The case also has a significant impact on Britain's sole feta producer, Yorkshire company Shepherds Purse Cheeses who argues it would cost a massive amount to rebrand its product.\n\nJudy Bell, the Danish government's founder, expressed concerns about the potential for mass re-merchandising and reorganisation if the ruling is taken. She mentioned that the case will require careful analysis and strategic planning to prevent disruptions to the operations of the company.\n", "smollm:1.7b": "The summary should be:\nFeta cheese battle reaches court, with Denmark and Germany challenging European Commission ruling that only Greece has exclusive rights to feta. The Danish and German governments argue that feta does not relate to a specific geographical area and that their firms have been producing and exporting the cheese for years.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about a cheese battle over feta cheese in Europe. Let me read through it carefully.\n\nThe main points are that the European Court of Justice has ruled on whether only Greece can label its feta cheese. The Danish and German governments are challenging the ruling which gave them exclusive rights for their own products but not others. They argue feta is a generic term, so it doesn't belong to any specific place.\n\nShepherd's Purse Cheese Company in Yorkshire wants to change their product's name because of this ruling. They would have to rebrand, costing millions. The original ruling was a win for Greece, giving them the exclusive use of feta across Europe. Denmark is the second largest producer and exporter after Greece, with about 30,000 tonnes per year.\n\nSo I need to capture all these key points: the ruling, the challenges from Danish and German governments, the idea that feta is generic, Shepherds Purse's concern, their cost of rebranding, the original success in Greece, Denmark's role as a big producer and exporter, and when the court might decide.\n\nI should make sure to include all these elements concisely without adding extra details. Also, the summary needs to be plain text only.\n</think>\n\nThe European Court of Justice has ruled on whether only Greece can label its feta cheese. Danish and German governments challenge a ruling that granted them exclusive rights for their own products but not others. Feta is considered generic and non-specific, so it's not tied to any particular geographic area.\n\nShepherd's Purse Cheese Company in Yorkshire faces a significant cost if they rebrand their product. They would have to spend millions to change the label from theirs to something else. The original ruling was a win for Greece, giving them exclusive use of feta across Europe. Denmark is the second largest producer and exporter after Greece, producing about 30,000 tonnes per year.\n\nThe case is expected to be resolved by the autumn court decision.", "tinyllama:1.1b": "Leading up to a major court ruling on whether only Greece should be allowed to label its cheese feté with a protected designation of origin (PDO), Denmark and Germany have challenged the EU Commission's controversial decision, arguing that feté is not a geographical name but instead a generic term. The EU Commission ruled in 2002 that feté must be labelled as such by Greek firms since it is a \"designation of origin\" with exclusive use. However, Danish and German authorities have stated that feté does not refer to a specific area and cannot be used to describe other cheeses in Europe, while the EU Commission's ruling will lead to significant changes to Britain's sole feté producer Shepherds Purse Cheeses. The case is expected to reach a verdict in the autumn, with a major impact on Britain's only feté producer Yorkshire cheese company Shepherds Purse Cheeses.", "tinydolphin:1.1b": " In this text, the sentence \"A row over whether only Greece should be allowed to label its cheese feta has reached the European Court of Justice\" is presented as a brief summary, while the main idea and reasoning are detailed below: The European Commission made a decision in 2002 regarding the use of the Greek label 'feta' for cheese produced outside Greece. Critics argue that this label does not accurately describe feta as a specific geographical area, which they believe should be reserved for producers in Greece only. This situation has led to an ongoing legal battle between different nations regarding who is allowed to use the name 'feta' for their products.", "phi:2.7b": " The European Court of Justice (ECJ) has been asked to rule on whether only Greece should be allowed to label its cheese feta or if other countries can use the name as well. This debate began with the Commission's decision in 2002 that gave feta cheese made in Greece protected designation of origin status, which means producers in other European countries must find another name for their products. Denmark and Germany are challenging this ruling because they believe feta is a generic term for a type of cheese and have been producing it for many years. The case will also affect Britain's only feta producer. Shepherds Purse Cheeses, based in Yorkshire, may need to rebrand its product if the Commission's decision is upheld. Greece has been making feta cheese for over 6,000 years and makes about 115,000 tonnes of it a year.\n", "orca-mini:3b": " The text reports on a court battle over the European Commission's ruling that Greece should have sole rights to use the name \"feta\" for its cheese. The Danish and German governments are challenging this decision, arguing that feta is a generic term and that their firms have been producing and exporting the cheese for years. The case could have major implications for British feta producer Shepherds Purse Cheeses and could reach a verdict in the autumn.", "hermes3:3b": "Feta cheese name dispute (European Court of Justice) (Greece sole feta rights vs Denmark/Germany challenge)", "stablelm-zephyr:3b": "The European Court of Justice is involved in a dispute over whether only Greece should be allowed to label its cheese feta. Danish and German governments are challenging a European Commission ruling that gave Greece sole rights to use the name, similar to Italian Parma ham and French Champagne. Critics argue that feta is a generic term for cheese produced widely outside Greece. The case will impact Britain's sole feta producer, Shepherds Purse Cheeses, and has major implications for Denmark as it is Europe's second largest producer of feta after Greece. The Court is expected to reach a verdict in the fall.", "chatgpt-4o-latest": "A legal dispute over the exclusive use of the name \"feta\" has reached the European Court of Justice, with Denmark and Germany challenging a European Commission ruling that grants Greece sole rights to the name. The 2002 ruling gave feta the same \"protected designation of origin\" status as Parma ham and Champagne, restricting its use to Greek producers from 2007 onwards. Denmark and Germany argue that feta is a generic term and that their producers have been making and exporting it for years. Danish officials warn that renaming their cheese would be costly and could set a precedent affecting other cheeses. The ruling also impacts Britain's only feta producer, Shepherds Purse Cheeses, which faces significant rebranding costs. Greece, which produces 115,000 tonnes of feta annually, claims historical ties to the cheese, which is a staple of its cuisine. A court verdict is expected in the autumn.", "stablelm2:1.6b": "A dispute over whether Greece should be exclusively labeled as \"feta\" cheese has reached the European Court of Justice. Denmark and Germany are challenging a European Commission ruling that granted similar protection to feta cheese produced in Greece, overriding its generic status. Critics argue that the term doesn..\n- The Danish and German governments challenge the decision because they claim feta is not specific to Greece.\n- Greek firms have been given protected designation of origin rights, making them exclusive users of the feta label.\n- Other European producers are required to find an alternative name for their cheese products.\n- This case will also impact British feta producer Shepherds Purse Cheeses and has major implications on production costs in Denmark, especially brie.", "granite3.1-dense:2b": "The European Court of Justice is set to decide whether only Greece should have exclusive rights to label its cheese feta. Denmark and Germany challenge this, arguing that feta is a generic term for a widely produced soft white cheese made from sheep or goat's milk, which they've been manufacturing and exporting for years. The 2002 Commission ruling granted Greek feta \"protected designation of origin\" status, restricting its use to producers in Greece and potentially impacting cheese production in Denmark and the UK's sole producer, Shepherds Purse Cheeses. If the court rules against them, Denmark and Britain would face significant costs for rebranding their feta products. The case is expected to be decided in autumn.", "reference": "The Commission's controversial 2002 ruling gave \"protected designation of origin\" status to feta cheese made in Greece, effectively restricting the use of the feta name to producers there.A row over whether only Greece should be allowed to label its cheese feta has reached the European Court of Justice.The original decision was a victory for Greece, where feta cheese is believed to have been produced for about 6,000 years.But critics of the judgement say feta is a generic term, with the cheese produced widely outside Greece.Denmark is Europe's second largest producer of feta after Greece - producing about 30,000 tonnes a year - and exports its products to Greece.The Danish and German governments are challenging a European Commission ruling which said Greece should have sole rights to use the name.The German and Danish governments argue that feta does not relate to a specific geographical area and that their firms have been producing and exporting the cheese for years.Feta is a soft white cheese made from sheep or goat's milk, and is an essential ingredient in Greek cuisine."}