{"raw_text": "Khodorkovsky ally denies charges\n \n A close associate of former Yukos boss Mikhail Khodorkovsky has told a court that fraud charges levelled against him are \"false\".\n \n Platon Lebedev has been on trial alongside Mr Khodorkovsky since June in a case centring around the privatisation of a fertiliser firm. The pair claim they are being punished by the authorities for the political ambitions of Mr Khodorkovsky. Mr Lebedev said there were \"absurd contradictions\" in the case. Opening his defence, he said he could not see the legal basis of the charges he faced, which also include allegations of tax evasion. \"To my embarrassment, I could not understand the file of complaints against me,\" he told a Moscow court. Mr Lebedev headed the Menatep group, the parent company of Yukos.\n \n Mr Lebedev and Mr Khodorkovsky, who each face a possible 10 year jail sentence if convicted, will be questioned by a judge over the next few days. Mr Khodorkovsky began his testimony last week, telling the court that he objected to the way that the \"running of a normal business has been presented as a work of criminal fiction\". The charges are seen by supporters as politically motivated and part of a drive by Russian President Vladimir Putin to rein in the country's super-rich business leaders, the so-called oligarchs. Yukos has been presented with a $27.5bn (£13bn) tax demand by the Russian authorities and its key Yugansk division was auctioned off to part settle the bill. The company's effort to gain bankruptcy protection in the US - in a bid to win damages for the sale - were dismissed by a court in Texas.\n", "llama3.2:1b": "Platon Lebedev, a close associate of Mikhail Khodorkovsky, denies charges that he is involved in fraud and tax evasion related to his role at Yukos, a company privatized by Khodorkovsky. Lebedev claims there are \"absurd contradictions\" in the case.", "llama3.2:3b": "Platon Lebedev, ally of former Yukos boss Mikhail Khodorkovsky, denies charges of fraud and tax evasion in Moscow court, calling them \"absurd contradictions\". He claims he is being punished for Khodorkovsky's political ambitions, which are seen as part of a drive by President Putin to crack down on oligarchs.", "gemma2:2b": "A close associate of former Yukos boss Mikhail Khodorkovsky, Platon Lebedev, has denied fraud charges against him and claims they are politically motivated. He also expressed confusion about the legal basis of the accusations. Lebedev's defense is that he is being punished for Mr. Khodorkovsky's political ambitions.  Mr. Lebedev and Mr. Khodorkovsky face potential 10-year prison sentences if convicted. Supporters view these charges as politically motivated, part of a larger effort by President Putin to curtail the power of Russia's wealthy business leaders (the \"oligarchs\"). Yukos has been subject to hefty tax demands and asset sales related to unpaid taxes.  \n", "qwen2.5:0.5b": "A close associate of former Yukos boss Mikhail Khodorkovsky has admitted to the prosecution that fraud charges against him are \"false\", while leading him to be on trial alongside Mr Khodorkovsky since June in a case centered around the privatisation of a fertiliser firm.", "qwen2.5:1.5b": "A former Yukos executive denies fraud charges against him, stating there are \"absurd contradictions\" and no legal basis for the allegations of tax evasion. The case revolves around political persecution targeting wealthy oligarchs.", "qwen2.5:3b": "Khodorkovsky’s ally, Platon Lebedev, denies fraud charges leveled against him and claims they are false. Both Khodorkovsky and Lebedev are facing possible 10-year jail sentences. Lebedev argues there are political motivations behind the case, seeing it as part of President Putin's effort to control oligarchs. They contest tax evasion allegations and present the charges as a fictional portrayal of their normal business activities.", "opencoder:1.5b": "A close associate of former Yukos boss Mikhail Khodorkovsky has told a court that fraud charges levied against him are \"false\". Platon Lebedev, who was on trial alongside Mr Khodorkovsky since June, is being prosecuted for political ambition by the authorities. He said there were \"absurd contradictions\" in the case, which also include allegations of tax evasion. Mr Lebedev's defence said he could not see the legal basis of the charges. The court has ordered a 10-year jail sentence if the accused is found guilty. The evidence is clear, and Mr Khodorkovsky objected to his way of running a normal business. The company's effort to gain bankruptcy protection in the US was dismissed by the court in Texas, parting with $27.5bn (£13bn) tax demand.\n", "smollm:1.7b": "The summary should preserve the main ideas of the original text, including:\n\n1. The key points about Khodorkovsky and his alleged fraud charges against him.\n2. The allegations of tax evasion and other legal issues surrounding the case.\n3. The opposition to Mr Lebedev's defense by Mr Khodorkovsky.\n4. The opening statements from both Mr Lebedev and Mr Khodorkovsky, which provide context for their positions in the case.", "deepseek-r1:1.5b": "<think>\nOkay, I need to help summarize this text about two Russian business associates being questioned in a case involving fraud and oligarchs. Let me read through it carefully.\n\nSo, there's someone named Khodorkovsky who is now under investigation for fraud charges. He has a close associate, Platon Lebedev, on trial since June. They're both accused of using political motives to gain favor with the government. The case revolves around the privatisation of a fertilizer company and related tax demands.\n\nPlaton Lebedev's defense seems focused on legal challenges but also accuses the case's creators of being politically motivated. They mention things like absurd contradictions in the complaints against them, which support their claims that the charges are based on ulterior motives.\n\nThey won't be questioned immediately, with Khodorkovsky starting his testimony last week but objecting to how the business's operations have been framed as criminal fiction. The authorities are dismissing a $27 billion tax demand by Russia and the auction of Yugansk division for part of it. Yukos is trying to secure bankruptcy protection in the U.S., which was denied by Texas court.\n\nI need to make sure I capture all these key points without adding anything else. Just the summary as plain text with no explanations or formatting.\n</think>\n\nPlaton Lebedev and Mikhail Khodorkovsky are both under investigation for fraud charges, allegations of political motives, and related tax demands. They will not be questioned immediately; Khodorkovsky is starting his testimony last week but faces questioning over claims the business operations were framed as criminal fiction. The case involves a $27 billion tax demand and a part of Yugansk division being sold to settle the bill. Yukos faces potential bankruptcy protections in the U.S., which were denied by Texas court.", "tinyllama:1.1b": "Khodorkovsky denies charges of fraud, false charges against him\n\nA close associate of former Yukos bosse Mikhail Khodorkovsky has told a Moscow court that accusations of fraud are \"false\". Platon Lebedev, who also faces legal proceedings, says there are \"absolutely absurd contradiction[s]\" in the case. The charges against Mr Khodorkovsky stem from allegations he is being punished by authorities for political ambitions of his boss Mikhail Khodorkovsky. In a surprise turnaround, Mr Lebedev declared that the \"running of a normal business has been presented as a work of criminal fiction\". The case is seen by supporters as part of a drive to rein in Russia's super-rich business leaders, known as the \"oligarcs\", with YuKos being presented with a $27.5bn (£13bn) tax demand, with its key YuKan division auctioned off and a bankruptcy protection bid for it rejected by a US court in Texas.", "tinydolphin:1.1b": " Khodorkovsky's associate, Platon Lebedev, has denied any wrongdoing and insists he is being persecuted due to his political ambitions. He claims there are \"absurd contradictions\" in the case against him, which also includes allegations of tax evasion. The court proceedings center around the privatisation of a fertiliser firm, Yukos, where Khodorkovsky was involved.", "phi:2.7b": " Platon Lebedev, an associate of former Yukos boss Mikhail Khodorkovsky, denies fraud charges that are said to be politically motivated and accuses the authorities of punishing them for Mr Khodorkovsky's political ambitions. The Menatep group is the parent company of Yukos, which has been presented with a $27.5 billion tax demand by the Russian authorities and its key Yugansk division was auctioned off to settle the bill.\n", "orca-mini:3b": " Platon Lebedev, a close associate of Mikhail Khodorkovsky, has denied charges against him and questioned the legal basis of the charges. The pair claim political motives for the charges, which include tax evasion and fraud. The Menatep group was owned by Yukos and the charges were presented by Russian authorities as part of their efforts to rein in super-rich business leaders. Mr Khodorkovsky began his testimony, stating that he disagreed with how a normal business transaction was presented as criminal evidence. Yukos faced a $27.5bn tax demand and its Yugansk division was auctioned off to settle the bill. The company's bankruptcy protection request in the US was dismissed by a court in Texas.", "hermes3:3b": "Khodorkovsky ally denies fraud charges, claims case politically motivated.", "stablelm-zephyr:3b": "A close associate of former Yukos boss Mikhail Khodorkovsky, Platon Lebedev, has denied fraud charges against him, calling them \"false.\" He is on trial alongside Khodorkovsky and claims that they are being punished for Khodorkovsky's political ambitions. Lebedev stated there were absurd contradictions in the case and questioned the legal basis of the charges, which also include tax evasion allegations. Both Khodorkovsky and Lebedev face a possible 10-year jail sentence if convicted, with Yukos facing a $27.5 billion tax demand from Russian authorities.", "chatgpt-4o-latest": "Platon Lebedev, a close associate of former Yukos boss Mikhail Khodorkovsky, denied fraud charges against him, calling them \"false\" and legally baseless. He and Khodorkovsky, on trial since June over the privatisation of a fertiliser firm, claim they are being targeted for Khodorkovsky's political ambitions. Both face up to 10 years in prison if convicted. Khodorkovsky criticized the portrayal of their business as criminal. Supporters see the charges as politically motivated, part of President Vladimir Putin's effort to curb oligarchs. Meanwhile, Yukos faces a $27.5bn tax demand, and its key asset was auctioned off. A U.S. court dismissed Yukos' attempt to seek bankruptcy protection.", "stablelm2:1.6b": "Khodorkovsky ally denies fraud charges as his trial continues, with potential jail sentences of one year for both defendants due to politically motivated allegations against them and their business rivals Yukos. Their defense counsel claims there are \"absurd contradictions\" in the case; they cannot understand the legal basis of the complaints involving tax evasion and fraud. The pair will be questioned by a judge over the next few days, with Mr. Khodorkovsky stating that normal business operations have been presented as criminal fiction. Yukos faces a $500m tax demand from Russian authorities, which key parts of its division were auctioned off to settle the bill. A US attempt for bankruptcy protection was also dismissed by a court in Texas.", "granite3.1-dense:2b": "Platon Lebedev, an ally of former Yukos CEO Mikhail Khodorkovsky, has denied fraud and other charges against him during his trial in Moscow. Lebedev, head of the parent company Menatep Group, argues the charges are false and based on \"absurd contradictions.\" The case centers around the privatization of a fertiliser firm, with both men facing up to 10 years in jail if convicted. Lebedev claims the charges are politically motivated, part of Russian President Vladimir Putin's efforts to restrain wealthy business leaders, or oligarchs. Yukos has received a $27.5 billion tax demand from Russia, leading to the sale of its key Yugansk division. Khodorkovsky recently testified, stating he disagrees with portraying normal business operations as criminal activities. The U.S. court dismissed Yukos' attempt to seek damages for the sale through bankruptcy protection in Texas.", "reference": "Mr Khodorkovsky began his testimony last week, telling the court that he objected to the way that the \"running of a normal business has been presented as a work of criminal fiction\".Platon Lebedev has been on trial alongside Mr Khodorkovsky since June in a case centring around the privatisation of a fertiliser firm.Mr Lebedev and Mr Khodorkovsky, who each face a possible 10 year jail sentence if convicted, will be questioned by a judge over the next few days.A close associate of former Yukos boss Mikhail Khodorkovsky has told a court that fraud charges levelled against him are \"false\".Mr Lebedev said there were \"absurd contradictions\" in the case."}