{"raw_text": "Ex-Boeing director gets jail term\n \n An ex-chief financial officer at Boeing has received a four-month jail sentence and a fine of $250,000 (£131,961) for illegally hiring a top Air Force aide.\n \n Michael Sears admitted his guilt in breaking conflict of interest laws by recruiting Darleen Druyun while she still handled military contracts. Ms Druyun is currently serving a nine month sentence for favouring Boeing when awarding lucrative contracts. Boeing lost a $23bn government contract after a Pentagon inquiry into the case. The contract, to provide refuelling tankers for the US Air Force, was cancelled last year.\n \n The Pentagon revealed earlier this week that it would examine eight other contracts worth $3bn which it believes may have been tainted by Ms Druyun's role in the procurement process. Boeing sacked Mr Sears and Ms Druyun in November 2003 after allegations that they had violated company recruitment policy. Ms Druyun had talks with Mr Sears in October 2002 about working for Boeing, while she was still a top procurement official within the Pentagon. She subsequently joined the company in January 2003. Ms Druyun admitted that she had steered multi-billion dollar contracts to Boeing and other favoured companies.\n \n In documents filed in a Virginia court ahead of Mr Sears' sentencing, prosecutors blamed Boeing's senior management for failing to ask key questions about the \"legal and ethical issues\" surrounding Ms Druyun's appointment. Mr Sears told prosecutors that no other Boeing officials were aware that Ms Druyun was still responsible for major procurement decisions at the time she was discussing a job with Boeing. However, analysts believe Boeing may yet face civil charges arising from the scandal. The Pentagon has investigated 400 contracts, dating back to 1993, since the allegations against Ms Druyun came to light.\n \n Boeing's corporate ethics have come under scrutiny on several occasions in recent years. Boeing was sued by Lockheed Martin after its rival accused it of industrial espionage during a 1998 contract competition. Boeing apologised publicly for the affair - although it claimed it did not gain any unfair advantage - and pledged to improve its procedures. The Pentagon subsequently revoked $1bn worth of contracts assigned to Boeing and prohibited the Seattle-based company from future rocket work.\n", "llama3.2:1b": "An ex-Boeing director, Michael Sears, was sentenced to four months in jail for illegally hiring a top Air Force aide while she still handled military contracts. He also received a fine of £131,961. The incident led to the cancellation of a $23bn Pentagon contract and an investigation into eight other contracts worth $3bn, which may have been tainted by Ms Druyun's role in the procurement process. Sears had discussed working for Boeing with Ms Druyun in 2002, while she was still in charge at the Pentagon. The scandal has raised concerns about Boeing's corporate ethics and led to investigations into several other contracts.", "llama3.2:3b": "An ex-Boeing CFO received a four-month jail sentence and a fine for hiring a top Air Force aide while still handling military contracts, leading to a loss of a $23 billion government contract. The Pentagon is examining eight other potentially tainted contracts worth $3 billion and plans to investigate 400 contracts dating back to 1993.", "gemma2:2b": "An ex-Boeing CFO received a four-month jail sentence and fine for hiring a top Air Force aide while she was still responsible for military contracts. This violated conflict of interest laws, leading to a $23 billion government contract cancellation for Boeing.  The Pentagon is also examining eight other contracts potentially tainted by Ms. Druyun's actions. The scandal has brought scrutiny on Boeing's ethics and led to past lawsuits. \n", "qwen2.5:0.5b": "A former chief financial officer at Boeing is facing four months in jail and a fine after recruiting an Air Force aide while she still handled military contracts. Ms Druyun served a nine-month sentence for favouring Boeing when awarding lucrative government contracts, and Boeing lost a $23bn contract worth of $3bn. The Pentagon has also investigated eight other contracts it believes may have been tainted by Ms Druyun's role in the procurement process.", "qwen2.5:1.5b": "A former Boeing CFO who illegally hired a top Air Force procurement official was sentenced to four months in jail, fined $250,000, and lost a $23 billion contract for providing refueling tankers to the US Air Force after admitting to using his position to steer contracts to Boeing.", "qwen2.5:3b": "An ex-Boeing CFO, Michael Sears, received a four-month jail sentence and $250,000 fine for illegally hiring Darleen Druyun, a top Air Force aide who later steered lucrative contracts towards Boeing. Druyun was sentenced to nine months after admitting her role in favoring the company. The Pentagon canceled a $23bn government contract due to allegations, and is now examining eight other major contracts potentially affected by her involvement. Analysts predict civil charges against Boeing could still arise from this scandal, which has led to multiple investigations into the company's corporate ethics over recent years.", "opencoder:1.5b": "Ex-Boeing director gets jail term. An ex-chief financial officer at Boeing has received a four-month jail sentence and a fine of $250,000 (£131,961) for illegally hiring a top Air Force aide.\n\nMichael Sears admitted his guilt in breaking conflict of interest laws by recruiting Darleen Druyun while she still handled military contracts. The Pentagon revealed earlier this week that it would examine eight other contracts worth $3bn which it believes may have been tainted by Ms Druyun's role in the procurement process. Boeing sacked Mr Sears and Ms Druyun in November 2003 after allegations that they had violated company recruitment policy.\n\nIn documents filed in a Virginia court ahead of Mr Sears' sentencing, prosecutors blamed Boeing's senior management for failing to ask key questions about the \"legal and ethical issues\" surrounding Ms Druyun's appointment. Mr Sears told prosecutors that no other Boeing officials were aware that Ms Druyun was still responsible for major procurement decisions at the time she was discussing a job with Boeing.\n\nBoeing's corporate ethics have come under scrutiny on several occasions in recent years, after Lockheed Martin sued Boeing and its rival. The Pentagon has investigated 400 contracts, dating back to 1993, since the accusations against Ms Druyun came to light.\n", "smollm:1.7b": "The ex-chief financial officer at Boeing has received a four-month jail term and a fine of $250,000 (£131,961) for illegally hiring a top Air Force aide while still handling military contracts. The ex-director admitted his guilt in breaking conflict of interest laws by recruiting Darleen Druyun while she still handled military contracts. Ms Druyun is currently serving a nine month sentence and a fine of $23bn (£14,961) for the illegal hiring. Boeing lost a $23bn government contract after a Pentagon inquiry into the case. The company also lost another $20bn contract to Lockheed Martin in 1998.\n\nThe Pentagon revealed earlier this week that it would examine eight other contracts worth $3bn which it believes may have been tainted by Ms Druyun's role in the procurement process. Boeing sacked Mr Sears and Ms Druyun in November 2003 after allegations that they had violated company recruitment policy. Ms Druyun admitted that she had steered multi-billion dollar contracts to Boeing and other favoured companies. The ex-director told prosecutors that no other Boeing officials were aware that Ms Druyun was still responsible for major procurement decisions at the time she was discussing a job with Boeing. However, analysts believe Boeing may yet face civil charges arising from the scandal.\n\nBoeing's corporate ethics have come under scrutiny on several occasions in recent years. Boeing was sued by Lockheed Martin after its rival accused it of industrial espionage during a 1998 contract competition. Boeing apologised publicly for the affair - although it claimed it did not gain any unfair advantage - and pledged to improve its procedures. The Pentagon subsequently revoked $1bn worth of contracts assigned to Boeing and prohibited the Seattle-based company from future rocket work.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about an ex-chief financial officer at Boeing getting jail time. Let me read through the given text carefully.\n\nThe main event is Michael Sears being sentenced for breaking a conflict of interest by recruiting Air Force Adele Druyun while she was still in her role as procurement official. Druyun, who's now serving a nine-month sentence, was paid $250k and made the company money by getting contracts with Boeing. Boeing lost a big government contract because Druyun did the procurement for them.\n\nThere are several sections to consider: the incident where Druyun recruited someone else later, the consequences of that recruitment leading to a loss for Boeing, the Pentagon's investigation into related contracts, and what others have done since. I need to make sure all key points are included concisely without adding extra details.\n</think>\n\nMichael Sears was sentenced in four months to $250,000 and $131,961 fine for recruiting Air Force Adele Druyun while she was still a procurement official at the Pentagon. Druyun, serving nine months, made Boeing money by securing large government contracts. The loss of a $23 billion contract to Boeing was due to her role in purchasing the fuel tanks. The Pentagon will investigate eight other related contracts and revoke some assigned to Boeing before Mr. Sears' sentencing.", "tinyllama:1.1b": "The ex-Chief Financial Officer at Boeing, Michael Seavers, was sentenced to four months in prison and a fine of $250,000 (£131,961) for illegally financing his company's Air Force aide. He admitted breaking conflict of interest laws by hiring Darlee N Druyun while he was handling military contracts. The Pentagon revealed eight more contracts worth $3bn which may have been tainted by her role in the procurement process. Boeing executives, including former CEO Alan Armstrong, pleaded for an apology during a 2005 scandal and promised to improve their procedures after losing one major contract in 2003. However, civil charges are still possible due to the alleged legal and ethical issues surrounding Ms Druyun's appointment.", "tinydolphin:1.1b": " Summarize this text as a concise summary: Michael Sears, ex-Chief Financial Officer at Boeing, received a four-month jail sentence and a $250,000 fine for illegally hiring a top Air Force aide. The case involved allegations of conflict of interest by recruiting Darleen Druyun, who later became Boeing's senior manager.", "phi:2.7b": " An ex-Boeing executive, Michael Sears, was sentenced to four months in jail and fined $250,000 for hiring a top Air Force aide while she still had access to military contracts, leading to a cancelled $23bn government contract. The Pentagon is now examining eight other contracts worth $3bn that may have been affected by the scandal.\n", "orca-mini:3b": " An ex-Boeing director has been sentenced to four months in jail and fined $250,000 for illegally hiring a top Air Force aide. The Pentagon is investigating eight other contracts worth $3bn that may have been tainted by the appointment of Boeing's former procurement official.", "hermes3:3b": "Boeing CFO receives 4-mth jail, $250k fine for hiring Air Force aide illegally, while Druyun serves 9-mth sentence for favouring Boeing in contracts.", "stablelm-zephyr:3b": "A former Boeing CFO, Michael Sears, received a four-month jail sentence and $250,000 fine for illegally hiring Air Force aide Darleen Druyun while she still handled military contracts, violating conflict of interest laws. Druyun is already serving a nine-month sentence for favoring Boeing in contract awards. The Pentagon has examined eight other contracts worth $3bn that it believes may have been tainted by Druyun's role in the procurement process. Boeing sacked Sears and Druyun in 2003 after allegations they violated company recruitment policy. Analysts believe Boeing could face civil charges arising from the scandal, and the Pentagon has investigated 400 contracts since the allegations against Druyun came to light.", "chatgpt-4o-latest": "Former Boeing CFO Michael Sears was sentenced to four months in jail and fined $250,000 for illegally hiring Air Force aide Darleen Druyun while she was still overseeing military contracts. Druyun, serving a nine-month sentence, admitted to favoring Boeing in awarding contracts. A Pentagon inquiry led to the cancellation of a $23 billion refueling tanker contract, and further investigations are examining eight other contracts worth $3 billion. Boeing fired both Sears and Druyun in 2003. Prosecutors criticized Boeing's senior management for ignoring ethical concerns, and analysts suggest the company may face civil charges. Boeing has faced previous ethics scandals, including a lawsuit from Lockheed Martin over industrial espionage, which led to the Pentagon revoking $1 billion in contracts and barring Boeing from future rocket work.", "stablelm2:1.6b": "Ex-Boeing director Michael Sears receives a four-month jail sentence and £££ for hiring top Air Force aide Darleen Druyun while she managed military contracts. Sears admitted guilt by violating conflict of interest laws, leading to scrutiny of Boeing's corporate ethics. Druyun is currently serving a nine-month sentence for favoring Boeing during the awarding process. The Pentagon will examine eight other contracts worth $3bn believed to be tainted by her role in the procurement process. This follows an investigation into contracts dating back to 2006.", "granite3.1-dense:2b": "Michael Sears, a former Boeing chief financial officer, was sentenced to four months in jail and fined $250,000 for violating conflict of interest laws by hiring Darleen Druyun, then a top Air Force official. Druyun had already been serving a nine-month sentence for favoring Boeing in military contract awards. This led to the cancellation of a $23 billion refuelling tanker contract for the US Air Force, which was initially valued at $35 billion.\n\nSears and Druyun were involved in illegal recruitment discussions in October 2002, while she was still handling major procurement decisions within the Pentagon. Boeing dismissed both in November 2003 after discovering their violation of company recruitment policy. Prosecutors blamed Boeing's senior management for neglecting to question the legal and ethical implications of Druyun's appointment.\n\nThe Pentagon is now scrutinizing eight other contracts valued at $3 billion, potentially tainted by Druyun's actions. The investigation extends back to 1993, involving a review of 400 contracts. Boeing's corporate ethics have been under close examination due to this scandal and a previous industrial espionage lawsuit with Lockheed Martin in 1998. Despite apologizing for the latter, Boeing was barred from future rocket work by the Pentagon. Analysts predict that Boeing may face additional civil charges resulting from this scandal.", "reference": "Ms Druyun had talks with Mr Sears in October 2002 about working for Boeing, while she was still a top procurement official within the Pentagon.Mr Sears told prosecutors that no other Boeing officials were aware that Ms Druyun was still responsible for major procurement decisions at the time she was discussing a job with Boeing.Boeing sacked Mr Sears and Ms Druyun in November 2003 after allegations that they had violated company recruitment policy.Ms Druyun admitted that she had steered multi-billion dollar contracts to Boeing and other favoured companies.The Pentagon subsequently revoked $1bn worth of contracts assigned to Boeing and prohibited the Seattle-based company from future rocket work.Boeing lost a $23bn government contract after a Pentagon inquiry into the case.Ms Druyun is currently serving a nine month sentence for favouring Boeing when awarding lucrative contracts.Boeing was sued by Lockheed Martin after its rival accused it of industrial espionage during a 1998 contract competition."}