{"raw_text": "Yukos sues four firms for $20bn\n \n Russian oil firm Yukos has sued four companies for their role in last year's forced state auction of its key oil production unit Yuganskneftegas.\n \n Yukos is claiming more than $20bn (£11bn) in damages after Yugansk was sold in December to settle back taxes. The four companies named in the law suit are gas giant Gazprom, its unit Gazpromneft, investment company Baikal, and state oil firm Rosneft. Yukos submitted the suit in Houston, where it filed for bankruptcy. As well as suing for damages, Yukos has asked the US court to send its tax dispute with the Russian government to an international arbitrator. It also has submitted a reorganisation plan as part of its Chapter 11 bankruptcy filing.\n \n The clash between Yukos and the Kremlin came to a head last year when Yukos was hit with a bill of more than $27bn in back taxes and unpaid fines. To settle the bill, Russia forced Yukos to sell off Yuganskneftegas.\n \n Yukos called the sale illegal and has turned to courts in the US in an effort to regain control of the oil production business. It also has vowed to use all legal means at its disposal to go after any firm that tries to buy or take control of its assets. Earlier this month it sued the Russian government for $28.3bn. Analysts have questioned whether a US court has any jurisdiction over Russian companies, while Moscow officials have dismissed Yukos' legal wrangling as meaningless. In Houston, bankruptcy Judge Letitia Clark will start a two-day hearing on 16 February to hear arguments on whether a US court is the proper forum for the case.\n \n The threat of legal action from Yukos and its bankruptcy filing in Houston did have an effect on last year's auction, however. Concerned that it would be caught up in a court battle, Gazprom and Gazpromneft withdrew from the auction, and Yuganskneftegas was sold to little-known investment firm Baikal Finance Group. A few days later, Baikal gave control of the company to state-run oil group Rosneft for $9.3bn. Rosneft, meanwhile, has agreed to merge with Gazprom, bringing a large chunk of Russia's very profitable oil business back under state control. Yukos claims that the rights of its shareholders have been ignored and that is has been punished for the political ambitions of its founder Mikhail Khodorkovsky. Mr Khodorkovsky, once Russia's richest man, is in prison, having been charged with fraud and tax evasion and repeatedly denied bail.\n", "llama3.2:1b": "Yukos sues four companies for $20bn over forced state auction of Yuganskneftegas. The oil firm claims damages and seeks international arbitration to address a disputed tax dispute with the Russian government. Yukos has also filed bankruptcy in Houston, seeking control of its assets. Russia's government has withdrawn from last year's sale due to concerns about legal action. Yukos accuses Yukanskneftegas' founder Mikhail Khodorkovsky of ignoring shareholder rights and punishing him for his political ambitions.", "llama3.2:3b": "Yukos sues four companies including Gazprom and Rosneft for $20bn in damages over forced sale of its oil unit Yuganskneftegas to settle back taxes, claiming rights of shareholders have been ignored. Yukos also filed for bankruptcy in Houston, submitting a reorganisation plan, and asked the US court to send its tax dispute with Russia to international arbitrator.", "gemma2:2b": "Yukos, a Russian oil firm, sued four companies - Gazprom, Gazpromneft, Baikal, and Rosneft - for $20 billion in damages related to the forced sale of its Yuganskneftegas unit.  They allege that the government's decision to sell the asset was illegal and seek international arbitration. The firm filed for bankruptcy in the US and is pursuing legal action against both Russia and the companies involved in the auction process. \n", "qwen2.5:0.5b": "Yukos sued four Russian companies over their role in selling a part of the oil business of Yuganskneftegas for more than $20 billion. The case is pending before US courts. The auction was disrupted due to legal disputes, including those between Gazprom and Gazpromneft, Baikal, and Rosneft. Rosneft has agreed to merge with Gazprom, while the other firms remain in court.", "qwen2.5:1.5b": "Russian oil giant Yukos sues four companies, including Gazprom and Rosneft, for $20 billion over the forced state auction of Yuganskneftegas, claiming damages, seeking international arbitration, and filing a bankruptcy plan. The case stems from Yukos' illegal tax settlement with Russia in 2018, which led to its controversial sale of Yuganskneftegas by the Russian government.", "qwen2.5:3b": "Russian oil firm Yukos has sued four companies—Gazprom, Gazpromneft, Baikal, and Rosneft—for damages exceeding $20bn over the forced state auction of its key unit Yuganskneftegas last year to settle back taxes. Yukos claimed this sale was illegal and is now seeking an international arbitrator for a tax dispute with the Russian government. It has also submitted a reorganisation plan in Chapter 11 bankruptcy proceedings. The lawsuit came after Yukos was hit with a $27bn bill for unpaid taxes, leading to its forced sale of Yuganskneftegas. While analysts question US jurisdiction over Russian companies and Moscow officials dismiss Yukos' legal challenges as meaningless, the case did influence the auction, causing Gazprom and Gazpromneft to withdraw from bidding and leading to Yuganskneftegas being sold to Rosneft for $9.3bn under state control. Yukos argues its shareholders were wronged due to political actions against founder Mikhail Khodorkovsky, who is currently in prison.", "opencoder:1.5b": "Yukos sues four firms for $20bn.\n\nYuganskneftegas: A key oil production unit of the Russian oil firm Yukos.\n\nThe clash between Yukos and the Kremlin came to a head last year when Yugansk was hit with a bill of more than $27bn in back taxes and unpaid fines. To settle the bill, Russia forced Yugos to sell off Yuganskneftegas.\n\nYukos called the sale illegal and has turned to courts in the US in an effort to regain control of the oil production business. It also has vowed to use all legal means at its disposal to go after any firm that tries to buy or take control of its assets. Earlier this month it sued the Russian government for $28.3bn.\n\nThe threat of legal action from Yukos and its bankruptcy filing in Houston did have an effect on last year's auction, however. Concerned that it would be caught up in a court battle, Gazprom and Gazpromneft were withdrawn from the auction, and Yuganskneftegas was sold to Baikal Finance Group. A few days later, Baikal gave control of the company to state-run oil group Rosneft for $9.3bn. Rosneft, meanwhile, has agreed to merge with Gazprom, bringing a large chunk of Russia's very profitable oil business back under state control. The rights of its shareholders have been ignored and that is has been punished for the political ambitions of its founder Mikhail Khodorkovsky, who has been charged with fraud and tax evasion and repeatedly denied bail. Mr Khodorkovsky, once in prison, was charged with fraud and tax evasion.\n", "smollm:1.7b": "Summarize the text concisely by highlighting key ideas and details. The main idea of this text is that Yukos sues four firms for $20bn after Yugansk was sold to settle back taxes. The Russian oil firm Yukos has also sued the US court for $28.3bn in a Chapter 11 bankruptcy case, alleging that the US government has no jurisdiction over Russian companies and that the US court is the proper forum for the case. The threat of legal action from Yukos and its bankruptcy filing in Houston did have an effect on last year's auction, however. Concerned about being caught up in a court battle, Gazprom and Gazpromneft withdrew from the auction and gave control of Yuganskneftegas to Rosneft for $9.3bn. Rosneft has agreed to merge with Gazprom, bringing a large chunk of Russia's very profitable oil business back under state control. Yukos claims that the rights of its shareholders have been ignored and that is has been punished for the political ambitions of its founder Mikhail Khodorkovsky. Mr Khodorkovsky, once Russia's richest man, is in prison, having been charged with fraud and tax evasion and repeatedly denied bail.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text about Yukos suing four firms for $20 billion. Let me read through it carefully.\n\nThe main points are that Yukos is suing companies related to Yuganskneftegas, which was part of the Russian oil company. They claim damages from back taxes and unpaid fines, which were big because of Russia's forced auction in December. The suit was filed in Houston, where they're in bankruptcy. They're suing four firms: Gazprom, its unit, Baikal, and Rosneft.\n\nYukos is calling it illegal and wants an international arbitration. They also want the US court to handle the tax dispute and include a reorganisation plan in their chapter 11 filing. There was a bill over $27bn from back taxes and fines, which led to the sale of Yuganskneftegas.\n\nRussia's court didn't have much jurisdiction over Russian companies before this case, but now it does, though they're skeptical. They've withdrawn the auction with Gazprom and its unit leaving, and Baikal has taken control for a sum. Rosneft is merging with Gazprom, and Yukos is saying shareholders were ignored.\n\nSo I need to condense all that into a summary without any extra info or explanations.\n</think>\n\nYukos, a Russian oil company, sued four firms related to Yuganskneftegas, the Russian industry arm of Yukos. They claim $20 billion in damages from back taxes and fines, which Russia forced to settle by selling Yuganskneftegas in December. The suit was filed in Houston for bankruptcy, with Yukos seeking an international arbitration court, and a reorganisation plan included in their chapter 11 filing. Russia's court had limited jurisdiction before the case but now has it, though skepticism remains about its role. Gazprom and its unit withdrew from the auction, while Baikal Finance Group took control of Yuganskneftegas for $9.3bn, with Rosneft merging with Gazprom to regain state control.", "tinyllama:1.1b": "A Russian oil firm, Yukoy (Yukos), has filed a lawsuit against four companies for their role in last year's forced state auction of its key oil production unit. The companies named are Gazprom, Gazpromneft, investment company Baikal, and state oil giant Rosneft. Yukao claimed more than $20bn in damages as a result of the auction, which they say violated both Russian tax laws and international agreements. The case has been raised for discussion in Houston, where the company filed bankruptcy last year. The legal dispute between Yukao and the Kremlin came to a head last year when they were hit with a bill of more than $27bn in back taxes and unpaid fines. In order to settle the bill, Russia forced Yukao to sell off its Yuankneftegas unit to Gazprom for $9.3bn. The legal wrangling between Yukao and the government is viewed as being legally meaningless by Moscow officials, who have dismissed the case as an attempt to use a US court to regain control of Russian companies. In Houston, Judge Leticia Clark will hear arguments on the jurisdiction question for the $28.3bn suit brought against Russia.", "tinydolphin:1.1b": " Yukos sues four firms for $20bn (£11bn), accusing them of their roles in a forced state auction of its key oil production unit Yuganskneftegas, which has left it owing over $27bn in back taxes and unpaid fines. The lawsuit was submitted in Houston, where Yukos has filed for bankruptcy after being hit with an estimated $28.3bn in unpaid taxes and back taxes. \n\nThe oil firm is also seeking to have its tax dispute with the Russian government sent to an international arbitrator to resolve the matter, as it believes the settlement reached last year was unfairly enforced. Yukos argues that the forced sale of Yuganskneftegas in December 2014 disregarded its right to fair treatment and should be subjected to further scrutiny by an international arbitrator.\n\nMeanwhile, Gazprom, Gazprom Neft, investment company Baikal, and state oil firm Rosneft have been named as defendants in the lawsuit. Yukos alleges that these companies had a role in forcibly selling Yuganskneftegas to investment firm Baikal Finance Group, which in turn sold it to Gazprom in November 2014 for $9.3bn. \n\nIn its reorganisation plan submitted to the US bankruptcy court in Houston, Yukos has also proposed a $6.3bn restructuring of its operations and the creation of a new oil company that would control more than half of Russia's proven oil reserves. This move comes amidst the ongoing political turmoil in Russia, with the Kremlin imposing heavy fines on Yukos in an attempt to regain control over its assets.", "phi:2.7b": " Yukos sued four companies in the US for $20bn after the forced sale of Yuganskneftegas, its key oil production unit in December to settle back taxes. It also filed for bankruptcy in Houston and asked a court to send its dispute with the Russian government to an international arbitrator. The conflict between Yukos and the Kremlin began when it was hit with  $27bn in back taxes and unpaid fines. To pay the debt, Russia forced Yukos to sell Yuganskneftegas, leading to its bankruptcy filing. Yukos claimed that the sale was illegal and took legal action against Russian companies involved in the auction. The threat of lawsuits from Yukos had an effect on the auction, with Gazprom and Gazpromneft withdrawing their bid. Eventually, Yuganskneftegas was sold to Baikal Finance Group, which then gave control of the company to state-run oil group Rosneft for  $9.3bn. Analysts have questioned whether a US court has jurisdiction over Russian companies, while Kremlin officials dismiss Yukos' legal battles as pointless. The case will be heard in Houston's bankruptcy court in early February. Yukos claims that its shareholders' rights have been ignored and it has been punished for the political ambitions of its founder, Mikhail Khodorkovsky, who is serving a prison sentence for fraud and tax evasion. Rosneft has agreed to merge with Gazprom, bringing back a large chunk of Russia's profitable oil business under state control.\n", "orca-mini:3b": " Yukos, the Russian oil firm, has sued four companies for their role in last year's forced state auction of its key oil production unit Yuganskneftegas. The lawsuit seeks more than $20bn in damages from Gazprom, Gazpromneft, Baikal Finance Group, and Rosneft. Yukos claims that the rights of its shareholders have been ignored and that it has been punished for the political ambitions of its founder Mikhail Khodorkovsky.", "hermes3:3b": "Yukos sues 4 companies ($20bn) over forced sale of Yuganskneftegas, claiming it was an illegal auction.", "stablelm-zephyr:3b": "Russian oil firm Yukos sued four companies—Gazprom, Gazpromneft, investment company Baikal, and state oil firm Rosneft—for their involvement in the forced sale of its key oil production unit Yuganskneftegas to settle back taxes last year. Yukos is seeking over $20bn in damages and has asked the US court to send its tax dispute with the Russian government to an international arbitrator. The company also submitted a reorganization plan as part of its Chapter 11 bankruptcy filing. The conflict between Yukos and the Kremlin reached a head when Yukos was billed for more than $27bn in back taxes and unpaid fines, leading to the sale of Yuganskneftegas. Earlier this month, Yukos sued the Russian government for $28.3bn.", "chatgpt-4o-latest": "Yukos has sued four companies—Gazprom, Gazpromneft, Baikal, and Rosneft—for over $20 billion in damages related to the forced state auction of its key oil unit, Yuganskneftegas, which was sold in December to cover back taxes. The lawsuit, filed in Houston as part of Yukos' Chapter 11 bankruptcy, also seeks to move its tax dispute with the Russian government to an international arbitrator. Yukos argues the sale was illegal and is using US courts to regain control of its assets, despite doubts over US jurisdiction. The legal battle stems from a $27 billion tax bill imposed on Yukos, which it claims was politically motivated due to the ambitions of its founder, Mikhail Khodorkovsky, who is imprisoned for fraud and tax evasion. The auction was affected by Yukos' legal threats, leading Gazprom to withdraw, and Yuganskneftegas was sold to Baikal, which later transferred control to Rosneft. Rosneft is set to merge with Gazprom, consolidating state control over a significant portion of Russia’s oil industry.", "stablelm2:1.6b": "Russian oil firm Yukos has sued four companies over $10 billion in damages incurred after the forced sale of its oil production unit, Yuganskneftegas, to settle back taxes last year. Yukos claims to have filed for bankruptcy and intends to use all legal means available to regain control of assets. The dispute between Yukos and the Kremlin escalated when the company was hit with over $1 billion in back taxes and unpaid fines. To settle the bill, Russia sold Yuganskneftegas. Yukos protested this action as illegal and has been attempting to regain control of its oil production business through legal channels and international arbitration.", "granite3.1-dense:2b": "Russian oil company Yukos has filed a $20bn lawsuit against Gazprom, Gazpromneft, Baikal, and Rosneft in Houston, where it previously sought bankruptcy protection. The suit stems from the forced sale of its key production unit, Yuganskneftegas, during a 2004 auction to settle over $27bn in back taxes and fines imposed by Russia. Yukos claims this sale was illegal and is seeking to have its dispute with the Russian government arbitrated internationally. The company also intends to pursue all legal avenues to prevent any acquisition of its assets.\n\nThe legal action has influenced past auctions, as Gazprom and Gazpromneft withdrew due to concerns about litigation. Yuganskneftegas was then sold to Baikal Finance Group, which later transferred it to Rosneft for $9.3bn. This merger brings significant Russian oil assets under state control.\n\nYukos argues that the rights of its shareholders have been disregarded and accuses founder Mikhail Khodorkovsky, now imprisoned on fraud and tax evasion charges, of using his influence for political gain. Bankruptcy Judge Letitia Clark in Houston will begin a two-day hearing on 16 February to determine if the US court is appropriate for the case.", "reference": "Russian oil firm Yukos has sued four companies for their role in last year's forced state auction of its key oil production unit Yuganskneftegas.Yukos called the sale illegal and has turned to courts in the US in an effort to regain control of the oil production business.As well as suing for damages, Yukos has asked the US court to send its tax dispute with the Russian government to an international arbitrator.The clash between Yukos and the Kremlin came to a head last year when Yukos was hit with a bill of more than $27bn in back taxes and unpaid fines.Analysts have questioned whether a US court has any jurisdiction over Russian companies, while Moscow officials have dismissed Yukos' legal wrangling as meaningless.Yukos submitted the suit in Houston, where it filed for bankruptcy.The threat of legal action from Yukos and its bankruptcy filing in Houston did have an effect on last year's auction, however.Yukos is claiming more than $20bn (£11bn) in damages after Yugansk was sold in December to settle back taxes."}