{"raw_text": "Hariri killing hits Beirut shares\n \n Shares in Solidere, the Lebanese company founded by assassinated former prime minister Rafik Hariri, fell 15% in renewed trading in Beirut.\n \n The real estate firm, which dominates Lebanon's stock exchange, ended the day down at $8.08. Traders said there was some panic selling during Friday's session, the first since a three-day market closure to mourn the death of Mr Hariri. Beirut's benchmark BLOM stock index closed down 7.9% at 642.80.\n \n Solidere, in which Mr Hariri was a major shareholder, was the major drag on the index. The company owns much of the property in central Beirut, which it restored and redeveloped following the end of Lebanon's bitter 15-year civil war. \"Solidere should be above $10 but because of this disaster it is falling,\" said one trader. \"If Solidere drops much lower I would consider it a buying opportunity. This is a very big company held by many Lebanese.\" Critics had accused Mr Hariri of using Lebanon's post-war reconstruction drive for his personal financial gain. But his assassination on Monday sent shudders through Lebanon's business community, which saw the billionaire tycoon as the country's best hope for economic revival. Solidere posted profits of $12.5m in the first half of 2004, and its shares had been gaining in recent months.\n", "llama3.2:1b": "Hariri killing hits Beirut stocks sharply\n\nSolidere stock drops 15% on Friday, down to $8.08 after Hariri's assassination. Benchmark BLOM index falls 7.9%, closing at 642.80. Solidere dominates the stock exchange and is a major shareholder of Hariri's company.", "llama3.2:3b": "Shares in Solidere fell 15% after the assassination of former prime minister Rafik Hariri, dominating Lebanon's stock exchange with a 7.9% drop in the benchmark BLOM index to $8.08, with traders considering it a buying opportunity despite critics' accusations against Hariri.", "gemma2:2b": "Shares of Solidere fell by 15% following the assassination of former prime minister Rafik Hariri. The company's stock performance reflects a sense of panic selling in Beirut’s stock market due to the shock of his death.  Solidere, a major real estate firm that owns significant properties in Beirut, saw its share price plummet. This decline in share value impacted the Lebanese benchmark BLOM stock index, which also declined significantly. \n", "qwen2.5:0.5b": "Shares in Beirut's main stock exchange fell sharply after Beirut-based Real Estate firm Solidere announced it was a major drag on BLOM index, while Lebanon's business community is wary of Mr Hariri's death.", "qwen2.5:1.5b": "Shares in Lebanese real estate firm Solidere fell sharply following the assassination of former prime minister Rafik Hariri, sending Lebanon's stock index down further. Hariri's company dominated the market but has since faced criticism for financial mismanagement during reconstruction post-war.", "qwen2.5:3b": "Shares in Solidere fell 15% after being dominated by Rafik Hariri's assassination, causing Lebanon's benchmark BLOM stock index to close down 7.9%. The real estate firm's major shareholder was Hariri, who used post-war reconstruction for personal financial gain according to critics. Business community viewed Hariri as key for economic revival; Solidere posted $12.5m in profits and shares had been rising previously.", "opencoder:1.5b": "Hariri killing shares in Solidere, the Lebanese company, ended the day down at $8.08. Traders sold during a Friday's session, which is a major selling point for Mr Hariri, who was a former prime minister and assassinated by the likes of his. Beirut's benchmark BLOM stock index closed down 7.9% at 642.80.\n", "smollm:1.7b": "Hariri killing hits Beirut shares falls in trading after Hariri assassination", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving the key ideas and details. Let me read through the text carefully.\n\nThe main event is Hariri's assassination, which caused a decline in shares of Solidere, the company founded by Rafik Hariri. The shares fell by 15%, and there was some panic selling during Friday's session, the first since a three-day market closure. Beirut's BLOM index also dropped.\n\nSolidere owns properties in Beirut after the civil war ended, so it must be on the decline. Traders found this significant because the company is big and wealthy, seen as a potential for economic revival. Hariri's assassination was criticized by critics but boosted the business community, thinking he had a plan to fix Lebanon's economy.\n\nI need to capture all these points succinctly without adding any extra information. I'll mention the shares falling, panic selling, Beirut index drop, Solidere's importance, and the impact on the business community.\n</think>\n\nHariri's assassination led to solidire shares dropping 15%, with panic selling during Friday's session. Beirut's BLOM index dropped 7.9%, as Solidere owns properties after the civil war. Solidere, a multi-billionaire, was central to Lebanon's economic recovery and had criticized Hariri for using his government's reconstruction efforts for personal gain.", "tinyllama:1.1b": "Hariri killing in Lebanon's Stock Exchange: Share prices in Solidere fell 15% on the back of a real estate developer's assassination, which left tradeers feeling panic selling during Friday's trading. The company owned much property in central Beirut after the end of Lebanon's bitter civil war and was held by many Lebanese. Critics accused Mr Hariri of using the post-war reconstruction drive for personal gain, but his assassination sent shudders through the business community and saw Solidere shares drop to a three-day low. The company's losses in June were $12.5m during the first half of the year.", "tinydolphin:1.1b": " The assassination of former Lebanese Prime Minister Rafik Hariri resulted in a significant drop in the value of shares of Solidere, a prominent Beirut-based real estate company. In the wake of this tragic event, many analysts predicted that the stock would fall further. However, on Friday, shares in the firm fell 15% amidst the ongoing market closure to mourn Mr Hariri's death. The decline has been attributed to the negative perception of the company following its involvement with Mr Hariri and the subsequent reconstruction efforts in his homeland. This is a particularly significant setback for Solidere, which enjoyed a considerable rise after the end of Lebanon's civil war. Critics had accused Hariri of using the reconstruction drive to further enrich himself, which has left many questioning his true intentions and the value of his company.", "phi:2.7b": " Shares in Lebanese real estate firm Solidere fell after the company's founder, Rafik Hariri, was assassinated. The stock index closed down 7.9%, with Solidere being the major drag on the market due to its extensive property holdings in central Beirut. Traders and experts suggest that this could be a buying opportunity for Solidere if it continues to underperform.\n", "orca-mini:3b": " Shares in Solidere, the Lebanese company founded by assassinated former prime minister Rafik Hariri, fell 15% in renewed trading in Beirut following his assassination. The real estate firm dominates Lebanon's stock exchange and ended the day down at $8.08. Critics had accused Mr Hariri of using Lebanon's post-war reconstruction drive for his personal financial gain, but his assassination on Monday sent shudders through the Lebanese business community. Solidere was the major drag on the index and posted profits of $12.5m in the first half of 2004.", "hermes3:3b": "Solidere shares fall 15% after Hariri killing, following market closure due to his assassination.", "stablelm-zephyr:3b": "Shares in Solidere, a Lebanese company founded by former prime minister Rafik Hariri, fell 15% following his assassination. The real estate firm, which is dominant in Lebanon's stock exchange, ended the day at $8.08 due to panic selling during its first trading session since a three-day market closure. Beirut's benchmark BLOM stock index closed down 7.9%. Solidere, in which Hariri was a major shareholder, owned central Beirut's property and had been accused of using post-war reconstruction for personal gain. Critics believed the company would face further drops if it lost more value.", "chatgpt-4o-latest": "Shares in Solidere, the Lebanese real estate firm founded by assassinated former Prime Minister Rafik Hariri, fell 15% as Beirut's stock market reopened after a three-day closure. The company's decline dragged the benchmark BLOM index down 7.9%. Solidere, a key player in Lebanon's post-war reconstruction, had been performing well, posting $12.5 million in profits in early 2004. Hariri's assassination caused panic selling, though some traders saw the drop as a buying opportunity. His death unsettled Lebanon's business community, which viewed him as crucial to economic recovery.", "stablelm2:1.6b": "Shares in Solidere, a Lebanese real estate company founded by slain former prime minister Rafik Hariri, fell by 10% in trading after his death, with Beirut's BLOM stock index dropping by 7.9%. Solidere is the dominant player on Lebanon's stock exchange and dominates the country's benchmark stock index. The company, which owns much of property central to Beirut, saw its shares crash due to Hariri's assassination. Critics accused him of exploiting post-war reconstruction for personal gains, but his death was seen as a national tragedy by many in the business community who admired him as Lebanon's hope for economic revival.", "granite3.1-dense:2b": "Shares in Solidere, a prominent Lebanese company founded by late prime minister Rafik Hariri, plummeted 15% following renewed trading post a three-day market closure due to his death. The real estate firm, which dominates Beirut's stock exchange and holds significant property in central Beirut, was the main cause of the index's 7.9% decline. Traders expressed concern about panic selling, with one estimating Solidere should be valued above $10 but currently trading at $8.08. Critics had previously accused Hariri of misusing post-war reconstruction funds for personal gain. Despite this, the business community viewed him as a key figure in Lebanon's economic recovery. Solidere reported profits of $12.5 million in H1 2004 and had recently been gaining value.", "reference": "Solidere, in which Mr Hariri was a major shareholder, was the major drag on the index.Shares in Solidere, the Lebanese company founded by assassinated former prime minister Rafik Hariri, fell 15% in renewed trading in Beirut.Critics had accused Mr Hariri of using Lebanon's post-war reconstruction drive for his personal financial gain.Traders said there was some panic selling during Friday's session, the first since a three-day market closure to mourn the death of Mr Hariri.The company owns much of the property in central Beirut, which it restored and redeveloped following the end of Lebanon's bitter 15-year civil war."}