{"raw_text": "Buyers snap up Jet Airways' shares\n \n Investors have snapped up shares in Jet Airways, India's biggest airline, following the launch of its much anticipated initial public offer (IPO).\n \n The IPO for 17.3 million shares was fully sold within 10 minutes of opening, on Friday. Analysts expect Jet to raise at least 16.4bn rupees ($375m; £198m) from the offering. Interest in Jet's IPO has been fuelled by hopes for robust growth in India's air travel market.\n \n The share offer, representing about 20% of Jet's equity, was oversubscribed, news agency Reuters reported. Jet, which was founded by London-based travel agent Naresh Goyal, plans to use the cash to buy new planes and cut its debt. The company has grown rapidly since it launched operations in 1993, overtaking state-owned flag carrier Indian Airlines. However, it faces stiff competition from rivals and low-cost carriers. Jet's IPO is the first in a series of expected share offers from Indian companies this year, as they move to raise funds to help them do business in a rapidly-growing economy.\n", "llama3.2:1b": "Buyers snap up Jet Airways shares following its initial public offer (IPO) which was fully sold within 10 minutes of opening on Friday. The IPO raised at least 16.4 billion rupees ($375 million; £198 million), while analysts expect Jet to raise more from the offering.", "llama3.2:3b": "Buyers snapped up 17.3 million shares of Jet Airways' in an initial public offer (IPO) that was fully subscribed within 10 minutes. Analysts expect the offering to raise at least 16.4 billion rupees ($375m; £198m). The company plans to use the funds to purchase new planes and reduce debt, following rapid growth since its launch in 1993.", "gemma2:2b": "Jet Airways' IPO was fully subscribed within 10 minutes of opening, raising at least $375 million. Investors are optimistic about the airline's growth prospects and are interested in its robust debt reduction plans. The offer is expected to help Jet Airways purchase new planes and reduce its financial obligations. This IPO marks one of several planned share offerings from Indian companies seeking funding for business expansion in a rapidly growing economy. \n", "qwen2.5:0.5b": "Jet Airways has been getting lots of investors' money lately. They bought 17 million shares at once, which took only about 10 minutes. The company plans to use the money to buy more planes and pay off debts. It's like when you want to buy a big toy from a store but don't have enough money. Jet wants to do that for its own business too. They're excited about getting those new shares.", "qwen2.5:1.5b": "Jet Airways shares are snapped up by investors following its $375 million initial public offering (IPO) on Friday, quickly reaching full subscription within 10 minutes. The company plans to use the proceeds for new plane purchases and debt reduction, aiming for robust growth in India's air travel market amid competition from rivals and low-cost carriers.", "qwen2.5:3b": "Investors have fully purchased Jet Airways' initial public offer (IPO) within 10 minutes, raising at least 16.4bn rupees ($375m; £198m). The IPO represents about 20% of Jet's equity and was oversubscribed. Established by Naresh Goyal as a London-based travel agent, Jet launched in 1993 and has grown to become India's biggest airline, overtaking state-owned flag carrier Indian Airlines. Despite rapid growth, Jet faces competition from rivals and low-cost carriers. This IPO is part of planned share offerings from Indian companies aimed at raising funds for their business in a growing economy.", "opencoder:1.5b": "\"Buyers snap up Jet Airways' shares Investors have snapped up shares in Jet Airways, India's biggest airline following the launch of its much anticipated initial public offer (IPO). The IPO for 17.3 million shares was fully sold within 10 minutes of opening on Friday. The share offer represents about 20% of Jet's equity and is oversubscribed news agency Reuters reported. Jet plans to use the cash to buy new planes and cut its debt, having grown rapidly since it launched operations in 1993. However, it faces stiff competition from Indian airlines.\"\n", "smollm:1.7b": "The summary should be concise and focus on the key points:\n\n1. Buyers snapped up shares in Jet Airways' IPO\n2. Investors have snapped up shares in Jet Airways, India's biggest airline\n3. The IPO for 17.3 million shares was fully sold within 10 minutes of opening\n4. Analysts expect Jet to raise at least 16.4bn rupees ($375m; £198m) from the offering\n5. Interest in Jet's IPO has been fueled by hopes for robust growth in India's air travel market\n6. The share offer, representing about 20% of Jet's equity, was oversubscribed\n7. Jet plans to use the cash to buy new planes and cut its debt\n8. The company faces stiff competition from rivals and low-cost carriers\n9. Jet's IPO is the first in a series of expected share offers from Indian companies this year", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Jet Airways' initial public offer (IPO). Let me read through it carefully.\n\nThe main points are: buyers snapped up Jet shares, the IPO was for 17.3 million shares sold quickly in 10 minutes on Friday, and the company raised at least 16.4 billion rupees. That's a significant amount. Investors were hopeful about India's growing air travel market, so they wanted to see Jet take off.\n\nThe share offer was oversubscribed, which means there were more offers than available shares. This could make it harder for companies with fewer shares to get in on the deal. But since the company is expanding and already surpassed Indian Airlines, it has some support from them.\n\nAdditionally, the IPO is part of a series that Indian companies are doing this year to help them grow in an economy that's booming. So, Jet's IPO isn't just about buying new planes; it's also about getting more money to go after its expansion and competition issues.\n\nI think I should mention how many shares were sold, the amount raised, and why investors are interested in Jet despite any oversubscription. Also, include their plans to buy new planes and reduce debt, which shows they're looking for a stable business environment.\n\nSo putting it all together: Investors snapped up Jet's 17 million shares quickly, raising significant funds, with hopes of solidifying their presence in India's air travel market despite potential oversubscription. Their strategy is clear—buy more planes, reduce debt, and support existing strong competitors.\n</think>\n\nBuyers snapped up Jet Airways' 17.3 million shares on Friday, marking the initial public offer (IPO). The company raised at least 16.4 billion rupees ($375m; £198m) from the offering, driven by optimism about India's growing air travel market. Despite potential oversubscription, investors are drawn to Jet's plans to invest in new planes and reduce debt, as well as its position to compete with established competitors like Indian Airlines.", "tinyllama:1.1b": "Investors snapped up shares in Jet Airways following the launch of its much anticipated initial public offering (IPO), with shares selling for 17.3 million units within 10 minutes of opening, on Friday. The IPO was widely expected to generate at least £198m ($375m) from a stock offering, according to analysts. While Jet's share offer is the first in a series of expected IPOs this year, it faces stiff competition and low-cost carriers. The company has grown rapidly since its foundation in 1993 by London-based travel agent Naresh Goyal.", "tinydolphin:1.1b": " Investors have snapped up shares in Jet Airways, India's biggest airline, following the launch of its much anticipated initial public offer (IPO). The IPO for 17.3 million shares was fully sold within 10 minutes of opening, on Friday. Analysts expect Jet to raise at least 16.4 billion rupees ($375 million; £198 million) from the offering. The share offer has been oversubscribed, with investors snapping up shares at a rate of about 20% of its equity. Jet plans to use the cash to buy new planes and cut its debt, which it had amassed in response to financial losses in the past. With its rapid growth, Jet Airways now competes with state-owned flag carrier Indian Airlines, but faces stiff competition from low-cost carriers.", "phi:2.7b": " The shares of Jet Airways, India's largest airline, were bought by investors during its initial public offer (IPO) that was fully sold within 10 minutes. This is because of the company's planned expansion and hopes for growth in India's air travel market. Jet aims to use the raised funds to buy new planes and reduce debt. Despite competition from other airlines, it has grown rapidly since its founding in 2003. This IPO comes amidst a wave of expected share offers by Indian companies this year.\n", "orca-mini:3b": " Investors have purchased all 17.3 million shares of Jet Airways in just ten minutes of the company's initial public offer (IPO) opening. The IPO generated at least 16.4 billion rupees ($375 million; £198 million) for the airline. With the success of the offering, Jet plans to use the cash to purchase new planes and reduce its debt. However, the airline faces stiff competition from other airlines in India's rapidly growing aviation industry.", "hermes3:3b": "Jet Airways shares heavily bought; IPO fully subscribed within 10 mins.<|end_of_text|><|begin_of_text|>IPO raises at least $375m for company to buy planes & reduce debt.", "stablelm-zephyr:3b": "Investors quickly purchased shares in Jet Airways, India's largest airline, during its initial public offering (IPO). The fully sold IPO within 10 minutes, raising at least 16.4 billion rupees ($375m; £198m). This sum will be used to purchase new planes and reduce debt. Jet has experienced rapid growth since launching in 1993, surpassing state-owned carrier Indian Airlines. Its success has sparked interest in the IPO, as well as similar share offerings from other Indian companies seeking funds to grow in a rapidly expanding economy.", "chatgpt-4o-latest": "Investors quickly bought up shares in Jet Airways, India's largest airline, as its IPO was fully sold within 10 minutes of opening. The offering of 17.3 million shares is expected to raise at least 16.4 billion rupees ($375 million). Strong interest was driven by optimism about India's growing air travel market. The IPO, representing 20% of Jet's equity, was oversubscribed. Founded by London-based Naresh Goyal, Jet plans to use the funds to buy new planes and reduce debt. Despite rapid growth since 1993, it faces competition from rivals and low-cost carriers. This IPO is the first of several expected from Indian companies seeking funds in a fast-growing economy.", "stablelm2:1.6b": "Buyers purchase shares in Jet Airways following successful initial public offer (IPO). The 3 million share offering was fully sold within minutes, raising at least ₹4.1 billion ($58 million, £50 million) with oversubscription. Growth in India's air travel market has fueled interest. Jet plans to use funds for buying new planes and cutting debt; it overtook state-owns flag carrier Indian Airlines. Competition from rivals, low-cost carriers poses challenges. IPO marks first of multiple expected share offerings this year as Indian companies seek funds to support growing economies.", "granite3.1-dense:2b": "Investors quickly purchased shares in Jet Airways, India's largest airline, during its highly anticipated initial public offering (IPO). The IPO for 17.3 million shares was fully sold within 10 minutes and is expected to generate at least 16.4 billion rupees ($375m; £198m) for the company. This oversubscription indicates strong market expectations for India's growing air travel sector. Jet, founded by Naresh Goyal, aims to allocate the funds towards acquiring new aircraft and reducing debt. Despite its rapid expansion since 1993, surpassing state-owned Indian Airlines, Jet competes with other carriers and low-cost airlines. This IPO marks the beginning of a series of share offerings from Indian firms this year to fund their operations in an expanding economy.", "reference": "Jet's IPO is the first in a series of expected share offers from Indian companies this year, as they move to raise funds to help them do business in a rapidly-growing economy.Investors have snapped up shares in Jet Airways, India's biggest airline, following the launch of its much anticipated initial public offer (IPO).The share offer, representing about 20% of Jet's equity, was oversubscribed, news agency Reuters reported.The IPO for 17.3 million shares was fully sold within 10 minutes of opening, on Friday."}