{"raw_text": "Deutsche Boerse boosts dividend\n \n Deutsche Boerse, the German stock exchange that is trying to buy its London rival, has said it will boost its 2004 dividend payment by 27%.\n \n Analysts said that the move is aimed at winning over investors opposed to its bid for the London Stock Exchange. Critics of the takeover have complained that the money could be better used by returning cash to shareholders. Deutsche Boerse also said profit in the three months to 31 December was 120.7m euros ($158.8m; £83.3m). Sales climbed to 364.4m euros, lifting revenue for the year to a record 1.45bn euros.\n \n Frankfurt-based Deutsche Boerse has offered £1.3bn ($2.48bn; 1.88bn euros) for the London Stock Exchange. Rival pan-European bourse Euronext is working also on a bid. Late on Monday, Deutsche Boerse said it would lift its 2004 dividend payment to 70 euro cents (£0.48; $0.98) from 55 euro cents a year earlier. \"There is a whiff of a sweetener in there,\" Anais Faraj, an analyst at Nomura told the BBC's World Business Report. \"Most of the disgruntled shareholders of Deutsche Boerse are complaining that the money that is being used for the bid could be better placed in their hands, paid out in dividends,\" Mr Faraj continued. Deutsche Boerse is \"trying to buy them off in a sense\", he said.\n", "llama3.2:1b": "Deutsche Boerse will boost its dividend payment by 27% and lift it from £0.55 to £0.70 per share as part of efforts to win over investors opposed to its bid for the London Stock Exchange.", "llama3.2:3b": "Deutsche Boerse boosts 2004 dividend payment by 27% in an effort to win over investors opposed to its bid for the London Stock Exchange, as the company reports record revenue and profit.", "gemma2:2b": "Deutsche Boerse will increase its 2004 dividend by 27%. The move aims to appease investors who oppose the company's bid for the London Stock Exchange.  Sales and profits have been strong, and Deutsche Boerse has offered £1.3 billion for the LSE. \n", "qwen2.5:0.5b": "Deutsche Boerse has announced that it will boost its 2004 dividend by 27%. Analysts say this move aims to win over investors who oppose the takeover of the London Stock Exchange. The company's revenue for the year was £1.45 billion, up from £1.35 billion a year earlier. Rival rival Euronext has also been working on a bid.", "qwen2.5:1.5b": "Deutsche Boerse plans to boost its 2004 dividend by 27%, aiming to win over investors skeptical of the German stock exchange's bid for London's Stock Exchange and returning cash to shareholders, while reporting earnings growth and revenue records.", "qwen2.5:3b": "Deutsche Boerse has increased its 2004 dividend payment by 27% to 70 euro cents from 55 euro cents, aligning with analysts' expectations that this move aims to win over investors opposing its bid for the London Stock Exchange. Deutsche Boerse's profit in Q4 was 120.7m euros ($158.8m; £83.3m), and sales reached 364.4m euros, boosting annual revenue to a record 1.45bn euros. The company is offering £1.3bn for the London Stock Exchange. Analysts suggest this dividend increase could be seen as a form of compensation or \"sweetener\" for investors wary of Deutsche Boerse's acquisition plans.", "opencoder:1.5b": "Deutsche Boerse boosts dividend\n\nDeutsche Boerse, which owns and operates the German stock exchange, has announced that it will raise its 2004 dividend payment by 27% under a proposed new agreement signed by the London Stock Exchange and Deutsche Bank in early 2005. The move is aimed at defeating investors who opposed its bid for the London Stock Exchange on the day of its launch.\n\nCritics have expressed concerns about the potential return of money invested in the exchange, particularly given that it now provides funds to fundraise against the ongoing economic slowdowns and increased trading activity. Despite this, Deutsche Boerse said profit had been in the three months to 31 December, upholding a record-breaking dividend payout of approximately $158.8m (approximately £83.3m) for the year.\n\nDeutsche Boerse's sales have also risen significantly since its launch, leading to elevated revenue figures from 1.45bn euros to 364.4m euros, reflecting increased trading activity and growth in the market.\n\nFurthermore, Deutsche Boerse is offering a bid worth an estimated $1.3bn (approximately $2.48bn; approximately 1.88bn euros) for the London Stock Exchange in Frankfurt, which is a major hub of the German stock market. The move was announced to draw attention from investors who are currently facing stiff competition and slow economic pace.\n\nIn terms of dividend payments, Deutsche Boerse has shifted from an initial 55 euro cents to 70 euro cents payment, reflecting a further boost compared to the previous one of 55 euro cents. While this increase may be offset by a positive perception that the bid will pay off its debts, investors are still reluctant due to concerns about potential default risks.\n\nTo conclude, while Deutsche Boerse is seeking to capitalize on its strong financial performance and market positioning, it remains cautious about how it allocates its resources for dividend payments. The move is seen as an investment opportunity aimed at defending against the tumultuous conditions imposed by trading activity and easing competition in the market.\n", "smollm:1.7b": "The summary should preserve key ideas and details:\n\n1. Deutsche Boerse boosts dividend payment by 27%\n2. The move is aimed at winning over investors opposed to the takeover\n3. Profit in the three months to December was 120.7 million euros ($158.8m; £83.3m)\n4. Sales climbed to 364.4 billion euros, lifting revenue for the year to a record 1.45bn euros\n5. Frankfurt-based Deutsche Boerse offered £1.3bn ($2.48bn; 1.88bn euros) for the London Stock Exchange\n6. Rival pan-European bourse Euronext is working on a bid\n7. Late on Monday, Deutsche Boerse said it would lift its 2004 dividend payment to 70 euro cents ($0.48; £0.98) from 55 euro cents a year earlier\n8. There is a whiff of a sweetener in there: most of the disgruntled shareholders of Deutsche Boerse are complaining that the money that is being used for the bid could be better placed in their hands, paid out in dividends\n9. Most of the disgruntled shareholders of Deutsche Boerse are complaining that the money that is being used for the takeover could be better placed in their hands\n10. Deutsche Boerse is \"trying to buy them off\" by offering a dividend payment of 70 euro cents ($0.48; £0.98) per year, which would be lower than the previous offer of 55 euro cents ($0.98).", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Deutsche Boerse boosting its dividend. Let's start by reading through the provided passage carefully.\n\nThe main points are: Deutsche Boerse has increased their 2004 dividend payment by 27%. Analysts say this move is aimed at attracting investors opposed to their bid for the London Stock Exchange, while critics complain that the funds could be better used returning cash. The company's revenue and profit figures are also mentioned, along with their recent offer to London Stock Exchange for £1.3 billion.\n\nI should make sure I capture all key details without unnecessary fluff. I'll start by stating that Deutsche Boerse is boosting its dividend. Then mention the 27% increase and who provided the funds. Next, highlight the focus of the move—attracting investors against the London Stock Exchange—and the criticism from opponents. Include their financial figures like revenue and profit, as well as their proposed offer to London Stock Exchange.\n\nI need to ensure the summary is concise, only including the main points without any explanations or formatting. Just plain text with key ideas preserved.\n</think>\n\nDeutsche Boerse boosts its dividend by 27%, increasing payments for 2004. Analysts aim to attract investors against London rival but critics complain funds should return cash. Revenue and profit from three months showed €120.7m, sales rose to £364.4m, revenue exceeded records at 1.45bn euros. Deutsche Boerse plans a £1.3bn offer for London Stock Exchange, competing with Euronext. Analyst Faraj says the dividend increase reflects their effort to acquire German firms.", "tinyllama:1.1b": "German stock exchange company Deutsche Boerse has announced plans to boost its 2004 dividend payment by 27% from £0.48 (US$0.98) per share to £0.60 ($1.50), with the move aimed at winning over investors who have criticized the takeover bid for not returning profits to shareholders. The move comes as Deutsche Boerse reported a 27% increase in profit for the third quarter of fiscal year 2004, compared to a 12.8% rise during the same period last year. Deutsche Boerse's takeover offer is currently being worked on by rival pan-European stock exchange Euronext. Despite these moves, some shareholders have criticized the bid for not allocating enough of its proceeds toward dividends, and analyst Anaïs Faraj from Nomura believes that the company could use the extra cash in their hands to \"pay out in dividends\" to investors opposed to the takeover.", "tinydolphin:1.1b": " In December, Deutsche Boerse, Germany's stock exchange, announced that they will increase the 2004 dividend payment by 27%. This decision comes as they compete with rival London Stock Exchange for control of the European stock exchange market. The increased dividend payment is aimed at winning over investor opposition to the takeover, and may be part of a broader effort to improve Deutsche Boerse's reputation and attract investors. Despite concerns about potential losses for shareholders due to the high cost of the bid, the stock exchange remains committed to its goal of dominating European stock markets.", "phi:2.7b": " The German stock exchange Deutsche Boerse is increasing its 2004 dividend payment by 27% and reports that profit for the year was 1.45 billion euros with sales climbing to 364 million euros. This move is aimed at winning over investors opposed to its takeover of the London Stock Exchange, which has been criticized by some as an example of returning cash to shareholders could be used in a better way.\n", "orca-mini:3b": " The German stock exchange Deutsche Boerse has announced an increase in its dividend payment by 27%. This move is aimed at winning over investors who are opposed to its bid for the London Stock Exchange.", "hermes3:3b": "Deutsche Boerse increases 2004 dividend by 27% to attract investors opposed to London stock exchange takeover.", "stablelm-zephyr:3b": "Deutsche Boerse, the German stock exchange attempting to purchase its London competitor, has increased its 2004 dividend payment by 27% to win over investors opposed to the takeover. The move aims to address concerns that the money could be better used for returning cash to shareholders. Deutsche Boerse reported a profit of 120.7 million euros and sales growth of 364.4 million euros in the three months ending 31 December, resulting in a record revenue of 1.45 billion euros for the year.", "chatgpt-4o-latest": "Deutsche Boerse, the German stock exchange bidding for the London Stock Exchange, announced a 27% increase in its 2004 dividend to 70 euro cents. Analysts see this as an attempt to appease investors opposed to the takeover, who argue the funds should be returned to shareholders instead. The company reported a quarterly profit of 120.7 million euros and record annual revenue of 1.45 billion euros. Deutsche Boerse has offered £1.3 billion for the London Stock Exchange, while rival Euronext is also preparing a bid. Analyst Anais Faraj suggested the dividend increase is a \"sweetener\" to win over disgruntled shareholders.", "stablelm2:1.6b": "Deutsche Boerse, the German stock exchange attempting to acquire London's stock exchange, announces a 10% increase in dividend payments, aimed at appeasing investors opposed to its takeover bid. The exchange also revealed profit for Q4 at €7 million ($8.3M; £6.8M) and sales of €4 million ($5M). They have offered £1.3bn ($2.4B) for the London Stock Exchange, while rival Euronext is working on a bid as well. The dividend payment will rise to €0.02 per share (£0; $0.02) from €0.01 (previous year). Analyst Anais Faraj suggests Deutsche Boerse is using the \"sweetener\" to purchase shares held by disgruntled shareholders.", "granite3.1-dense:2b": "Deutsche Boerse, the German stock exchange seeking to acquire London's rival, has announced a 27% increase in its 2004 dividend payment to 70 euro cents per share from 55 euro cents previously. This move aims to persuade investors opposing the takeover, who argue the funds would be better returned as dividends rather than spent on acquiring the London Stock Exchange. The company reported a profit of 120.7 million euros and sales of 364.4 million euros for Q4, bringing yearly revenue to a record 1.45 billion euros. Deutsche Boerse's offer for the London Stock Exchange stands at £1.3 billion ($2.48 billion; 1.88 billion euros). Analysts suggest this dividend hike serves as a form of compensation to disaffected shareholders, with Nomura analyst Anais Faraj describing it as a \"sweetener\" meant to appease critics.", "reference": "Deutsche Boerse, the German stock exchange that is trying to buy its London rival, has said it will boost its 2004 dividend payment by 27%.Deutsche Boerse is \"trying to buy them off in a sense\", he said.\"Most of the disgruntled shareholders of Deutsche Boerse are complaining that the money that is being used for the bid could be better placed in their hands, paid out in dividends,\" Mr Faraj continued.Frankfurt-based Deutsche Boerse has offered £1.3bn ($2.48bn; 1.88bn euros) for the London Stock Exchange.Deutsche Boerse also said profit in the three months to 31 December was 120.7m euros ($158.8m; £83.3m)."}