{"raw_text": "US bank 'loses' customer details\n \n The Bank of America has revealed it has lost computer tapes containing account details of more than one million customers who are US federal employees.\n \n Several members of the US Senate are among those affected, who could now be vulnerable to identity theft. Senate sources say the missing tapes may have been stolen from a plane by baggage handlers. The bank gave no details of how the records disappeared, but said they had probably not been misused. Customers' accounts were being monitoring and account holders would be notified if any \"unusual activity\" was detected, bank officials said.\n \n Bank of America said the tapes went missing in December while being shipped to a back-up data centre. \"We, with federal law authorities, have done a very robust, thorough investigation on this and neither we nor they would make the statement lightly that we believe those tapes to be lost,\" Alexandra Tower, a spokeswoman for the North Carolina-based bank, told Time magazine. But although there was no evidence of criminal activity, the bank said, the Secret Service - a federal agency whose brief includes investigations of serious financial crime - is said to be looking into the loss. New York Senator Charles Schumer said he was told by the Senate Rules Committee that the tapes were probably stolen from a commercial plane. \"Whether it is identity theft, terrorism, or other theft, in this new complicated world baggage handlers should have background checks and more care should be taken for who is hired for these increasingly sensitive positions,\" the Democrat senator said. Details of his Vermont colleague Pat Leahy's credit card account are among those missing, Senator Leahy's spokeswoman Tracy Schmaler said. About 900,000 military and civilian staff at the defence department are among the 1.2 million affected, according to a Pentagon spokesman.\n", "llama3.2:1b": "US bank Bank of America has lost computer tapes containing account details of over one million customers who are US federal employees. The tapes went missing in December while being shipped to a back-up data centre and have not been misused or stolen by individuals. However, the Secret Service is investigating the loss. The incident highlights concerns about security and background checks for individuals hired with sensitive positions.", "llama3.2:3b": "Bank of America has lost computer tapes containing account details of over one million US federal employees, including several senators, due to a shipment of tapes being stolen from a plane in December. The bank says no evidence suggests criminal misuse but is cooperating with the Secret Service investigation. The affected include 900,000 military and civilian staff at the defense department.", "gemma2:2b": "Bank of America lost computer tapes containing details of more than one million US federal employee accounts.  The tapes were likely stolen from a commercial plane while being shipped to a backup data centre. The bank is investigating and says no evidence suggests the records were misused. However, the Secret Service is involved due to its role in financial crime investigations. \n", "qwen2.5:0.5b": "The Bank of America has lost computer tapes containing customer account details of US federal employees. The bank is investigating if they were misused but no evidence of criminal activity was found, the Secret Service is also looking into the loss. About 900,000 military and civilian staff at the Pentagon are affected.", "qwen2.5:1.5b": "US bank loses over one million customer records held on tape, possibly due to theft from airport baggage handlers; federal agencies investigating, with Senate officials expressing concern about potential identity theft and terrorism risks.", "qwen2.5:3b": "US bank Bank of America has lost computer tapes containing account details of over one million federal employees, including several US Senators. The missing tapes may have been stolen from a plane by baggage handlers. Senator Charles Schumer suggests background checks should be mandatory for baggage handlers due to the sensitive nature of the information involved. While no evidence of misuse was found, the Secret Service is investigating. Customers' accounts are being monitored; if unusual activity is detected, account holders will be notified.", "opencoder:1.5b": "The Bank of America has revealed it has lost computer tapes containing account details of more than one million customers who are US federal employees. Several members of the US Senate are among those affected, who could now be vulnerable to identity theft. The bank gave no details of how the records disappeared, but said they had probably not been misused. Customers' accounts were being monitoring and account holders would be notified if any \"unusual activity\" was detected.\n", "smollm:1.7b": "The Bank of America has lost computer tapes containing account details of more than one million US federal employees. The tapes went missing in December while being shipped to a back-up data centre. The bank gave no details of how the records disappeared, but said they had probably not been misused. Customers' accounts were being monitored and account holders would be notified if any \"unusual activity\" was detected.\nThe Bank of America said the tapes went missing in December while being shipped to a back-up data centre. The bank gave no details of how the records disappeared, but said they had probably not been misused. Customers' accounts were being monitored and account holders would be notified if any \"unusual activity\" was detected.\nThe Bank of America said it is investigating the loss of the tapes, but whether it is identity theft or other forms of financial crime is unclear. In this new complicated world, baggage handlers should have background checks and more care should be taken for who is hired for these increasingly sensitive positions.\nAbout 900,000 military and civilian staff at the defence department are among those affected by the loss of the tapes. The bank's spokeswoman said about 1.2 million US federal employees were affected by the loss of the tapes.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about US bank losing customer details. The user wants only the summary in plain text without any explanations or formatting.\n\nFirst, I'll read through the entire paragraph carefully to understand the key points. It starts by stating that Bank of America has lost computer tapes with account details for over a million US federal employees.\n\nThen it mentions that several Senate members are among those affected and they're vulnerable to identity theft. The sources say the tapes might have been stolen from a plane, possibly by baggage handlers. They also note that the bank hasn't provided any details on how the records disappeared but confirmed that none were misused.\n\nNext, there's information about customer monitoring and account holder notifications if unusual activity is detected. Bank officials said they've done an extensive investigation with federal law authorities, which neither they nor the authorities would say lightly that they believe the tapes are lost.\n\nAdditionally, the bank refers to the Secret Service as looking into this loss, though it's linked to more complex financial crimes like identity theft or terrorism. The text also mentions specific examples of missing accounts, including Pat Leahy's credit card and others from the defense department.\n\nI need to make sure that all these points are included concisely in the summary without adding any explanations or extra information. I'll structure it by first stating that the bank lost account details of over a million employees, mention the Senate impact, possible theft sources, customer monitoring, and specific examples affected.\n</think>\n\nUS bank 'loses' employee accounts  \nThe Bank of America has revealed it has lost computer tapes containing account details for over a million US federal employees. Several U.S. Senate members are among those affected, who could now be vulnerable to identity theft. The missing tapes might have been stolen from a plane by baggage handlers. Customers’ accounts were being monitored and account holders would be notified if any unusual activity was detected. Bank officials said the tapes went missing in December while being shipped to a backup data center. They confirmed that neither the bank nor federal law authorities would make lightly believed statements regarding their loss, though the Secret Service is investigating this as linked to more complex financial crimes. Specific examples include Pat Leahy's credit card and several from the defense department.", "tinyllama:1.1b": "The US bank, Bank of America, has reportedly lost computer tapes containing sensitive account details of more than one million federal employees and US citizens who were travelling or working in the Department of Defence. The missing tapes may have been stolen from a commercial plane while being shipped to a backup data centre. According to Senate sources, the tapes went missing in December, and bank officials stated that they had conducted a \"robust\" investigation into the loss, with neither the bank nor federal authorities believing there was any criminal activity involved. The missing tapes included details of Bank of America customers' credit cards, as well as information about their accounts at the Department of Defence, including employee numbers and account holder names. A report by Time magazine claimed that bank officials stated that the tapes went missing in December while being shipped to a backup data centre. Senator Charles Schumer stated that it was \"likely\" that baggage handlers were responsible for the tapes' loss, while Senate Republican leader Mitch McConnell said that employees of the US Defence Department should undergo background checks and be provided with additional protection. The report noted that details of 1.2 million military and civilian staff at the Dept of Defense are also missing, and that the affected individuals included over 900,000 employees and more than one million civilians in the US federal government who were traveling or working for US Citizens.", "tinydolphin:1.1b": " Bank of America has lost computer tapes containing details of over one million US federal employee customers. The lost records may have been stolen from a commercial plane by baggage handlers while being shipped to a backup data centre. However, Bank of America officials have not said if any unusual activity was detected on these accounts. \n\nSenators are investigating the loss, with US Senator Charles Schumer stating that it seems likely that the tapes were stolen from a commercial plane during transportation. The Senate Rules Committee has also confirmed that the lost records belong to US federal employees, while new details about the investigation have been provided by Senator Schumer.", "phi:2.7b": " The Bank of America lost computer tapes containing account details of more than 1 million US federal employees. Some senators may be affected and bank officials say they have been monitoring their accounts for unusual activity. The tapes were probably stolen from a plane by baggage handlers, but no evidence of criminal activity has been found yet. The Secret Service is investigating the loss. New York Senator Charles Schumer said the tapes were likely stolen from a commercial plane and that more care should be taken for who hires these sensitive workers.", "orca-mini:3b": " The US bank Bank of America has lost computer tapes containing account details of more than one million customers who are US federal employees. Several members of the US Senate were affected, making them vulnerable to identity theft. The missing tapes may have been stolen from a plane by baggage handlers, and the Secret Service is investigating the loss. No evidence of criminal activity was found, but the bank said the tape could have been misused. Bank officials believe the tapes were probably stolen from a commercial plane.", "hermes3:3b": "Bank of America loses customer details of over 1m US federal employees.", "stablelm-zephyr:3b": "Bank of America lost computer tapes containing account details of over one million US federal employees, including several senators, leading to potential identity theft risks. The tapes were likely stolen from a plane by baggage handlers. Although there was no evidence of criminal activity, the Secret Service is investigating the matter. Around 900,000 military and civilian staff at the defense department are affected, along with 1.2 million other customers.", "chatgpt-4o-latest": "Bank of America has lost computer tapes containing account details of over one million US federal employees, including members of the Senate. The tapes, which went missing in December while being shipped to a backup data center, may have been stolen from a plane by baggage handlers. The bank stated there was no evidence of misuse but is monitoring accounts for unusual activity. The Secret Service is investigating the loss, and Senator Charles Schumer has called for stricter background checks for baggage handlers. Among those affected are 900,000 military and civilian defense department staff.", "stablelm2:1.6b": "Bank of America lost computer tapes containing account details of over 1 million US federal employees, potentially exposing customers to identity theft. The lost tapes were shipped to a backup data center in December but contain information on monitoring and possible unusual activity if any occur. Although there's no evidence of criminal activity, the Secret Service is reportedly investigating the loss. Senators Schumer and Leahy express concerns about background checks for baggage handlers and possible theft from commercial planes.", "granite3.1-dense:2b": "Bank of America reported the loss of computer tapes containing account details for over one million US federal employees, including several Senators. The missing tapes, presumed stolen from a commercial plane by baggage handlers, were being transported to a backup data center in December. Despite an investigation, no evidence of criminal activity was found, but the Secret Service is now involved in the inquiry. Customers will be notified if any unusual account activities are detected. Affected individuals include around 900,000 military and civilian Defense Department staff, as well as a few Senators like Charles Schumer and Pat Leahy, whose credit card details are among the lost records. The incident underscores the need for enhanced security measures for personnel handling sensitive information during air travel.", "reference": "New York Senator Charles Schumer said he was told by the Senate Rules Committee that the tapes were probably stolen from a commercial plane.Bank of America said the tapes went missing in December while being shipped to a back-up data centre.But although there was no evidence of criminal activity, the bank said, the Secret Service - a federal agency whose brief includes investigations of serious financial crime - is said to be looking into the loss.Customers' accounts were being monitoring and account holders would be notified if any \"unusual activity\" was detected, bank officials said.The Bank of America has revealed it has lost computer tapes containing account details of more than one million customers who are US federal employees."}