{"raw_text": "Bank payout to Pinochet victims\n \n A US bank has said it will donate more than $8m to victims of former Chilean military ruler Augusto Pinochet's regime under a Madrid court settlement.\n \n Riggs Bank will put money in a special fund to be managed by a Madrid-based charity, the Salvador Allende Foundation, which helps abused victims. The bank had been accused of illegally concealing Gen Pinochet's assets. More than 3,000 people were killed for political reasons under Gen Pinochet's regime, an official report says. Last month in a US court, Riggs Bank pleaded guilty to failing to report suspicious activity relating to accounts held by Gen Pinochet and the government of Equatorial Guinea. On that occasion, it was ordered to pay a fine of $16m. Gen Pinochet himself has never been put on trial for human rights violations under his 1973-90 rule, despite several high-profile cases against him. He is now facing charges relating to the murder of one Chilean and the disappearance of nine others. He is also being investigated for tax evasion, tax fraud and embezzlement of state funds.\n \n The general's opponents rejoiced at the settlement, which was agreed in a court in the Spanish capital, Madrid. A lawyer for the victims, Eduardo Contreras, told Reuters news agency: \"This demonstrates that the horrors of the Pinochet dictatorship are not a mystery to anyone and that the whole world knows his victims deserve reparations.\" Riggs spokesman Mark Hendrix said the settlement, details of which will be announced next week, was an opportunity to move on. \"This enables the institution to put the matter behind us,\" he told Reuters. The settlement follows a legal complaint filed against the bank by Spanish Judge Baltasar Garzon alleging that it had illegally concealed assets. The bank agreed to create a fund for the victims, but the charges were dropped.\n", "llama3.2:1b": "A US bank, Riggs Bank, will donate over $8m to Chilean victims of former dictator Augusto Pinochet's regime under a Madrid court settlement. The bank previously faced allegations of concealing Pinochet's assets and has agreed to create a fund for the victims' reparations.", "llama3.2:3b": "A US bank will donate over $8m to victims of Augusto Pinochet's regime in a Madrid court settlement. Riggs Bank pleaded guilty to failing to report suspicious activity related to accounts held by Pinochet and Equatorial Guinea, and was ordered to pay a fine of $16m. The fund will be managed by the Salvador Allende Foundation, which helps abused victims. Gen Pinochet faces charges for human rights violations, murder, and embezzlement, but has never been put on trial for these crimes.", "gemma2:2b": "Riggs Bank will donate over $8 million to victims of Augusto Pinochet's regime in Chile. The settlement comes after an agreement with Spanish Judge Baltasar Garzon and follows accusations that Riggs Bank concealed Gen. Pinochet's assets. This marks a significant step towards addressing human rights abuses during Pinochet's dictatorship, but the general himself continues to face investigations for other crimes. \n", "qwen2.5:0.5b": "A US bank is donating more than $8 million to victims of former Chilean military ruler Augusto Pinochet's regime. The bank will put the money in a special fund managed by a Salvador Allende Foundation, which helps abused victims. More than 3,000 people were killed for political reasons under Gen Pinochet's regime and are currently facing charges related to his tax evasion, tax fraud, embezzlement of state funds, and murder. The bank has agreed to create a fund with the goal of helping victims in their legal battle against Gen Pinochet.", "qwen2.5:1.5b": "Riggs Bank has donated over $8 million to Pinochet's regime victims in exchange for a court settlement of $16 million. This enables Riggs to move on from the matter, while Spanish Judge Baltasar Garzon dropped charges against the bank alleging illegal asset concealment.", "qwen2.5:3b": "A US bank, Riggs, has donated over $8 million from its settlement with Madrid court regarding former Chilean military ruler Augusto Pinochet's regime. The money will be used by a charity in Madrid to help victims of political killings under Pinochet's rule. More than 3,000 people were killed for political reasons during the regime. The bank pleaded guilty to failing to report suspicious activity related to accounts held by Pinochet and Equatorial Guinea. Despite not being put on trial himself, Pinochet is now facing charges including murder, disappearance of others, and tax evasion. Legal complaints from Spanish Judge Baltasar Garzon prompted the settlement, where Riggs agreed to create a fund for victims, though the judge's charges were dropped. Opponents of Pinochet rejoiced at this settlement.", "opencoder:1.5b": "The bank has announced plans to donate more than $8 million in recognition of the actions of former Chilean military regime Augusto Pinochet. The settlement details were filed under Spanish judge Baltasar Garzon's complaint against it. The donations fund is managed by a Spanish-based charity, the Salvador Allende Foundation. The bank was accused of concealing Gen Pinochet's assets in court and the government of Equatorial Guinea has been ordered to pay a fine of $16 million. Pinochet himself has never been put on trial for violations of human rights. Despite several high-profile cases against him, charges are being brought against one Chilean and the disappearance of nine others. It is also being investigated for tax evasion, tax fraud, embezzlement of state funds and other related matters.\n", "smollm:1.7b": "The summary should preserve key ideas and details from the original text:\n\n1. A US bank has said it will donate more than $8m to victims of former Chilean military ruler Augusto Pinochet's regime under a Madrid court settlement.\n2. Riggs Bank will put money in a special fund to be managed by a Madrid-based charity, the Salvador Allende Foundation, which helps abused victims.\n3. The bank had been accused of illegally concealing Gen Pinochet's assets. More than 3,000 people were killed for political reasons under Gen Pinochet's regime, an official report says. Last month in a US court, Riggs Bank pleaded guilty to failing to report suspicious activity relating to accounts held by Gen Pinochet and the government of Equatorial Guinea. On that occasion, it was ordered to pay a fine of $16m. Gen Pinochet himself has never been put on trial for human rights violations under his 1973-90 rule, despite several high-profile cases against him. He is now facing charges relating to the murder of one Chilean and the disappearance of nine others. He is also being investigated for tax evasion, tax fraud and embezzlement of state funds.\n4. The general's opponents rejoiced at the settlement, which was agreed in a court in the Spanish capital, Madrid. A lawyer for the victims, Eduardo Contreras, told Reuters news agency: \"This demonstrates that the horrors of the Pinochet dictatorship are not a mystery to anyone and that the whole world knows his victims deserve reparations.\" Riggs spokesman Mark Hendrix said the settlement was an opportunity to move on. \"This enables the institution to put the matter behind us,\" he told Reuters. The settlement follows a legal complaint filed against the bank by Spanish Judge Baltasar Garzon alleging that it had illegally concealed assets. The bank agreed to create a fund for the victims, but the charges were dropped.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into just the key ideas and details. Let me read through each paragraph carefully.\n\nThe first paragraph mentions that the US bank Riggs Bank is donating over $8 million to Pinochet victims under a Madrid court settlement. So, the main idea here is the donation from the US bank to these victims.\n\nThen, there's an official report saying more than 3,000 people were killed because of Gen Pinochet's regime. I should note that despite his rule being illegal, many civilians were killed for their political reasons.\n\nNext, Riggs Bank was accused of not reporting suspicious accounts. The court in Madrid accepted them under the settlement, paying a fine of $16 million. That's important because it shows the bank's responsibility and the legal process involved.\n\nI shouldn't mention that Gen Pinochet hasn't been tried for human rights issues since 1973-90, but I do need to include his current charges: murder, disappearance, tax evasion, fraud, and embezzlement. These details are crucial about the situation and the consequences.\n\nAlso, the general's opponents in Spain were positive because of the settlement, stating that the victims deserve reparations. The bank agreed with the court's decision but dropped the charges, which is a good point to include.\n\nI should make sure not to add any explanations or reasoning; just keep it concise as per the instructions. No markdown, plain text only.\n</think>\n\nA US bank has donated over $8 million to victims of former Chilean military ruler Augusto Pinochet's regime, under a Madrid court settlement. Riggs Bank accepted a fine for failing to report suspicious accounts and paid $16 million. More than 3,000 civilians were killed in his regime, and the bank managed a fund for these victims. Pinochet is facing charges including murder, disappearance, tax evasion, fraud, and embezzlement. The Spanish court accepted the bank's claim but dropped the charges. A positive note from Spanish law opponents highlights the recipients' rights.", "tinyllama:1.1b": "The US bank RiGHS (Rigg Bank) has announced a donation of more than $8m to a Madrid-based charity for the benefit of victims of former Chilean military ruler Augusto Pinochet's regime and his government's abused victim's. The bank pleaded guilty to failing to report suspicious activity related to accounts held by Gen Pinochet and the government of Equatorial Guinea, and was ordered to pay a fine of $16m for doing so. Gen Pinochet himself has never been put on trial for human rights violations, despite several high-profile cases against him. He is now facing charges relating to the murder of one Chilean and the disappearance of nine others. The bank's general's opponents rejoiced at a settlement announced in Madrid last month, which was agreed after years of legal proceedings. RiGHS said it will put money into a special fund managed by a Madrid-based charity to help abused victim's, with details expected to be announced next week. The bank had been accused of illlegally concealing assets under Gen Pinochet's regime, but the charges were dropped in April 2018.", "tinydolphin:1.1b": " In a recent ruling, a US bank has decided to donate more than $8m to victims of former Chilean military ruler Augusto Pinochet's regime under a Madrid court settlement. Riggs Bank will put money in a special fund managed by a Salvador Allende Foundation, which assists those affected by abused victims. The bank faced a legal battle for allegedly failing to report suspicious activity related to accounts held by Gen Pinochet and the government of Equatorial Guinea. Despite this, Riggs Bank has now agreed to contribute $8m to the Salvador Allende Foundation and ensure access to justice for the victims' families.", "phi:2.7b": " Riggs Bank will donate over $8 million to victims of former Chilean dictator Augusto Pinochet's regime under a settlement in Spain's Madrid court. The bank had previously been accused of concealing assets related to Gen Pinochet and the government of Equatorial Guinea. More than 3,000 people were killed during Gen Pinochet's rule. Although he has not faced charges for human rights violations, he is currently facing several other charges including tax evasion, fraud, and embezzlement of state funds. The settlement follows a lawsuit filed by Spanish Judge Baltasar Garzon, who accused Riggs Bank of illegally concealing assets related to Gen Pinochet.\n", "orca-mini:3b": " A US bank has agreed to donate more than $8m to a Madrid-based charity to settle a court case linked to the Pinochet regime in Chile. The Salvador Allende Foundation will manage the funds and provide support to victims of the regime. The bank had been accused of concealing Gen Pinochet's assets and failed to report suspicious activity relating to accounts held by him and the government of Equatorial Guinea.", "hermes3:3b": "US bank Riggs donates over $8m to Pinochet regime victims; part of Madrid court settlement.", "stablelm-zephyr:3b": "Riggs Bank will donate over $8m to a Madrid-based charity, the Salvador Allende Foundation, to be managed by them. This charity helps abused Pinochet victims. They pleaded guilty in a US court last month for failing to report suspicious activity related to accounts held by Pinochet and the government of Equatorial Guinea, leading to a $16m fine. The settlement was agreed upon after a legal complaint was filed against the bank by Spanish Judge Baltasar Garzon alleging they had unlawfully concealed assets. The bank will now create a fund for the victims, as part of this agreement.", "chatgpt-4o-latest": "Riggs Bank will donate over $8 million to victims of Augusto Pinochet's regime as part of a Madrid court settlement. The funds will be managed by the Salvador Allende Foundation, a charity aiding victims of abuse. The bank had been accused of illegally concealing Pinochet's assets and previously pleaded guilty in a U.S. court to failing to report suspicious activity, resulting in a $16 million fine. Pinochet, whose regime was responsible for over 3,000 political killings, has never been tried for human rights violations but faces charges related to murder, disappearances, tax evasion, and embezzlement. The settlement, welcomed by victims' advocates, follows a legal complaint by Spanish Judge Baltasar Garzon, which led to the bank agreeing to create the fund in exchange for dropped charges.", "stablelm2:1.6b": "A US bank, Riggs Bank, will donate $8M to Chilean regime victims under a Madrid court settlement, managed by the Salvador Allende Foundation. Riggs has previously been accused of concealing Gen Pinochet's assets and pleaded guilty in a US court for failing to report suspicious activity. Last month, Riggs was ordered to pay a fine of $250K for its actions. More than 3,0 S people were killed under Gen Pinochet's regime. Despite facing multiple high-profile cases against him, Gen Pinochet himself has never been put on trial for human rights violations. He is now facing charges relating to the murder of one Chilean and the disappearance of nine others.", "granite3.1-dense:2b": "US-based Riggs Bank has agreed to donate over $8 million to victims of former Chilean dictator Augusto Pinochet's regime as part of a Madrid court settlement. This funds will be managed by the Salvador Allende Foundation, a charity in Spain that supports abused victims. Riggs Bank previously pleaded guilty to failing to report suspicious activity related to accounts belonging to Pinochet and Equatorial Guinea, resulting in a $16 million US fine. Over 3,000 people were killed during the Pinochet era for political reasons. Despite never being tried for human rights violations, Pinochet now faces charges of murder, disappearances, tax evasion, fraud, and embezzlement. Spanish Judge Baltasar Garzon filed a legal complaint against Riggs Bank for concealing assets, leading to this settlement. Victims' representatives celebrate the agreement as evidence of global recognition of Pinochet's atrocities and the need for reparations. Riggs Bank spokesman stated that the settlement allows the institution to \"move on\" from the matter.", "reference": "A US bank has said it will donate more than $8m to victims of former Chilean military ruler Augusto Pinochet's regime under a Madrid court settlement.The bank had been accused of illegally concealing Gen Pinochet's assets.Last month in a US court, Riggs Bank pleaded guilty to failing to report suspicious activity relating to accounts held by Gen Pinochet and the government of Equatorial Guinea.The bank agreed to create a fund for the victims, but the charges were dropped.The general's opponents rejoiced at the settlement, which was agreed in a court in the Spanish capital, Madrid.Riggs Bank will put money in a special fund to be managed by a Madrid-based charity, the Salvador Allende Foundation, which helps abused victims."}