{"raw_text": "US regulator to rule on pain drug\n \n US food and drug regulators will decide on Friday whether to recommend the sale of painkillers that have been linked to a high risk of heart attack and stroke.\n \n The Food and Drug Administration (FDA) advisory panel will give its verdict after hearing evidence for three days. The painkillers - called COX-2 inhibitors - are sold under brand names such as Celebrex and Vioxx. Vioxx was withdrawn from shops last year but Merck said it would consider selling it if it gets FDA approval. The FDA has been asked to decide if the benefits to patients justify the increased risks.\n \n Putting Vioxx back on the shelves is likely to boost profits at Merck and make easier any legal battles with people who claim to have been injured by the drug, analysts said.\n \n Merck voluntarily stopped sales of Vioxx on 30 September, a move which caused the firm's fourth-quarter earnings to slide to $1.1bn (£581m), from $1.4bn a year earlier. Merck's shares tumbled more than 10% on the news and the company has had to set aside millions of dollars to cover the cost of Vioxx-related litigation. Alarm bells were rung by a research note called Approve which showed that the risk of heart attack and stroke doubled in patients who had been taking the drug for at least 18 months. The Cox-2 inhibitors were developed by drug companies, including Merck and Pfizer, because they cause users fewer stomach problems than other painkillers.\n \n Pfizer is still selling its Celebrex and Bextra products, though investigations have suggested that they may also be harmful to the heart. Merck's announcement of a possible reintroduction of Vioxx caught analysts by surprise. Merck's head of research Peter Kim said that it withdrew Vioxx \"based on the information that was available to us at the time, knowing there were alternative therapies\". He went on to say that things have since changed in the light of new reports. \"Given this new information, its is not clear that the cardiovascular risk observed in Approve makes Vioxx unique in the class of similar drugs marketed in the US,\" Mr Kim explained.\n \n On Thursday, David Graham from the FDA's Office of Drug Safety told the advisory panel that \"there really doesn't appear to be a need for Cox-2\" inhibitors. According to calculations presented to the US Senate by Dr Graham in November, Vioxx may be linked to as many as to 56,000 American deaths. Facing stem criticism for its handling of the Vioxx case, the FDA said on Tuesday that it will create an independent body to oversee the safety of drugs already in the market place. European regulators, meanwhile, ruled on Thursday that patients who have had heart disease or a stroke should not take Cox-2 inhibitors. The European Medicines Agency also said doctors should be \"cautious\" about giving the drugs to patients who have risk factors for heart disease.\n", "llama3.2:1b": "US regulator will decide whether to recommend the sale of painkillers called COX-2 inhibitors, which are linked to a high risk of heart attack and stroke. The FDA advisory panel will hear evidence for three days before making its verdict. Merck has stopped selling Vioxx due to increased risks, but may consider re-introducing it if approved by the FDA. Analysts suggest that boosting sales could boost profits at Merck and make legal battles easier.", "llama3.2:3b": "US food and drug regulator will decide on Friday whether to recommend sale of COX-2 painkillers, which have been linked to a high risk of heart attack and stroke, despite increased risks to justify benefits for patients.", "gemma2:2b": "The Food and Drug Administration (FDA) advisory panel will decide on Friday whether to approve the sale of COX-2 inhibitors, such as Vioxx.  Merck, which voluntarily stopped selling Vioxx in September due to concerns about its link to heart attacks and strokes, may reintroduce it if the FDA approves. The FDA has been asked to consider patient benefits against risks associated with these drugs. Concerns surrounding heart risks have led to investigations by regulators like the European Medicines Agency, who advise caution for patients with pre-existing heart conditions. \n", "qwen2.5:0.5b": "The US Food and Drug Administration (FDA) has ruled on the sale of COX-2 inhibitors such as Vioxx, warning that their risks may outweigh the benefits. FDA will decide within 15 days if they should be added back to the market or not. This news is likely to boost profits for Merck and make easier any legal battles with people who claim to have been injured by the drug.", "qwen2.5:1.5b": "US food and drug regulators will decide Friday whether to recommend COX-2 inhibitors, linked to increased heart attack and stroke risks in some users, for sale despite new evidence suggesting a higher cardiovascular risk. The FDA is expected to approve their sale if benefits outweigh the increased risks. Merck plans to reintroduce Vioxx after voluntary withdrawal due to concerns over its cardiovascular safety.", "qwen2.5:3b": "US food and drug regulators will decide Friday whether to recommend sales of painkillers (COX-2 inhibitors) linked to high risks of heart attack and stroke, including Vioxx which was withdrawn last year but could be reintroduced by Merck if approved. The FDA's advisory panel has heard evidence for three days; the move is expected to benefit Merck financially and in legal battles. Vioxx's withdrawal led to a 10% drop in Merck shares and $581m cost of litigation-related issues. New research suggests doubled heart attack and stroke risks among long-term users, prompting concerns from some experts like FDA's Office of Drug Safety Director David Graham. Pfizer's Celebrex and Bextra are also under investigation for cardiovascular risks. European regulators warn against using Cox-2 inhibitors by patients with risk factors for heart disease.", "opencoder:1.5b": "US regulatory body will rule on pain drug decision\n\nThe US food and drug regulators, given the information presented by the advisory panel, will decide whether to recommend the sale of painkillers linked with a high risk of heart attack or stroke. The company's decision may be announced on Friday after hearing evidence for three days.\n\nThe Food and Drug Administration (FDA) gives its verdict. After considering various evidence, the analysts ruled favorably for the increased risks given their use cases. Users who have had heart disease or a stroke should not take the drugs due to potential risk factors. They are advised to \"cautiously\" prepare patients by giving them the drug.\n\nThe Celebrex and Bextra products from Merck were released after being withdrawn from shops last year, making them suitable for retailing. According to research, these products may cause users to experience fewer stomach problems compared to other painkillers.\n\nMerck's voluntary decision on 30 September was a move which shifted the company's quarterly earnings from negative balance to profit. The shares had risen by around 10% due to favorable news and Merck's profits were set back to help overcome its debt obligations, which were upturned because of lawsuits against it in the past.\n\nOn an overall basis, the analysis showed that Vioxx was linked with heart attack and stroke risks more frequently than other painkillers. The increased risk could lead to complications including stomach discomfort, complications from heart disease, etc., therefore, offering a unique advantage as they might reduce adverse side effects compared to traditional painkillers.\n\nMerck's decision on reintroducing Vioxx sparked excitement among analysts. They were unsure about the legal battles with people claiming to have been injured by the drug and concluded that these cases are not severe enough to need new legal battles. The company has also been forced to set aside millions of dollars to cover the cost of litigation related to Vioxx-related lawsuits.\n\nThe decision also prompted increased alarms and research reports on the potential risk of heart attack and stroke for patients who have taken the drug. According to the findings, a high-risk patient's risk is about 56,000 in the US. The company has been scrutinized by Europe's regulatory bodies which suggested that doctors should be cautious about giving the drugs to those who are at high risk.\n\nThe decision has led to an independent body named the Food and Drug Administration (FDA) overseeing the safety of the drug, a move which could potentially open up new market opportunities for Merck's products. The company’s decision also provided evidence to the US Senate on Tuesday that it will create an independent body to oversee the safety of drugs already in the market place.\n", "smollm:1.7b": "The US regulator will decide on Friday whether to recommend the sale of painkillers that have been linked to a high risk of heart attack and stroke. The FDA advisory panel will give its verdict after hearing evidence for three days. The painkillers - called COX-2 inhibitors - are sold under brand names such as Celebrex and Vioxx. Vioxx was withdrawn from shops last year but Merck said it would consider selling it if it gets FDA approval. The FDA has been asked to decide if the benefits to patients justify the increased risks.\n\nPutting Vioxx back on the shelves is likely to boost profits at Merck and make easier any legal battles with people who claim to have been injured by the drug, analysts said. Alarm bells were rung by a research note called Approve which showed that the risk of heart attack and stroke doubled in patients who had been taking the drug for at least 18 months. The Cox-2 inhibitors were developed by drug companies, including Merck and Pfizer, because they cause users fewer stomach problems than other painkillers.\n\nMerck voluntarily stopped sales of Vioxx on 30 September, a move which caused the firm's fourth-quarter earnings to slide to $1.1bn (£581m), from $1.4bn a year earlier. Merck's shares tumbled more than 10% on the news and the company has had to set aside millions of dollars to cover the cost of Vioxx-related litigation. Alarm bells were rung by a research note called Approve which showed that the risk of heart attack and stroke doubled in patients who had been taking the drug for at least 18 months. The Cox-2 inhibitors were developed by drug companies, including Merck and Pfizer, because they cause users fewer stomach problems than other painkillers.\n\nPfizer is still selling its Celebrex and Bextra products, though investigations have suggested that they may also be harmful to the heart. Merck's announcement of a possible reintroduction of Vioxx \"without FDA approval\" caught analysts by surprise. Merck's head of research Peter Kim said that it withdrew Vioxx \"based on the information that was available to us at the time, knowing there were alternative therapies\". He went on to say that things have since changed in the light of new reports. \"Given this new information, its is not clear that the cardiovascular risk observed in Approve makes Vioxx unique in the class of similar drugs marketed in the US,\" Mr Kim explained.\n\nOn Thursday, David Graham from the FDA's Office of Drug Safety told the advisory panel that \"there really doesn't appear to be a need for Cox-2\" inhibitors. According to calculations presented to the US Senate by Dr Graham in November, Vioxx may be linked to as many as to 56,000 American deaths. Facing stem criticism for its handling of the Vioxx case, the FDA said on Tuesday that it will create an independent body to oversee the safety of drugs already in the market place. European regulators also ruled on Thursday that patients who have had heart disease or a stroke should not take Cox-2 inhibitors.\n\nThe European Medicines Agency also said doctors should be \"cautious\" about giving the drugs to patients who have risk factors for heart disease. The European Medicines Agency also said doctors should be \"cautious\" about giving the drugs to patients who have risk factors for heart disease.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this entire text into just the key ideas and details without any explanations or formatting. Let me start by reading through each paragraph carefully.\n\nThe first part talks about US regulators deciding whether to recommend selling painkillers linked to high risks of heart attack and stroke. The painkillers in question are COX-2 inhibitors, including Celebrex and Vioxx. Vioxx was withdrawn last year but Merck is considering their sale if approved.\n\nNext, the FDA will give its verdict on Vioxx after three days of evidence. They're concerned about the increased risks justifying the higher costs. If they approve it, profits for Merck would go up and legal battles with people suing would be easier to handle.\n\nMerck had a tough fourth-quarter earnings, down $1.4 billion to $1.1 billion due to selling Vioxx back. Their shares dropped more than 10%, needing to set aside money on litigation costs. A research note showed heart attack and stroke risks doubled for patients taking it for at least 18 months.\n\nPfizer is still selling Celebrex and Bextra, but some say these might also be bad for hearts. Merck's decision to reintroduce Vioxx was surprising because Peter Kim said they didn't have the info, but things changed since new data came in. The FDA will create an independent body to assess safety, and EMA ruled against heart disease patients taking the drugs.\n\nSo putting it all together, I need to highlight that regulators are evaluating whether to recommend Vioxx for sale, the financial impact of selling Vioxx back, the risks from Vioxx in people's lives, the potential benefits for Merck despite the risks, and regulatory moves like creating an independent safety body and ruling against heart disease patients.\n</think>\n\nThe US regulator is deciding whether to recommend the sale of painkillers linked to high risk of heart attack or stroke. The painkillers are COX-2 inhibitors, including Celebrex and Vioxx. Vioxx was withdrawn last year but Merck may consider selling it if approved by the FDA. The decision would impact profits for Merck and ease legal battles with claims of harm to patients.\n\nMerck faced a tough fourth-quarter earnings drop due to selling Vioxx back, losing $1.4 billion from $1.4 billion a year earlier. They had to set aside millions on litigation costs. A research note showed heart attack and stroke risks doubled for 18 months of use. Pfizer is still selling its Celebrex products but some are concerning their potential harm.\n\nThe FDA will decide Vioxx's need for approval, citing over 56,000 possible deaths from the drug. They created an independent safety body. European regulators ruled out heart disease patients taking Vioxx.", "tinyllama:1.1b": "In the coming Friday, US food and drug regulators will decide whether to recommend the sale of painkillers called COX-2 inhibitors, which are linked to a high risk of heart attack and stroke due to their increased risk compared to other painkillers. The FDA is being asked to consider if benefits justify increased risks in patients, with the Pfizer's drug Celebrex also under scrutiny for potential harm. Despite being voluntarily pulled off the market last year by Merck, Vioxx remains a popular choice among some 25 million Americans, and analysts suggest that it may have caused harm to many more if not sold again. In an effort to mitigate harm, the FDA is forming an independent body to oversee drug safety, while European regulators have banned use of these drugs in patients with known heart disease or stroke risk factors.", "tinydolphin:1.1b": " US regulators are set to decide on whether to recommend the sale of painkillers linked to high risks of heart attack and stroke. The Food and Drug Administration (FDA) advisory panel will give its verdict after hearing evidence for three days. The painkillers - called COX-2 inhibitors - are sold under brand names such as Celebrex and Vioxx. If approved, Merck would consider selling them if it believes they provide a higher benefit to patients than the risks they pose. The vote is expected on Friday, 5 December.", "phi:2.7b": " FDA advisory panel will decide if the benefits of COX-2 inhibitors justify the increased risks of heart attack and stroke. Merck voluntarily stopped sales of Vioxx in September, leading to a decline in profits and legal battles. Recent reports suggest that Vioxx may be linked to as many as 56,000 American deaths. The FDA has created an independent body to oversee drug safety, while European regulators have warned against using Cox-2 inhibitors for patients with heart disease or stroke risk factors.\n", "orca-mini:3b": " US food and drug regulators will decide on Friday whether to recommend the sale of painkillers that have been linked to a high risk of heart attack and stroke. The Food and Drug Administration (FDA) advisory panel will give its verdict after hearing evidence for three days. Merck has announced possible plans to reintroduce Vioxx, which was withdrawn from shops last year but faces lawsuits from people who claim to have been injured by the drug. Analysts said that the move could boost profits at Merck and make it easier for litigators to win cases against the company. However, the FDA's Office of Drug Safety told an advisory panel on Thursday that there does not seem to be a need for Cox-2 inhibitors, and European regulators also advised against their use in patients who have risk factors for heart disease.", "hermes3:3b": "US food and drug regulators to decide on painkillers linked to high heart attack/stroke risk, possibly allowing Vioxx re-entry.", "stablelm-zephyr:3b": "US food and drug regulators are set to decide whether painkillers called COX-2 inhibitors, such as Celebrex and Vioxx, should be sold again after being linked to a high risk of heart attack and stroke. The FDA has been asked to consider if the benefits to patients justify the increased risks. Merck, who withdrew Vioxx last year, announced it may sell it again if approved by the FDA; however, Pfizer still sells its Celebrex and Bextra products, which have also been linked to heart problems. European regulators advise that patients with a history of heart disease or stroke should not take Cox-2 inhibitors, and an independent body will oversee drug safety in the US market place from now on.", "chatgpt-4o-latest": "The FDA will decide whether to approve the sale of COX-2 inhibitor painkillers, including Celebrex and the withdrawn Vioxx, despite their links to heart attack and stroke risks. Merck, which voluntarily stopped selling Vioxx in September, may reintroduce it if approved, potentially boosting profits and aiding legal battles. Research showed Vioxx doubled heart attack and stroke risks after 18 months of use. Pfizer continues selling Celebrex and Bextra, though they may also pose heart risks. FDA official David Graham questioned the need for COX-2 inhibitors, linking Vioxx to up to 56,000 U.S. deaths. The FDA plans an independent drug safety body, while European regulators advised against COX-2 inhibitors for heart disease patients and urged caution for at-risk individuals.", "stablelm2:1.6b": "US regulator will decide whether to recommend selling painkillers linked to high risks of heart attack and stroke, with Merck considering a sale if FDA approves. The Food and Drug Administration advisory panel will weigh the benefits to patients against the increased risks. Vioxx was withdrawn from shops in 2004 but Merck could re-introduce it under approval from FDA. Recent research showed doubled risk of heart attack and stroke, which has led to speculation about safety of COX-2 inhibitors like Vioxx. Pfizer's Celebrex is still available while Bextra products face investigation into potential harm to the heart. FDA is considering whether there's a need for similar drugs after new reports have changed the assessment of cardiovascular risk in Vioxx and other COX-2 inhibitors.", "granite3.1-dense:2b": "US food and drug regulators, the FDA, are set to rule on Friday whether to recommend the resumption of painkillers known as COX-2 inhibitors (sold under brand names like Celebrex and Vioxx). After a three-day advisory panel hearing, the FDA will decide if the drugs' potential patient benefits outweigh their increased risks of heart attack and stroke. Merck aims to reintroduce Vioxx, which was withdrawn in 2004 due to cardiovascular concerns. This move could bolster Merck's profits and simplify related lawsuits. The FDA's head of drug safety emphasized the potential link between Vioxx and up to 56,000 US deaths. European regulators have already banned these drugs for heart disease or stroke patients and cautioned against their use in those with cardiac risk factors.", "reference": "The European Medicines Agency also said doctors should be \"cautious\" about giving the drugs to patients who have risk factors for heart disease.\"Given this new information, its is not clear that the cardiovascular risk observed in Approve makes Vioxx unique in the class of similar drugs marketed in the US,\" Mr Kim explained.US food and drug regulators will decide on Friday whether to recommend the sale of painkillers that have been linked to a high risk of heart attack and stroke.Putting Vioxx back on the shelves is likely to boost profits at Merck and make easier any legal battles with people who claim to have been injured by the drug, analysts said.Facing stem criticism for its handling of the Vioxx case, the FDA said on Tuesday that it will create an independent body to oversee the safety of drugs already in the market place.Vioxx was withdrawn from shops last year but Merck said it would consider selling it if it gets FDA approval.Alarm bells were rung by a research note called Approve which showed that the risk of heart attack and stroke doubled in patients who had been taking the drug for at least 18 months.The painkillers - called COX-2 inhibitors - are sold under brand names such as Celebrex and Vioxx."}