{"raw_text": "Yukos bankruptcy 'not US matter'\n \n Russian authorities do not have to abide by any US court decisions taken with regard to troubled oil giant Yukos, a Houston court has been told.\n \n Legal expert William Butler said there was no treaty between the US and Russia to recognise the other's legal rulings. That meant Moscow would not have to adhere to US rulings in the Yukos case. Yukos says a US court was entitled to declare it bankrupt before its Yugansk unit was sold, since it has a US subsidiary and local bank accounts.\n \n Yukos made its surprise Chapter 11 bankruptcy filing in Houston in December in an unsuccessful attempt to halt the auction of Yugansk, its main oil producing unit, by Russian authorities. Yugansk was sold to help pay off a $27.5bn (£14.5bn) back tax bill. It was bought for $9.4bn by a previously unknown group, which was in turn bought by state-controlled oil company Rosneft. The US court's jurisdiction has been challenged by Deutsche Bank and Gazpromneft, a former unit of Russian gas monopoly Gazprom which is due to merge with Rosneft. Deutsche Bank maintains the case has no place in a US court because Yukos has no assets in the US, apart from two bank accounts and a house in Houston owned by its chief finance officer Bruce Misamore. Deutsche Bank is involved in the case because it is itself being sued by Yukos. It had agreed to loan Gazpromneft the money to bid for Yugansk. US bankruptcy judge Letitia Clark, who issued an injunction in December to try and prevent the Yugansk sale, has said she will rule \"pretty promptly, however I do not anticipate ruling on it before next Tuesday\".\n \n Yukos has claimed it sought help in the US because other forums - Russian courts and the European Court of Human Rights - were either unfriendly or offered less protection. It has claimed that Russia imposed the huge tax bill and forced the sale of Yugansk as part of a campaign to destroy Yukos and its former owner Mihkail Khodorkovsky, who is facing a 10-year prison term in Russia for fraud and tax evasion. Yukos' parent company, the Gibraltar-based Menatep Group, is suing Russia in Europe for $28.3bn in financial damages. The company is also seeking $20bn in a separate US lawsuit against Rosneft and Gazprom for their role in the sale of Yugansk.\n", "llama3.2:1b": "Russian authorities are not bound by US court decisions related to Yukos bankruptcy, as there is no treaty between the two countries recognizing each other's legal rulings. Yukos was seeking help from US courts because Russian courts were unfriendly or offered less protection.", "llama3.2:3b": "US court says Russian authorities do not have to abide by its decisions on Yukos' bankruptcy, citing no treaty between the two countries; US judge ruled Yukos should be declared bankrupt before sale of key unit to pay off $27.5bn tax bill; Yukos claims Russia forced the sale as part of campaign to destroy company and its owner Mikhail Khodorkovsky; Yukos seeks financial damages from Russia in Europe and US lawsuit against Rosneft and Gazprom.", "gemma2:2b": "US courts do not have jurisdiction over Yukos' bankruptcy proceedings because there is no treaty between the US and Russia recognizing such rulings. Yukos filed for bankruptcy in Houston to prevent the auction of its main oil-producing unit, Yugansk. The case has drawn challenges from Deutsche Bank and Gazpromneft, who argue that Yukos has no US assets and the jurisdiction lies with Russian courts. \n", "qwen2.5:0.5b": "The Russian government does not have to abide by US court decisions taken with regard to troubled oil giant Yukos, according to an Houston court ruling. Yukos is in bankruptcy pending sale, while the US court's jurisdiction has been challenged by Deutsche Bank and Gazpromneft, who are seeking to stop the sale of Yugansk. The decision does not address Russian courts' unfriendliness or lack of protection, but it seems that both parties have reached a compromise and Yukos will proceed with the sale.", "qwen2.5:1.5b": "Russian authorities are exempt from following U.S. court rulings regarding troubled oil giant Yukos. Yukos filed Chapter 11 bankruptcy in Houston over its attempt to stop a Russian auction that sold its main oil-producing unit. The U.S. court's jurisdiction has been challenged by Deutsche Bank and Gazpromneft, while Yukos is seeking help from the European Court of Human Rights and Russia for protection against a $28 billion financial damages lawsuit filed by its parent company.", "qwen2.5:3b": "Russian authorities do not have to comply with any US court decisions regarding Yukos, as there's no treaty between the US and Russia recognizing such rulings. The Houston court has heard arguments that Moscow would not be compelled by US courts in the Yukos case due to lack of mutual legal recognition. Yukos filed for bankruptcy protection in Houston to halt a sale of its main oil unit Yugansk, which was later bought by Rosneft. Legal challenges have been raised by Deutsche Bank and Gazpromneft, questioning the jurisdiction of US courts over Yukos assets outside the country. Yukos claimed it sought help from US forums due to unfriendly responses in Russian courts and the European Court of Human Rights. The company is pursuing lawsuits against Russia and its allies for $58.8 billion related to the sale of Yugansk.", "opencoder:1.5b": "Yukos bankruptcy 'not US matter' was a case that was ruled against by Russian authorities based on the lack of cooperation between the US and Russia to recognize the legal ruling of the Yukos case. The case occurred in December 2017, where the U.S. court was challenged by Deutsche Bank and Gazpromneft, a former unit of Russian gas monopoly Gazprom which is due to merge with Rosneft. The US bankruptcy judge Letitia Clark ruled \"pretty quickly\" but did not rule on it before next Tuesday. The case was set up as a point about the potential for diplomatic cooperation between the US and Russia to settle a dispute over the sale of Yugansk, a Russian oil giant.\n", "smollm:1.7b": "Yukos bankruptcy not US matter: Russian authorities do not have to abide by any US court decisions taken with regard to troubled oil giant Yukos, a Houston court has been told. Russian legal expert William Butler said there was no treaty between the US and Russia to recognize the other's legal rulings. That meant Moscow would not have to adhere to US rulings in the Yukos case. Yukos says a US court was entitled to declare it bankrupt before its Yugansk unit was sold, since it has a US subsidiary and local bank accounts.\nYukos made its surprise Chapter 11 bankruptcy filing in Houston in December in an unsuccessful attempt to halt the auction of Yugansk, its main oil producing unit, by Russian authorities. Yugansk was sold to help pay off a $27.5bn (£14.5bn) back tax bill. It was bought for $9.4bn by a previously unknown group, which was in turn bought by state-controlled oil company Rosneft. The US court's jurisdiction has been challenged by Deutsche Bank and Gazpromneft, a former unit of Russian gas monopoly Gazprom which is due to merge with Rosneft. Deutcher Bank maintains the case has no place in a US court because Yukos has no assets in the US, apart from two bank accounts and a house in Houston owned by its chief finance officer Bruce Misamore.\nYukos seeks help in the US: Yukos' claim that it sought help in the US to avoid US court decisions is disputed by legal experts who say there was no treaty between the US and Russia to recognize the other's legal rulings. That meant Moscow would not have had to abide by US court decisions in the Yugansk case. Yukos says a US court was entitled to declare it bankrupt before its Yugansk unit was sold, since it has a US subsidiary and local bank accounts. The US court's jurisdiction has been challenged by Deutcher Bank and Gazpromneft, a former unit of Russian gas monopoly Gazprom which is due to merge with Rosneft. Deutcher Bank maintains the case has no place in a US court because Yukos has no assets in the US, apart from two bank accounts and a house in Houston owned by its chief finance officer Bruce Misamore.\nYukos seeks help in the US: Yukos' claim that it sought help in the US to avoid US court decisions is disputed by legal experts who say there was no treaty between the US and Russia to recognize the other's legal rulings. That meant Moscow would not have had to abide by US court decisions in the Yugansk case. Yukos says a US court was entitled to declare it bankrupt before its Yugansk unit was sold, since it has a US subsidiary and local bank accounts. The US court's jurisdiction has been challenged by Deutcher Bank and Gazpromneft, a former unit of Russian gas monopoly Gazprom which is due to merge with Rosneft. Deutcher Bank maintains the case has no place in a US court because Yukos has no assets in the US, apart from two bank accounts and a house in Houston owned by its chief finance officer Bruce Misamore.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Yukos Bank's bankruptcy case. Let me read through it carefully.\n\nThe first sentence says that the bankruptcy isn't about U.S. matters at all. That means Yukos is facing legal issues outside the US.\n\nThen there's mention of Russian authorities not following any U.S. court decisions related to their troubled oil company, Yukos. It says something about a court being told this information but doesn't give details on how they're handling it.\n\nWilliam Butler, a legal expert, says there's no treaty between the U.S. and Russia for their legal rulings. That means Moscow won't have to obey US rulings in Yukos' case because of that lack of treaty agreement.\n\nYukos filed its Chapter 11 bankruptcy in Houston in December, but it was a mistake because they were trying to stop the sale of Yugansk. It sold it to someone else to pay back a $27.5 billion tax bill. They bought it for $9.4 billion and the buyer wasn't state-controlled.\n\nDeutsche Bank and Gazpromneft are suing them. They're involved because they own some parts of this company. Deutsche Bank says the case doesn't go into the U.S. court because Yukos has no assets there, apart from two bank accounts and a house in Houston. They also say they had to consult with other sources like Boris Solzhenikov.\n\nUS bankruptcy judge Letitia Clark is still ruling, but she'll probably do so before next Tuesday, though she hasn't ruled on it yet.\n\nYukos claims that Russian courts weren't favorable or didn't offer much protection. It's part of a campaign to destroy their company and the person who ran them down, Mihkail Khodorkovsky, in Russia for fraud and tax evasion. They're suing Russia elsewhere in Europe and U.S., seeking financial damages.\n\nI think that covers all the main points. Now I need to condense this into a concise summary without any extra info or explanations.\n</think>\n\nYukos Bank's bankruptcy case is not linked to the United States, despite the involvement of Russian authorities. The court has not been involved in U.S. legal decisions regarding Yukos, which faces significant financial loss from the sale of Yugansk and tax bill payment. A bankruptcy filing was an unsuccessful attempt to halt the sale of Yugansk. Two companies, Deutsche Bank and Gazpromneft, are suing Yukos for avoiding a U.S. court's ruling on its lack of assets in the U.S., apart from bank accounts and real estate. The case has faced legal challenges from sources including Boris Solzhenikov, who is suing Russia as well. US judge Letitia Clark will rule on the case but hasn't so far, and Yukos claims Russian courts were unfriendly or lack protection. The company is also seeking financial damages in Europe for Russian involvement and another $20 billion in a U.S. lawsuit against Rosneft.", "tinyllama:1.1b": "A Houston court has ruled that Russia does not have to follow any US court decisions taken with regard to troubled oil giant Yukos, as there is no treaty between the two countries to recognise each other's legal rulings. This means Moscow would not be obliged to adhere to US rulings in the bankruptcy case of Yukos, which had been filed by a Chapter 11 bankruptcy filing in December. The American subsidiary and local bank accounts of Yukos were not involved in the sale of its main oil producing unit, Yuagansk, to Russian authorities. In turn, Deutsche Bank was part of the US court's jurisdiction because it was involved in the case because it finances Gazpromneft, a company that is also being sued by Yukos for losses and damages. Despite this, Yukos remains in legal limbo as they seek to have the sale of Yuagansk recognised and stop the auction of their main asset.", "tinydolphin:1.1b": " This article discusses the decision made by US bankruptcy judge Letitia Clark in December 2014, which allowed an unsuccessful Chapter 11 bankruptcy filing in Houston, Texas, by Russian oil giant Yukos to proceed against its previous supporters. Yukos sought help in the United States due to its conflict with other forums, including the Russian courts and the European Court of Human Rights, which may have imposed a higher tax on its businesses or made it difficult for it to recover from its debts. The case is set to be heard by US bankruptcy court Judge Michael Fitzgerald in March 2015.", "phi:2.7b": " In December, Russian authorities sold Yukos' oil producing unit Yugansk to help pay off back taxes owed by the company's parent company Menatep Group. Despite being sued by Menatep Group in a US court, Moscow did not have to abide by any US court decisions because there is no treaty between the US and Russia recognizing each other's legal rulings.\n", "orca-mini:3b": " The Yukos bankruptcy case is not directly related to any US court decisions, as Russian authorities are not bound by them. Yukos argues that a US court has jurisdiction over the case, but the matter is currently before a Houston judge who has issued an injunction to prevent the sale of Yugansk. However, the ruling is expected to be appealed and will be decided by the US bankruptcy court in the near future.", "hermes3:3b": "Yukos bankruptcy not subject to US courts' decisions, no Russian adherence to US rulings due to lack of treaty.", "stablelm-zephyr:3b": "A Houston court ruled that Russian authorities do not have to adhere to US court decisions regarding the Yukos bankruptcy. Legal expert William Butler stated there is no treaty between the US and Russia recognizing each other's legal rulings, meaning Moscow is not obligated to follow US rulings in this case. Yukos filed for Chapter 11 bankruptcy in Houston in December, challenging both the US court's jurisdiction and the Russian authorities' decision to sell its main oil producing unit, Yugansk, to pay off a $27.5bn back tax bill. Deutsche Bank and Gazpromneft have also contested the case, with the latter being involved as it had loaned money to Rosneft, which eventually bought Yugansk. Yukos claims that other forums, such as Russian courts and the European Court of Human Rights, were unfriendly or offered less protection.", "chatgpt-4o-latest": "Russian authorities are not bound by US court rulings in the Yukos bankruptcy case, as there is no treaty requiring mutual recognition of legal decisions. Yukos filed for Chapter 11 bankruptcy in Houston to prevent the auction of its main oil-producing unit, Yugansk, which was sold to cover a $27.5bn tax bill. The unit was bought by a previously unknown group and later acquired by state-controlled Rosneft. Deutsche Bank and Gazpromneft have challenged the US court's jurisdiction, arguing Yukos has minimal US assets. Yukos claims it turned to US courts due to bias in Russian and European legal systems, alleging the Russian government orchestrated its downfall. Its parent company, Menatep Group, is suing Russia for $28.3bn in Europe, while Yukos is seeking $20bn in a US lawsuit against Rosneft and Gazprom.", "stablelm2:1.6b": "A Houston court does not need to follow US court decisions related to Yukos, as there is no treaty between the two countries recognizing such rulings. Yukos filed Chapter 15 bankruptcy, but this was unsuccessful as it tried to halt the auction of its main oil producing unit, Yugansk. Despite this, Russian authorities sold Yugansk and bought it for $9.4bn with help from state-controlled company Rosneft. A US judge's jurisdiction has been contested by Deutsche Bank and Gazpromneft in relation to Yukos' bankruptcy case. Yukos argues that Russia imposed the large tax bill and forced the sale of Yugansk as part of a campaign against it, involving its former owner Mihkail Khodorkovsky.", "granite3.1-dense:2b": "Russian authorities are not obligated to follow US court decisions regarding Yukos, as there is no treaty recognizing each other's legal rulings. This stance is supported by legal expert William Butler and the lack of US assets in Russia for Yukos, aside from bank accounts and a house owned by Bruce Misamore, its CFO. Yukos filed for Chapter 11 bankruptcy in Houston to prevent the sale of its primary oil unit, Yugansk, which was auctioned off to settle a $27.5bn (£14.5bn) tax debt owed by Russian authorities to Gazpromneft. The case has been challenged by Deutsche Bank and Gazpromneft, with the latter arguing Yukos has no US assets. Yukos claims it sought US recourse due to unfavorable or less protective Russian courts and the European Court of Human Rights. The company alleges that Russia imposed the tax bill as part of an effort to eliminate former owner Mikhail Khodorkovsky, who faces a 10-year prison sentence for fraud and tax evasion. Yukos' parent, the Gibraltar-based Menatep Group, is litigating in Europe for $28.3bn in financial damages and seeking $20bn from Rosneft and Gazprom for their role in the Yugansk sale. US bankruptcy judge Letitia Clark will soon rule on preventing the Yugansk sale, anticipating a prompt decision but not before next Tuesday.", "reference": "Yukos says a US court was entitled to declare it bankrupt before its Yugansk unit was sold, since it has a US subsidiary and local bank accounts.Deutsche Bank maintains the case has no place in a US court because Yukos has no assets in the US, apart from two bank accounts and a house in Houston owned by its chief finance officer Bruce Misamore.Russian authorities do not have to abide by any US court decisions taken with regard to troubled oil giant Yukos, a Houston court has been told.The company is also seeking $20bn in a separate US lawsuit against Rosneft and Gazprom for their role in the sale of Yugansk.Yukos has claimed it sought help in the US because other forums - Russian courts and the European Court of Human Rights - were either unfriendly or offered less protection.The US court's jurisdiction has been challenged by Deutsche Bank and Gazpromneft, a former unit of Russian gas monopoly Gazprom which is due to merge with Rosneft.That meant Moscow would not have to adhere to US rulings in the Yukos case."}