{"raw_text": "Borussia Dortmund near bust\n \n German football club and former European champion Borussia Dortmund has warned it will go bankrupt if rescue talks with creditors fail.\n \n The company's shares tumbled after it said it has \"entered a life-threatening profitability and financial situation\". Borussia Dortmund has posted record losses and missed rent payments on its Westfallen stadium. Chief executive Gerd Niebaum stepped down last week and creditors are now pushing for greater control. Shares in Borussia Dortmund, Germany's only stock-market listed football club, dropped by almost 23% to 2.05 euros during early afternoon trading.\n \n Fund manager Florian Hamm - Borussia Dortmund's largest investor - said he would only invest more money in the company if he got a greater say in how it is run. \"I demand better transparency,\" he is quoted as saying by Germany's Manger Magazin. The club has also faced calls to appoint executives from outside the club.\n \n Borussia Dortmund posted a record loss of 68m euros ($89m; £47m) in the 12 months through June. It made a loss of 27.2m euros in the first half of the current fiscal year and said that total debts will increase to 134.7m euros by the middle of 2006 unless a restructuring plan is pushed through. \"This is the bill for their mismanagement over the past years,\" said HVB analyst Peter-Thilo Halser. The club appointed an auditor, who has recommended a number of steps, including deferring the rent due on the stadium and suspending debt repayments until at least the 2006-2007 fiscal year. Stephen Schechter, a UK investment banker who has held talks with Borussia Dortmund over a possible bond sale, said the club needs a capital injection of 35m euros. \"They need strong people on the board who do not have a history with the club,\" he said.\n", "llama3.2:1b": "Borussia Dortmund is facing financial difficulties and has warned it may go bankrupt if rescue talks with creditors fail. The company has posted record losses and missed rent payments, leading to concerns about its ability to repay debts. Despite efforts by investors like Florian Hamm, who will only invest more money in the club if given greater control, the club's situation remains dire.", "llama3.2:3b": "Borussia Dortmund is at risk of bankruptcy if rescue talks fail. The club has posted record losses, including €68m in the last year and €27.2m in the first half of the current fiscal year. Total debts are expected to reach €134.7m by mid-2006 unless a restructuring plan is implemented. Key investors are demanding greater control and transparency, while experts recommend appointing new executives and considering a capital injection of €35m to avoid bankruptcy.", "gemma2:2b": "Borussia Dortmund is facing financial distress and may go bankrupt if rescue talks with creditors fail. The club has posted record losses, missed rent payments, and is struggling with debt.  Key demands include greater transparency from the club's management and restructuring to improve its financial situation. \n", "qwen2.5:0.5b": "Borussia Dortmund warns bankruptcy if creditors' rescue talks fail, citing record losses and missed rent payments at its Westfallen stadium. Shareholders demand better transparency, including appointing executive from outside the club and setting up a restructuring plan. The club faced calls to appoint executives from outside for a possible bond sale.", "qwen2.5:1.5b": "Borussia Dortmund, Germany's only stock-market listed football club, warned it will go bankrupt if rescue talks fail and has posted record losses and missed rent payments on its Westfallen stadium. The company's shares dropped by 23% to €2.05 after CEO stepped down and creditors pushed for greater control.", "qwen2.5:3b": "Borussia Dortmund, Germany's only stock-market listed football club, faces bankruptcy if rescue talks with creditors fail. Shares dropped by almost 23% after the company reported record losses and missed rent payments. CEO Gerd Niebaum resigned, and creditors are demanding greater control. The club posted a record loss of €68 million in the past year, with debts set to reach €134.7 million unless restructuring is approved. Former investor Florian Hamm wants more say in management, while HVB analyst Peter-Thilo Halser suggests deferring stadium rent payments and suspending debt repayments until 2006-2007. UK investment banker Stephen Schechter recommends a €35 million capital injection for new board members without prior club history.", "opencoder:1.5b": "The football club and former European champion Borussia Dortmund have warned it will go bankrupt if rescue talks with creditors fail. The shares tumbled after the club said it has \"entered a life-threatening profitability and financial situation\" and missed rent payments on its Westfallen stadium. Chief executive Gerd Niebaum stepped down last week and creditors are now pushing for greater control. Shares in Borussia Dortmund have dropped by almost 23% to 2.05 euros during early afternoon trading.\n\nFund manager Florian Hamm has said he would only invest more money in the company if he got a greater say in how it is run. \"I demand better transparency,\" he is quoted as saying by Germany's Manger Magazin.\n\nBorussia Dortmund posted a record loss of 68m euros ($89m; £47m) and said that total debts will increase to 134.7m euros by the middle of 2006 unless a restructuring plan is pushed through. Borussia Dortmund has also faced calls to appoint executives from outside the club.\n", "smollm:1.7b": "The summary is concise and to the point. It captures the main points from the original text:\n\n1. Borussia Dortmund has warned it will go bankrupt if rescue talks with creditors fail.\n2. The company's shares tumbled after it said it has \"entered a life-threatening profitability and financial situation\".\n3. Borussia Dortmund has posted record losses and missed rent payments on its Westfallen stadium.\n4. Chief executive Gerd Niebaum stepped down last week and creditors are now pushing for greater control.\n5. Shares in Borussia Dortmund dropped by almost 23% to 2.05 euros during early afternoon trading.\n6. Fund manager Florian Hamm is quoted as saying he would only invest more money in the company if he gets a greater say in how it is run.\n7. I demand better transparency, he said by Germany's Manger Magazin.\n8. Borussia Dortmund posted a record loss of 68m euros ($89m; £47m) in the 12 months through June.\n9. It made a loss of 27.2m euros in the first half of the current fiscal year and said that total debts will increase to 134.7m euros by the middle of 2006 unless a restructuring plan is pushed through.\n10. I recommend a capital injection of 35m euros from a UK investment banker who has held talks with Borussia Dortmund over a possible bond sale.", "deepseek-r1:1.5b": "<think>\nAlright, let's tackle this query step by step. The user wants a summary of the given text, preserving key ideas and details, and to output only the summary in plain text without any explanations or additional formatting.\n\nFirst, I need to read through the provided text carefully. It's about Borussia Dortmund's financial situation, specifically near bankruptcy. The main points are:\n\n1. Borussia Dortmund has warned that it might go bankrupt if rescue talks fail.\n2. The company's shares have dropped significantly (almost 23%) from their previous level.\n3. The CEO, Gerd Niebaum, stepped down last week and creditors are pushing for more control.\n4. Key figures like manager Florian Hamm and fund manager HVB analyst Peter-Thilo Halser emphasize better transparency and a clear board.\n5. Financial data shows a record loss of 68 million euros in the past year, with half lost in the first six months.\n6. Debt management steps include deferring rent payments on their Westfallen stadium and suspending debt repayment until mid-2006.\n7. External investors like Stephen Schechter suggest that Borussia Dortmund needs a strong board to avoid distress.\n\nNow, I need to condense all these points into a concise summary without losing any critical information. The user wants the output in plain text, so no markdown or explanations needed. I should make sure each key point is clearly highlighted.\n\nI'll start by mentioning that the club's near bankruptcy, then note the significant drop in shares and CEO's departure with creditors pushing for more control. Highlighting the financial figures—record loss, half lost in first six months—is important. Then, mention specific actions taken by Hamme and Halser, like transparency and debt management steps. Finally, include external investments and the need for a strong board.\n\nI should ensure the summary is around 100 characters without markdown. Let me structure it so each sentence flows logically from one point to another, covering all the main aspects mentioned.\n</think>\n\nBorussia Dortmund is near bankruptcy after rescue talks fail, with shares dropping by nearly 23%. CEO Gerd Niebaum stepped down and creditors seek greater control. The club posted a record loss of 68 million euros in its first year, half lost in the first six months, with debt increasing unless restructuring. Key figures emphasize transparency and clearer leadership. External investors have proposed $35 million for a bond sale, requiring strong board oversight to avoid distress.", "tinyllama:1.1b": "Borussiya Dortmund, one of Germany's top football clubs and former European champion, has warned it will go bankrupt if rescue talks with creditors fail. The company's shares dropped by almost 23% to 2.05 euros during early trading on Friday, after it posted record losses of 68 million euro ($89m) in the 12 months through June. Borussia Dortmund has also faced calls for greater control and investment from its largest shareholder, fund manager Florian Hamm. The club has seen debt increase to 134.7 million euros by the middle of 2006 unless a restructuring plan is implemented, according to HVB analyst Peter-Thilo Halser. Borussia Dortmund's Chief Executive Gerd Niebaum stepped down last week and creditors are now pushing for greater control of the club. Stephen Schechter, a UK investment banker who has held talks with Borussia Dortmund over a possible bond sale, says the club needs capital injection of 35 million euro to avoid going bust.", "tinydolphin:1.1b": " Borussia Dortmund, one of Germany's most successful football clubs, faces financial turmoil as it struggles to recover from its recent losses and bankruptcy threat. The club has reported record losses in recent months and missed rent payments on its Westfalen stadium. In response to mounting pressure from creditors, Borussia Dortmund's management is reportedly considering cutting jobs and reducing expenses. Borussia Dortmund is the only stock-market listed football club in Germany, and shares dropped by almost 23% during early afternoon trading. Despite its financial struggles, Borussia Dortmund has been saved from bankruptcy by its largest investor, Florian Hamm, who stepped down as CEO last week. However, Hamm is demanding a greater say in how the club is run and believes that better transparency will prevent further losses. Borussia Dortmund's situation is reminiscent of West Germany's bankruptcy crisis, when the country's banks struggled to recover from the hyperinflation that followed World War II.", "phi:2.7b": " German football club Borussia Dortmund is at risk of bankruptcy if it fails to reach an agreement with creditors. The company has posted record losses and missed rent payments, leading its shares to fall by almost 23%. Fund manager Florian Hamm has called for greater transparency and for outside executives to be appointed. The club's debts are projected to increase to 134.7 million euros by the end of 2006 unless a restructuring plan is implemented, including deferring the stadium rent and suspending debt repayments. The club could benefit from a capital injection of 35 million euros and strong leadership on the board.\n", "orca-mini:3b": " German football club Borussia Dortmund has warned that it will go bankrupt if rescue talks with creditors fail. The company's shares dropped by almost 23% to 2.05 euros during early afternoon trading after it posted record losses and missed rent payments on its Westfallen stadium. Investors such as Florian Hamm, Borussia Dortmund's largest investor, demand better transparency. The club appointed an auditor who recommended a number of steps, including deferring the rent due on the stadium and suspending debt repayments until at least the 2006-2007 fiscal year. An injection of capital of 35m euros is needed for Borussia Dortmund to survive. The club's mismanagement over the past years has led to debts increasing to 134.7m euros by the middle of 2006.", "hermes3:3b": "Borusa Dortmund warns of bankruptcy & shares drop.\nPost record losses, 68m€ in 12 months.\nTotal debts to reach 134.7m€ by mid-2006 if no restructuring plan isn't pushed through.", "stablelm-zephyr:3b": "Borussia Dortmund, a German football club and former European champion, is at risk of going bankrupt if rescue talks with creditors fail. The company has entered a life-threatening profitability and financial situation, posting record losses and missing rent payments on its Westfallen stadium. Chief executive Gerd Niebaum stepped down last week, and creditors are pushing for greater control. Fund manager Florian Hamm, the largest investor in Borussia Dortmund, demanded better transparency and called for executives from outside the club to be appointed. The club has also been advised by an auditor to defer rent due on the stadium and suspend debt repayments until at least the 2006-2007 fiscal year. A capital injection of 35 million euros is required, and strong people should be on the board without a history with the club.", "chatgpt-4o-latest": "Borussia Dortmund faces potential bankruptcy if rescue talks with creditors fail. The club has posted record losses, missed stadium rent payments, and seen its shares drop by nearly 23%. Chief executive Gerd Niebaum resigned, and creditors are demanding more control. Largest investor Florian Hamm insists on greater transparency before investing further. The club reported a 68m euro loss last year and expects debts to rise to 134.7m euros by mid-2006 without restructuring. An auditor has recommended deferring rent and suspending debt repayments, while UK banker Stephen Schechter suggests a 35m euro capital injection and stronger leadership.", "stablelm2:1.6b": "Borussia Dortmund is near bankruptcy and may go bankrupt if rescue talks fail. The company has posted record losses and missed rent payments, prompting creditors for greater control. Share value dropped by almost 20% after CEO stepped down. Investors demand transparency and greater say in running the club. Club faces calls to appoint executives from outside. Record loss of €1m ($1.3m; £957,0 LKR) in Q2. Total debts expected to reach €1.7m by end of 6th month unless restructuring plan pushes through.", "granite3.1-dense:2b": "Borussia Dortmund, Germany's sole football club listed on the stock market, faces potential bankruptcy due to a dire financial situation, warning that rescue talks with creditors may fail. The club has experienced record losses of 68 million euros and missed stadium rent payments. Its shares plummeted by nearly 23% during trading, reaching 2.05 euros. Fund manager Florian Hamm, the largest investor, demands increased control over the company's operations for further investment. The club's total debts are projected to rise to 134.7 million euros by mid-2006 if no restructuring plan is implemented. An auditor recommended deferring stadium rent and suspending debt repayments until at least 2006-2007. Analysts suggest the club requires a capital injection of around 35 million euros, emphasizing the need for unbiased board members without past ties to the club.", "reference": "Stephen Schechter, a UK investment banker who has held talks with Borussia Dortmund over a possible bond sale, said the club needs a capital injection of 35m euros.Borussia Dortmund has posted record losses and missed rent payments on its Westfallen stadium.German football club and former European champion Borussia Dortmund has warned it will go bankrupt if rescue talks with creditors fail.Shares in Borussia Dortmund, Germany's only stock-market listed football club, dropped by almost 23% to 2.05 euros during early afternoon trading.Borussia Dortmund posted a record loss of 68m euros ($89m; £47m) in the 12 months through June.The club has also faced calls to appoint executives from outside the club."}