{"raw_text": "Cairn shares up on new oil find\n \n Shares in Cairn Energy have jumped 6% after the firm said an Indian oilfield was larger than previously thought.\n \n Cairn said drilling to the north-west of its development site in Rajasthan had produced \"very strong results\". The company also said it now believed the development area would be able to produce oil for more than 25 years. Cairn's share price rose 300% last year after a number of oil finds, but its shares were hit in December following a disappointing drilling update. December's share fall means that Cairn is still in danger of being relegated from the FTSE 100 when the index is reshuffled next month. Cairn's shares closed up 64 pence, or 6%, at 1130p on Thursday.\n \n Before Christmas, Cairn revealed that drilling to the north of the field in Rajasthan had been disappointing, which caused its shares to lose 18% in one day.\n \n However, on Thursday, the group said its belief that the path of oil in the area actually moved further to the west had proved correct. \"This area does need more appraisal drilling but it looks very strong,\" Dr Mike Watts head of exploration said. Chief executive Bill Gammell added: \"The more we progress in Rajasthan the better we feel about it.\" Cairn made the discovery after having been granted an extension to their drilling licence in January by Indian authorities. The firm has applied for a 30-month extension to scout for oil outside its main development area, which includes the Mangala and Aishwariya fields where Cairn has previously announced major discoveries. It also said production at its other fields across the globe was likely to surpass levels seen in 2004.\n", "llama3.2:1b": "Cairn Energy shares rose 6% after it found an Indian oilfield larger than previously thought. The company had previously drilled near a field in Rajasthan, but this new find has increased its belief that the area could produce oil for over 25 years. Cairn's share price fell 18% last year following disappointing drilling results, and it closed up 6% on Thursday at £1130p.", "llama3.2:3b": "Cairn Energy shares rose 6% after discovering a larger oilfield in Rajasthan, India, than initially thought, with production expected to last over 25 years. The share price dropped 18% before Christmas due to disappointing drilling but has now regained some ground following the update. Cairn is still at risk of being removed from the FTSE 100 next month.", "gemma2:2b": "Cairn Energy's shares increased by 6% following a positive discovery of a larger oilfield in India. The company now believes the field will produce oil for over 25 years and has expressed confidence about its potential.  The company experienced a sharp share drop earlier due to disappointing drilling results but has since confirmed a new promising development area. They have also extended their drilling license and plan further exploration efforts.\n", "qwen2.5:0.5b": "Cairn Energy shares jumped by 6% after it reported a larger-than-expected oil discovery in an Indian oilfield. The company's share price increased from around 103 points in December to 1130 points on Thursday, with Cairn still expected to be relegated from the FTSE 100 when its index is reshuffled next month after a disappointing drilling update.", "qwen2.5:1.5b": "Shares of Cairn Energy have risen due to a new oil find near an Indian development site, indicating the company may be able to produce for more than 25 years. This comes after disappointing drilling results in December and a potential FTSE 100 reclassification risk next month. Prior to Christmas, Cairn announced poor performance from north of their Rajasthan field; however, they now believe oil will flow further west into the area.", "qwen2.5:3b": "Cairn Energy's shares surged 6% after announcing an expanded oilfield discovery near Rajasthan, India. The company revised upwards its potential operational life from over 25 years. Cairn's stock price had risen 300% last year due to several discoveries but plummeted in December following a drilling update. Despite prior disappointing results near the field, Cairn now believes the oil's actual path is westward and has extended its exploration license for another three months. The company expects increased production globally.", "opencoder:1.5b": "Cairn shares have jumped after an Indian oilfield size was larger than previously thought. The company also believes the development area could produce more than 25 years of oil. Cairn's share price rose due to a number of finds, but its shares fell December following a disappointing drilling update. The company is still in danger of being relegated from the FTSE 100 when the index is reshuffled next month. Cairn's shares closed at an adjusted close with a gain of 6%. Before Christmas, the discovery of a disappointing drilling had led to a loss of 18% in one day. However, on Thursday, the group further evidenced that the path of oil was moving further to the west.\n", "smollm:1.7b": "Cairn shares jumped 6% after Indian oilfield discovery, but drilling progress remains slow.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Cairn Energy's stock performance. Let me read through it again carefully.\n\nFirst, they say their shares jumped 6% because they found an Indian oilfield larger than expected. Then, they mention drilling in the north-west of Rajasthan produced \"very strong results\" and believed the development area would last more than 25 years. Last year, their stock went up 300%, but it dropped in December when there was a disappointing update. That drop caused them to be repositioned in the FTSE 100 next month.\n\nBefore Christmas, they had a bad day where drilling in another area lost 18%. But on Thursday, their exploration showed the oil path moved further west. Dr Mike Watts said this needed more appraisal drilling but it's strong, and Bill Gammell said progress is good. They found the discovery after January extension granted by Indian authorities, have 30 months of development outside their main areas, and production elsewhere is likely as good as in 2004.\n\nI should make sure to include all key points: the stock movement, the discovery's size, the 25-year belief, the December drop, the impact on FTSE 100, the disappointing drilling, Gammell's statement, and the later positive update. Also, mention the license extension and production updates.\n\nI need to make sure I don't add any extra info beyond what's in the original text.\n</think>\n\nCairn Energy shares have surged 6% after discovering a larger Indian oilfield. The firm now believes the area could sustain more than 25 years of oil production. Last year, their stock rose by 300%, but it dropped due to disappointing drilling results. Before Christmas, they lost 18% in one day from another oil discovery. On Thursday, exploration confirmed the oil path moved west further, with Dr Mike Watts and Bill Gammell highlighting progress. They found the discovery after January extension granted by Indian authorities, have 30 months of development outside their main areas, and production elsewhere is likely as good as 2004.", "tinyllama:1.1b": "Cairn Energy has reported a 6% increase in its share price after it said that a new oilfield discovered by drilling in India is larger than previously thought, with production expected to exceed previous forecasts. The company also stated that the development area for Cairn's main project, Mangala and Aishwariyia, could now produce oil for more than 25 years due to improvements. However, this was not enough to fully alleviate worries over Cairn's upcoming reshuffle by the Financial Times Selective Equity 100 index. Cairn Energy shares closed at £1130p on Thursday, with a 6% jump since last year.", "tinydolphin:1.1b": " Cairn Energy has successfully discovered oil in a new area of Rajasthan, India, that could potentially last for more than 25 years. The discovery brings the company's total oil production up from 26 million barrels in 2019 to an estimated 70 million barrels in 2020, based on Cairn's current plans for growth. The firm has applied for a 30-month extension to scout for oil outside of its main development area, which includes the Mangala and Aishwariya fields where Cairn has previously announced major discoveries. Production at these other fields across the globe is likely to surpass levels seen in 2004.", "phi:2.7b": " Shares of Cairn Energy surged 6% after the company announced an Indian oilfield was larger than previously thought, with the discovery expected to yield more than 25 years of oil production. The news follows a disappointing drilling update in December that caused its shares to fall 18%. Despite this setback, Cairn still hopes to be included in the FTSE 100 when the index is reshuffled next month. The company made the new discovery after being granted an extension to their drilling license by Indian authorities and plans to continue exploring for oil outside of their main development area.\n", "orca-mini:3b": " Cairn Energy's share price increased by 6% after the company announced a new oil find in India, which is larger than previously believed. The firm said that drilling to the north-west of its Rajasthan development site had produced strong results and that it now believes the area will be able to produce oil for more than 25 years. However, Cairn's shares were hit last month following a disappointing drilling update, and the company is still in danger of being relegated from the FTSE 100 when the index is reshuffled next month. Before Christmas, Cairn revealed that drilling to the north of the Rajasthan field had been disappointing, but on Thursday the firm said its belief that the path of oil had moved further west had proven correct. Cairn has applied for a 30-month extension to scout for oil outside its main development area and expects production at its other fields across the globe to surpass levels seen in 2004.", "hermes3:3b": "Cairn Energy shares up 6% on larger estimated Indian oilfield discovery.", "stablelm-zephyr:3b": "Cairn Energy shares jumped 6% following the revelation of a larger-than-thought Indian oilfield, producing \"very strong results.\" The company now expects the development area to produce oil for over 25 years. Cairn's share price increased by 300% last year due to various oil finds, but faced a December drop after a disappointing drilling update. The company believes its Rajasthan find has moved further west and that the region looks \"very strong.\" Cairn made this discovery after receiving an extension for their drilling license in January and now seeks a 30-month extension to scout for oil outside of their main development area.", "chatgpt-4o-latest": "Cairn Energy's shares rose 6% after announcing that an Indian oilfield in Rajasthan was larger than expected, with strong drilling results suggesting over 25 years of production. The company's shares had surged 300% last year due to multiple oil finds but dropped in December after disappointing drilling results. Despite this, Cairn's latest findings confirmed oil movement further west, boosting confidence. The firm, granted a drilling license extension in January, has applied for a further 30-month extension to explore beyond its main development area. Cairn also expects global production to exceed 2004 levels.", "stablelm2:1.6b": "Cairn Energy shares jumped 6% after discovering an Indian oilfield is larger than initially thought, with strong results from drilling conducted to the north-west of their development site in Rajasthan. The company now estimates the development area can produce oil for more than four years, and Cairn's share price surged by 6% after a successful oil find last year. However, shares were hit following disappointing drilling updates in December. Cairn made the discovery with an extension to their drilling license granted by Indian authorities, allowing them to scout for oil outside their main development area. Production at other fields worldwide is expected to surpass levels seen in 204.", "granite3.1-dense:2b": "Cairn Energy's share price increased by 6% following a positive drilling update for an Indian oilfield in Rajasthan, where they now estimate the field could produce oil for over 25 years. This reversal of previous disappointing results has raised hopes, as Cairn had previously seen its shares fall by 18% and risked being delisted from the FTSE 100. Drilling to the west confirmed strong potential, according to exploration head Mike Watts and CEO Bill Gammell. The company recently received a 30-month extension for drilling outside its main development area, which includes successful fields like Mangala and Aishwariya. Additionally, production from other global fields is expected to surpass 2004 levels.", "reference": "Cairn said drilling to the north-west of its development site in Rajasthan had produced \"very strong results\".Before Christmas, Cairn revealed that drilling to the north of the field in Rajasthan had been disappointing, which caused its shares to lose 18% in one day.The firm has applied for a 30-month extension to scout for oil outside its main development area, which includes the Mangala and Aishwariya fields where Cairn has previously announced major discoveries.The company also said it now believed the development area would be able to produce oil for more than 25 years.Shares in Cairn Energy have jumped 6% after the firm said an Indian oilfield was larger than previously thought.Cairn's share price rose 300% last year after a number of oil finds, but its shares were hit in December following a disappointing drilling update."}