{"raw_text": "'Standoff' on Deutsche's LSE bid\n \n Deutsche Boerse investors unhappy with its London Stock Exchange bid will have no chance to throw out the exchange's management until May, Reuters says.\n \n The Sunday Times reported that hedge funds TCI and Atticus were planning to demand the removal of the group's chairman and chief executive. But Deutsche Boerse told news agency Reuters such a move would have to wait until May's annual general meeting. Investors want Deutsche to return cash to shareholders rather than bid. \"We are long-term investors and are experienced in removing management. We are not scared to take this to its conclusion this time,\" Atticus' David Slager told the Sunday Times. However, Deutsche Boerse told Reuters: \"TCI's request for the removal of the supervisory board will be considered at the annual general meeting on May 25.\"\n \n The Sunday Times reported that TCI had been drawing up a list of heavyweight executives to replace Deutsche's chairman Rolf Breuer and chief executive Werner Seifert. The group owns more than 5% of Deutsche - more than enough to demand an extraordinary general meeting to call on shareholders to oust the German exchange's management. Under German law Deutsche does not need investor backing to make a takeover bid. TCI and Atticus have opposed the LSE bid for some time saying it would destroy shareholder value, and would be better spent on a share buyback. Deutsche is in competition with pan-European bourse Euronext to take over the London exchange. Many commentators have suggested a bidding war between the two could break out. However, any such move would have to wait until March when the Office of Fair Trading completes an investigation into the competition aspects of the pair's takeover proposals.\n", "llama3.2:1b": "Deutsche Boerse investors plan to demand removal of CEO Werner Seifert and chairman Rolf Breuer from Deutsche's London Stock Exchange bid. Investors want Deutsche to return cash to shareholders rather than bidding. The Sunday Times reported that TCI and Atticus, who own over 5% of the exchange, will seek to remove the supervisory board during Deutsche Boerse's annual general meeting on May 25.", "llama3.2:3b": "Deutsche Boerse investors unhappy with its LSE bid can't block the management's attempt until May, when the company's annual general meeting is due to take place. Hedge funds TCI and Atticus are demanding the removal of chairman Rolf Breuer and chief executive Werner Seifert. They believe the exchange should return cash to shareholders rather than bid for LSE.", "gemma2:2b": "Deutsche Boerse investors unhappy with its LSE bid cannot force management removal before May's AGM. TCI and Atticus, owning over 5% of Deutsche Boerse, planned to demand chairman and CEO removal but will have to wait for the AGM.  They also intend to push for cash returns to shareholders instead of a bid for the LSE. While Deutsche Boerse says TCI's request will be considered at the AGM, they also argue that shareholder removal wouldn't be possible before May. \n", "qwen2.5:0.5b": "Deutsche Bank has made a bid for LSE with TCI and Atticus' backing; however, Deutsche is not willing to sell control. TCI is proposing to replace Breuer and Seifert as CEO of Deutsche.", "qwen2.5:1.5b": "Deutsche Boerse investors will not be able to remove management from LSE until May 25th at the annual general meeting. TCI and Atticus want Breuer out as chairman, while Seifert will remain CEO. Shareholders are requesting cash returns rather than a bid for Deutsche's London exchange. A bidding war between Euronext and Deutsche could break out if competition investigation is completed in March.", "qwen2.5:3b": "Deutsche Boerse’s LSE bid faces opposition from hedge funds TCI and Atticus who want the group’s chairman and CEO removed before May’s AGM. Deutsche denied this, stating that a request for supervisory board removal will be considered at the annual general meeting on May 25th. The duo has been planning to replace Deutsche's management with heavyweight executives, supported by over 5% of shares. Despite this opposition, Deutsche does not need investor backing as per German law and could proceed with takeover bid in competition with Euronext. Any bidding war would likely be delayed until March when OFT completes its investigation into the competition aspect of their takeover proposals.", "opencoder:1.5b": "The 'Standoff' on Deutsche's LSE bid is concerned with the Deutsche Boerse investors unhappy about its London Stock Exchange bid. The exchange has indicated that it will not be able to make significant progress after May, when investors have expressed a preference for Deutsche to return cash to shareholders rather than bid. TCI and Atticus were contemplating whether they could demand the removal of the group's chairman and chief executive, while Deutsche Boerse mentioned that such move would need to wait until May's annual general meeting. Investors are eager for Deutsche to react this time - but the same source noted: \"TCI’s request for the removal of the supervisory board will be considered at the annual general meeting on May 25.\"\n", "smollm:1.7b": "The summary is concise and preserves key ideas and details from the original text. It includes:\n\n1. The main points: Standoff on Deutsche's LSE bid, investors unhappy with management, and TCI and Atticus planning to demand removal of management until May.\n2. Key details: Investors want Deutsche to return cash to shareholders rather than bid, long-term investors and experienced in removing management, heavyweight executives to replace Deutsche's chairman Rolf Breuer and chief executive Werner Seifert.\n3. The main points are preserved, but the language is simplified and concise for easier understanding.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Deutsche Boerse's bid on the London Stock Exchange. The user provided a detailed summary already, but they want me to generate my own version without using markdown or any explanations. Hmm, let me try to understand what's going on here.\n\nFirst, the text talks about Deutsche Boerse investors not wanting to remove their chairman and CEO until May. It mentions that hedge funds TCI and Atticus are pushing for a change, but they're asking for a meeting by May 25. The Sunday Times reported this, saying that these companies are trying to force a change because of shareholder's desire for cash back.\n\nI should capture the key points: Deutsche's current management is on trial until May, investors wanting a change before the meeting, TCI and Atticus being the main pushers, their demand involving a general meeting by May 25. Also, it's important to note that German law allows direct removal of managers without investor support, so they're not scared to go all out.\n\nSo putting it together: Investors are unhappy until May when management can be removed, TCI and Atticus are pushing for this through a meeting on May 25. The text also mentions competitors like Euronext and the fairness investigation by OBT.\n</think>\n\nInvestors at Deutsche's LSE bid are set to remove their chairman and CEO by May, with no chance until then. hedge funds TCI and Atticus plan to demand such removal during a general meeting on May 25, aiming for cash relief to shareholders. German law allows direct management removal without investor backing, so they're not hesitant.", "tinyllama:1.1b": "According to Reuter's, Deutsche Boersen's investors are unhappy with their London Stock Exchange bid and plan to request the removal of CEO Rolf Breuer and chairman Rolf Seifert until the group's annual general meeting in May. Investors want the German company to return shareholder value by ousting management, but Deutsche Boersen says it will wait for the AGM before removing the supervisory board. The Takeover Bid and Competition Authority investigation into Euronext and Deutsche Bank have been ongoing since 2017.", "tinydolphin:1.1b": " The German stock exchange operator Deutsche Boerse has received backlash from investors who are unhappy with its London Stock Exchange bid, with hedge funds planning to demand the removal of its management until May. However, Deutsche Boerse stated that any such move would have to wait until March when the Office of Fair Trading completes an investigation into the competition aspects of their takeover proposal.", "phi:2.7b": " Deutsche Boerse's investors are unhappy with their London Stock Exchange bid and will have to wait until May for a chance to vote against the exchange's management. The hedge funds TCI and Atticus are planning to demand the removal of the group's chairman and chief executive but must wait until May's annual general meeting. Investors want Deutsche to return cash to shareholders rather than bid, and TCI is considering replacing Deutsche' management with its own executives. However, Deutsche Boerse has said it will be considered at an extraordinary general meeting in May.\n", "orca-mini:3b": " Deutsche Boerse investors unhappy with its LSE bid plan to demand the removal of management at May's annual general meeting, according to Reuters. However, they will have to wait until May's AGM to take action. The Sunday Times reported that hedge funds TCI and Atticus want to remove the chairman and CEO, and have drawn up a list of heavyweight executives to replace them. Deutsche does not need investor backing to make a takeover bid, and is in competition with Euronext to take over the London exchange. However, any move to take on the LSE bid would have to wait until March when the Office of Fair Trading completes an investigation into the competition aspects of the pair's takeover proposals.", "hermes3:3b": "Deutsche Boerse bid for London Stock Exchange: Investors cannot challenge management removal before May annual meeting.", "stablelm-zephyr:3b": "Deutsche Boerse's London Stock Exchange (LSE) bid is causing dissatisfaction among investors, particularly hedge funds TCI and Atticus. These investors want Deutsche Boerse to return cash to shareholders instead of pursuing the LSE bid. However, Deutsche Boerse informed Reuters that TCI's request to remove the supervisory board will be considered at the annual general meeting on May 25. The Sunday Times reported that TCI was preparing a list of potential replacements for chairman Rolf Breuer and CEO Werner Seifert. Despite opposition from TCI and Atticus, Deutsche Boerse is still pursuing the LSE bid, as it does not require investor approval under German law. Any move by Deutsche Boerse to compete with pan-European exchange Euronext for London's stock exchange would have to wait until March when the Office of Fair Trading completes its investigation into the competition aspects of their takeover proposals.", "chatgpt-4o-latest": "Deutsche Boerse investors opposing its bid for the London Stock Exchange cannot remove management until May's annual general meeting. Hedge funds TCI and Atticus are pushing for the ousting of Deutsche's chairman and CEO, preferring a cash return to shareholders over the bid. TCI has been preparing a list of potential replacements and, with over 5% ownership, could call for an extraordinary meeting. However, under German law, Deutsche does not need investor approval for a takeover. TCI and Atticus argue the bid would harm shareholder value and advocate for a share buyback instead. Deutsche faces competition from Euronext for the LSE, with a potential bidding war delayed until March pending a UK competition review.", "stablelm2:1.6b": "Deutsche Boerse investors want to remove its management from the London Stock Exchange bid but can't do so until May's annual general meeting as they demand cash return to shareholders instead of bidding. Hedge funds TCI and Atticus plan to demand the removal of chairman and CEO, while Deutsche told Reuters such a move will wait for consideration at the AGM on May. TCI opposes the deal, arguing it would destroy shareholder value, suggesting replacing Deutsche's management with heavyweight executives; however, no action can take place under German law. A bidding war between Deutsche and Euronext awaits March when the Office of Fair Trading investigates competition aspects.", "granite3.1-dense:2b": "Investors of Deutsche Boerse, the German stock exchange group, are dissatisfied with its proposed acquisition of London Stock Exchange (LSE). Hedge funds TCI and Atticus, holding more than 5% of Deutsche's shares, intend to push for the removal of chairman Rolf Breuer and CEO Werner Seifert. According to Reuters, this demand will be considered only at the annual general meeting on May 25, not earlier. The groups argue that returning cash to shareholders would be more beneficial than pursuing the LSE bid. Deutsche is also facing opposition from Euronext in the bidding process for the LSE. A potential bidding war between these two exchanges is anticipated, but it will remain on hold until the Office of Fair Trading completes its investigation into the competition implications of their takeover proposals, scheduled for March.", "reference": "Deutsche Boerse investors unhappy with its London Stock Exchange bid will have no chance to throw out the exchange's management until May, Reuters says.But Deutsche Boerse told news agency Reuters such a move would have to wait until May's annual general meeting.However, Deutsche Boerse told Reuters: \"TCI's request for the removal of the supervisory board will be considered at the annual general meeting on May 25.\"The group owns more than 5% of Deutsche - more than enough to demand an extraordinary general meeting to call on shareholders to oust the German exchange's management.Under German law Deutsche does not need investor backing to make a takeover bid.The Sunday Times reported that hedge funds TCI and Atticus were planning to demand the removal of the group's chairman and chief executive."}