{"raw_text": "SEC to rethink post-Enron rules\n \n The US stock market watchdog's chairman has said he is willing to soften tough new US corporate governance rules to ease the burden on foreign firms.\n \n In a speech at the London School of Economics, William Donaldson promised \"several initiatives\". European firms have protested that US laws introduced after the Enron scandal make Wall Street listings too costly. The US regulator said foreign firms may get extra time to comply with a key clause in the Sarbanes-Oxley Act.\n \n The Act comes into force in mid-2005. It obliges all firms with US stock market listings to make declarations, which, critics say, will add substantially to the cost of preparing their annual accounts.\n \n Firms that break the new law could face huge fines, while senior executives risk jail terms of up to 20 years. Mr Donaldson said that although the Act does not provide exemptions for foreign firms, the Securities and Exchange Commission (SEC) would \"continue to be sensitive to the need to accomodate foreign structures and requirements\". There are few, if any, who disagree with the intentions of the Act, which obliges chief executives to sign a statement taking responsibility for the accuracy of the accounts. But European firms with secondary listings in New York have objected - arguing that the compliance costs outweigh the benefits of a dual listing. The Act also applies to firms with more than 300 US shareholders, a situation many firms without US listings could find themselves in.\n \n The 300-shareholder threshold has drawn anger as it effectively blocks the most obvious remedy, a delisting. Mr Donaldson said the SEC would \"consider whether there should be a new approach to the deregistration process\" for foreign firms unwilling to meet US requirements.\n \n \"We should seek a solution that will preserve investor protections\" without turning the US market into \"one with no exit\", he said. He revealed that his staff were already weighing up the merits of delaying the implementation of the Act's least popular measure - Section 404 - for foreign firms. Seen as particularly costly to implement, Section 404 obliges chief executives to take responsibility for the firm's internal controls by signing a compliance statement in the annual accounts. The SEC has already delayed implementation of this clause for smaller firms - including US ones - with market capitalisations below $700m (£374m).\n \n A delegation of European firms visited the SEC in December to press for change, the Financial Times reported.\n \n It was led by Digby Jones, director general of the UK's Confederation of British Industry (CBI) and included representatives of BASF, Siemens and Cadbury Schweppes. Compliance costs are already believed to be making firms wary of US listings. Air China picked the London Stock Exchange for its secondary listing in its $1.07bn (£558m) stock market debut last month. There are also rumours that two Chinese state-run banks - China Construction Bank and Bank of China - have abandoned plans for multi-billion dollar listings in New York later this year. Instead, the cost of Sarbanes-Oxley has persuaded them to stick to a single listing in Hong Kong, according to press reports in China.\n", "llama3.2:1b": "The US Securities and Exchange Commission (SEC) is considering softening new corporate governance rules that were introduced after the Enron scandal to ease the burden on foreign firms. The SEC chair, William Donaldson, has promised \"several initiatives\" to address European firms' concerns about compliance costs associated with Sarbanes-Oxley Act requirements for US listings.", "llama3.2:3b": "SEC chairman William Donaldson promises several initiatives to soften post-Enron rules, including extra time for foreign firms to comply with key clause in Sarbanes-Oxley Act, which could help ease compliance costs and allow more European firms to list on Wall Street.", "gemma2:2b": "SEC chairman William Donaldson is considering relaxing new US corporate governance rules to ease the burden on foreign firms. He plans to offer more time for compliance with the Sarbanes-Oxley Act and potentially adjust the 300-shareholder threshold for delisting. The SEC will weigh options for accommodating foreign structures while preserving investor protection.  The impact of these new rules has discouraged some companies from listing in the US, leading them to seek alternative venues like London or Hong Kong. \n", "qwen2.5:0.5b": "The US stock market watchdog is considering softening new corporate governance rules that would make foreign firms' annual accounts more costly and require executives to sign compliance statements. The SEC may delay implementation of this measure for smaller US companies with less than $700 million in market capitalization, including Air China and two Chinese state banks. European firms have protested the Act's requirements but are seeking a solution that preserves investor protections without turning the US market into one with no exit.", "qwen2.5:1.5b": "US stock market regulator willing to reconsider post-Enron corporate governance rules, including easing compliance requirements for foreign firms and delaying implementation of Section 404 for those without US listings. European companies have protested the new laws' high costs, which they argue outweigh potential benefits from dual listings in New York.", "qwen2.5:3b": "The US Securities and Exchange Commission (SEC) chairman, William Donaldson, is considering relaxing tough new corporate governance rules for foreign firms after the Enron scandal. The Sarbanes-Oxley Act, which goes into effect mid-2005, requires all US-listed firms to declare their financial accuracy in annual reports, potentially increasing compliance costs, especially for dual listed European firms. Donaldson announced potential initiatives including giving foreign firms more time to comply with key provisions of the Act and exploring a new deregistration process for reluctant foreign companies. The SEC is also reconsidering delaying the implementation of Section 404, which mandates chief executives to sign statements about internal controls, given its high cost. European firms have been lobbying the SEC for changes due to compliance costs outweighing potential benefits.", "opencoder:1.5b": "The SEC will continue to be sensitive to the need to accomodate foreign structures and requirements for firms with US stock market listings.\n \nFirms that break the new law could face huge fines and senior executives risk jail terms of up to 20 years. Mr Donaldson promised several initiatives, European firms have protested but have argued against the Act's least popular measure. The Act does not provide exemptions for foreign firms. The Act comes into force in mid-2005 and obliges all firms with US stock market listings to make declarations, which adds substantially to the cost of preparing their annual accounts. Firms that don't comply could face substantial losses.\n", "smollm:1.7b": "The US stock market watchdog's chairman has said he is willing to soften tough new US corporate governance rules to ease the burden on foreign firms. The SEC has already delayed implementation of this clause for smaller firms with market capitalisations below $700m (£374m).", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text about US stock market regulations and how they might change after Enron. Let me read through it carefully.\n\nThe text starts by talking about the US stock market watchdog's chairman wanting to soften the new rules because foreign firms are facing higher costs. They made a speech at London School of Economics, where they promised several initiatives. European companies protested that the US laws make Wall Street listings too expensive for them.\n\nThen it mentions Sarbanes-Oxley Act. I know this one from the scandal, and it's supposed to help executives comply with internal controls by signing compliance statements in their annual accounts. critics say it makes firms more expensive because they have to declare things, which is a big expense. If that happens, foreign companies might get fines or jail time if they break the law.\n\nThe Act was introduced in mid-2005 and is now in effect. It's supposed to help with things like preventing corporate fraud by making declarations. The US regulator said they'd continue to focus on accommodating foreign structures and requirements. But there are few people against this act, which includes making executives sign those compliance statements.\n\nHowever, European companies with NYSE secondary listings have objected because the costs of compliance seem too high compared to the benefits. They're worried that not all firms will follow, especially small ones like Air China using the London Stock Exchange and Chinese banks sticking to Hong Kong instead of New York.\n\nThe text also talks about a 300 shareholder threshold. It says this has blocked the easiest fix, which is listing firms without US shares, leading some to delay implementing compliance clauses. The chairman is weighing delays for foreign companies, especially those like smaller firms with less than $700 million in market cap.\n\nThere were delays in speeding up the Act's implementation. For example, smaller firms like US-sized ones had their compliance issues delayed, and now they're being considered by the SEC. A delegation of European firms visited the SEC to push for changes, and companies like Air China used London, while others moved to Hong Kong or not list at all.\n\nOverall, the summary needs to capture the main points: softening regulations, the act's role in compliance costs, Europe's opposition due to high costs, the 300 shareholder threshold blocking easy solutions, and the delay in implementing some clauses.\n\nI need to make sure I include key details without getting too detailed. Maybe mention William Donaldson's speech, the act's purpose, European opposition, the threshold problem, and the delegation visit.\n</think>\n\nThe US stock market watchdog chairman is considering softening tough new corporate governance rules due to concerns about foreign firms' increased compliance costs. In a speech at London School of Economics, he promised several initiatives. European firms objects that US laws make Wall Street listings too costly for them, arguing compliance costs outweigh benefits of dual listings. Sarbanes-Oxley Act, obliging executives to declare matters, makes firms more expensive as they comply with internal controls, but this also requires signatures and compliance statements. The 300 shareholder threshold blocked easy solutions like listing without US shares, leading some to delay complying clauses. A delegation of European firms visited the SEC in December, including Digby Jones, BASF, Siemens, and BASF stockbrokers. Compliance costs have already made many firms wary, with Air China using London Stock Exchange for $1.07 billion and rumors suggesting Chinese banks moved to Hong Kong instead of New York or avoiding NY listing altogether.", "tinyllama:1.1b": "The US stock market watchdog has promised \"severaal initiatives\" as part of its plan to ease the burden on foreign firmsincorporating new US corporate governance rules after the Enron scandal. The SEC will look at delaying the implementation of Section 404, which requires chief executive signatures for firms with market capitalization below $700 million. European firmsincluding British Associations, BASF, Siemens and Cadbury Schweppe, have already pressed for this change, a delegation led by Digby Jones (Director General of the UK's Confederation of British Industry) visited the SEC in December, and plans for a multi-billion dollar listing in Hong Kong instead of New York are reportedly underway.", "tinydolphin:1.1b": " Sure, I can summarize the main points from that text: The Securities and Exchange Commission (SEC) is considering softening its corporate governance rules following criticism of new US corporate laws after the Enron scandal, particularly on foreign firms. This would ease the burden on those companies wishing to comply with these new rules without violating international accounting standards or adding significant costs. The SEC's chairman, William Donaldson, has announced several initiatives aimed at easing these new rules for foreign firms, including a delay in implementing Section 404 and considering whether there should be a new approach to the deregistration process for foreign firms unwilling to meet US requirements.", "phi:2.7b": " US stock market watchdog's chairman is willing to ease tough new corporate governance rules to accommodate foreign firms. The SEC will consider giving foreign firms extra time to comply with the Sarbanes-Oxley Act and may delay implementation of its least popular measure for foreign firms. European firms have protested that US laws introduced after the Enron scandal make Wall Street listings too costly, leading some firms to choose a single listing in Hong Kong over multiple listings on the New York Stock Exchange.\n", "orca-mini:3b": " The US stock market regulator, William Donaldson, has hinted at softening tough new rules for foreign firms following protests that US laws imposed after the Enron scandal make Wall Street listings too costly. The Sarbanes-Oxley Act, which comes into force next year, obliges all firms with US stock market listings to make declarations, critics say will add substantially to the cost of preparing their annual accounts. However, the SEC chairman has said he is willing to rethink post-Enron rules, including Section 404, which obliges chief executives to take responsibility for the firm's internal controls by signing a compliance statement in the annual accounts. The SEC has already delayed implementation of this clause for smaller firms, including US ones, with market capitalisations below $700m. A delegation of European firms visited the SEC in December to press for change, and rumours suggest that two Chinese state-run banks - China Construction Bank and Bank of China - have abandoned plans for multi-billion dollar listings in New York later this year. Instead, the cost of Sarbanes-Oxley has persuaded them to stick to a single listing in Hong Kong.", "hermes3:3b": "US stock market watchdog chairman open to easing post-Enron corporate governance rules for foreign firms, considering delays for less popular measures.", "stablelm-zephyr:3b": "SEC Chairman William Donaldson announced his willingness to soften US corporate governance rules, specifically the Sarbanes-Oxley Act, to reduce compliance burdens on foreign firms. The act requires all firms with US stock market listings to make declarations, which critics argue will substantially increase annual account preparation costs. Donaldson suggested that the SEC would consider accommodating foreign structures and requirements while preserving investor protections. A delegation of European firms, including BASF, Siemens, and Cadbury Schweppes, visited the SEC in December to press for changes in the implementation of the Act's least popular measure, Section 404. The Financial Times reported that compliance costs are making US listings less appealing to some companies, leading them to choose secondary listings in other markets like Hong Kong instead.", "chatgpt-4o-latest": "SEC Chairman William Donaldson indicated a willingness to ease US corporate governance rules to reduce the burden on foreign firms. Speaking at the London School of Economics, he acknowledged concerns from European companies that the Sarbanes-Oxley Act, introduced after the Enron scandal, makes US listings too costly. The SEC may grant foreign firms extra time to comply with Section 404, a particularly expensive requirement obliging CEOs to certify internal controls. While the Act does not exempt foreign firms, the SEC is considering changes to the deregistration process for those seeking to exit US markets. Compliance costs have already deterred firms from US listings, with Air China and Chinese state-run banks opting for alternative markets. A European business delegation, including representatives from BASF, Siemens, and Cadbury Schweppes, recently lobbied the SEC for reforms.", "stablelm2:1.6b": "US stock market watchdog William Donaldson is reconsidering tough new corporate governance rules following European firms' complaints about the US laws introduced after the Enron scandal. The Securities and Exchange Commission (SEC) will consider new approaches for accommodating foreign structures and requirements while seeking a solution that preserves investor protections without turning the US market into one with no exit. The Sarbanes-Oxley Act requires all firms with US stock market listings to make declarations, adding substantially to the cost of preparing annual accounts; those that break the new law could face huge fines, while senior executives risk jail terms up to a year.", "granite3.1-dense:2b": "The US Securities and Exchange Commission (SEC) chairman, William Donaldson, announced plans to modify post-Enron governance rules to reduce the burden on foreign firms with listings on US stock exchanges. These changes could include extending compliance deadlines for key provisions of the Sarbanes-Oxley Act, which came into effect in 2005 and requires chief executives to vouch for their companies' financial accuracy. European firms have criticized these rules as too expensive, potentially discouraging them from dual listings on US markets. The SEC is considering new approaches to the deregistration process for foreign firms unwilling or unable to meet US requirements, aiming to maintain investor protections while preserving market exit options. Delaying Section 404 of the Sarbanes-Oxley Act, considered particularly costly due to CEO responsibility for internal controls, is among proposed adjustments.", "reference": "The Act also applies to firms with more than 300 US shareholders, a situation many firms without US listings could find themselves in.It obliges all firms with US stock market listings to make declarations, which, critics say, will add substantially to the cost of preparing their annual accounts.The US stock market watchdog's chairman has said he is willing to soften tough new US corporate governance rules to ease the burden on foreign firms.The SEC has already delayed implementation of this clause for smaller firms - including US ones - with market capitalisations below $700m (£374m).Mr Donaldson said the SEC would \"consider whether there should be a new approach to the deregistration process\" for foreign firms unwilling to meet US requirements.The US regulator said foreign firms may get extra time to comply with a key clause in the Sarbanes-Oxley Act.But European firms with secondary listings in New York have objected - arguing that the compliance costs outweigh the benefits of a dual listing.European firms have protested that US laws introduced after the Enron scandal make Wall Street listings too costly.Compliance costs are already believed to be making firms wary of US listings.Mr Donaldson said that although the Act does not provide exemptions for foreign firms, the Securities and Exchange Commission (SEC) would \"continue to be sensitive to the need to accomodate foreign structures and requirements\"."}