{"raw_text": "Ukraine trims privatisation check\n \n Ukraine is to review \"dozens\" of state asset sales as the country's new administration tackles corruption.\n \n The figure announced by President Viktor Yushchenko is less than the 3,000 cases mentioned last week, but will cover many of the biggest deals. Ukraine recently ousted long-serving leader Leonid Kuchma and has said it wants closer European Union links. In a separate statement, the EU said that the US should back Ukraine's entry into the World Trade Organisation. The comments came as Viktor Yushchenko prepared to head to Brussels to meet with US President George W Bush and other North Atlantic Treaty Organisation (Nato) leaders. He is the only non-Nato member leader invited to attend the summit.\n \n Mr Yushchenko recently defeated Moscow-backed presidential candidate and Prime Minister Viktor Yanukovych at the polls, and has made no secret of his wish to fight corruption and make Ukraine more transparent.\n \n Earlier this month, new Prime Minister Yulia Tymoshenko said as many as 3,000 firms may have their privatisations put under the spotlight. Her comments raised concerns among a number of investors and Mr Yushchenko was seen on Monday as trying to soothe their frayed nerves. \"We acknowledge that business in Ukraine is now shaped and 98% of privatisations were carried out according to the law,\" Mr Yushchenko said on Monday. \"We have trust in this business and want to defend it by law,\" he continued, adding that any review would focus on \"dozens of companies, not hundreds or thousands\". He cited last year's sale of Ukrainian steel producer Krivorizhstal as one that had raised concerns. It was sold in June 2004 to a consortium that included Viktor Pinchuk, son-in-law of former-President Kuchma, and Rinat Akhmetov, the country's richest man, for $800m (£424m) - despite other higher offers.\n \n Vice-Prime Minister Oleg Rybachuk called on the EU to recognise the steps that Ukraine was taking, fearing that should the country not be rewarded for its efforts there may be a backlash against closer relations with Brussels. He said that while he understood that Ukraine was not ready for EU membership, the country needed to see progress on topics such as trade and visa requirements. \"We deserve an honest response,\" Mr Rybachuk told the Associated Press in an interview. \"We understand the difficulties. We refuse to understand double standards.\" Ukraine may find it has a sympathetic ear in Brussels \"The EU has reiterated that we support (Ukraine's) fast accession to the WTO and if possible we would like that to happen some time during the year,\" said Claude Veron-Reville, a spokesman for EU trade commissioner Peter Mandelson. \"We have said as much to the Americans. We feel that it is important for us all to pull together for Ukraine to be allowed into the WTO. Mr Yushchenko was careful not to turn his back on Russia, which borders the country to the east, saying it was important to maintain 'pragmatic' ties with Moscow. \"Russia is Ukraine's eternal strategic partner,\" Mr Yushchenko said.\n", "llama3.2:1b": "Ukraine's new administration plans to review a dozen state asset sales as part of its efforts to combat corruption. The move follows President Viktor Yushchenko's announcement that 3,000 firms may have their privatisations put under the spotlight. Vice-Prime Minister Oleg Rybachuk has called for the EU to recognize Ukraine's steps towards closer European ties, including potential membership in the World Trade Organisation. Meanwhile, Russia is said to be supporting Ukraine's bid to join the WTO.", "llama3.2:3b": "Ukraine plans to review around 50 state asset sales amid efforts to combat corruption. President Viktor Yushchenko aims to make the country more transparent and has made no secret of his desire to fight corruption. The move was announced as he prepares to meet with EU leaders, who have expressed support for Ukraine's entry into the World Trade Organisation.", "gemma2:2b": "Ukraine will review a number of state asset sales due to corruption concerns under President Viktor Yushchenko's administration. The review will focus on \"dozens\" of companies, not hundreds or thousands, including the controversial sale of steel producer Krivorizhstal, which sparked protests from investors. Ukraine seeks closer ties with the European Union and is pushing for entry into the World Trade Organization.  The EU supports Ukraine’s WTO membership. Yushchenko will meet with US President George W Bush and other NATO leaders in Brussels to discuss these issues. \n", "qwen2.5:0.5b": "Ukraine is reviewing a large number of state asset sales as part of a new administration’s efforts against corruption. A figure announced by President Viktor Yushchenko indicates 3,000 deals that have already been carried out. This number may not be the final tally, but it will cover many of the biggest deals. The EU and Ukraine are also in discussions about how to make Ukraine more transparent.\n\nUkraine's new leader, Viktor Yushchenko, defeated his opponent and formed a government with support from both parties, including Moscow-backed Prime Minister Viktor Yanukovych. However, he has acknowledged that business in Ukraine is now shaped by 98% of privatisations carried out according to the law. He also mentioned the sale of Krivorizhstal steel company as an example of companies being sold under the spotlight.\n\nUkraine is currently negotiating with the EU about its access to the World Trade Organization (WTO). The EU has reiterated that they support Ukraine's accession, but it's important for them to maintain pragmatic ties with Russia. \"Russia is Ukraine's eternal strategic partner,\" said Yushchenko in his speech, indicating the importance of maintaining good relations with the country's neighbor.\n\nThe European Union and Ukraine are also discussing how to make Ukraine more transparent. The EU has expressed interest in making Ukraine a member of the World Trade Organization (WTO), but it is important for them to maintain pragmatic ties with Russia. The EU has reaffirmed their support for Ukraine's fast accession to the WTO, but it would like to see more progress on other topics such as trade and visa requirements.\n\nOverall, Ukraine appears to be in the process of reviewing a large number of state asset sales as part of a new administration’s efforts against corruption.", "qwen2.5:1.5b": "Ukraine will review state asset sales as President Viktor Yushchenko attempts to address corruption concerns ahead of upcoming reforms and potential EU membership talks.", "qwen2.5:3b": "Ukraine plans to review \"dozens\" of state asset sales as part of efforts to tackle corruption under President Viktor Yushchenko, following the ousting of Leonid Kuchma and calls for closer EU links. The administration aims to address concerns among investors by stating that 98% of privatisations have been carried out legally. Mr Yushchenko recently defeated Prime Minister Viktor Yanukovych in elections and is keen on fighting corruption. Vice-Prime Minister Oleg Rybachuk emphasized the need for recognition from the EU, while Ukraine maintains pragmatic ties with Russia despite bordering it to the east. The EU supports Ukraine's fast accession to the World Trade Organisation (WTO).", "opencoder:1.5b": "Ukraine trims privatisation check\n\nUkraine is reviewing dozens of state asset sales as President Viktor Yushchenko tackles corruption. He announced that the figure less than 3000 cases was mentioned last week, but will cover many of the biggest deals.\n\nUkraine recently ousts long-standing Prime Minister Leonid Kuchma and has criticized EU-US links. Mr Yushchenko met with US President George W Bush at a polling center to discuss their decision. He also invited NATO leaders to attend the summit.\n\nMr Yushchenko defeated Moscow-backed candidate and Prime Minister Viktor Yanukovych in the polls, while he made a secret move. The comments suggested his wish to fight corruption and make Ukraine more transparent.\n\nSeveral firms have raised concerns last year due to their privatisations. Mr Yushchenko mentioned that 3,000 firms were willing to share with the European Union on a case-by-case basis. He also cited Krivorizhstal's sale in June 2004 for $800m (£424m) - despite higher offers.\n\nOn behalf of voters, Ukraine's efforts appear focused on promoting transparency and confidence in its actions. While it has seen a few escalations, it is now poised to return to the core through increased trade and visa requirements.\n", "smollm:1.7b": "Ukraine trims privatisation check by reducing the number of state assets sold under review. The figure announced by President Viktor Yushchenko is less than the 3,000 cases mentioned last week, but will cover many of the biggest deals. Ukraine recently ousted long-serving leader Leonid Kuchma and has said it wants closer European Union links. In a separate statement, the EU said that the US should back Ukraine's entry into the World Trade Organisation. The comments came as Viktor Yushchenko prepared to head to Brussels to meet with US President George W Bush and other North Atlantic Treaty Organisation (Nato) leaders. He is the only non-NATO member leader invited to attend the summit.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Ukraine trimming their privatisation process and the government's actions. Let me go through each point step by step.\n\nFirst sentence: Ukraine is reviewing several state asset sales. The figure announced is less than 3,000 deals but covers many big ones.\n\nNext, the President Yushchenko defeated a candidate and wants to strengthen transparency. He prepared for meetings with Bush and NATO leaders, which were crucial for his election.\n\nThere was an update on the privatisation efforts, mentioning Steel Ukrainian Krivorizhstal sold in 2004 as one of the big deals. The sale involved several people, including Pinchuk and Akhmetov, from the same family.\n\nThen, the vice president urged the EU to recognize their efforts. They worry without reward in Brussels might lose favor with the EU's partners there.\n\nThe EU said they support Ukraine joining WTO soon, as it was a strategic partner. Russia is also mentioned for its pragmatic ties and role as Ukraine's main partner.\n\nI need to condense all these points into a concise summary, making sure key ideas like Yushchenko's actions, the sale of Krivorizhstal, and the EU's involvement are included without adding extra details.\n</think>\n\nUkraine is reviewing state asset sales, with over 3,000 deals announced but covering many big ones. The country aims to strengthen transparency by preparing for meetings with President George W. Bush and NATO leaders. New Prime Minister Yulia Tymoshenko has criticized 3,000 privatisations as being carried out in law despite concerns among investors. The EU supports Ukraine's EU membership and has encouraged it to prepare for trade-related steps. Russia is mentioned as a strategic partner, with Ukraine also considering its pragmatic ties.", "tinyllama:1.1b": "Ahead of a summit with US President George W Bush and other North Atlantic Treaty Organisation (NATO) leaders, Ukrainian President Viktor Yushchenko is preparing to meet with them in Bruussels later this month, hoping to ease concerns over his administration's efforts to combat corruption. The president has made no secret of his intention to review \"dozens\" of privatisations that were carried out according to the law and will focus on \"dozen[s]\" of companies that raised concerns. The move comes in light of last year's sale of Ukrainian steel producer Krivorizhsalt, which was sold for $800m despite other higher offers. Vice-Prime Minister Oleh Rybachuk called on the EU to recognise Ukraine's efforts and hopes for a backslide on closer relations with EU membership. The European Union has also expressed interest in fast-tracking Ukraine's WTO accessions, while the President is expected to make sure \"pragmatic\" tie-ups with Moscow remain intact.", "tinydolphin:1.1b": " Based on the provided text, a summary of the key points would be:\n1. President Viktor Yushchenko has announced that he plans to review state asset sales and is reviewing the number of deals in line with previous statements. 2. The figure being considered by Yushchenko falls short of the 3,000 cases mentioned last week, but covers many major deals. 3. President Yushchenko believes that Ukraine should benefit from closer European Union (EU) links and seeks support from NATO members for its entry into the organization. 4. The EU has expressed support for Ukraine's move towards a more transparent business environment, with US President George W. Bush also expressing interest in the situation. 5. The review of asset sales is seen as part of President Yushchenko's efforts to fight corruption and improve transparency in Ukraine.", "phi:2.7b": " The Ukrainian government plans to review dozens of state asset sales due to concerns about corruption. President Viktor Yushchenko aims to improve transparency and make Ukraine more transparent. Earlier this month, the new Prime Minister announced that as many as 3,000 companies may have their privatisations put under scrutiny. However, Mr Yushchenko has assured investors that any review would focus on dozens of companies, not hundreds or thousands. He cited the sale of a Ukrainian steel producer to a consortium involving two wealthy individuals as an example. Vice-Prime Minister Oleg Rybachuk urged the EU to recognise Ukraine's efforts and progress towards closer ties with Brussels. The EU has expressed support for Ukraine's fast accession to the World Trade Organisation (WTO) and hopes that this will happen during the year. Despite concerns about corruption, Mr Yushchenko stressed the importance of maintaining pragmatic ties with Russia, which borders Ukraine.\n", "orca-mini:3b": " Ukraine plans to review \"dozens\" of state asset sales as the country's new administration aims to tackle corruption. The figure announced by President Viktor Yushchenko is less than the 3,000 cases mentioned last week, but will cover many of the biggest deals. The review comes as Viktor Yushchenko prepares to head to Brussels to meet with US President George W Bush and other North Atlantic Treaty Organisation (Nato) leaders. He is the only non-Nato member leader invited to attend the summit. Mr Yushchenko has made no secret of his wish to fight corruption and make Ukraine more transparent. Earlier this month, new Prime Minister Yulia Tymoshenko said as many as 3,000 firms may have their privatisations put under the spotlight. Her comments raised concerns among a number of investors and Mr Yushchenko was seen on Monday as trying to soothe their frayed nerves. The review will focus on \"dozens\" of companies, not hundreds or thousands, said President Viktor Yushchenko. He cited last year's sale of Ukrainian steel producer Krivorizhstal as one that had raised concerns. It was sold in June 2004 to a consortium that included Viktor Pinchuk, son-in-law of former-President Kuchma, and Rinat Akhmetov, the country's richest man, for $800m (£424m) - despite other higher offers. Vice-Prime Minister Oleg Rybachuk called on the EU to recognize the steps that Ukraine was taking, fearing that should the country not be rewarded for its efforts there may be a backlash against closer relations with Brussels. He said that while he understood that Ukraine was not ready for EU membership, the country needed to see progress on topics such as trade and visa requirements.", "hermes3:3b": "Ukraine to review fewer than 3000 state asset sales as part of corruption fight before closer EU links and WTO entry.", "stablelm-zephyr:3b": "Ukraine's new administration plans to review dozens of state asset sales in an effort to tackle corruption and increase transparency. This announcement comes after President Viktor Yushchenko defeated Moscow-backed presidential candidate and Prime Minister Viktor Yanukovych at the polls, with a focus on fighting corruption. New Prime Minister Yulia Tymoshenko had previously suggested that up to 3,000 firms may have their privatisations put under scrutiny, but Yushchenko clarified that only dozens of companies would be reviewed. The European Union (EU) expressed support for Ukraine's entry into the World Trade Organisation and called on the US to do the same. Vice-Prime Minister Oleg Rybachuk urged the EU to recognize Ukraine's efforts in this regard, as progress was made on topics such as trade and visa requirements.", "chatgpt-4o-latest": "Ukraine's new administration, led by President Viktor Yushchenko, is reviewing \"dozens\" of state asset sales to tackle corruption, a smaller number than the 3,000 initially suggested. The review will focus on major deals, including the controversial sale of steel producer Krivorizhstal. Yushchenko reassured investors that 98% of privatisations were legal and that business would be protected. Meanwhile, Ukraine seeks closer ties with the EU and WTO membership, with EU officials supporting its accession. Vice-Prime Minister Oleg Rybachuk urged the EU to acknowledge Ukraine's reforms. Yushchenko also emphasized maintaining pragmatic relations with Russia.", "stablelm2:1.6b": "Ukraine will review dozens of state asset sales as part of a new administration aims to combat corruption. New Prime Minister Yulia Tymoshenko previously announced up to 3,000 companies may face scrutiny. President Viktor Yushchenko assures that any review will focus on \"dozens\" and not hundreds or thousands. The EU has pledged support for Ukraine's fast accession to the World Trade Organization.", "granite3.1-dense:2b": "Ukraine plans to review \"dozens\" of large-scale privatization cases as part of its new administration's anti-corruption measures, following the ousting of long-serving President Leonid Kuchma and a desire for closer EU ties. This is a reduction from the 3,000 proposed deals mentioned earlier by Prime Minister Yulia Tymoshenko, who expressed concerns about potential corporate backlash due to past high-profile, questionable privatizations.\n\nPresident Viktor Yushchenko aims to reassure investors and international partners, emphasizing that 98% of previous privatizations adhered to the law. He highlighted Ukraine's commitment to upholding business practices through legislation. Vice-Prime Minister Oleg Rybachuk called for recognition from the EU of Ukraine's progress, warning against potential penalties if there is no advancement on trade and visa matters.\n\nThe EU has expressed support for Ukraine's swift entry into the World Trade Organisation (WTO), viewing it as crucial for collective cooperation. Meanwhile, Yushchenko maintains pragmatic ties with Russia, recognizing its strategic importance due to their shared border. He stated that Russia remains Ukraine's \"eternal strategic partner.\"\n\nYushchenko is set to meet US President George W Bush and other Nato leaders in Brussels as the only non-Nato member leader invited to attend.", "reference": "\"We acknowledge that business in Ukraine is now shaped and 98% of privatisations were carried out according to the law,\" Mr Yushchenko said on Monday.\"Russia is Ukraine's eternal strategic partner,\" Mr Yushchenko said.He said that while he understood that Ukraine was not ready for EU membership, the country needed to see progress on topics such as trade and visa requirements.Ukraine recently ousted long-serving leader Leonid Kuchma and has said it wants closer European Union links.Mr Yushchenko recently defeated Moscow-backed presidential candidate and Prime Minister Viktor Yanukovych at the polls, and has made no secret of his wish to fight corruption and make Ukraine more transparent.Ukraine may find it has a sympathetic ear in Brussels \"The EU has reiterated that we support (Ukraine's) fast accession to the WTO and if possible we would like that to happen some time during the year,\" said Claude Veron-Reville, a spokesman for EU trade commissioner Peter Mandelson.Mr Yushchenko was careful not to turn his back on Russia, which borders the country to the east, saying it was important to maintain 'pragmatic' ties with Moscow.Vice-Prime Minister Oleg Rybachuk called on the EU to recognise the steps that Ukraine was taking, fearing that should the country not be rewarded for its efforts there may be a backlash against closer relations with Brussels.In a separate statement, the EU said that the US should back Ukraine's entry into the World Trade Organisation.Her comments raised concerns among a number of investors and Mr Yushchenko was seen on Monday as trying to soothe their frayed nerves."}