{"raw_text": "Standard Life concern at LSE bid\n \n Standard Life is the latest shareholder in Deutsche Boerse to express concern at the German stock market operator's plans to buy the London Stock Exchange.\n \n It said Deutsche Boerse had to show why its planned £1.35bn ($2.5bn) offer for the LSE was good for shareholder value. Reports say Standard Life, which owns a 1% stake in Deutsche Boerse, may seek a shareholder vote on the issue. Fellow shareholders US-based hedge fund Atticus Capital and UK-based TCI Fund Management have also expressed doubts.\n \n Deutsche Boerse's supervisory board has approved the possible takeover of the LSE despite the signs of opposition from investors. \"The onus is on Deutsche Boerse's management to demonstrate why the purchase of the LSE creates more value for shareholders than other strategies, such as a buyback,\" said Richard Moffat, investment director of UK Equities at Standard Life Investments. Atticus Capital, holding 2% of Deutsche Boerse, wants it to buy back its own shares rather than buy the LSE. And TCI which holds about 5%, has made a request for an extraordinary shareholders meeting to be held to vote on replacing the company's entire supervisory board. It has also demanded that shareholders be consulted about the proposed acquisition, and whether the operator of the Frankfurt stock exchange should return $500m (£266m) to shareholders instead.\n \n In December, Deutsche Boerse, which also owns the derivatives market Eurex and the clearing firm Clearstream, put an informal offer of 530 pence per LSE share on the table. However, the LSE said the cash offer \"undervalued\" both its own business and the benefits of such a tie-up. Since then an improved offer from Deutsche Boerse has been anticipated as its management has continued talks with LSE chief executive Clara Furse. But the London exchange is also holding talks with Deutsche Boerse's rival Euronext, which operates the Amsterdam, Brussels, Lisbon and Paris exchanges, as well as London-based international derivatives market Liffe.\n", "llama3.2:1b": "Standard Life, Deutsche Boerse, and US hedge fund Atticus Capital are concerned about the German stock market operator's plans to buy the London Stock Exchange due to uncertainty from investors.", "llama3.2:3b": "Standard Life expresses concern over Deutsche Boerse's £1.35bn bid for the London Stock Exchange, suggesting a shareholder vote may be necessary to assess its value. Other investors also question the proposal, with Atticus Capital seeking a share buyback instead and TCI Fund Management demanding an extraordinary meeting to replace the supervisory board.", "gemma2:2b": "Standard Life, Atticus Capital, and TCI Fund Management have expressed concerns about Deutsche Boerse's proposed £1.35bn takeover of the London Stock Exchange. They demand evidence that the acquisition will enhance shareholder value over alternative options such as share buybacks. Investors are pushing for a shareholder vote on the deal and requesting discussions regarding its implications and potential alternatives. \n", "qwen2.5:0.5b": "Standard Life expressed concern at Deutsche Boerse's plans to buy the London Stock Exchange (LSE). The company owns 1% of Deutsche Boerse. Standard Life may seek a shareholder vote on the issue if necessary. Atticus Capital and TCI Fund Management have also expressed doubts. The Frankfurt stock exchange, which owns Eurex, Clearstream, and ClearMark, has been discussing an informal offer for 530 pence per LSE share.", "qwen2.5:1.5b": "Standard Life concerns Deutsche Boerse bid for London Stock Exchange due to lack of evidence showing deal would benefit shareholders. The company holds a 1% stake in Deutsche Boerse and could seek a shareholder vote on the matter. Atticus Capital, US-based hedge fund, wants to buy back its own shares instead of LSE; TCI Fund Management has requested an extraordinary shareholders meeting for a potential supervisory board change and consultation regarding the acquisition. In December 2019, Deutsche Boerse offered a cash bid of 530 pence per LSE share but was rejected by the London exchange, leading to talks with rivals Euronext.", "qwen2.5:3b": "Standard Life expresses concern over Deutsche Boerse’s £1.35bn offer for the London Stock Exchange, citing lack of justification for its value to shareholders. Fellow investors Atticus Capital and TCI Fund Management also doubt the deal. Despite these concerns, Deutsche Boerse's supervisory board approved the takeover. Standard Life Investment Director Richard Moffat suggests Deutsche Boerse should demonstrate how acquiring LSE increases shareholder value over alternatives like buybacks. Other investors call for a shareholders' vote or an extraordinary meeting to discuss and possibly reject the acquisition, arguing it undervalues both parties’ assets. In December, Deutsche Boerse initially offered 530 pence per LSE share but did not meet London Exchange's valuation criteria. The London exchange is also in talks with Euronext for potential takeover alternatives.", "opencoder:1.5b": "Standard Life concern at LSE bid\n\nDeutsche Boerse has made a significant move in the London Stock Exchange (LSE) which may lead to concerns about Standard Life's decision to buy the LSE.\n\nDeutsche Boerse said on December 14, the purchase of the LSE offered $2.5bn for Standard Life, but it did not come to the required margin. According to reports, Standard Life, which owns a stake in Deutsche Boerse, may seek a shareholder vote on the issue.\n\nFellow shareholders, including Atticus Capital and TCI Fund Management, also expressed concerns about the potential takeover by Deutsche Boerse.\n\nDeutsche Boerse's board approved the purchase of the LSE after considering opposition from investors. \"The purpose of the LSE is to provide an efficient marketplace for a wide range of financial instruments that are difficult or expensive to manage on a central bank, such as equities and derivatives,\" said Richard Moffat, former investment director at Standard Life Investments.\n\nAtticus Capital, who holds about 1% of Deutsche Boerse's stake, is seeking it to buy back its own shares rather than the LSE. The TCI Fund Management group also mentioned a request for an extraordinary shareholders meeting, which is likely to replace the company's entire supervisory board.\n\nStandard Life has also demanded that shareholders be consulted about the proposed acquisition before it can proceed. Moreover, they have asked Deutsche Boerse to \"continue talks with LSE chief executive Clara Furse.\" However, the London Stock Exchange and the Eurex market are also in discussions due to a merger of Deutsche Boerse and TCI.\n\nIn recent years, Deutsche Boerse has improved its offer from the LSE, showing increased confidence with continued talks between the board. However, the cash offer offered by Deutsche Boerse \"undervalued\" both business and the benefits of the deal, suggesting a potential for increased investment.\n", "smollm:1.7b": "The text above summarizes the main points of the original text by highlighting key ideas and details while preserving the tone and style of the original text. The summary should preserve the same meaning and essence of the original text without adding or removing any information.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text into a concise summary. The user wants only the summary without any extra information or explanations.\n\nFirst, I'll read through the entire text carefully. It's about Standard Life's concern regarding their investment in Deutsche Boerse buying the London Stock Exchange. There are quotes from Standard Life Investments and other shares expressing doubts about shareholder vote on the offer.\n\nI should identify the key points: Standard Life owns a 1% stake, expressed doubt about shareholder votes, potential buyback options from other shares, Deutsche Boerse's approval despite opposition, improved offers expected, and plans with Euronext and Liffe exchanges.\n\nNow, I need to condense all this into a clear summary. I'll make sure each main point is included succinctly without adding extra details.\n</think>\n\nStandard Life is the latest shareholder in Deutsche Boerse expressing concern over its £1.35bn offer for the LSE. They expressed doubts about shareholder vote on the offer, while fellow shareholders, including US-based Atticus Capital and UK-based TCI Fund Management, questioned it as well. Deutsche Boerse was allowed to approve the takeover despite opposition from investors. Standard Life Investments' Richard Moffat emphasized demonstrating value through better share buyback. Atticus wants a buyback instead of a share offer, and TCI seeks an extraordinary meeting for voting on replacing the supervision board. In December, Deutsche Boerse offered 530 pence per LSE share but faced criticism, anticipating improved offers with Clara Furse, while plans to join Euronext and Liffe exchanges are ongoing.", "tinyllama:1.1b": "Standard Life, another shareholder in Deutsche Boerse, has expressed concerns about the German stock market operator's plans to buy the London Stock Exchange (LSE). Standard Life is also reported to be considering a shareholder vote for or against the takeover proposal. Meanwhile, Deutsche Boerse's supervisory board approved the potential purchase of the LSE despite signs of opposition from investors. Atticus Capital and TCI Fund Management are also questioning why Deutsche Boerse's management proposed the acquisition instead of returning investor funds or buying back shares. Standard Life has urged shareholders to consult about the proposed acquisition, while Deutsche Boerse's rival Euronext is holding talks with the LSE over a possible tie-up.", "tinydolphin:1.1b": " Standard Life (StandardLife) has expressed concerns about Deutsche Boerse's proposed £1.35bn takeover of the London Stock Exchange (LSE). The company is considering whether the acquisition would lead to more value for its shareholders, and has received expressions of doubt from fellow shareholders like Atticus Capital and TCI Fund Management. Deutsche Boerse's management has also faced scrutiny from investors, with a supervisory board approving the acquisition despite concerns.\n\nDeutsche Boerse is planning to buy the LSE for £1.35bn in total, which would value it at around $2.5bn. However, concerns have been raised over whether the proposed takeover is fair or in line with shareholder values. Atticus Capital has argued that Deutsche Boerse's strategy for creating more value for its shareholders is not compelling enough. TCI Fund Management, on the other hand, has pointed out that the acquisition of the LSE would lead to a buyer's remorse situation for its own shareholders.\n\nDeutsche Boerse has been in talks with both Euronext and Liffe, two major European stock exchanges. However, the LSE's CEO Clara Furse has also been engaging in discussions with Deutsche Boerse's management, and negotiations are continuing. If a satisfactory offer is not made by Deutsche Boerse, Standard Life may seek a shareholder vote to determine its position on the proposed acquisition.", "phi:2.7b": " Standard Life, Atticus Capital, and TCI Fund Management are expressing concern about Deutsche Boerse's plans to buy the London Stock Exchange for £1.35bn ($2.5bn). Standard Life is considering a shareholder vote on the issue, while Atticus Capital has suggested that Deutsche Boerse should buy back its own shares instead of purchasing the LSE. TCI wants a special shareholders meeting and a say in the matter. Deutsche Boerse's board has approved the acquisition despite opposition from investors. The company must demonstrate why the purchase will create more value for shareholders than other strategies, such as share buybacks.\n", "orca-mini:3b": " Standard Life, a shareholder in Deutsche Boerse, expressed concern about the planned acquisition of the London Stock Exchange by the German stock market operator. It sought a vote on the proposal by shareholders, citing doubts about the value creation of the acquisition. The concerns were echoed by fellow investors, including US-based hedge fund Atticus Capital and UK-based TCI Fund Management. Despite the objections, the supervisory board of Deutsche Boerse approved the acquisition plan. The LSE has also held talks with Euronext, its rival, and London-based international derivatives market Liffe, in case the acquisition falls through.", "hermes3:3b": "Standard Life opposes Deutsche Boerse's £1.35b LSE takeover bid; calls for demonstration of shareholder value benefits.", "stablelm-zephyr:3b": "Standard Life expresses concern over Deutsche Boerse's plan to buy the London Stock Exchange (LSE) for £1.35bn ($2.5bn). The investment firm may seek a shareholder vote on the issue, along with US-based hedge fund Atticus Capital and UK-based TCI Fund Management. Despite signs of opposition from investors, Deutsche Boerse's supervisory board approved the possible takeover of the LSE. Talks continue between Deutsche Boerse and LSE chief executive Clara Furse, as well as discussions with Euronext, a rival exchange operator.", "chatgpt-4o-latest": "Standard Life, a shareholder in Deutsche Boerse, has raised concerns over the German stock market operator's £1.35bn bid for the London Stock Exchange (LSE), questioning its value for shareholders. Other investors, including Atticus Capital and TCI Fund Management, have also expressed doubts. Deutsche Boerse's supervisory board has approved the potential takeover despite opposition. Atticus Capital prefers a share buyback, while TCI, holding 5%, has called for a shareholder vote on replacing the supervisory board and returning $500m to investors. Deutsche Boerse previously made an informal offer of 530 pence per LSE share, which the LSE rejected as undervaluing its business. Talks continue between Deutsche Boerse and LSE, while the LSE is also in discussions with rival Euronext.", "stablelm2:1.6b": "Standard Life expresses concern over Deutsche Boerse's plans to acquire the London Stock Exchange, urging the company to demonstrate why the deal would boost shareholder value. The German operator's supervisory board has approved the takeover, but investors including Standard Life are demanding clearer evidence of potential benefits for shareholders. In December, Deutsche Boerse put a £1 billion ($2.5 billion) offer on the table; however, the LSE said it undervalued both its business and the potential synergies from such a tie-up.", "granite3.1-dense:2b": "Standard Life, a 1% stakeholder in Deutsche Boerse, has raised concerns about its planned £1.35bn ($2.5bn) acquisition of the London Stock Exchange (LSE). Standard Life demands that Deutsche Boerse demonstrate how this deal enhances shareholder value over other strategies like share buybacks. Similar opposition comes from fellow investors Atticus Capital and TCI, which holds 2% and about 5% of Deutsche Boerse, respectively.\n\nAtticus Capital prefers a share buyback, while TCI seeks an extraordinary shareholders meeting to vote on replacing the LSE supervisory board and consulting shareholders about returning $500m (£266m) to them instead of proceeding with the acquisition. Deutsche Boerse's 530 pence per LSE share offer was deemed insufficient by the London Stock Exchange, prompting anticipation of a more attractive proposal from Deutsche Boerse. Meanwhile, the LSE is negotiating with Euronext, another major stock exchange operator, amid these developments.", "reference": "It said Deutsche Boerse had to show why its planned £1.35bn ($2.5bn) offer for the LSE was good for shareholder value.Since then an improved offer from Deutsche Boerse has been anticipated as its management has continued talks with LSE chief executive Clara Furse.Standard Life is the latest shareholder in Deutsche Boerse to express concern at the German stock market operator's plans to buy the London Stock Exchange.\"The onus is on Deutsche Boerse's management to demonstrate why the purchase of the LSE creates more value for shareholders than other strategies, such as a buyback,\" said Richard Moffat, investment director of UK Equities at Standard Life Investments.In December, Deutsche Boerse, which also owns the derivatives market Eurex and the clearing firm Clearstream, put an informal offer of 530 pence per LSE share on the table.Reports say Standard Life, which owns a 1% stake in Deutsche Boerse, may seek a shareholder vote on the issue."}