{"raw_text": "Man Utd to open books to Glazer\n \n Manchester United's board has agreed to give US tycoon Malcolm Glazer access to its books.\n \n Earlier this month, Mr Glazer presented the board with detailed proposals on an offer to buy the football club. In a statement, the club said it would allow Mr Glazer \"limited due diligence\" to give him the opportunity to take the proposal on to a formal bid. But it said it continued to oppose Mr Glazer's plans, calling his assumptions \"aggressive\" and his plan \"damaging\". Many of Manchester United's supporters own shares in the club, and the fan-based group Shareholders United is strongly opposed to any takeover by Mr Glazer. About 300 fans protested outside the Old Trafford ground two days ago.\n \n Rival local club Manchester City has pleaded with visiting fans not to protest inside its ground when the two teams play a televised match on Sunday.\n \n Manchester United's response comes as little surprise, as the board made clear. \"Any board has a responsibility to consider a bona fide offer proposal,\" the club said in its statement. Should it become a firm offer, it should be at a price that \"the board is likely to regard as fair\" and on terms which \"may be deliverable\". But it also stressed that it stayed opposed to Mr Glazer's proposal. \"The board continues to believe that Mr Glazer's business plan assumptions are aggressive,\" the statement said, \"and the direct and indirect financial strain on the business could be damaging.\" Whether or not the bid is attractive in monetary terms, in the case of Manchester United many investors hold the stock for sentimental rather than financial reasons. At present, Mr Glazer and his family hold a 28.1% stake, making them Manchester United's second biggest shareholders. They own the successful Tampa Bay Buccaneers American football team based in Florida. If the family makes a formal offer, they will need the support of the club's biggest shareholders.\n \n Irish horse racing millionaires JP McManus and John Magnier own 29% of United through their investment vehicle Cubic Expression, and have yet to express a view on the bid approach.\n \n A group of five MPs are calling on the Department of Trade and Industry to block any takeover of the club by the US football magnate on public interest grounds. They have signed a House of Commons motion, and Tony Lloyd, the Manchester Central MP, whose constituency includes the club's Old Trafford ground, has pledged to take the matter \"to Tony Blair if necessary\". The Commons motion says \"any takeover designed to transform the club into a private company would be against the interests of those supporters and football\". However, the DTI has dismissed the proposal. A spokesman said the department did not believe there was a case for changing the Enterprise Act so that takeovers of football clubs could be looked at on non-competition grounds. Mr Glazer's offer values the club at £800m ($1.5bn). Pitched at 300p per share, it also relies less on debt to finance it than an earlier approach from the US tycoon, which was rejected out of hand. Manchester United shares closed at 270.25p on Friday, down 3.75p on the day.\n", "llama3.2:1b": "Manchester United's board has agreed to give American businessman Malcolm Glazer access to the club's books, allowing him to consider a takeover proposal. The offer values the club at £800m ($1.5bn) and includes limited due diligence, but the board still opposes it, citing potential financial strain on the business. Shareholders United, a fan-based group, has opposed the plan, while some MPs have called for the government to block the takeover due to public interest grounds.", "llama3.2:3b": "Manchester United's board has agreed to allow US tycoon Malcolm Glazer limited due diligence on his offer to buy the club. The club opposes Mr Glazer's plan, calling his assumptions \"aggressive\" and his proposal \"damaging\". Manchester City asked its fans not to protest inside its ground against the potential takeover. If a formal bid is made, it must be at a fair price with deliverable terms. A group of MPs are calling for the Department of Trade and Industry to block any takeover on public interest grounds. Mr Glazer's offer values the club at £800m ($1.5bn), pitched at 300p per share, less reliant on debt than an earlier approach.", "gemma2:2b": "Manchester United's board agreed to allow Malcolm Glazer access to its financial records for due diligence purposes. While the club is considering a potential offer from Glazer, it continues to oppose his plan and believes his proposals are detrimental to the club's future. Fans are protesting against the potential takeover by Glazer.  Some of Manchester United’s biggest shareholders (including JP McManus and John Magnier) haven’t commented on the proposal yet. A group of MPs is urging the government not to allow the Glazers to take over the club, claiming it would be detrimental to fans and football. \n ", "qwen2.5:0.5b": "Man Utd has agreed to give Malcolm Glazer limited access to the club's books and will allow him \"limited due diligence\" before a formal bid. Glazer claims his assumptions are aggressive and plans \"damaging\" Manchester City. The board, however, remains opposed. Manchester United supporters own 28.1% of the club and have been opposing Mr Glazer's proposal for 30 days. A group of MPs has asked the Department of Trade & Industry to block any takeover by Mr Glazer on public interest grounds.", "qwen2.5:1.5b": "Manchester United's board has agreed to allow US tycoon Glazer access to club financials but continues to oppose his takeover proposal due to concerns about aggressive assumptions and potential damage to the business. Shareholders United is strongly opposed, and fans have protested outside Old Trafford. The club expects any offer valued at £800m ($1.5bn) to be fair in terms of price and delivery. MPs are calling for a Department of Trade and Industry ban on takeover by Glazer due to public interest concerns, but the DTI has dismissed the proposal as not meeting non-competition grounds criteria under the Enterprise Act.", "qwen2.5:3b": "Manchester United's board has agreed to allow US tycoon Malcolm Glazer limited access to its books for due diligence as part of his takeover proposal. The club opposes any takeover, considering Glazer’s assumptions aggressive and financially damaging despite owning a significant stake. Many fans oppose the deal, with some protesting outside Old Trafford. A Commons motion seeks to block the takeover citing public interest concerns, but the DTI has dismissed this. Currently, Glazer holds 28.1% of the club through his family's stake in Tampa Bay Buccaneers and investment vehicle Cubic Expression.", "opencoder:1.5b": "Manchester United has agreed to give a tycoon a boost for buying Glazer's books. Earlier this month Mr Glazer presented detailed proposals to buy the football club. The club said he allowed him \"limited due diligence\" to give him the opportunity to take the proposal on to a formal bid. However, it continued to attack his plans and called his assumptions \"aggressive\" and his plan \"damaging\". Many fans own shares in the club, and Shareholders United is against any takeover by Mr Glazer. A few people have expressed concerns about Manchester United's response.\nThe rival club has also insisted on not protest inside its ground when they play a televised match on Sunday. The club said it had considered the offer, but it continued to hold opposition.\nUnited's response was surprising as the board made clear \"any board has a responsibility to consider a bona fide offer\". If it becomes a firm offer, it should be at a price that \"the board is likely to regard as fair\" and on terms which may be deliverable. However, it also stressed that it stayed opposed to Mr Glazer's proposal.\nThe Irish horse racing club has invested with JP McManus and John Magnier who own 29% of United. If the family makes a formal offer, they will need the support of the club's biggest shareholders, which includes the club's Old Trafford ground.\nThe Commons motion is proposed to block any takeover by the US football magnate on public interest grounds. The DTI has dismissed the proposal, and a spokesman said the department did not believe there was a case for changing the Enterprise Act so that takeovers of football clubs could be looked at on non-competition grounds.\nMr Glazer's offer values the club at £800m ($1.5bn). It also relies less on debt to finance it than an earlier approach from the US tycoon who was rejected out of hand. The club shares closed at 270.25p on Friday, down 3.75p on the day.\n", "smollm:1.7b": "The summary is concise and objective, preserving key ideas and details. The main points are:\n\n1. A board has agreed to give US tycoon Malcolm Glazer access to its books.\n2. Earlier this month, Mr Glazer presented the board with detailed proposals on an offer to buy the football club.\n3. Many of Manchester United's supporters own shares in the club, and the fan-based group Shareholders United is strongly opposed to any takeover by Mr Glazer.\n4. Manchester City has pleaded with visiting fans not to protest inside its ground when the two teams play a televised match on Sunday.\n5. Manchester United's response comes as little surprise, as the board made clear. \"Any board has a responsibility to consider a bona fide offer proposal,\" the club said in its statement. Should it become a firm offer, it should be at a price that \"the board is likely to regard as fair\" and on terms which \"may be deliverable\".\n6. Mr Glazer and his family own 29% of United through their investment vehicle Cubic Expression, and have yet to express a view on the bid approach.\n7. A group of five MPs are calling on the Department of Trade and Industry to block any takeover of the club by the US football magnate on public interest grounds. They have signed a House of Commons motion, and Tony Lloyd, the Manchester Central MP, whose constituency includes the club's Old Trafford ground, has pledged to take the matter \"to Tony Blair if necessary\". The MPs say the department does not believe there was a case for changing the Enterprise Act so that takeovers of football clubs could be looked at on non-competition grounds.\n8. Mr Glazer's offer values the club at £800m ($1.5bn).\n9. Pitched at 300p per share, it also relies less on debt to finance it than an earlier approach from the US tycoon, which was rejected out of hand. Manchester United shares closed at 270.25p on Friday, down 3.75p on the day.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving key ideas and details. Let me read through it carefully.\n\nFirst, Manchester United is giving Mr. Glazer access to their books. The board has promised limited due diligence but he still opposes his plan. They're against aggressive assumptions and a damaging business model. Supporters own shares, and fans are opposed to internal protests. Man City is asking people not to protest inside when they play against United on Sunday.\n\nManchester United's statement says if it becomes an offer, it should be fair in price and terms. They oppose the plan but are okay with any size of investment. Michael Glazer holds 28% shares, making them the second largest shareholder. The US tycoon is interested in football through a Cubic Expression account.\n\nIrish millionaires own 29% and haven't said anything. Trade and Industry denied the takeover because it's against public interest. MPs are calling for the department to block it on public grounds, with Tony Lloyd supporting Blair if needed.\n\nSo I need to include all these points: Glazer's access, opposition, funding issues, Man City's response, Glazer's stake, US football context, and Trade and Industry's denial.\n</think>\n\nManchester United's board has agreed to give US tycoon Malcolm Glazer access to their books. Glazer presented the proposal but opposed it, calling assumptions \"aggressive\" and his plan \"damaging.\" Manchester City is asking visitors not to protest inside when they play at Old Trafford. Man Utd said accepting an offer would need fair terms. Glazer owns 28% shares, making them second largest. US football interests are against taking over clubs through their Cubic Expression account. Trade and Industry denied the takeover on public interest grounds. MPs called for UK Trade & Industry to block it.", "tinyllama:1.1b": "Amidst a heated takeover bid by Malcolm Glazer, Manchester United's board has allowed limited due diligence and approved Glazer's business plan as aggressive, but still opposes his proposal. The club reiterates its opposition to Glazer's plans and calls for a formal offer from other interested parties. A group of MPs called on the Department of Trade and Industry to block any takeover by Glazer, citing concerns about public interest, but the department dismissed their motion. Despite this, the DTI stated that changes would not be necessary to look at takeovers involving football clubs under certain circumstances. The shares closed at 270.25p on Friday, with a 3.75% decrease in value from Thursday's close.", "tinydolphin:1.1b": " Manchester United has agreed to grant US football tycoon Malcolm Glazer limited due diligence access to its books in a bid to buy the club. The proposal will allow Glazer to take an informed decision about the club's future, potentially leading to his proposal being accepted by the club's board. However, the fan-based group Shareholders United has expressed their opposition to any takeover by Mr Glazer, believing that his proposals are aggressive and not financially sound for the club. Manchester United's board made its decision based on the board's assessment of a bona fide offer from Mr Glazer. The club will continue to oppose the takeover proposal and is likely to ask for terms on which it would be acceptable to the board. In response, Manchester United has stated that any bid should be at a price that the board is likely to regard as fair, and should not lead to a significant reduction in the value of the club.", "phi:2.7b": " Manchester United's board has agreed to give US billionaire Malcolm Glazer access to its books as he presents detailed proposals to buy the football club. However, Manchester United and its shareholders remain opposed to his bid. Rival local club Manchester City is urging visiting fans not to protest during their televised match against a Manchester United game on Sunday. The board remains undecided but will consider any bona fide offer at a fair price that it deems deliverable, despite believing that Mr Glazer' s business plan assumptions are aggressive and the financial strain could be damaging.\n", "orca-mini:3b": " Man Utd's board has agreed to give US tycoon Malcolm Glazer access to its books, allowing him limited due diligence to take his proposal to a formal bid. Manchester United remains opposed to Mr Glazer's plan, calling his assumptions \"aggressive\" and his plan \"damaging\". The rival local club Manchester City has pleaded with visiting fans not to protest inside its ground when the two teams play a televised match on Sunday. A group of MPs is calling on the Department of Trade and Industry to block any takeover of the club by the US football magnate on public interest grounds. However, the DTI has dismissed the proposal. Manchester United shares closed at 270.25p on Friday, down 3.75p on the day.", "hermes3:3b": "Manchester United agrees to allow Glazer limited access to its books for potential takeover proposal.", "stablelm-zephyr:3b": "Manchester United's board has granted US tycoon Malcolm Glazer limited due diligence to explore a potential buyout offer. Despite this, the club continues to oppose Glazer's plans, which it deems \"aggressive\" and \"damaging.\" Shareholders, including many Manchester United fans, strongly object to any takeover attempt by Glazer. Rival club Manchester City has asked visitors not to protest during their upcoming match against United. Irish horse racing heirs JP McManus and John Magnier hold 29% of the club through Cubic Expression but have yet to comment on the bid approach. A group of five MPs is pushing for the Department of Trade and Industry to block any takeover on public interest grounds, but the DTI has dismissed this proposal.", "chatgpt-4o-latest": "Manchester United's board has agreed to give US tycoon Malcolm Glazer limited access to its financial records as he considers a formal takeover bid. Despite this, the board remains opposed to his plans, calling them \"aggressive\" and potentially \"damaging\" to the club. Many fans, including the group Shareholders United, strongly oppose the takeover, with protests occurring outside Old Trafford. Glazer and his family currently own 28.1% of the club, but they would need the support of the largest shareholders, JP McManus and John Magnier, who own 29% through Cubic Expression. A group of MPs is urging the government to block the takeover on public interest grounds, but the Department of Trade and Industry has dismissed the idea. Glazer's latest offer values the club at £800m and is less reliant on debt than his previous bid. Manchester United shares closed at 270.25p, down 3.75p.", "stablelm2:1.6b": "Manchester United's board has agreed to allow Malcolm Glazer access to its books for limited due diligence as he presents a proposal to buy the football club. While opposing the takeover, the club continues to oppose Mr. Glazer's plans. The fan-based group Shareholders United is strongly opposed to any takeover by Mr. Glazer. Manchester United's response comes as no surprise, as the board made clear that any offer should be at a fair price and on deliverable terms while opposing Mr. Glazer's proposal. Should the bid become a firm offer, it should be at a fair price and on deliverable terms. The club's biggest shareholders are opposed to the takeover, with many investors holding shares for sentimental reasons rather than financial ones. If the family makes a formal offer, they will need the support  of the club's biggest shareholders.", "granite3.1-dense:2b": "Manchester United's board has agreed to allow US businessman Malcolm Glazer limited access to the club's books following his proposal to buy the football club. The club maintains its opposition to the offer, citing aggressive assumptions and potential damaging financial strain. Shareholders United, a fan-based group, strongly disapproves of the takeover. Manchester City has requested fans not protest during their upcoming match with Manchester United. Glazer's family, who currently hold a 28.1% stake in the club, are among the second-largest shareholders. The club values the offer at £800m ($1.5bn), priced at 300p per share and less reliant on debt than previous proposals. However, Manchester United shares closed at 270.25p on Friday, down from 274p the previous day. A group of five MPs has called for the Department of Trade and Industry to block the takeover due to public interest concerns, but the DTI has dismissed this proposal.", "reference": "Many of Manchester United's supporters own shares in the club, and the fan-based group Shareholders United is strongly opposed to any takeover by Mr Glazer.Earlier this month, Mr Glazer presented the board with detailed proposals on an offer to buy the football club.\"Any board has a responsibility to consider a bona fide offer proposal,\" the club said in its statement.In a statement, the club said it would allow Mr Glazer \"limited due diligence\" to give him the opportunity to take the proposal on to a formal bid.Mr Glazer's offer values the club at £800m ($1.5bn).Manchester United's board has agreed to give US tycoon Malcolm Glazer access to its books.At present, Mr Glazer and his family hold a 28.1% stake, making them Manchester United's second biggest shareholders.\"The board continues to believe that Mr Glazer's business plan assumptions are aggressive,\" the statement said, \"and the direct and indirect financial strain on the business could be damaging.\"Rival local club Manchester City has pleaded with visiting fans not to protest inside its ground when the two teams play a televised match on Sunday.But it also stressed that it stayed opposed to Mr Glazer's proposal."}