{"raw_text": "Tsunami 'to hit Sri Lanka banks'\n \n Sri Lanka's banks face hard times following December's tsunami disaster, officials have warned.\n \n The Sri Lanka Banks Association said the waves which killed more than 30,000 people also washed away huge amounts of property which was securing loans. According to its estimate, as much as 13.6% of the loans made by private banks to clients in the disaster zone has been written off or damaged. State-owned lenders may be even worse hit, it said.\n \n The association estimates that the private banking sector has 25bn rupees ($250m; £135m) of loans outstanding in the disaster zone. On one hand, banks are dealing with the death of their customers, along with damaged or destroyed collateral. On the other, most are extending cheap loans for rebuilding and recovery, as well as giving their clients more time to repay existing borrowing. The combination means a revenue shortfall during 2005, SLBA chairman - and Commercial Bank managing director - AL Gooneratne told a news conference. \"Most banks have given moratoriums and will not be collecting interest, at least in this quarter,\" he said. In the public sector, more than one in ten of the state-owned People's Bank's customers in the south of Sri Lanka were affected, a bank spokesman told Reuters. He estimated the bank's loss at 3bn rupees.\n", "llama3.2:1b": "Sri Lanka's banks face revenue shortfall due to tsunami damage and loss of collateral during December's disaster. Estimated losses include 13.6% of private loans made in the disaster zone, with 25bn rupees ($250m; £135m) outstanding. State-owned lenders may also be affected, with some giving moratoriums on interest payments.", "llama3.2:3b": "Sri Lanka's banks face significant challenges following the tsunami disaster, with over 30,000 people killed and property damage resulting in an estimated 13.6% write-off of loans worth $250m. The private banking sector has outstanding loans totaling $250m, while state-owned lenders may be worse hit, with one bank estimating a loss of $3bn.", "gemma2:2b": "Sri Lanka's banks are facing significant financial challenges after the December tsunami disaster.  Massive property damage has wiped out collateral for loans and resulted in loan losses of up to 13.6% for private banks, potentially higher for state-owned lenders. Banks are extending relief by suspending interest payments and providing temporary repayment moratoria while navigating financial losses caused by the tragedy.  \n", "qwen2.5:0.5b": "Sri Lanka banks are facing hard times after the December tsunami disaster. According to the Sri Lanka Banks Association, the banks have dealt with the death of their customers and damaged or destroyed collateral, while most extend cheap loans for rebuilding and recovery as well as give clients more time to repay existing borrowing. The private banking sector has 25bn rupees outstanding in the disaster zone. Most banks are giving moratoriums and will not be collecting interest. In the public sector, nearly ten percent of state-owned bank customers in the south of Sri Lanka were affected.", "qwen2.5:1.5b": "Sri Lanka banks face significant losses and revenue shortfalls due to property damage from the December tsunami disaster. Private banks have written off or damaged approximately 13.6% of their loans in the affected area, while state-owned lenders may be even worse hit with a loss estimate of over 3 billion rupees.", "qwen2.5:3b": "Sri Lanka's banks face severe financial difficulties following December's tsunami disaster. The waves washed away property securing loans, resulting in up to 13.6% of private banks' loans in affected areas being written off or damaged. State-owned lenders may be even worse hit. Private banking sector has about 25bn rupees ($250m; £135m) of outstanding loans in the disaster zone. Banks are dealing with customer deaths and damaged collateral while extending cheap rebuilding loans, causing a revenue shortfall for most banks during 2005. The Sri Lanka Banks Association estimates losses at 250 million USD, with state-owned People's Bank estimating its loss at over 3bn rupees (around £189m).", "opencoder:1.5b": "\"Tsunami 'to hit Sri Lanka banks' Sri Lanka's banks face hard times following December's tsunami disaster. The Sri Lanka Banks Association said the waves which killed more than 30,000 people also washed away huge amounts of property which was securing loans. According to its estimate, as much as 13.6% of the loans made by private banks to clients in the disaster zone has been written off or damaged. State-owned lenders may be even worse hit.\" \n\nThe association estimates that the private banking sector has $250m (£135m) of loans outstanding in the disaster zone. The private sector is dealing with the death of their customers, along with damaged or destroyed collateral. Most banks are extending cheap loans for rebuilding and recovery, as well as giving their clients more time to repay existing borrowing. The combination means a revenue shortfall during 2005, SLBA chairman - and Commercial Bank managing director - AL Gooneratne said. In the public sector, around one in ten of the state-owned People's Bank's customers in the south of Sri Lanka were affected.\" \n\nThe bank's loss at 3bn rupees.\n", "smollm:1.7b": "The summary is concise and to the point, capturing the key ideas and details of the text:\n\n1. Tsunami 'to hit Sri Lanka banks' - The tsunami disaster has affected Sri Lanka's banks, which have suffered significant losses due to damage or loss of collateral.\n2. Sri Lanka's banks face hard times following December's tsunami disaster - The Sri Lankan banks are facing a severe crisis, with many loans written off or damaged in the disaster zone.\n3. State-owned lenders may be even worse hit - The state-owned banks, such as Commercial Bank and People's Bank, have been particularly affected by the disaster, with most lending suspended or cancelled.\n4. Most banks are giving moratoriums to collect interest - To mitigate the impact of the crisis, most banks have given a moratorium on collecting interest from their customers in 2005.\n5. SLBA chairman AL Gooneratne told a news conference that the private banking sector has lost around 3bn rupees - The Sri Lankan Banking Association estimates that the private banking sector has suffered significant losses due to the disaster, with many loans written off or damaged in the disaster zone.\n6. Most banks have given moratoriums and will not be collecting interest - To prevent further damage to their customers' finances, most banks have given a moratorium on collecting interest from their customers in 2005.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about Sri Lanka facing issues after its tsunami. Let me read through it carefully.\n\nThe main event is that Sri Lanka banks are struggling after the December tsunami. They face hard times because a lot of people died and huge properties were lost. The association said some 13% of their loans were damaged or written off, which is significant. Also, state-owned lenders might be worse off since they have bigger debts.\n\nBanks are dealing with customers who die and those with damaged collateral, meaning most are trying to get loans because they're rebuilding. They’re giving cheap loans for rebuilding and time to repay existing debts. This leads to a revenue issue in 2005, causing problems for the banks.\n\nAL Gooneratne told a news conference that many banks can’t collect interest because they have MORatoriums or won’t give it out in this quarter. He also mentioned that over one-third of state-owned banks had affected customers, with some losing 3 billion rupees.\n\nSo, I need to condense all these points into a concise summary without explanations or formatting.\n</think>\n\nSri Lanka's banks are facing financial challenges after the December tsunami disaster due to heavy losses from both the destruction and loss of properties. The Sri Lanka Banks Association estimates that approximately 13% of loans made by private banks in the disaster zone have been damaged or written off, while state-owned lenders may be even more affected. Private banking sector's outstanding loans are estimated at around $25 billion. Banks are handling losses from customer deaths and damaged collateral, while extending cheap loans for rebuilding and recovery. This leads to revenue issues in 2005, with many banks facing MORatoriums on interest collection. State-owned banks like the People's Bank of Sri Lanka have shown significant losses as well.", "tinyllama:1.1b": "Sri Lanka Banks Face Hard Times Following December Tsunami Disaster, as Property Damaged and Loans Written Off or Impaired by Waves\nThe Sri Lanka Banking Association has warned that disaster-hit banks face difficult times. The waves which killed over 30,000 people also wreaked havoc on the banking system, leaving a significant number of loan accounts with no collateral or damage. As a result, most banks are dealing with small revenues from their operations and have extended cheap loans for bouncing customers' accounts and building up the country during 2005. The combination means a shortage of revenue, which may lead to a financial crunch in private banking sectors as well as state-owned banks. One in ten customers in the People's Bank's south were affected by the tsunami disaster, while Moist Banks had given moratoriums on interest payments and would not collect them for this year, their representative told Reuters.", "tinydolphin:1.1b": " The tsunami has caused significant damage to several banks in Sri Lanka, leading to an estimated 13.6% loss of loans made by private clients in disaster-hit areas. As a result, some state-owned banks may also be severely impacted. This is particularly concerning as many of these loans were likely securing collateral for borrowers. The tsunami has caused significant damage to infrastructure and businesses in the affected regions, further exacerbating the situation for businesses and individuals alike. As a result, banks are facing a substantial revenue shortfall this year. Meanwhile, in the public sector, more than one in ten customers of the People's Bank have been affected by the tsunami, with estimated losses at over 3 billion rupees (approximately USD $250 million).", "phi:2.7b": " The tsunami that hit Sri Lanka's banks caused a financial setback due to lost property and loans written off or damaged. Private banks have an estimated 25 billion rupees (over $250 million) of outstanding loans in the disaster zone, with many giving clients more time to repay existing debt while also extending cheap loans for rebuilding. State-owned lenders may be even worse off.\n", "orca-mini:3b": " Following the tsunami disaster in December, Sri Lanka's banks face hard times as waves washed away huge amounts of property securing loans. The estimate suggests that around 13.6% of private bank loans made to clients in the affected area have been written off or damaged. State-owned lenders may be even worse hit. The banking sector is expected to experience a revenue shortfall during 2005 due to the combination of dealing with the death of their customers, along with damaged or destroyed collateral. Additionally, many banks are giving moratoriums and not collecting interest in some areas. The People's Bank has estimated that their loss at 3 billion rupees.", "hermes3:3b": "Sri Lanka's banks face 13.6% loan writeoff due to tsunami damage, affecting private banking sector ($250m) and state-owned lenders like People's Bank.", "stablelm-zephyr:3b": "Sri Lanka's banks face challenges due to the December tsunami disaster, which caused significant damage and lost collateral. Private banks in the disaster zone have seen up to 13.6% of their loans written off or damaged, with an estimated 25 billion rupees ($250 million; £135 million) outstanding. State-owned lenders may suffer even more, leading to revenue shortfalls for banks during 2005. Many are extending cheap loans for rebuilding and recovery but have given moratoriums on interest collection for this quarter.", "chatgpt-4o-latest": "Sri Lanka's banks are facing financial difficulties after the December tsunami, which killed over 30,000 people and destroyed property securing loans. The Sri Lanka Banks Association estimates that 13.6% of private bank loans in the disaster zone have been written off or damaged, with state-owned banks potentially worse affected. Private banks have 25bn rupees in outstanding loans in the affected areas and are dealing with customer deaths and lost collateral while also offering low-interest loans and repayment extensions for recovery. This is expected to cause a revenue shortfall in 2005. State-owned People's Bank reported that over 10% of its southern customers were affected, estimating losses at 3bn rupees.", "stablelm2:1.6b": "Sri Lanka's banks face difficulties due to a tsunami that struck the country in December, with waves killing over 200 people and causing significant property damage. The Sri Lanka Banks Association estimates that around 6% of loans made by private banks in the disaster zone have been written off or damaged. Approximately $5 billion (Rupees 130 billion) of loans are outstanding in the affected area, with most banks extending cheap loans for rebuilding and recovery while giving clients more time to repay existing borrowing. However, as a result of the loss of customers and destroyed collateral, combined with the revenue shortfall during Q4, state-owned lenders may be even worse hit.", "granite3.1-dense:2b": "Sri Lanka's banks anticipate significant financial strain due to the December tsunami disaster. The Sri Lanka Banks Association projects that up to 13.6% of private bank loans in the affected region have been lost or damaged, totaling approximately $250 million. State-owned banks are also expected to suffer substantial losses. To assist clients in rebuilding and recovery, banks have offered interest-free moratoriums and extended repayment deadlines, leading to projected revenue shortfalls for 2005. The People's Bank, a state-owned institution, estimates its loss at $30 million, affecting more than one in ten of its customers in the disaster-stricken south.", "reference": "According to its estimate, as much as 13.6% of the loans made by private banks to clients in the disaster zone has been written off or damaged.In the public sector, more than one in ten of the state-owned People's Bank's customers in the south of Sri Lanka were affected, a bank spokesman told Reuters.The association estimates that the private banking sector has 25bn rupees ($250m; £135m) of loans outstanding in the disaster zone.Sri Lanka's banks face hard times following December's tsunami disaster, officials have warned.\"Most banks have given moratoriums and will not be collecting interest, at least in this quarter,\" he said."}