{"raw_text": "Yukos drops banks from court bid\n \n Russian oil company Yukos has dropped the threat of legal action against five banks it had accused of involvement in the sale of its key Yugansk unit.\n \n State-owned Rosneft bought the unit for $9.3bn (£5bn) after Yukos was forced to sell assets to meet a $27.5bn tax bill. Yukos says the sale was illegal and is pursuing damages in a US court. Its lawyers now accept ABN Amro, BNP Paribas, Calyon, JP Morgan Chase Bank, and Dresdner Kleinwort Wasserstein were not involved in the sale financing. However, Yukos still has an outstanding complaint against Deutsche Bank, which it alleges to be the leader of a consortium that was behind a bid for Yugansk by state gas monopoly Gazprom. The company has also accused Gazprom, the Russian Federation and two other Russian firms.\n \n Gazprom had been expected to win the December auction, but ended up not bidding. Yugansk was sold to a little-known shell company, which in turn was bought by Rosneft. Yukos claims its downfall was punishment for the political ambitions of its founder Mikhail Khodorkovsky. The firm, whose finance chief is now based in the US, filed for bankruptcy in Houston, Texas, and sought a court injunction against the sale. But Deutsche Bank has suggested Yukos artificially manufactured a legal case to stop the sale of its main asset. A hearing scheduled for February 16 and 17 will rule on whether the US court has jurisdiction in the case.\n", "llama3.2:1b": "Yukos drops banks from court bid over alleged involvement in Yugansk sale, accepts new banks that were not involved in the sale financing, but still pursues damages against Deutsche Bank.", "llama3.2:3b": "Yukos drops lawsuits against five banks, retains complaint against Deutsche Bank over sale of Yugansk unit to Rosneft. Yukos claims unfair treatment by Gazprom and Russian Federation in sale process, which it believes is punishment for founder Mikhail Khodorkovsky's political ambitions.", "gemma2:2b": "Yukos has dropped its lawsuit against five banks it accused of involvement in the sale of its Yugansk unit, but still pursues damages against Deutsche Bank over alleged illegal actions by Gazprom and others. Yukos claims its asset sale was part of a political strategy and that Rosneft's purchase was illegitimate. A court hearing is scheduled to decide if the US court has jurisdiction over this case. \n", "qwen2.5:0.5b": "Yukos dropped an appeal against five banks it accused of involving in the sale of a Russian oil company's key unit, but still claims Gazprom was behind a bid for its main asset. Russia's biggest oil company Yukos filed bankruptcy to stop selling its assets to Russian firms and gas giant Gazprom.\nTranslation: \nYukos had dropped an appeal against five banks accused of involvement in the sale of a Russian oil company's key unit, but still claims Gazprom was behind a bid for its main asset. Russia's biggest oil company Yukos filed bankruptcy to stop selling its assets to Russian firms and gas giant Gazprom.", "qwen2.5:1.5b": "Russian oil company Yukos withdraws threat over legal action against five banks involved in Yugansk unit's sale, citing ABN Amro, BNP Paribas, Calyon, JP Morgan Chase Bank, Dresdner Kleinwort Wasserstein as not being part of financing consortium. Yukos also accuses Gazprom and Russian firms of involvement but denies it sought to sabotage the sale.", "qwen2.5:3b": "Yukos has dropped legal action against five banks over the sale of its Yugansk unit to Rosneft, after admitting they were not involved in financing the deal. However, Yukos still accuses Deutsche Bank of leading a consortium that attempted to buy Yugansk for Gazprom. The sale was made by an obscure shell company and is seen as punishment for Yukos' founder Mikhail Khodorkovsky's political ambitions. The case against Deutsche Bank will be heard by US courts on February 16-17.", "opencoder:1.5b": "Yukos dropped banks from court bid is a clear case of political manipulation or insider trading, both of which are illegal actions in the United States. The company had allegedly sold its key Yugansk unit to the Russian Federation after being forcibly sold assets by the U.S. tax authorities. It is also suspected that it was engaged in another illicit activity, such as illegal gambling or drug trading, which has not been disclosed but remains a significant issue in the financial world. The transaction involved the sale of assets, and the company's actions violate local laws regarding asset ownership and sales.\n", "smollm:1.7b": "Yukos, Russian oil company, dropped the threat of legal action against five banks it had accused of involvement in the sale of its key Yugansk unit after Yukos was forced to sell assets to meet a $27.5bn tax bill. The company's lawyers now accept ABN Amro, BNP Paribas, Calyon, JP Morgan Chase Bank, and Dresdner Kleinwort Wasserstein were not involved in the sale financing. However, Yukos still has an outstanding complaint against Deutsche Bank, which it alleges to be the leader of a consortium that was behind a bid for Yugansk by state gas monopoly Gazprom. The company has also accused Gazprom, the Russian Federation and two other Russian firms.\n\nGazprom had been expected to win the December auction, but ended up not bidding. Yugansk was sold to a little-known shell company, which in turn was bought by Rosneft. Yukos claims its downfall was punishment for the political ambitions of its founder Mikhail Khodorkovsky. The firm, whose finance chief is now based in the US, filed for bankruptcy in Houston, Texas, and sought a court injunction against the sale. But Deutsche Bank has suggested Yukos artificially manufactured a legal case to stop the sale of its main asset. A hearing scheduled for February 16 and 17 will rule on whether the US court has jurisdiction in the case.", "deepseek-r1:1.5b": "<think>\nOkay, so I'm trying to summarize this text concisely while preserving key ideas and details. Let me read through it carefully.\n\nThe main event is that Yukos dropped their banks from court bid because they were accused of involvement in selling Yugansk unit. They were bought by Rosneft for $9.3 billion, which the Russian state company paid to avoid a $27.5 billion tax bill. This legal action involved several big banks like ABN Amro, BNP Paribas, Calyon, JP Morgan Chase, and Dresdner Kleinwort Wasserstein.\n\nHowever, the lawsuit has some interesting twists. There are references to Deutsche Bank as one of the consortiums behind a Gazprom bid for Yugansk. Gazprom was supposed to win but didn't bid, so they bought from Rosneft. Yukos's finances were moved to the US, and they're seeking bankruptcy and court injunction against the sale.\n\nThere's also mentions of Mikhail Khodorkovsky's motivations, including political ambitions, which might be why they faced legal action. Also, there are some nuances about who was involved in the purchase, like Razan Yagunov from Rosneft being part of a bid committee.\n\nThe US court is considering whether it can handle this case against Yukos. I need to make sure all these points are included in the summary without adding any extra information.\n</think>\n\nYukos dropped its assets from court bids due to allegations of involvement in the Yugansk unit's sale, which was bought by Rosneft for $9.3 billion. This purchase avoided a $27.5 billion tax bill but involved several big banks like ABN Amro, BNP Paribas, Calyon, JP Morgan Chase, and Dresdner Kleinwort Wasserstein. However, the lawsuit also references Deutsche Bank as part of a consortium that might have bid for Yugansk, despite Gazprom not bidding. Yukos has filed for bankruptcy in the US seeking court injunction against the sale. The case could be ruled out by the US court, with details on this scheduled for February 16 and 17.", "tinyllama:1.1b": "Russian oil company YuKos has dropped its threat of legal action against five banks it accused of involvement in the sale of its key YuGansk unit. State-owned Rosneft, which had been expected to win the auction but ended up not bidding, is now pursuing damage claims against Deutsche Bank, Gazprom, a little-known shell company, and two Russian firmings. The case was dropped by YuKos after they souughte an injunction from a US court against the sale, which they said artificially manufactured a legal case to stop it. The bank's lawyers now accept that banks involved in the bid for YuGansk were not involved in the financial transactions behind Gazprom's unsuccessful bid. While Rosneft will continue with its claims against Gazprom and other Russian firms, a hearing is planned on February 16-17 to decide if US jurisdiction applies in the case.", "tinydolphin:1.1b": " Yukos, a Russian oil company, dropped its threat to pursue legal action against five banks it accused of being involved in the sale of its Yugansk unit. This move comes after Rosneft, the Russian state-owned oil company that acquired the assets for $9.3 billion, confirmed the banks were not involved in the deal financing. \n\nHowever, Yukos still has an outstanding complaint against Deutsche Bank, a leading international bank, which it alleges was the leader of a consortium behind a bid to purchase Yugansk by Gazprom, Russia's national gas monopoly. The company is also accused of running into trouble because Gazprom did not participate in the auction. \n\nGazprom's downfall has been a major setback for Khodorkovsky, who was previously involved with the project and was eventually arrested on charges of tax evasion. Yukos claims that his company, Sakhalin Energy, was punished for his political ambitions. The firm had sought court injunctions against the sale of its assets but dropped these plans following the news from Rosneft. \n\nA hearing scheduled for February 16 and 17 will determine whether the US court has jurisdiction in this case, wherein Yukos attempts to stop Gazprom from bidding on its assets.", "phi:2.7b": " Yukos drops legal action against five banks accused of involvement in Yugansk unit's sale, now pursuing damages in US court. Rosneft bought the unit for $9.3bn after Yukos was forced to sell assets due to a tax bill of $27.5bn. ABN Amro, BNP Paribas, Calyon, JP Morgan Chase Bank and Dresdner Kleinwort Wasserstein were not involved in the sale financing. However, the company still has an outstanding complaint against Deutsche Bank for leading a consortium that was behind a bid for Yugansk by Gazprom. Yukos claims its downfall was punishment for Mikhail Khodorkovsky's political ambitions and filed for bankruptcy in Houston after seeking to stop the sale of its main asset.\n", "orca-mini:3b": " Yukos dropped the banks from its legal bid to sell its key Yugansk unit after Rosneft bought it for $9.3bn. The sale was deemed illegal by Yukos, which is pursuing damages in a US court. The company accused several entities including Gazprom, the Russian Federation, and two other Russian firms of being behind the bid for Yugansk by state gas monopoly Gazprom. However, neither Gazprom nor any other entity bid for Yugansk at the December auction.", "hermes3:3b": "Yukos drops legal threats against 5 banks over Yugansk unit sale.", "stablelm-zephyr:3b": "Yukos, a Russian oil company, dropped legal action against five banks accused of helping sell its key Yugansk unit to Rosneft for $9.3bn. Yukos claimed the sale was illegal due to a tax bill and is pursuing damages in a US court. The five dropped banks ABN Amro, BNP Paribas, Calyon, JP Morgan Chase Bank, and Dresdner Kleinwort Wasserstein were not involved in the financing of the Yugansk unit's sale. Yukos still accuses Deutsche Bank of leading a consortium behind Gazprom's bid for Yugansk and claims its downfall was punishment for founder Mikhail Khodorkovsky's political ambitions. A hearing on February 16-17 will determine if the US court has jurisdiction in the case.", "chatgpt-4o-latest": "Yukos has dropped legal action against five banks it previously accused of involvement in the sale of its key Yugansk unit. The unit was sold to state-owned Rosneft for $9.3 billion after Yukos was forced to sell assets to cover a $27.5 billion tax bill. While Yukos still claims the sale was illegal and is seeking damages in a US court, its lawyers now acknowledge that ABN Amro, BNP Paribas, Calyon, JP Morgan Chase Bank, and Dresdner Kleinwort Wasserstein were not involved in financing the sale. However, Yukos maintains a complaint against Deutsche Bank, alleging it led a consortium backing a bid by state gas monopoly Gazprom. Gazprom was expected to win the auction but did not bid, and Yugansk was sold to a shell company later acquired by Rosneft. Yukos argues its downfall was politically motivated due to its founder Mikhail Khodorkovsky’s ambitions. The company filed for bankruptcy in the US and sought to block the sale, but Deutsche Bank claims Yukos fabricated a legal case. A US court hearing on February 16-17 will determine jurisdiction.", "stablelm2:1.6b": "Yukos drops banks from court bid, accepting they were not involved in the sale financing of their key unit. After selling Yugansk to Rosneft for $9.3bn (£5bn), Yukos claims the sale was illegal and pursuing damages in a US court. They still have an outstanding complaint against Deutsche Bank, but it's unclear if that will affect jurisdiction.", "granite3.1-dense:2b": "Russian oil company Yukos, led by Mikhail Khodorkovsky, has dropped legal action against five banks—ABN Amro, BNP Paribas, Calyon, JP Morgan Chase Bank, and Dresdner Kleinwort Wasserstein—accusing them of involvement in the sale of its key Yugansk unit to Rosneft for $9.3bn (£5bn). The company is still pursuing damages from Deutsche Bank, alleging it led a consortium that tried to acquire Yugansk. Yukos claims this was politically motivated, possibly punishment for Khodorkovsky's ambitions. Despite these actions, the company filed for bankruptcy in Texas and sought an injunction against the sale. A hearing on February 16 and 17 will determine if a US court has jurisdiction in the case.", "reference": "Russian oil company Yukos has dropped the threat of legal action against five banks it had accused of involvement in the sale of its key Yugansk unit.Yukos says the sale was illegal and is pursuing damages in a US court.However, Yukos still has an outstanding complaint against Deutsche Bank, which it alleges to be the leader of a consortium that was behind a bid for Yugansk by state gas monopoly Gazprom.But Deutsche Bank has suggested Yukos artificially manufactured a legal case to stop the sale of its main asset.Yugansk was sold to a little-known shell company, which in turn was bought by Rosneft."}