{"raw_text": "Lloyd's of London head chides FSA\n \n The head of Lloyd's of London, the insurance market, has criticised Britain's financial watchdog, the Financial Services Authority (FSA).\n \n In a speech on Monday, Mr Prettejohn urged the FSA to force brokers to disclose the size of their commissions. \"The FSA should change, and change now\" said Mr Prettejohn, who wants it to move from \"disclosure on request\" to mandatory disclosure. The call came in a speech on improving the London insurance market.\n \n \"The FSA should not bide their time and 'wait and see'. They should seize the moment,\" Mr Prettejohn, Lloyd's chief executive said. The FSA took over regulation of the general insurance sector in January, but it sidestepped calls to require brokers to disclose the commissions they earn from insurers to their clients. Last week, the City watchdog gave brokers and insurers guidance on managing conflicts of interest. Brokers must give information on their commissions if, and only if, their customers request it, the FSA said.\n \n In the US, lack of transparency about brokers' commissions has led to problems. The world's biggest insurance broker Marsh & McLennan said last week it would pay $850m to settle charges, raised by New York Attorney General Eliot Spitzer in October, that it sought to rig bids in conjunction with insurers. The probe centred around so-called contingent commissions, whereby brokers were rewarded according to how much business they brought to an insurer, an arrangement that did not always benefit brokers' customers. All of the insurance business written in the Lloyd's market is placed via brokers.\n", "llama3.2:1b": "Lloyd's of London head chides FSA for its lack of action on broker commissions. The head, Prettejohn, urges the Financial Services Authority (FSA) to force brokers to disclose their commission sizes and wants the agency to change its approach from \"disclosure on request\" to mandatory disclosure. The FSA is currently taking over regulation of the general insurance sector in January but has yet to require broker disclosure. This follows a US scandal where Marsh & McLennan paid $850m to settle charges related to bidder manipulation.", "llama3.2:3b": "The head of Lloyd's of London criticized the Financial Services Authority for not requiring brokers to disclose commission sizes to clients. He called on the FSA to change its policy and make disclosure mandatory, citing the US example where lack of transparency led to problems with contingent commissions.", "gemma2:2b": "Lloyd's CEO urges the FSA to make broker commission disclosure mandatory. He claims the current \"disclosure on request\" model is inadequate and cites the US case of Marsh & McLennan for proof.  He encourages the FSA to implement a more immediate change, arguing that waiting would be harmful. \n", "qwen2.5:0.5b": "Lloyd's chief executive Lloyd Prettejohn criticised the Financial Services Authority (FSA) for ignoring requirements to disclose the size of commissions from brokers to clients and encouraged FSA to change this practice now. The FSA took over regulation of insurance sector in January but had previously sidestepped calls to require brokers to disclose their commissions, allowing brokers to keep their commissions undisclosed until customers requested them. The World Financial Forum (WWF) reported that the London insurance market is under scrutiny due to lack of transparency about broker commissions and a number of large insurance companies have filed for compensation in response to regulatory inquiries.", "qwen2.5:1.5b": "The head of Lloyd's of London criticizes Britain's Financial Services Authority for not requiring brokers to disclose commissions, calling for mandatory disclosure instead. The FSA should act now and stop sidestepping responsibilities, as it has done with brokers. In contrast, the US experience highlights issues arising from lack of transparency about brokers' commissions, leading to potential conflicts of interest and settlements.", "qwen2.5:3b": "Lloyd's of London head criticizes FSA for insufficient regulation of brokers' commissions. Prettejohn urges mandatory rather than voluntary disclosure of broker commissions to clients, contrasting this with the UK watchdog’s current practice of requiring only request-based disclosures. The lack of transparency in US insurance markets has led to legal issues, highlighting the importance of such regulations. Lloyd's market relies heavily on brokers for business placement, emphasizing the need for robust commission-disclosure policies.", "opencoder:1.5b": "Lloyd's of London head chides FSA\n\nThe head of Lloyd's of London, the insurance market, has criticized Britain's financial watchdog, the Financial Services Authority (FSA).\n\nIn a speech on Monday, Mr Prettejohn urged the FSA to force brokers to disclose the size of their commissions. \"The FSA should change, and change now\" said Mr Prettejohn, who wants it to move from \"disclosure on request\" to mandatory disclosure.\n\nMr Prettejohn expressed his excitement about changing the law, which is central to insurance market regulations. The calls came in a speech on improving the London insurance market. Lloyd's chief executive, who was speaking at the time, urged Mr Prettejohn to \"The FSA should not bide their time and 'wait and see'. They should seize the moment.\"\n", "smollm:1.7b": "The head of Lloyd's of London has criticized Britain's financial watchdog, the Financial Services Authority (FSA), for its lack of transparency about broker commissions. The head of Lloyd's, Mr Prettejohn, urged the FSA to force brokers to disclose the size of their commissions. In a speech on Monday, Mr Prettejohn urged the FSA to move from \"disclosure on request\" to mandatory disclosure. The call came in a speech on improving the London insurance market.\nThe head of Lloyd's of London has criticized Britain's financial watchdog, the Financial Services Authority (FSA), for its lack of transparency about broker commissions. In a speech on Monday, Mr Prettejohn urged the FSA to force brokers to disclose the size of their commissions. The head of Lloyd's, Mr Prettejohn, said the FSA should change and move from \"disclosure on request\" to mandatory disclosure. The call came in a speech on improving the London insurance market.\nThe lack of transparency about broker commissions has led to problems in the US, where the world's biggest insurance broker Marsh & McLennan was accused last week it sought to rig bids in conjunction with insurers. All of the insurance business written in the Lloyd's market is placed via brokers.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text concisely. Let me read through it carefully.\n\nThe main points are about a head of Lloyds of London (Lloyd's) challenging the Financial Services Authority (FSA). \n\nFirst sentence: The head of Lloyd's head chides FSA. So that's the initial summary point.\n\nNext, he called out the FSA in a speech on Monday. He urged them to force brokers to disclose their commissions. That's good.\n\nMr. Prettejohn wants it changed from \"request\" to \"mandatory.\" \n\nAnother part: The FSA was already regulating general insurance in January. However, they didn't require brokers to disclose commissions to customers. Last week, the FSA provided guidelines on when and how brokers should give information. If a broker's customer requests it, then the FSA mandates disclosure.\n\nIn the US, lack of transparency led to problems with the biggest insurance broker (Marsh & McLennan). They had to pay money to settle charges from insurers involved in rigging bids. This was about contingent commissions where pay is based on business brought to an insurer, not always beneficial for customers.\n\nI think I can structure this into a concise summary without explanations or formatting.\n</think>\n\nThe head of Lloyds of London (Lloyd's) criticized the Financial Services Authority (FSA), calling it a financial market regulator. In a speech on Monday, he urged the FSA to make brokers disclose their commissions if customers request it. However, the FSA did not require this disclosure currently but had guidelines for mandatory disclosure when necessary. Last week, Marsh & McLennan had to pay $850m due to compliance with this new rule.", "tinyllama:1.1b": "Leading Lloyd's of London head of Financial Services Authority (FSA), Lloyd's CEO, urges the UK financial watchdog to change and mandatory commission disclosure policy in the insurance market to improve its London insurance market. In his speech at the Financial Times Leaders conference on Monday, Lloyd's CEO criticized the FSA for not enforcing a mandatory requirement to disclose commission sizes to customers. He also highlighted the need for conflict of interest management in the insurance sector, which has led to problems in the US market. The London insurance market is dominated by Lloyd's, and its insurers broker transactions with other companies, making it a hub for risky financial deals.", "tinydolphin:1.1b": " In a city known for its financial hubs and global networks, a major shift has taken place recently—the Financial Services Authority (FSA) has been replaced by the Lloyd's of London head, Mr. Prettejohn. As the new boss, Mr. Prettejohn has called for the FSA to change its approach and mandatory disclosure of brokers' commissions in the London insurance market. In a recent speech, he emphasized that the current system of disclosure on request is inadequate and called for mandatory disclosure. This move would go a long way in improving the London insurance market, ensuring transparency and fairness between clients and brokers. The authority must take swift action to address the issues raised by the lack of information provided about commissions paid by brokers. In the US, Marsh & McLennan is under scrutiny for its involvement in the contingent commission scheme, with a $850m settlement being announced recently. This has raised concerns regarding the potential conflicts between brokers and their customers. As Mr. Prettejohn's comments illustrate, transparency in the financial markets is essential to maintain trust among investors and ensure fair competition in the industry.", "phi:2.7b": " Lloyd's of London head criticizes Britain's FSA for not requiring brokers to disclose the size of their commissions, urging it to make mandatory disclosure a priority and move away from \"disclosure on request\". The City watchdog, however, has sidestepped calls for such transparency in the past, leading to issues like broker compensation schemes being used to rig bids. The problem is particularly severe in the US, where lack of transparency about brokers' commissions led to Marsh & McLennan's $850m settlement with New York Attorney General Eliot Spitzer.\n", "orca-mini:3b": " Lloyd's of London head criticizes FSA for not requiring broker commissions to be disclosed to clients.", "hermes3:3b": "Lloyd's head criticizes FSA, calls for mandatory broker disclosure on commissions instead of current 'disclosure on request'.", "stablelm-zephyr:3b": "Lloyd's of London's head criticizes UK financial watchdog, the Financial Services Authority (FSA), urging mandatory disclosure of brokers' commissions to prevent issues like those faced in the US involving Marsh & McLennan. Mr Prettejohn, Lloyd's chief executive, suggests that the FSA should seize the moment and transition from \"disclosure on request\" to mandatory disclosure, stating that all insurance business in the London market is placed via brokers.", "chatgpt-4o-latest": "Lloyd's of London chief executive, Mr. Prettejohn, criticized the UK's Financial Services Authority (FSA) for not mandating brokers to disclose their commissions. In a speech on improving the London insurance market, he urged the FSA to move from \"disclosure on request\" to mandatory disclosure, warning against delays. The FSA, which took over general insurance regulation in January, currently requires brokers to disclose commissions only if clients request it. In the US, lack of transparency has led to legal issues, with Marsh & McLennan agreeing to an $850m settlement over bid-rigging allegations. All insurance business at Lloyd's is conducted through brokers.", "stablelm2:1.6b": "Lloyd's of London head criticizes FSA for not requiring broker commission disclosure, urging a change from \"disclosure on request\" to mandatory disclosure since taking over regulation of the general insurance sector. The UK financial watchdog sidestepped calls to make this change previously. In contrast, US issues surrounding lack of transparency about brokers' commissions have led to problems. Marsh & McLennan paid $10 million to settle attorney general charges related to contingent commission arrangements that didn\n```python\n{\n  \"text\": \"Lloyd's of London head chides FSA\\nThe head of Lloyd's of London, the insurance market, has criticized Britain's financial watchdog, the Financial Services Authority (FSA).\\nIn a speech on Monday, Mr Prettejohn urged the FSA to force brokers to disclose the size of their commissions.\\n'The FSA should change and change now' said Mr Prettejohn, who wants it to move from \\\"disclosure on request\\\" to mandatory disclosure.\\nThe call came in a speech on improving the London insurance market.\\n\\\"The FSA should not bide their time and 'wait and see'. They should seize the moment,' said Mr Prettejohn, Lloyd's chief executive.\\nThe FSA took over regulation of the general insurance sector in January, but it sidestepped calls to require brokers to disclose the commissions they earn from insurers to their clients. Last week, the City watchdog gave brokers and insurers guidance on managing conflicts of interest.\\nIn the US, lack of transparency about brokers' commissions has led to problems. The world's biggest insurance broker Marsh & McLennan said last week it would pay $10 million to settle charges raised by New York Attorney General Eliot Spitzer in October that it sought to rig bids in conjunction with insurers. The probe centered around so-called contingent commissions, whereby brokers were rewarded according to how much business they brought to an insurer, an arrangement that did not always benefit brokers' customers. All of the insurance business written in the Lloyd's market is placed via brokers.\\n\"\n}\n```", "granite3.1-dense:2b": "Lloyd's of London chief, Mr Prettejohn, criticized Britain's financial watchdog, the FSA, during a speech on Monday. He urged the FSA to mandate that brokers disclose their commission sizes, moving from voluntary disclosure on request. Prettejohn emphasized the need for immediate action, stating, \"The FSA should not wait and see; they should seize the moment.\" This call comes as the FSA oversees general insurance regulation in January, having previously resisted requiring brokers to reveal their commissions to clients. Last week, the FSA issued guidance on managing conflicts of interest but maintained that brokers only need disclose commission details upon customer request.\n\nThe issue is not unique to the UK; in the US, a lack of transparency regarding brokers' commissions has caused problems. In 2004, insurance giant Marsh & McLennan agreed to pay $850 million to settle charges brought by New York Attorney General Eliot Spitzer for allegedly rigging bids with insurers through contingent commissions—a practice that often harmed customers. Notably, all insurance business in the Lloyd's market is brokered, and Prettejohn highlighted the potential negative impacts of untransparency in this context.", "reference": "The FSA took over regulation of the general insurance sector in January, but it sidestepped calls to require brokers to disclose the commissions they earn from insurers to their clients.In a speech on Monday, Mr Prettejohn urged the FSA to force brokers to disclose the size of their commissions.Brokers must give information on their commissions if, and only if, their customers request it, the FSA said.The head of Lloyd's of London, the insurance market, has criticised Britain's financial watchdog, the Financial Services Authority (FSA).All of the insurance business written in the Lloyd's market is placed via brokers.\"The FSA should change, and change now\" said Mr Prettejohn, who wants it to move from \"disclosure on request\" to mandatory disclosure."}