{"raw_text": "Bat spit drug firm goes to market\n \n A German firm whose main product is derived from the saliva of the vampire bat is looking to raise more than 70m euros ($91m; £49m) on the stock market.\n \n The firm, Paion, said that it hoped to sell 5 million shares - a third of the firm - for 11-14 euros a share. Its main drug, desmoteplase, is based on a protein in the bat's saliva. The protein stops blood from clotting - which helps the bat to drink from its victims, but could also be used to help stroke sufferers. The company's shares go on sale later this week, and are scheduled to start trading on the Frankfurt Stock Exchange on 10 February. If the final price is at the top of the range, the company could be valued at as much as 200m euros. The money raised will be spent largely on developing the company's other drugs, since desmoteplase has already been licensed to one manufacturer, Forest Laboratories.\n", "llama3.2:1b": "A German firm Paion plans to raise over €70 million through a stock market listing and sell shares worth around €11-€14 each. Its main drug desmoteplase is derived from saliva of the vampire bat and may be used to help stroke patients by stopping blood clotting.", "llama3.2:3b": "A German firm Paion plans to raise over 70m euros by selling 5 million shares at 11-14 euros each, with its main drug desmoteplase based on a protein from vampire bat saliva that stops blood clotting and could help stroke sufferers.", "gemma2:2b": "Paion, a German firm, plans to raise over €70 million by selling shares of its company. Their main drug, desmoteplase, is derived from bat saliva and can help with blood clotting disorders in stroke patients. The initial sale price per share ranges between €11-€14. If the sale goes through as planned, Paion's valuation could reach €200 million.  The company will use the funds to develop additional drugs. \n", "qwen2.5:0.5b": "A German firm that makes a drug used by bats is going public and raising more than 70 million euros ($91 million; £49 million). The firm plans to sell its shares on the Frankfurt Stock Exchange in February for up to 11-14 euros per share, which would value the company at as much as 200 million euros.", "qwen2.5:1.5b": "A German drug firm plans to raise €70 million on the stock market by selling 5 million shares at $91 million and £49 million, with its main product derived from vampire bat saliva used for treating stroke patients. The proceeds will support further drug development.", "qwen2.5:3b": "A German firm, Paion, plans to raise over 70m euros by selling 5 million shares at 11-14 euros each. Its main drug, derived from vampire bat saliva protein that prevents blood clotting and treats strokes, is scheduled for trading on the Frankfurt Stock Exchange starting February 10th. The company could be valued up to 200m euros with funds primarily used for developing other drugs; desmoteplase has already been licensed to Forest Laboratories.", "opencoder:1.5b": "Bat spit drug firm aims to raise more than $91m (£49m) on the stock market by selling 5 million shares for approximately 11-14 euros per share. The company's main drug is based on a protein in the bat's saliva that helps blood from clotting the bat and also strokes sufferers. It plans to sell these shares later this week at a future date on the Frankfurt Stock Exchange. The overall goal will result in a 200m euro valuation if the final price reaches its peak. The company has invested heavily into developing other drugs, since desmoteplase is already licensed to one manufacturer.\n", "smollm:1.7b": "The German firm whose main product is derived from the saliva of the vampire bat is looking to raise more than 70 million euros ($91 million; £49 million) on the stock market. The company's main drug, desmoteplase, is based on a protein in the bat's saliva and has been shown to help stroke sufferers by stopping blood clotting. The company hopes to sell 5 million shares - about one third of the firm - for 11-14 euros per share. Its main drug, desmoteplase, is already licensed to one manufacturer, Forest Laboratories, and the money raised will be spent largely on developing its other drugs.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize the given text concisely. Let me read through it carefully.\n\nThe main points are: a German drug firm from vampire bats is seeking funding. They plan to sell around 5 million shares at $11-14 each, aiming for a total of over 70 million euros. Their stock will be listed on the Frankfurt Exchange by February 10. They have already licensed desmoteplase, which could be used in strokes, so they won't raise more funds from there. The value might go up to 200 million euros if the price is top of range.\n\nI need to make sure I include all these key details without any extra information.\n</think>\n\nThe German drug firm, based on vampire bat saliva, aims to sell around 5 million shares at €11-14 each, aiming for over 70m euros. Their stock will be listed on the Frankfurt Exchange by February 10. Desmoteplase, their main drug, has already been licensed and is used in strokes. The company could potentially reach €200m if the shares close at the highest price.", "tinyllama:1.1b": "A German firm is looking to raise around 74m euros ($91m; £49m) on the stock market through the sale of shares. Paion, a company that produces a drug based on a protein found in bat saliva, hopes to sell 5 million shares at a price ranging between 10.68 and 12 euros. The main product is a treatment for blood clotting disorders called desmoteplase. The company's shares will be listed on the Frankfurt Stock Exchange and the proceeds from the sale are expected to be used mainly for developing other drug candidates, with some spending also going towards license fees paid to a previous partner. If the final price is at the top of the range, Paion could be valued at as much as 200 million euros ($256m).", "tinydolphin:1.1b": " Bat spit drug firm Goes to Market - 70m Euro ($91m; £49m) Investment on Stock Exchange - 5 Million Shares on Sale This week - Frankfurt Stock Exchange", "phi:2.7b": " A German firm plans to raise over 70 million euros by selling 3/4 of its shares for 11-14 euros each, with their main drug being derived from vampire bat saliva and used to prevent blood clotting. The company's other drugs are also in development and they hope to start trading on the Frankfurt Stock Exchange later this week.\n", "orca-mini:3b": " A German vampire bat drug firm is seeking to raise more than 70 million euros by selling shares on the stock market. The firm hopes to sell 5 million shares, or a third of the company, for between 11-14 euros each. Its main drug is based on a protein in the bat's saliva and could be used to help stroke sufferers. If the final price is at the top of the range, the company could be valued at up to 200 million euros. The money will be spent largely on developing other drugs.", "hermes3:3b": "German bat-saliva based drug firm Paion raises over 70m€ on stock market, selling shares and planning Frankfurt listing.", "stablelm-zephyr:3b": "Paion, a German pharmaceutical firm specializing in drugs derived from vampire bat saliva, intends to raise over 70 million euros (USD 91m; £49m) through a stock market offering. The company plans to sell 5 million shares, representing a third of its equity, at an asking price of 11-14 euros per share. Its primary drug, desmoteplase, which derives from a protein in bat saliva that prevents blood clotting, has potential applications not only for assisting vampire bat victims but also helping stroke sufferers. The company's shares will begin trading on the Frankfurt Stock Exchange on February 10th, with the final price ranging between the top of the offered range potentially valuing Paion at 200 million euros. The funds raised will be mainly directed toward the development of additional drugs for the company, as desmoteplase has already been licensed to one manufacturer, Forest Laboratories.", "chatgpt-4o-latest": "A German firm, Paion, is seeking to raise over 70 million euros by selling 5 million shares at 11-14 euros each, valuing the company at up to 200 million euros. Its main drug, desmoteplase, derived from vampire bat saliva, prevents blood clotting and could aid stroke patients. Shares will start trading on the Frankfurt Stock Exchange on 10 February. The funds will primarily support the development of other drugs, as desmoteplase is already licensed to Forest Laboratories.", "stablelm2:1.6b": "German firm Paion plans to raise over €50 million ($68 million; £54 million) through a stock market sale of 5 million shares, with its main drug, desmoteplase derived from the saliva of a vampire bat. The protein in bat saliva helps clotting and can be used for stroke sufferers or to treat blood clotting issues. Share issuance is set for later this week on the Frankfurt Stock Exchange with possible valuation up to €50 million if final price falls within stated range. Paion will use majority of funds for R&D on its other drugs, having licensed desmoteplase to Forest Laboratories.", "granite3.1-dense:2b": "Paion, a German firm specializing in medications derived from vampire bat saliva, plans to raise €70 million ($91m; £49m) through an initial public offering (IPO) on the Frankfurt Stock Exchange. They aim to sell 5 million shares between €11 and €14 each. Their primary drug, desmoteplase, a clot-stopping protein from bat saliva, could aid stroke patients. If the final price is at the upper end of the range, Paion's value could reach €200 million. The funds will primarily support further development of their other medications, as desmoteplase has been licensed to Forest Laboratories.", "reference": "A German firm whose main product is derived from the saliva of the vampire bat is looking to raise more than 70m euros ($91m; £49m) on the stock market.Its main drug, desmoteplase, is based on a protein in the bat's saliva.The firm, Paion, said that it hoped to sell 5 million shares - a third of the firm - for 11-14 euros a share."}