{"raw_text": "Card fraudsters 'targeting web'\n \n New safeguards on credit and debit card payments in shops has led fraudsters to focus on internet and phone payments, an anti-fraud agency has said.\n \n Anti-fraud consultancy Retail Decisions says 'card-not-present' fraud, where goods are paid for online or by phone, has risen since the start of 2005. The introduction of 'chip and pin' cards has tightened security for transactions on the High Street. But the clampdown has caused fraudsters to change tack, Retail Decisions said.\n \n The introduction of chip and pin cards aimed to cut down on credit card fraud in stores by asking shoppers to verify their identity with a confidential personal pin number, instead of a signature. Retail Decisions chief executive Carl Clump told the BBC that there was \"no doubt\" that chip and pin would \"reduce card fraud in the card-present environment\". \"However, it is important to monitor what happens in the card-not-present environment as fraudsters will turn their attention to the internet, mail order, telephone order and interactive TV,\" he said. \"We have seen a 22% uplift in card-not-present fraud here in the UK... since the start of the year. \"Fraud doesn't just disappear, it mutates to the next weakest link in the chain,\" he said.\n \n Retail Decisions' survey on the implementation of chip and pin found that shoppers had adapted easily to the new system, but that banks' performance in distributing the new cards had been patchy, at best. \"The main issue is that not everyone has the pins they need,\" said Mr Clump. Nearly two thirds - 65% - of the 1,000 people interviewed said they had used chip and pin to make payments. Of these, 83% were happy with the experience, though nearly a quarter said they struggled to remember their pin number. However, only 34% said they had received replacement cards with the necessary 'chip' technology from all their card providers. Furthermore, 16% said that none of their cards had been replaced, while 30% said only some had. UK shoppers spent £5.3bn on plastic cards in 2003, the last full year for which figures are available from the Association of Payment Clearing Services (Apacs). Altogether, card scams on UK-issued cards totalled £402.4m in 2003. Card-not-present fraud rose an annual 6% to £116.4m, making it the biggest category even then. Within this, internet fraud totalled £43m, Apacs' figures show.\n", "llama3.2:1b": "Card fraudsters have shifted their focus from physical card payments to online and phone payments due to increased security measures on credit and debit cards in shops, according to an anti-fraud agency.\n\nThe introduction of chip and pin cards has reduced credit card fraud, but fraudsters are now targeting the internet, mail order, telephone orders, and interactive TV for card-not-present transactions.\n\nRetail Decisions found a 22% increase in card-not-present fraud since the start of the year with nearly two-thirds of shoppers using chip and pin technology to make payments. However, only 34% received replacement cards from their providers, and some saw no improvement.\n\nThe agency reported a £402.4m total for UK-issued card scams in 2003, which included £116.4m from card-not-present fraud, with internet fraud accounting for £43m of this amount.", "llama3.2:3b": "Card fraudsters are shifting their focus from in-store credit and debit card payments to online and phone payments as new chip and pin technology improves security on the High Street, leading to a 22% increase in \"card-not-present\" fraud in the UK since 2005.", "gemma2:2b": "Card fraudsters are targeting online and phone payments because of stricter security measures on in-store purchases.  This has led to an increase in card-not-present fraud since 2005.  Although chip and pin cards have helped reduce in-store fraud, their implementation has been uneven with many customers struggling to obtain the necessary pins.  \n", "qwen2.5:0.5b": "Card fraudsters are using internet and phone payments, which have led them to change their focus on credit card transactions. Retail Decisions advises that 'chip and pin' cards, introduced in 2005, helped cut down on card fraud in stores by asking shoppers for personal information instead of signatures. However, this security measure is no longer effective in the internet age, as online fraudsters have adapted to change their tactics. Retail Decisions survey found that nearly two-thirds of UK shoppers had used chip and pin to make payments, but banks' performance in distributing new cards was poor. Only 34% received replacement cards from all card providers, which makes it challenging for card-not-present fraud to be eradicated. Internet fraud totalled £43 million in the UK in 2003, with internet payments making up 6% of the total.", "qwen2.5:1.5b": "Anti-fraud agency reports increased card-not-present fraud following introduction of chip and pin technology aimed at reducing in-store credit card fraud by asking shoppers to verify their identity with a PIN instead of a signature. Fraudsters switched tactics, targeting internet, phone, mail order, telephone order, and interactive TV transactions since the measure's implementation.", "qwen2.5:3b": "Card fraudsters targeting web\n\nNew safeguards on credit and debit card payments in shops have led to a rise in 'card-not-present' fraud, such as online or phone payments. Retail Decisions found that since the introduction of chip and pin cards for in-store transactions in 2005, there has been a 22% increase in card-not-present fraud in the UK. The consultancy believes fraudsters are shifting their focus to internet orders, mail order, telephone orders, and interactive TV due to tightened security on in-store payments. While retailers have adapted quickly to chip and pin systems, banks' distribution of new cards has been inconsistent. Around 65% of those surveyed were satisfied with the chip and pin experience, though only a third received all necessary replacement cards. Card scams cost £402.4m annually in the UK, with online fraud accounting for £43m.", "opencoder:1.5b": "Card fraudsters targeting web have introduced new safeguards on credit and debit card payments in shops that are led by anti-fraud agency Retail Decisions. The introduction of chip and pin cards has tightened security for transactions on the High Street, but it's important to monitor what happens in the card-not-present environment as fraudsters will turn their attention to the internet, mail order, telephone order and interactive TV. The introduction of chip and pin cards has led to a 22% uplift in card-not-present fraud here in the UK since the start of the year. However, retailers must monitor what happens when shoppers use the new system. Shoppers had adapted easily to the new system but banks' performance in distributing the new cards had been patchy. The main issue is that not everyone has the pins they need and shoppers spent £5.3bn on plastic cards in 2003, while card scams on UK-issued cards totalled £402.4m in 2003.\n", "smollm:1.7b": "The summary is concise and clear, capturing the main points of the text:\n\n1. The introduction of chip and pin cards aimed to reduce credit card fraud in stores by asking shoppers to verify their identity with a confidential personal pin number, instead of a signature.\n2. Retail Decisions chief executive Carl Clump told the BBC that there was \"no doubt\" that chip and pin would \"reduce card fraud in the card-present environment\".\n3. The survey on the implementation of chip and pin found that shoppers had adapted easily to the new system, but that banks' performance in distributing the new cards had been patchy, at best.\n4. Of the 1,000 people interviewed, nearly two thirds - 65% - said they had used chip and pin to make payments. Of these, 83% were happy with the experience, though nearly a quarter said they struggled to remember their pin number. However, only 34% said they had received replacement cards with the necessary 'chip' technology from all their card providers.\n5. UK shoppers spent £5.3bn on plastic cards in 2003, the last full year for which figures are available from the Association of Payment Clearing Services (Apacs). Altogether, card scams on UK-issued cards totalled £402.4m in 2003. Card-not-present fraud rose an annual 6% to £116.4m, making it the biggest category even then. Within this, internet fraud totalled £43m, Apacs' figures show.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text. Let me read through the provided text carefully.\n\nThe first sentence mentions card fraudsters targeting web. It says new safeguards on credit and debit cards have led them to focus more on internet payments. An anti-fraud agency called Retail Decisions has highlighted how card-not-present fraud is rising since 2005 because they introduced chip and pin cards. These cards reduced card fraud in physical stores but caused fraudsters to shift their focus online.\n\nThe text also talks about the introduction of chip and pin cards, mentioning that retailers asked shoppers to verify their identity with a personal PIN instead of a signature. Retail Decisions CEO Carl Clump mentioned that this was no doubt to reduce card fraud in stores, but fraudsters would then move into areas like internet banking, mail order, etc.\n\nThere's some data provided: the survey found that mostly people adapted well to the chip and pin system, with banks distributing new cards patchily. 16% of users had none, 34% had their card replaced, and 30% only some were replaced. Also, spending on plastic cards was £5.3 billion in 2003, and total fraud was £402 million, with a rise to £116 million in card-not-present fraud.\n\nI need to capture all these points into a concise summary without explanations or formatting. I'll have to make sure key ideas are included: the shift towards internet payments, increased card-not-present fraud, benefits of chip and pin cards, user adaptation, banking issues with replacement, spending figures, and the rise in fraud.\n</think>\n\nThe anti-fraud agency Retail Decisions highlighted that card fraudsters were shifting their focus from physical store transactions to online payments, particularly via chips and pins. Since 2005, this trend has intensified as these cards reduced fraudulent activity in stores but prompted a move into areas like online banking and mail order.\n\nThe introduction of chip and pin cards aimed at verifying identity with a personal PIN instead of a signature was deemed effective for reducing fraud in physical transactions. Retail Decisions noted that while this strategy cut down on card fraud, it caused fraudsters to adapt to new payment methods such as internet banking and telephone orders.\n\nSurvey data showed that nearly two-thirds (65 out of 100) of respondents used chips and pins, with most happy with the experience but struggling to remember their PINs. Only 34% were satisfied with replacement cards, while 16% had none, and 30% had only partial replacements.\n\nSpending on plastic cards by UK shoppers reached £5.3 billion in 2003, with fraud totaling £402 million that year. Card-not-present fraud grew by 6%, reaching £116.4 million as the largest category. Within this, internet fraud stood at £43 million.", "tinyllama:1.1b": "Concise summary: \n\nNew safeguarding measures on credit and debit card payments in stores have led fraudsters to focus on internet and phone payment methods, according to anti-fraud agency Retail Decisions. The clampdown has caused fraudsters to change their tactics, with nearly two thirds of UK shoppers using chip and pin cards for payment. However, not all card providers have been delivering replacement cards with the necessary 'chips' technology, resulting in a quarter struggling to remember their pin numbers. Card-not-present fraud rose an annual 6% to £116.4m, and internet fraud accounted for £43m.", "tinydolphin:1.1b": " The introduction of chip and pin card technology has led to a notable rise in online and phone payments due to security concerns on the High Street. However, some card-not-present fraudsters are turning their attention to the internet, mail order, telephone order, and interactive TV for an increased risk of fraud. Fraud doesn't simply disappear, it mutates to the next weakest link in the chain.", "phi:2.7b": " A summary of the text is as follows:\n\nThe text discusses how credit and debit card fraudsters have shifted their focus from in-store transactions to online and phone payments since the introduction of chip and pin cards. It also reports that card-not-present fraud has increased by 22% in the UK, and urges shoppers to be aware of the risks and security issues involved in using plastic cards over the internet or by phone.\n", "orca-mini:3b": " Card fraudsters have shifted their focus from High Street transactions to internet and phone payments since the start of 2005, an anti-fraud agency has said. Chip and pin cards have tightened security for High Street transactions, but fraudsters have adapted to target card-not-present payments online and by phone. Retail Decisions' survey found that 65% of those polled had used chip and pin to make payments, with 83% happy with the experience. However, only 34% said they had received replacement cards with the necessary 'chip' technology from all their card providers. UK shoppers spent £5.3bn on plastic cards in 2003, with card-not-present fraud totalling £116.4m and internet fraud £43m. Within this, £43m was internet fraud, making it the biggest category even then.", "hermes3:3b": "Card fraudsters targeting 'card-not-present' payments (online & phone) after reducing 'card-present' fraud (in-store).", "stablelm-zephyr:3b": "Fraudsters have shifted their focus from card-present fraud in shops to card-not-present fraud, such as online and phone payments, due to new safeguards on credit and debit card payments. The introduction of 'chip and pin' cards reduced security for transactions on the High Street, causing fraudsters to target alternative methods. Retail Decisions, an anti-fraud consultancy, reported a 22% uplift in card-not-present fraud in the UK since 2005. While shoppers adapted easily to chip and pin, banks faced issues with distributing replacement cards, with some people not receiving the necessary 'chip' technology for their cards. Card scams on UK-issued cards totaled £402.4 million in 2003, with card-not-present fraud being the largest category at that time, accounting for £43 million of internet fraud.", "chatgpt-4o-latest": "New security measures for credit and debit card payments in stores, such as chip and pin technology, have led fraudsters to shift their focus to internet and phone transactions, according to anti-fraud consultancy Retail Decisions. 'Card-not-present' fraud has increased by 22% in the UK since early 2005. While chip and pin has improved security for in-store transactions, fraudsters are now targeting online, mail order, and telephone payments. A survey by Retail Decisions found that most shoppers adapted well to chip and pin, but banks' distribution of new cards was inconsistent, with many customers not receiving updated cards. In 2003, UK shoppers spent £5.3bn on plastic cards, with total fraud reaching £402.4m, including £116.4m in card-not-present fraud, of which £43m was internet fraud.", "stablelm2:1.6b": "Anti-fraud agency reports that with the introduction of chip and pin cards, fraudsters have shifted their focus to internet, mail order, telephone order, and interactive TV payments, causing an increase in card-not-present fraud (i.e., online or phone payments). Retail Decisions has found that shoppers adapted easily to the new system but noted banks' issues in distributing chip and pin cards. Card scams on UK-issued cards totaled £4.4 million in 2015.", "granite3.1-dense:2b": "Fraudsters have shifted their focus from in-store card transactions to online and phone payments since the introduction of chip and pin cards, which strengthened security for in-person purchases. Retail Decisions, an anti-fraud consultancy, reports a 22% increase in card-not-present fraud (internet, mail order, telephone orders, interactive TV) in the UK since early 2005. Despite shoppers' easy adaptation to chip and pin (83% satisfied), banks have had inconsistent performance in distributing new cards with the required 'chip' technology. Only a third of those surveyed received replacement cards with the necessary features, and nearly one-third reported no card replacements at all. Card fraud in the UK totaled £402.4m in 2003, with £116.4m attributed to card-not-present transactions, primarily internet fraud of £43m.", "reference": "The introduction of chip and pin cards aimed to cut down on credit card fraud in stores by asking shoppers to verify their identity with a confidential personal pin number, instead of a signature.However, only 34% said they had received replacement cards with the necessary 'chip' technology from all their card providers.Furthermore, 16% said that none of their cards had been replaced, while 30% said only some had.New safeguards on credit and debit card payments in shops has led fraudsters to focus on internet and phone payments, an anti-fraud agency has said.Retail Decisions chief executive Carl Clump told the BBC that there was \"no doubt\" that chip and pin would \"reduce card fraud in the card-present environment\".The introduction of 'chip and pin' cards has tightened security for transactions on the High Street.\"The main issue is that not everyone has the pins they need,\" said Mr Clump.But the clampdown has caused fraudsters to change tack, Retail Decisions said."}