{"raw_text": "News Corp eyes video games market\n \n News Corp, the media company controlled by Australian billionaire Rupert Murdoch, is eyeing a move into the video games market.\n \n According to the Financial Times, chief operating officer Peter Chernin said that News Corp is \"kicking the tyres of pretty much all video games companies\". Santa Monica-based Activison is said to be one firm on its takeover list. Video games are \"big business\", the paper quoted Mr Chernin as saying. We \"would like to get into it\".\n \n The success of products such as Sony's Playstation, Microsoft's X-Box and Nintendo's Game Cube have boosted demand for video games. The days of arcade classics such as Space Invaders, Pac-Man and Donkey Kong are long gone. Today, games often have budgets big enough for feature films and look to give gamers as real an experience as possible. And with their price tags reflecting the heavy investment by development companies, video games are proving almost as profitable as they are fun.\n \n Mr Chernin, however, told the FT that News Corp was finding it difficult to identify a suitable target. \"We are struggling with the gap between companies like Electronic Arts (EA), which comes with a high price tag, and the next tier of companies,\" he explained during a conference in Phoenix, Arizona. \"These may be too focused on one or two product lines.\" Activision has a stock market capitalisation of about $2.95bn (£1.57bn), compared to EA's $17.8bn. Some of the games industry's main players have recently been looking to consolidate their position by making acquisitions. France's Ubisoft, one of Europe's biggest video game publishers, has been trying to remain independent since Electronic Arts announced plans to buy 19.9% of the firm. Analysts have said that industry mergers are likely in the future.\n", "llama3.2:1b": "News Corp is eyeing a move into the video games market, with CEO Peter Chernin stating that they \"kicked the tyres\" of various companies and want to enter the market. The company's success has boosted demand for video games, which have become big business. However, News Corp is struggling to identify a suitable target due to differences in price tags between established players like EA and Activision, which are too focused on one product line.", "llama3.2:3b": "News Corp is considering a move into the video games market under Peter Chernin's leadership. The company is evaluating several companies, including Activision, which has a stock market capitalization of around $2.95 billion. However, finding a suitable target is challenging due to the gap between large-cap companies like Electronic Arts and smaller firms. Industry mergers are likely in the future as companies look to consolidate their position.", "gemma2:2b": "News Corp is considering entering the video games market, exploring companies like Activision as potential targets.  Video games have become a major industry with high budgets and strong profitability, though News Corp is finding it challenging to identify a suitable acquisition target due to the various size and focus differences between current companies. \n", "qwen2.5:0.5b": "News Corp is eyeing a potential market for video games, with Activision reportedly on the list. The success of video games like PlayStation and X-Box has boosted demand, making these companies profitable and fun to play. However, News Corp faces difficulty finding suitable targets due to high prices and competition from other game companies.", "qwen2.5:1.5b": "News Corp is considering acquiring a video games company due to their success and increasing market demand. While they struggle with finding suitable targets, EA's high price tag presents an opportunity. Video games have become more profitable than ever before as companies invest heavily in creating immersive experiences.", "qwen2.5:3b": "News Corp, controlled by Rupert Murdoch, is exploring the video games market. Peter Chernin, CEO, indicated interest in acquiring video game companies, with Activision mentioned as a potential acquisition target. The video games industry has grown due to high-demand products like Sony's PlayStation, Microsoft's Xbox, and Nintendo's GameCube. Video games now have budgets comparable to feature films and are increasingly profitable. However, Chernin struggles to find suitable targets between high-priced firms like Electronic Arts and smaller companies focusing on limited product lines. Industry consolidation through mergers is expected in the future.", "opencoder:1.5b": "The news company is looking into video games market. According to the financial times chief operating officer Peter Chernin noted that News Corp has been finding it difficult to identify a suitable target for its business. The success of products like Playstation, X-Box and Game Cube have made gamers more likely than ever. Also, games with budgets big enough for feature films and give gamers as real an experience as possible. With their price tags reflecting the heavy investment by development companies, video games are proving almost as profitable as they are fun.\n", "smollm:1.7b": "News Corp is eyeing a move into the video games market. According to the Financial Times, chief operating officer Peter Chernin said that News Corp is \"kicking the tyres of pretty much all video games companies\". Santa Monica-based Activision is one firm on its takeover list. Video games are \"big business\", the paper quoted Mr Chernin as saying. We \"would like to get into it\".\nThe success of products such as Sony's Playstation, Microsoft's X-Box and Nintendo's Game Cube have boosted demand for video games. The days of arcade classics such as Space Invaders, Pac-Man and Donkey Kong are long gone. Today, games often have budgets big enough for feature films and look to give gamers as real an experience as possible. And with their price tags reflecting the heavy investment by development companies, video games are proving almost as profitable as they are fun.\nMr Chernin, however, told the FT that News Corp was finding it difficult to identify a suitable target. \"We are struggling with the gap between companies like Electronic Arts (EA), which comes with a high price tag, and the next tier of companies,\" he explained during a conference in Phoenix, Arizona. \"These may be too focused on one or two product lines.\" Activision has a stock market capitalisation of about $2.95bn (£1.57bn), compared to EA's $17.8bn. Some of the games industry's main players have recently been looking to consolidate their position by making acquisitions. France's Ubisoft, one of Europe's biggest video game publishers, has been trying to remain independent since Electronic Arts announced plans to buy 19.9% of the firm. Analysts have said that industry mergers are likely in the future.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this news about News Corp taking a look at the video games market. Let me read through it again.\n\nThe main points are that News Corp, controlled by Rupert Murdoch, is eyeing a move into video games. They're talking to Peter Chernin, the CEO of News Corp. He says they're not focusing on all video games companies, especially when some have high costs and others focus on one product line. Activison is one company listed with $2.95 billion in market capitalization, while EA has much more. There's a mention that video games are big business but facing criticism for their price tag making them expensive for developers. They want to get into the game industry but find it hard because companies like EA and Activision aren't matching their cost structures.\n\nI need to capture all these key points in a concise summary. Make sure I include who is involved, what they're looking at, why they're facing challenges, and the current market dynamics. Also, mention that video games are big but with high costs.\n</think>\n\nNews Corp aims to expand into the video games market with CEO Peter Chernin focusing on diversifying their approach. Activison is listed as a potential acquisition target. Video games are considered a 'big business' but face criticism over expensive titles and developer focus. Chernin wants to enter despite difficulty matching EA and Activision's cost structures, aiming to compete with established games companies like Sony, Microsoft, and Nintendo.", "tinyllama:1.1b": "News Corp is looking into entering the video games market, as CEO Peter Chernin says that the company would like to get into it. The Australian media company has been struggling to identify a suitable target and is finding it difficult to differentiate itself from big names in the game industry. Some companies have recently been trying to remain independent by making acquisitions, including France's Ubisoft, which publishes video games but was trying to remain autonomous since Electronic Arts announced plans to buy 19.9% of the company.", "tinydolphin:1.1b": " News Corp is considering entering the video games market with a potential bid for Activision, which is considered the largest and most profitable video game company globally, with a stock market capitalisation of around $2.95 billion. The move comes as News Corp seeks to diversify its offerings and tap into emerging markets, such as video games.", "phi:2.7b": " News Corp is interested in entering the video games market after being impressed by its profitability and popularity. However, finding a suitable target company with a high enough price tag is proving difficult for them. They have approached one such company called Activison but have not made any deals yet. The success of video games has led to mergers between industry players, which may be the future of the market.\n", "orca-mini:3b": " News Corp is eyeing a move into the video games market by examining potential acquisitions, such as Activision and Santa Monica-based Activison. The media company controlled by Australian billionaire Rupert Murdoch struggles to identify suitable targets due to the high price tags of some companies.", "hermes3:3b": "News Corp looks to enter video games market, aims to find suitable target amid high-priced companies like Activision and EA.", "stablelm-zephyr:3b": "News Corp, controlled by Rupert Murdoch, is considering entering the video games market, according to Financial Times. COO Peter Chernin revealed they are \"kicking the tyres of pretty much all video games companies\" and have identified potential targets such as Activision. The success of major game consoles like Sony's PlayStation, Microsoft's Xbox, and Nintendo's GameCube has made video games a big business, with budgets often surpassing those of film productions. However, News Corp is finding it challenging to identify suitable target companies due to the high stock market capitalizations of Electronic Arts and Activision. Mergers within the industry are expected in the future as major players consolidate their positions through acquisitions.", "chatgpt-4o-latest": "News Corp, led by Rupert Murdoch, is exploring entry into the video games market, with Activision as a potential acquisition target. COO Peter Chernin highlighted the industry's profitability and growing demand due to advanced gaming consoles. However, News Corp faces challenges in finding a suitable company, as major firms like Electronic Arts are expensive, while smaller ones may lack diversity. Industry consolidation is ongoing, with companies like Ubisoft resisting takeovers. Analysts predict further mergers in the sector.", "stablelm2:1.6b": "News Corp is considering entering the video games market due to its potential success and profitability. CEO Peter Chernin acknowledges this shift, suggesting that companies like Activison may be attractive targets. Video game success has led to increased demand and the creation of budget-friendly, immersive experiences for gamers. News Corp struggles to identify a suitable target, possibly due to differences in price tag between high-end firms like Electronic Arts and lower-tier companies. Some major players in the video game industry have been seeking consolidation through acquisitions.", "granite3.1-dense:2b": "News Corp, led by Rupert Murdoch, is exploring entry into the video games market, with COO Peter Chernin indicating interest in acquiring companies like Activision. The company recognizes video games as a significant and profitable industry, rivaling feature films in terms of production values and revenue. However, News Corp faces challenges in identifying suitable targets due to the high prices associated with major players like Electronic Arts (EA) and the potential acquisition-focused strategies of some independents, such as Ubisoft. Activision, valued at approximately $2.95 billion, is one firm on News Corp's radar, but Chernin noted a gap between EA and smaller companies that might be more amenable to acquisition. Analysts predict future industry consolidation through mergers.", "reference": "According to the Financial Times, chief operating officer Peter Chernin said that News Corp is \"kicking the tyres of pretty much all video games companies\".Video games are \"big business\", the paper quoted Mr Chernin as saying.News Corp, the media company controlled by Australian billionaire Rupert Murdoch, is eyeing a move into the video games market.France's Ubisoft, one of Europe's biggest video game publishers, has been trying to remain independent since Electronic Arts announced plans to buy 19.9% of the firm.And with their price tags reflecting the heavy investment by development companies, video games are proving almost as profitable as they are fun.The success of products such as Sony's Playstation, Microsoft's X-Box and Nintendo's Game Cube have boosted demand for video games.\"We are struggling with the gap between companies like Electronic Arts (EA), which comes with a high price tag, and the next tier of companies,\" he explained during a conference in Phoenix, Arizona."}