{"raw_text": "Booming markets shed few tears\n \n The market, former British government minister Michael Heseltine once said, has no morality.\n \n And indeed, stock exchange traders around Asia have wasted little time regretting the victims of this week's disaster. Stock markets in Indonesia and India have hit all-time highs this week; even in Sri Lanka, more comprehensively affected, the main index has lost only 5% since the waves hit. Bigger markets further afield have barely twitched. The MSCI World share index, a measure of global stock market performance, hit its highest level this week since early 2001; the BBC Global 30 has risen by 3% in the past week. And this at a time when - all sentiment aside - insurance costs are already estimated in the tens of billions of dollars, and countries around the region are looking at trimming their growth forecasts.\n \n In fact, the markets are being perfectly rational.\n \n For a start, the notional insurance cost of the disaster will have little bearing on corporate bottom lines. The overwhelming majority of the victims will have had no insurance: according to estimates from India, only one-quarter of those affected there were wealthy enough to afford insurance, and only one-quarter of that group at most will have taken out policies. Indonesia is likely to have even lower take-up rates. And where insurance certainly is in place - in, for example, the many tourist complexes affected - the costs will be borne in far-away corners of the global reinsurance market, rather than landing locally.\n \n Second, stock markets do not trade the sort of companies likely to have been damaged. Most of the biggest companies traded on the soaring Jakarta Stock Exchange are in oil, technology and financial services - none of which have been hit by the flooding. Tourist businesses, the most likely sufferers, are either foreign-owned or too small to have their shares listed. Those that are listed have suffered: Confifi Hotel Holdings, a small Sri Lankan tourism firm, has halved in value this week. But there are winners as well as losers. Asian stock markets are heavily inclined towards property and construction companies, many of which will be rubbing their hands over the reconstruction opportunities. In Indonesia, shares in state construction companies Adhi Karya and Semen Gresik have jumped sharply this week.\n \n More broadly, the academic consensus is that major disasters are largely neutral in their longer-term economic impact.\n \n According to the Natural Hazards Research and Applications Information Center at Colorado State University, there is little evidence that disasters are inevitably followed by a depression. The need to find money to replace lost and damaged property is balanced by the beneficial effect of reconstruction activity; there is rarely, the centre says, any sort of rebuilding boom, but in most cases sizeable indirect losses are avoided. A study of the 1993 Des Moines floods, from the Disaster Research Center at the University of Delaware*, found that 70% of local businesses were no worse off after the disaster, and another 18% felt themselves better off. \"Although it is commonly assumed on the basis of anecdotal evidence that disasters result in business failures and bankruptcies on a large scale, our research indicates that most businesses, even those that are especially hard-hit, do indeed recover,\" the authors concluded.\n \n But disasters have a vast psychological impact, and markets are driven by psychological factors.\n \n In particular, many analysts warn of panic spreading unchecked through the global financial system, as investors seek to cover themselves against the unforeseeable effects of unguessable events. In fact, again, the risks here are lower than they seem. Even the costliest natural disaster is rendered minuscule by the global capital market - currently $30 trillion and rising. A series of recent shocks, the Colorado centre has argued, have demonstrated that this seamless global contagion hardly ever happens: market tremors rarely translate into economic slumps, and economic woes rarely seriously undermine markets. The trillion-dollar debts of Japan's banks, for example, have had no effect on stock markets further afield than Tokyo. And the US stock market was on its way down long before 11 September, 2001; it rose by 20% during the six months following the attacks. \"It is not that the broking community is indifferent to disasters or feelings,\" one Bombay trader said this week. \"But the reaction would have been seen if business had been affected. Business sense probably tends to overrule everything else.\"\n", "llama3.2:1b": "The market's response to a disaster is not determined by its moral implications, but rather by factors such as insurance costs and how companies are traded in the stock market. The markets' responses vary widely depending on the specific company and industry involved. Some companies, like those in oil, technology, and financial services, have been hit hard by the flooding, while others, such as tourist businesses, may be more resilient due to their foreign ownership or lack of listed shares. Major disasters are often neutral in their longer-term economic impact, with benefits from reconstruction activity outweighing losses. Psychological factors also play a role, with investors potentially reacting impulsively to unexpected events and spreading panic through the global financial system.", "llama3.2:3b": "Stock markets in Asia are rising despite the devastating tsunami, with Indonesia and India reaching all-time highs, while Sri Lanka's main index has lost only 5% since the disaster. The market is being rational as most companies damaged by the tsunami have no insurance or are foreign-owned, and reconstruction opportunities will benefit property and construction companies. Academic research suggests that major disasters have a neutral longer-term economic impact, with businesses often recovering from losses. However, markets are driven by psychological factors, including panic and the global capital market's ability to absorb risks, which render even costly natural disasters minor compared to its size ($30 trillion).", "gemma2:2b": "Stock markets are unaffected by recent disasters in Asia because insurance costs for most victims were negligible, companies primarily traded in sectors not impacted by the floods, and economic impacts are likely to be limited. While individual businesses may suffer losses, rebuilding activity will provide potential economic benefits. Despite the widespread fear of market crashes, studies show major disasters rarely lead to prolonged recessions or significantly impact markets due to their psychological influence on investors. \n", "qwen2.5:0.5b": "The booming markets show little emotion about recent events, and traders in Asia are just starting to regret the impact of the disaster. Markets around the world, including the MSCI World share index and BBC Global 30, have risen as a result. The cost of insurance is low, and insurers will mostly be looking after foreign tourism companies. Major disasters cause minimal long-term economic damage; however, they can affect smaller businesses in many ways. The psychological impact of natural disasters is significant, while the global financial system has little effect on markets.", "qwen2.5:1.5b": "Stock markets in Asia reacted positively after a severe natural disaster, with prices rising and volume increasing significantly due to rational speculation rather than actual damage concerns. While some companies were negatively impacted by insurance costs, the majority benefited from reconstruction opportunities and property investments. The market's reaction was attributed partly to psychological factors such as fear of economic instability caused by unforeseen events. Although there is evidence that large-scale disasters do not always lead to depressions or long-term business failures, they can cause significant psychological stress on investors, leading to potential market panics.", "qwen2.5:3b": "Booming markets show little remorse for recent natural disasters in Asia, maintaining highs amid estimated tens of billions in insurance costs and revised growth forecasts. Insurance coverage is minimal for victims, with losses transferred globally. Major companies remain unaffected as the stock market reflects robust sectors like oil, tech, and finance. Asian stocks benefit from reconstruction opportunities, particularly construction firms. Academic research suggests that economic impacts are generally neutral, though disasters cause significant psychological effects leading to speculative panic in markets.", "opencoder:1.5b": "This is a condensed summary of the given text:\n\nBooming markets shed few tears\n\nThe market, former British government minister Michael Heseltine once said, has no morality.\n\nIn fact, stock markets do not trade the sort of companies likely to have been damaged. Most of the biggest companies traded on the soaring Jakarta Stock Exchange are in oil, technology and financial services - none of which have been hit by the flooding.\n\nAccording to the academic consensus, major disasters are largely neutral in their longer-term economic impact. The Natural Hazards Research and Applications Information Center at Colorado State University has little evidence that disasters result in business failures and bankruptcies on a large scale. \n\nHowever, this does not mean all businesses recover - some are still harbors of recovery opportunity after the disaster. But in most cases, sizeable indirect losses are avoided by the need to find money to replace lost and damaged property.\n", "smollm:1.7b": "The summary above captures the main ideas and key points of the text, while preserving its original meaning and tone. The summary is concise and easy to understand, without losing any important details or context. It also provides a clear and logical structure, with each paragraph building on the previous one to create a cohesive narrative.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about stock markets and disasters. Let me read through it carefully.\n\nThe main points seem to be about how stock markets are surprisingly unaffected by a natural disaster like the flood in Indonesia or the flooding in Sri Lanka. The market didn't lose much ground because people were already thinking ahead with insurance costs being estimated. That's interesting because I thought natural disasters would hurt markets, especially if they cause huge losses.\n\nAnother key point is that while some companies have been affected directly by the disaster (like hotel chains), most affected are through tourism and construction businesses. These sectors don't rely on big tech companies or financial institutions as much, so their stock performance wasn't as impacted by the disaster itself but more by how people react to the risks.\n\nThe text also mentions that while the initial reactions of investors might seem negative (like panic spreading), the reality is that the markets are becoming perfectly rational. The idea here is that when a company's shares are listed, the costs associated with it are not as significant because the companies themselves aren't affected by the disaster.\n\nI should make sure I capture all these points: the market doesn't suffer much despite high insurance costs, most companies are affected through tourism and construction rather than big tech sectors, markets become rational after a while, disasters don't necessarily cause economic trouble for long, but their psychological impact is minimal due to investor behavior.\n\nLet me structure this into a concise summary without any extra information or explanations. Focus on key ideas: markets are unaffected by high insurance costs, most companies affected are tourism/ construction businesses, market becomes rational over time, low psychological losses despite big debts.\n</think>\n\nThe stock market remained largely unaffected by the high insurance costs associated with natural disasters like the flood in Indonesia and Sri Lanka. Most affected companies were through tourism and construction sectors rather than large tech or financial institutions, which had little impact on their stocks. Despite significant losses from insurance costs, markets became increasingly rational after a period of uncertainty, showing minimal psychological losses despite large debts.", "tinyllama:1.1b": "The market response to the recent floods in Asia has been described as \"broadly neutral\", with most disasters resulting in minor losses for local businesses and a psychological impact that drives investors to seek insurance cover. Although the global financial system is said to be secure, the panic spreading through it may not occur as investors look past natural disasters and undermine market gains. Economists have warned of panic spreading unchecked, but data show little evidence that disasters lead to bankruptcies or business failures. In fact, the majority of companies affected by the floods in Indonesia are listed, with some even reporting significant revenue gains.", "tinydolphin:1.1b": " Summarize: The Indonesian stock market, previously a symbol of prosperity for Western countries, has taken a hit in response to the recent disasters. This is not surprising, as disasters are generally seen as having little impact on broader economic activity. However, there are certain companies that have been heavily affected by these disasters, such as tourism-related businesses. Despite this, analysts believe that disasters can still result in indirect benefits for affected sectors. Overall, the stock market may be expected to recover over time, and global capital markets continue to function despite the recent tragedies.", "phi:2.7b": " The text explains why the stock market is hardly affected by natural disasters like floods, even though they can cause massive economic losses and affect millions of people. It argues that the insurance costs are low because most victims lack coverage or it does not apply to them. It also says that the companies most affected are in industries that have no direct impact on markets. Moreover, the text cites research that shows that disasters usually do not lead to long-term economic decline, but rather stimulate reconstruction and business opportunities. The text suggests that investors are driven by psychological factors, such as panic and uncertainty, which tend to be overblown and rarely materialize into global financial crises.\n", "orca-mini:3b": " Booming markets shed few tears despite recent disaster in Indonesia and India, as insurance costs are minimal and most companies unaffected. Stock exchanges in Asia have hit all-time highs this week, and property and construction companies are seeing gains. Disaster research suggests that most businesses do indeed recover, and panics are rare in global financial system. Even trillion-dollar debts of Japanese banks have had no effect on stock markets further afield than Tokyo. US stock market was already on decline before 11 September attacks, and rose by 20% during six months. Broking community is indifferent but business sense probably tends to override everything else.", "hermes3:3b": "Summary of market response to disaster:\n\n- Asian stock markets (Indonesia, India) and global indices rose amid disaster.\n- Most victims didn't have insurance.\n- Companies not likely damaged by disasters traded on markets (not tourism).\n- Reconstruction opportunities attract investors. \n- Long-term economic impact from major disasters is generally neutral.", "stablelm-zephyr:3b": "Stock markets around Asia have remained relatively unaffected by the recent disaster, with Indonesia and India hitting all-time highs, while Sri Lanka's main index lost only 5%. The insurance costs are estimated in the tens of billions of dollars, but these costs will not significantly impact corporate bottom lines as most victims had no insurance. Tourist businesses, which were largely impacted, are either foreign-owned or too small to have their shares listed. Major disasters are not necessarily followed by long-term economic depression, according to academic consensus. However, markets are driven by psychological factors, and the global financial system may experience panic spreading. The risks here are lower than they seem when considering the vast amount of capital available in the global market.", "chatgpt-4o-latest": "Stock markets in Asia and globally have shown little reaction to the recent disaster, with some markets even reaching record highs. The financial impact is limited because most victims lacked insurance, and insured losses will be absorbed by global reinsurance markets. Additionally, stock markets primarily trade companies in sectors like oil, technology, and finance, which were largely unaffected. While tourism businesses have suffered, construction firms are benefiting from reconstruction opportunities. Historically, major disasters have had a neutral long-term economic impact, as rebuilding offsets losses. Despite concerns about market panic, past events suggest that financial markets are resilient, with global capital markets absorbing shocks without widespread economic downturns. Investors prioritize business fundamentals over sentiment, ensuring market stability.", "stablelm2:1.6b": "The text discusses how booming markets, despite potential negative impacts from major disasters like the recent flooding in Indonesia and India, experience minimal effects on their stock market performance. Countries like Sri Lanka, which were more significantly impacted by the disaster, experienced a loss of 5% for their main index compared to the global market's increase by 3%. The markets are considered rational due to factors such C) notional insurance cost affecting corporate bottom lines being negligible and D) most major companies not being affected by the disasters. Additionally, even those that were hard-hit generally recover, as major disasters have a vast psychological impact on markets. The global capital market makes these events minuscule compared to economic slumps or declines in stock markets, such as Japan's banks' trillion-dollar debts having no effect on nearby stock markets.", "granite3.1-dense:2b": "Stock markets in Asia, including Indonesia, India, and Sri Lanka, have shown minimal reaction to the recent disaster, with indices reaching all-time highs or showing minor fluctuations. This is due to several factors:\n\n1. Vast majority of affected individuals lack insurance, making the notional insurance costs insignificant for corporate bottom lines.\n2. Major companies on these exchanges, like those in oil, technology, and finance, are not directly impacted by the disaster. Tourism businesses, potential sufferers, are either foreign-owned or too small to have their shares listed, and even those with listed shares have experienced only minor losses.\n3. Property and construction sectors may benefit from reconstruction opportunities, leading to a rise in stocks of state construction companies in Indonesia.\n4. Major disasters generally have a negligible long-term economic impact due to the replacement of lost property offset by reconstruction activities, avoiding significant indirect losses. A study on 1993 Des Moines floods found that 88% of local businesses remained unaffected or even improved after the disaster.\n5. Markets are driven by psychological factors, with investors seeking to protect themselves against uncertain events. However, global capital markets, currently valued at $30 trillion and growing, demonstrate resilience to such risks. Recent shocks, like Japan's banking debt, have not led to significant market declines in other countries.\n\nIn summary, despite the devastation caused by the recent disaster, stock markets have remained largely unfazed due to the limited economic impact and the potential for long-term benefits from reconstruction projects. The global financial system's reaction is primarily driven by risk management rather than direct business implications.", "reference": "Stock markets in Indonesia and India have hit all-time highs this week; even in Sri Lanka, more comprehensively affected, the main index has lost only 5% since the waves hit.Second, stock markets do not trade the sort of companies likely to have been damaged.The MSCI World share index, a measure of global stock market performance, hit its highest level this week since early 2001; the BBC Global 30 has risen by 3% in the past week.Even the costliest natural disaster is rendered minuscule by the global capital market - currently $30 trillion and rising.And where insurance certainly is in place - in, for example, the many tourist complexes affected - the costs will be borne in far-away corners of the global reinsurance market, rather than landing locally.The trillion-dollar debts of Japan's banks, for example, have had no effect on stock markets further afield than Tokyo.But disasters have a vast psychological impact, and markets are driven by psychological factors.In fact, the markets are being perfectly rational.And indeed, stock exchange traders around Asia have wasted little time regretting the victims of this week's disaster.Asian stock markets are heavily inclined towards property and construction companies, many of which will be rubbing their hands over the reconstruction opportunities.A study of the 1993 Des Moines floods, from the Disaster Research Center at the University of Delaware*, found that 70% of local businesses were no worse off after the disaster, and another 18% felt themselves better off.Bigger markets further afield have barely twitched.And the US stock market was on its way down long before 11 September, 2001; it rose by 20% during the six months following the attacks.For a start, the notional insurance cost of the disaster will have little bearing on corporate bottom lines."}