{"raw_text": "Asian quake hits European shares\n \n Shares in Europe's leading reinsurers and travel firms have fallen as the scale of the damage wrought by tsunamis across south Asia has become apparent.\n \n More than 23,000 people have been killed following a massive underwater earthquake and many of the worst hit areas are popular tourist destinations. Reisurance firms such as Swiss Re and Munich Re lost value as investors worried about rebuilding costs. But the disaster has little impact on stock markets in the US and Asia.\n \n Currencies including the Thai baht and Indonesian rupiah weakened as analysts warned that economic growth may slow. \"It came at the worst possible time,\" said Hans Goetti, a Singapore-based fund manager. \"The impact on the tourist industry is pretty devastating, especially in Thailand.\" Travel-related shares dropped in Europe, with companies such as Germany's TUI and Lufthansa and France's Club Mediterranne sliding. Insurers and reinsurance firms were also under pressure in Europe.\n \n Shares in Munich Re and Swiss Re - the world's two biggest reinsurers - both fell 1.7% as the market speculated about the cost of rebuilding in Asia. Zurich Financial, Allianz and Axa also suffered a decline in value.\n \n However, their losses were much smaller, reflecting the market's view that reinsurers were likely to pick up the bulk of the costs. Worries about the size of insurance liabilities dragged European shares down, although the impact was exacerbated by light post-Christmas trading. Germany's benchmark Dax index closed the day 16.29 points lower at 3.817.69 while France's Cac index of leading shares fell 5.07 points to 3.817.69. Investors pointed out, however, that declines probably would be industry specific, with the travel and insurance firms hit hardest. \"It's still too early for concrete damage figures,\" Swiss Re's spokesman Floiran Woest told Associated Press. \"That also has to do with the fact that the damage is very widely spread geographically.\"\n \n The unfolding scale of the disaster in south Asia had little immediate impact on US shares, however. The Dow Jones index had risen 20.54 points, or 0.2%, to 10,847.66 by late morning as analsyts were cheered by more encouraging reports from retailers about post-Christmas sales. In Asian markets, adjustments were made quickly to account for lower earnings and the cost of repairs. Thai Airways shed almost 4%. The country relies on tourism for about 6% of its total economy. Singapore Airlines dropped 2.6%. About 5% of Singapore's annual gross domestic product (GDP) comes from tourism. Malaysia's budget airline, AirAsia fell 2.9%. Resort operator Tanco Holdings slumped 5%.\n \n Travel companies also took a hit, with Japan's Kinki Nippon sliding 1.5% and HIS dropping 3.3%. However, the overall impact on Asia's largest stock market, Japan's Nikkei, was slight. Shares fell just 0.03%. Concerns about the strength of economic growth going forward weighed on the currency markets. The Indonesian rupiah lost as much as 0.6% against the US dollar, before bouncing back slightly to trade at 9,300. The Thai baht lost 0.3% against the US currency, trading at 39.10. In India, where more than 2,000 people are thought to have died, the rupee shed 0.1% against the dollar Analysts said that it was difficult to predict the total cost of the disaster and warned that share prices and currencies would come under increasing pressure as the bills mounted.\n", "llama3.2:1b": "Asian quake hits European shares due to tsunamis across south Asia resulting in over 23,000 deaths. Shares in leading reinsurers such as Swiss Re and Munich Re fell by more than 1.7%. Insurers were also affected, with Zurich Financial, Allianz, and Axa experiencing declines in value. However, the market's view is that reinsurers will pick up the bulk of rebuilding costs. US shares were unaffected.", "llama3.2:3b": "Shares in European reinsurers and travel firms fell after a massive underwater earthquake and tsunamis hit south Asia, killing over 23,000 people. Reinsurance firms Swiss Re and Munich Re lost 1.7% value, while travel companies like TUI and Lufthansa dropped 16 points. The disaster had little impact on US shares, which rose 0.2%, but currencies such as the Thai baht and Indonesian rupiah weakened.", "gemma2:2b": "A massive earthquake in Asia caused significant damage and death, impacting travel and insurance sectors. Shares in European reinsurers and travel companies decreased due to worries about rebuilding costs and tourism losses. US and Asian markets remained relatively unaffected. However, currency values like the Thai baht and Indonesian rupiah weakened as analysts anticipate economic slowdown. While there is uncertainty regarding the true extent of financial losses, investors are anticipating increased pressure on share prices and currencies as the scope of the disaster becomes clearer. \n", "qwen2.5:0.5b": "European stock markets fell following a large earthquake in South Asia, causing losses for reinsurers, travel firms, and insurers. Many companies had already lost value due to investors' concerns about rebuilding costs. The impact was limited compared to US shares, which continued their gains after a disappointing outlook for economic growth post-Christmas.", "qwen2.5:1.5b": "European shares fell due to tsunamis in south Asia, with losses concentrated in insurance companies and travel firms. Currencies weakened; tourism-dependent countries' stocks declined significantly. Stock markets outside Europe were relatively unaffected.", "qwen2.5:3b": "Asian quake hits European shares; reinsurers and travel firms lose value. Munich Re, Swiss Re drop 1.7%. Travel-related shares decline in Europe but US markets rise. Thai baht and Indonesian rupiah weaken due to economic growth concerns. US markets up modestly on retail sales reports. Asia's largest stock market (Nikkei) falls just 0.03% amid currency adjustments and lower earnings. Overall impact slight, with Thailand and Malaysia's tourism industries heavily affected. Economic growth outlook uncertain as damages mount.", "opencoder:1.5b": "The text you provided is a comprehensive summary of an event that occurred in the context of a global earthquake, followed by comments about various aspects of the impact on US shares, tourist industry, currency performance, and potential future economic conditions. The key points are clear-cut: the scale of the disaster, the loss of value from investors, and the impact on Asian and European markets remain significant.\n", "smollm:1.7b": "The summary is concise and objective, preserving key ideas and details from the original text while omitting unnecessary information. The main points covered are:\n\n1. Asian quake hits European shares: Shares in Europe's leading reinsurers and travel firms have fallen as the scale of the damage wrought by tsunamis across south Asia has become apparent.\n2. More than 23,000 people have been killed following a massive underwater earthquake and many of the worst hit areas are popular tourist destinations. Reisurance firms such as Swiss Re and Munich Re lost value as investors worried about rebuilding costs. But the disaster has little impact on stock markets in the US and Asia.\n3. Currencies including the Thai baht and Indonesian rupiah weakened as analysts warned that economic growth may slow. \"It came at the worst possible time,\" said Hans Goetti, a Singapore-based fund manager. \"The impact on the tourist industry is pretty devastating, especially in Thailand.\" Travel-related shares dropped in Europe, with companies such as Germany's TUI and Lufthansa and France's Club Med Mediterranean slipping.\n4. Shares in Munich Re and Swiss Re - the world's two biggest reinsurers - both fell 1.7% as the market speculated about the cost of rebuilding in Asia. Worries about the size of insurance liabilities dragged European shares down, although the impact was exacerbated by light post-Christmas trading.\n5. The unfolding scale of the disaster in south Asia had little immediate impact on US shares, although the Dow Jones index rose 20.54 points, or 0.2%, to 10,847.66 by late morning as analsyts were cheered by more encouraging reports from retailers about post-Christmas sales. In Asian markets, adjustments were made quickly to account for lower earnings and the cost of repairs.\n6. Travel companies also took a hit, with Japan's Kinki Nippon losing 1.5% against the US dollar, before bouncing back slightly to trade at 9,300. The Thai baht lost 0.3% against the US currency, trading at 39.10. In India, where more than 2,000 people are thought to have died, the rupee shed 0.1% against the dollar Analysts said that it was difficult to predict the total cost of the disaster and warned that share prices and currencies would come under increasing pressure as the bills mounted.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about how a tsunami in Asia affected European reinsurance companies' stock markets. First, I'll read through the entire passage carefully to understand all the key points.\n\nThe main event is a massive underwater earthquake in South Asia, which caused significant damage and loss of lives. More than 23,000 people died, with popular tourist spots like beaches being hit hard. Reinsurance companies lost value because investors were worried about rebuilding costs, especially in places like Thailand where tourism was crucial.\n\nNext, the currencies weakened due to economic concerns. analysts warned that growth could slow and the travel industry would be particularly affected. Travel-related companies in Europe dropped in shares. Insurers and reinsurance firms also suffered.\n\nMunich Re and Swiss Re, being big reinsurers, lost 1.7% each. Other companies like Zurich Financial, Axa, TUI, and Lufthansa also had declines. However, the losses were smaller compared to what investors expected because they focused on cost recovery, not total liabilities. Even though the post-Christmas trading ended helped a bit, the travel sectors hurt the markets more.\n\nUS stocks didn't react much, but some Asian markets did adjust after lower earnings and repairs costs. Travel companies faced impacts too, with Nikkei shares dropping just 0.03%. The Rupiah and Thai baht lost value against the dollar, suggesting uncertainty about future costs.\n\nI need to make sure I capture all these points concisely without extra information or explanations. Focus on key players like reinsurance companies, the main impact regions (like Thailand), currency fluctuations from economic concerns, and how markets reacted.\n</think>\n\nAsian Quake Hits European Reinsurers  \nReinsurance companies in Europe, including Swiss Re and Munich Re, lost value after a massive underwater earthquake in South Asia caused significant losses. More than 23,000 people died, with popular tourist destinations like beaches experiencing severe damage. Investors worried about rebuilding costs, leading to declines in shares of these firms. Travel-related companies such as TUI and Lufthansa also faced drops. Munich Re and Swiss Re each lost 1.7% due to high insurance liabilities. The risk of slower economic growth caused currency weakening, with the Thai baht and Indonesian rupiah dropping. Although US markets were largely unaffected, Asian markets showed signs of recovery after losses in travel and energy sectors.", "tinyllama:1.1b": "The Asian stock market, which includes countries such as Singapore, Japan, Hong Kong, and South Korea, has been impacted by the massive tsunami that occurred in the south of Asia on December 26, with shares in European insurance firms, travel companies, and reinforcement firms falling as investors worry about economic recovery following the disaster. The Thai baht, Indonesian rupeah, and Thai stock market's index were all weighed down by the earthquake's devastating impact on tourism, with insurance firms and travel companies among the worst hit areas. Although there was a decline in value as speculation arose over the cost of rebuilding costs, investors could expect to see further damage to shares and currencies due to the scale of the disaster.", "tinydolphin:1.1b": " Asian shares were largely unaffected by the tsunami-induced damage, with only modest declines reported on both the Thai baht and Indonesian rupiah. Stock markets in Japan also did not seem significantly impacted, with its Nikkei index having a slight downward movement of 0.03%. On the currency front, the Thai baht lost more value against the US dollar but bounced back slightly to trade at 9,300. The Indonesian rupiah also experienced a similar pattern, losing ground against the American currency as investors worried about rebuilding costs. Overall, while some companies in these regions may have taken significant hits due to the tsunami's impact on their businesses and economies, it seems that the impact was light at best.", "phi:2.7b": " A major earthquake in south Asia has caused widespread devastation, killing thousands of people and impacting European shares in reinsurance firms and travel companies. Despite concerns about rebuilding costs, insurance liabilities are expected to be manageable for most insurers and reinsurers. The impact on US markets is minimal, with the Dow Jones index rising due to improved sales figures from retailers. However, other Asian markets have been affected, particularly Thailand' s tourism industry. The Thai baht and Indonesian rupiah have weakened in response to slower economic growth concerns. The cost of the disaster is difficult to predict, but share prices and currencies are expected to come under increasing pressure as rebuilding costs mount.\n", "orca-mini:3b": " Asian stocks were hit by the tsunami disaster in south Asia, with shares in Europe's reinsurance and travel firms falling. The earthquake damaged tourist destinations, causing concerns about the cost of rebuilding and the impact on economic growth. The scale of the damage was difficult to estimate, but it had a significant impact on stock markets in the US and Asia. Shares in Munich Re and Swiss Re fell, while other insurers and reinsurance firms also suffered losses. Travel-related shares dropped in Europe, with companies such as Germany's TUI and Lufthansa and France's Club Mediterranne sliding.", "hermes3:3b": "European shares fall due to damage from south Asian quakes, affecting reinsurers and travel firms.", "stablelm-zephyr:3b": "A big earthquake in Asia caused a lot of damage, especially in places where people like to travel. Companies that help travelers and make sure they are safe (like Swiss Re and Munich Re) lost some of their value, because it might cost a lot of money to fix everything. But this didn't affect stock markets much in the US or Asia, because people think these companies will pay for most of what needs to be fixed. Some countries' money also got weaker because they rely on tourists to help their economy. Even though it's hard to know how much the disaster will cost and how bad the effects are going to be, some people believe that this situation could make things more difficult for these companies in the future.", "chatgpt-4o-latest": "Shares in European reinsurers and travel firms fell as the impact of the South Asian tsunami, which killed over 23,000 people, became clear. Swiss Re and Munich Re lost value due to concerns over rebuilding costs, while travel-related stocks such as TUI, Lufthansa, and Club Mediterranée also declined. The disaster weakened currencies like the Thai baht and Indonesian rupiah, with analysts warning of slower economic growth, particularly in tourism-dependent economies. European stock markets dropped slightly, with insurers and reinsurers bearing the brunt of losses. However, US and Asian markets saw limited impact, with Japan’s Nikkei barely affected. Airlines and travel firms in Asia, including Thai Airways and Singapore Airlines, saw declines, while currency markets reacted with minor losses. Analysts cautioned that the full financial impact remained uncertain, with further pressure expected on shares and currencies as costs mounted.", "stablelm2:1.6b": "Asian quake hits European shares: Reinsurers and travel firms experience losses due to South Asian tsunamis, while tourist-related shares drop in Europe; insurers and reinsurance firms face pressure, but their value decreases are small compared  to overall costs of rebuilding. In Asia, stock markets remain largely unaffected by the disaster, with Japan's Nikkei slightly down. Economic growth concerns lead to weakening of currencies like the Thai baht and Indonesian rupiah.", "granite3.1-dense:2b": "A powerful tsunami in south Asia, resulting in over 23,000 deaths, has led to significant stock market declines in Europe, particularly among reinsurers and travel firms. Swiss Re, Munich Re, Zurich Financial, Allianz, and Axa experienced value drops due to concerns about massive rebuilding costs. European indices like Germany's Dax and France's Cac fell by 16.29 and 5 points, respectively. Travel companies, including TUI, Lufthansa, Club Mediterranne, Japan's Kinki Nippon, HIS, and India's HIS, also suffered declines.\n\nIn contrast, U.S. stocks, despite post-Christmas sales optimism, showed only a 0.2% increase in the Dow Jones index. Asian markets, such as Thailand (Nikkei down 0.03%) and Singapore (Singapore Airlines dropping 2.6%, Tanco Holdings by 5%), were less affected. Currency markets also experienced volatility: the Indonesian rupiah lost 0.6% against the USD, while the Thai baht decreased by 0.3%. Analysts cautioned that the true economic impact and insurance liabilities may worsen as time passes.", "reference": "The unfolding scale of the disaster in south Asia had little immediate impact on US shares, however.But the disaster has little impact on stock markets in the US and Asia.Shares in Munich Re and Swiss Re - the world's two biggest reinsurers - both fell 1.7% as the market speculated about the cost of rebuilding in Asia.In India, where more than 2,000 people are thought to have died, the rupee shed 0.1% against the dollar Analysts said that it was difficult to predict the total cost of the disaster and warned that share prices and currencies would come under increasing pressure as the bills mounted.Shares in Europe's leading reinsurers and travel firms have fallen as the scale of the damage wrought by tsunamis across south Asia has become apparent.The Thai baht lost 0.3% against the US currency, trading at 39.10.Shares fell just 0.03%.Investors pointed out, however, that declines probably would be industry specific, with the travel and insurance firms hit hardest.However, the overall impact on Asia's largest stock market, Japan's Nikkei, was slight.Reisurance firms such as Swiss Re and Munich Re lost value as investors worried about rebuilding costs.Travel companies also took a hit, with Japan's Kinki Nippon sliding 1.5% and HIS dropping 3.3%.Insurers and reinsurance firms were also under pressure in Europe.Germany's benchmark Dax index closed the day 16.29 points lower at 3.817.69 while France's Cac index of leading shares fell 5.07 points to 3.817.69.Travel-related shares dropped in Europe, with companies such as Germany's TUI and Lufthansa and France's Club Mediterranne sliding."}