{"raw_text": "Could Yukos be a blessing in disguise?\n \n Other things being equal, the notion of entrepreneurs languishing in jail while their companies are sold off for a song ought to be bad for business.\n \n But in the looking-glass world of modern Russia, the opposite might just be true, a new report* has argued. The study, from the Centre for Economic Policy Research, does not praise the rough handling of oil company Yukos. But it argues that more rigorous tax policing has benefited all Russian firms, even targets of the tax police. \"An increase in tax enforcement can increase the amount [of dividends and other income] outside shareholders will receive, even accounting for increased levels of taxation,\" the authors say.\n \n The paper's reasoning is complex, and is based on a sophisticated model of the relationship between tax regimes and corporate governance - in particular, the propensity of management to steal from the company. The calculations demonstrated what many Russian analysts already knew: that increasing the tax rate increases the amount that managers steal, since undeclared income becomes relatively more valuable. In the West, meanwhile, higher tax rates translate far more smoothly into higher government revenues. On the other hand, increasing the rigour with which taxes are collected encourages companies to become more transparent, forcing them to be able to demonstrate their financial position far more accurately. The net result, the authors say, is that the extra amount companies pay in tax is more than compensated for by greater efficiency and financial soundness.\n \n After Vladimir Putin became president in 2000, he did not raise taxes, but put a lot of effort - too much, critics argue - into enforcement.\n \n Since then, the Russian stock market has more than trebled in value, a rise the authors attribute at least in part to the newly tough approach. The report highlights the case of Sibneft, a Russian oil company that came close to merging with Yukos last year. After Mr Putin came to power, the company's overall effective tax rate rose from 2.6% to 10.4%, and Sibneft was the target of a series of aggressive raids by fiscal police. But shareholders benefited hugely: Sibneft started to pay dividends - $53m in 2000 and almost $1bn in 2001 - and closed down the network of opaque subsidiaries it had previously used for siphoning off unofficial funds. According to the authors, although a variety of changes were sweeping through Russian industry at the time, the increase in tax enforcement is the only likely explanation for the change of fortunes at Sibneft and many of its peers.\n \n Does this analysis make sense? In part, certainly. For all its faults, corporate Russia has become far more orderly and law-abiding since 2000. Companies have rushed to list their shares on international stock exchanges - something unthinkable in the wilder days of the 1990s - and most large firms now produce their accounts to international standards. Foreign direct investment, long negligible, is starting to flow in serious amounts - $7bn in 2003 - and stock market returns have been among the healthiest in Europe. But the authors' model does not quite cover all the complexities. For a start, the model assumes that the various parties have clearly-defined motivation: companies want to maximise profit, governments want to maximise tax revenue. In fact, the alarmingly close connections between big business and government in Russia - connections often greased by bribery - blur the apparently antagonistic relationship. Companies can, for example, persuade officials to overlook non-payment of taxes.\n \n And the authors' definition of tax enforcement seems unrealistically Western. Genuine, disinterested tax collection might well work wonders in Russia; the problem with recent examples has been the erratic and unpredictable way laws are enforced. The case against Yukos, for example, has moved in fits and starts, with little clarity from the government about its intentions, and little faith from investors that the letter of the law would be followed. As far as most commentators are concerned, the state is pursuing Yukos out of a political vendetta, rather than simply to enforce fiscal rectitude. Since Yukos' founder, Mikhail Khodorkovsky, was arrested a year ago, the Russian market has dropped by 10% - an indication that few investors feel optimistic about the salutary effect on corporate performance.\n", "llama3.2:1b": "Other things being equal, Yukos could be a blessing in disguise.\nA new report argues that increasing tax enforcement in Russia may benefit all companies, even targets of the tax police. \nThe study suggests that more rigorous tax policing can increase dividend payments and financial transparency, leading to greater efficiency and soundness. \nHowever, critics argue that increasing tax rates encourages companies to become more transparent, forcing them to demonstrate their financial position accurately. \nSince Vladimir Putin came to power in 2000, Russia has seen a significant rise in the stock market due in part to increased enforcement efforts. \nThe report attributes this change to Sibneft's effective tax rate rising from 2.6% to 10.4%, despite facing aggressive raids by fiscal police.\nHowever, other changes sweeping through Russian industry may have contributed to the increase in fortunes at Sibneft and many of its peers, rather than simply increased enforcement efforts. \nThe report does not address concerns about corporate Russia becoming more orderly and law-abiding since 2000.", "llama3.2:3b": "Other things being equal, increased tax enforcement in modern Russia may benefit all firms, including targets of tax police, even Yukos, as it leads to greater transparency and financial soundness, resulting in higher dividend payments and government revenues. The study suggests that increasing tax rates increases management's propensity to steal, but the additional amount companies pay in tax is more than compensated by these gains, leading to a net increase in efficiency and financial stability.", "gemma2:2b": "A new study suggests that increased tax enforcement in Russia might actually benefit businesses overall. The report argues that stricter tax policing increases transparency and encourages more efficient operations, ultimately resulting in greater profitability for companies.  It highlights the case of Sibneft, which experienced a financial turnaround after aggressive tax enforcement. However, the study's model may not fully capture the complexities of Russian business dealings and the blurring lines between government interests and corporate behavior.  Despite some positive economic changes since 2000, investors remain skeptical about the impact of recent tax enforcement actions on the overall stability of the Russian market due to uncertainties surrounding legal enforcement and allegations of political motivations behind those efforts. \n", "qwen2.5:0.5b": "In modern Russia, stricter tax enforcement has made companies pay more in taxes despite no clear-cut evidence that it benefits shareholders. Taxing oil giant Yukos increased its value and resulted in a rise in its effective tax rate, allowing shareholders to benefit from higher dividends and reduced uncertainty around their financial position. The analysis considers the complex interplay of corporate governance, market dynamics, and government policies influencing corporate behavior in Russia.", "qwen2.5:1.5b": "The Centre for Economic Policy Research argues that increased tax enforcement in Russia benefits all firms, including targets of the tax police. This increase results in higher dividends and other income for shareholders even with increased taxation. The authors' complex model suggests this is due to lower managers' propensity to steal from companies when taxes are enforced rigorously, leading to greater financial transparency and efficiency. Despite improvements, corporate Russia remains orderly since 2000, as evidenced by its successful stock market, international listings, and foreign investment despite recent political controversies surrounding Yukos.", "qwen2.5:3b": "Could Yukos be a blessing in disguise?\n\nOther things being equal, entrepreneurs languishing in jail can harm business. However, a new report from the Centre for Economic Policy Research suggests modern Russia's rigorous tax enforcement has benefited all firms, even targets of the tax police. Increasing taxes benefits managers by making undeclared income more valuable, yet it also encourages companies to be more transparent, improving their financial soundness.\n\nThe authors argue that increased tax enforcement led to higher dividends and transparency at Russian firms like Sibneft, whose tax rate rose from 2.6% to 10.4%. Putin's emphasis on tax enforcement coincided with the Russian stock market tripling in value since 2000. Yet, their model does not account for the blurred relationship between big business and government in Russia, which involves bribery.\n\nThe report highlights increased tax enforcement as a significant factor behind the improved fortunes of companies like Sibneft, but critics argue that Yukos' case may not fit this pattern due to political motives rather than enforced fiscal rectitude.", "opencoder:1.5b": "This summary preserves key ideas from the text:\n\n- The notion of entrepreneurs languishing in jail while their companies are sold off for a song is bad for business.\n \nThe paper's reasoning is complex, and it explains the relationship between tax regimes and corporate governance by focusing on an aspect that many analysts already knew: increased tax rates increase how much businesses can steal from their companies. The authors attribute this to higher tax rates resulting in greater efficiency and financial soundness.\n\nIn addition, they argue that increasing the rigour with which taxes are collected allows companies to demonstrate transparency and accuracy in their financial position, thus boosting the overall performance of these companies.\n\nLastly, it's worth mentioning that the increased tax enforcement may contribute to the growth of the stock market in Russia.\n", "smollm:1.7b": "The article argues that increasing tax enforcement in Russia can lead to increased dividend payments and profits for companies, as well as increased transparency and financial soundness. The authors also argue that this is a good thing because it leads to more efficient allocation of resources and greater economic growth. However, the article does not provide any evidence to support these claims.", "deepseek-r1:1.5b": "<think>\nOkay, so I have this text that's pretty dense and I need to summarize it in plain text. Let me read through it carefully.\n\nThe first part is a question: \"Could Yukos be a blessing in disguise?\" They mention something about entrepreneurs being sold off into the market. But then they switch gears and talk about Russian business, especially Sibneft, which was struggling but started getting dividends after Putin came in. It's all about corporate tax policies.\n\nI think I need to pick out the key points. The text is discussing whether a tough tax policy benefits Russian companies more than just encouraging investors to sell off their stocks. It mentions that Yukos and Sibneft had issues but now are doing better. There’s also talk about Putin's role in increasing taxes without much enforcement, leading to corporate restructuring.\n\nSo the main idea is that tougher tax policies have improved corporate practices despite being done poorly by government officials. The economy is getting more stable because companies list shares internationally and have consistent financial reporting. This makes investors feel safer and their profits better off.\n</think>\n\nCould Yukos be a blessing in disguise?  \n\nOther things being equal, the notion of entrepreneurs languishing in jail while their companies are sold off for a song ought to be bad for business.  \n\nBut in modern Russia, despite a tough tax approach, it's becoming more orderly and law-abiding. Companies list shares on international exchanges, produce consistent financial statements, and foreign direct investment grows. However, the model assumes clear motivations—companies maximizing profit, governments maximizing tax revenue. In reality, businesses and the government often connect via bribery. Tax enforcement is seen as Western but has erratic legal moves.  \n\nThe analysis suggests that tougher taxes may improve corporate practices even when officials don't act correctly. Sibneft's story shows how tough taxes can lead to restructuring, benefiting companies without investors feeling safe. The economic recovery reflects a more stable corporate landscape since 2000.", "tinyllama:1.1b": "The author contends that while modern Russia experiences poor corporate governance, higher tax rates increase the amount of undeclared income and force companies to become more transparent, leading to a more efficient financial system and a net increase in revenue. The authors argue that this increased efficiency is made possible by enforcement of tax laws and the implementation of a model based on rigorous tax policies that encourage companies to become more transparent. They explain that this improvement can be seen as a good thing for Russian businesses, particularly those targeted by fiscal police raids during the period when Putin became president. The authors suggest that increased efficiency and financial soundness can compensate for higher corporate tax rates.", "tinydolphin:1.1b": " The report provided by the Centre for Economic Policy Research (CEPR) suggests that companies in Russia would benefit from increased tax enforcement and more rigorous auditing, which could lead to an increase in dividend payments outside of the company's shareholders. This could potentially translate into higher profits and, ultimately, higher revenue for Russian companies. The authors suggest that this could also be beneficial for Russian citizens and businesses by encouraging more transparent corporate governance and increased tax revenue. However, they acknowledge that there are complications with the analysis, such as the presence of undisclosed income within the company, which would require a more sophisticated model to fully capture these relationships. Overall, while the authors do not explicitly argue against the idea of entrepreneurs being languished in jail while their companies were sold off for a song, they acknowledge that the increased use of tax enforcement might be beneficial for businesses and investors alike.", "phi:2.7b": " The study argues that increased tax enforcement in Russia has benefited all companies, even those targeted by the tax police. It suggests that more rigorous tax policing can lead to greater transparency and financial soundness, resulting in more accurate financial statements and increased dividends for shareholders. While some Russian analysts already knew this, the paper provides a complex analysis of the relationship between tax regimes and corporate governance. The authors argue that after Vladimir Putin's presidency, the Russian government focused on enforcement rather than increasing taxes. This led to higher taxes being paid by companies, which were more likely to be transparent and efficient as a result. The case of Sibneft is used as an example, where increased tax enforcement led to greater transparency and financial stability for the company. While this analysis makes sense in theory, it may not apply in practice due to the complex nature of Russia's business environment, including close ties between big business and government officials. Additionally, recent examples of inconsistent law enforcement have affected investor confidence and market performance.\n", "orca-mini:3b": " Could Yukos be a blessing in disguise? Other things being equal, the notion of entrepreneurs languishing in jail while their companies are sold off for a song might be bad for business. But in the looking-glass world of modern Russia, the opposite might just be true according to a new report from the Centre for Economic Policy Research. The study argues that more rigorous tax policing has benefited all Russian firms, even targets of the tax police. An increase in tax enforcement can increase the amount outside shareholders will receive, even accounting for increased levels of taxation. In the West, higher tax rates translate far more smoothly into higher government revenues. However, increasing the rigour with which taxes are collected encourages companies to become more transparent, forcing them to be able to demonstrate their financial position far more accurately. The net result, the authors say, is that the extra amount companies pay in tax is more than compensated for by greater efficiency and financial soundness. After Vladimir Putin became president in 2000, he did not raise taxes but put a lot of effort - too much, critics argue - into enforcement. Since then, the Russian stock market has more than trebled in value, a rise the authors attribute at least in part to the newly tough approach. The report highlights the case of Sibneft, a Russian oil company that came close to merging with Yukos last year. After Mr Putin came to power, the company's overall effective tax rate rose from 2.6% to 10.4%, and Sibneft was the target of a series of aggressive raids by fiscal police. But shareholders benefited hugely: Sibneft started to pay dividends - $53m in 2000 and almost $1bn in 2001 - and closed down the network of opaque subsidiaries it had previously used for siphoning off unofficial funds. According to the authors, although a variety of changes were sweeping through Russian industry at the time, the increase in tax enforcement is the only likely explanation for the change of fortunes at Sibneft and many of its peers.", "hermes3:3b": "Summary of \"Could Yukos be a blessing in disguise?\":\n\nStudy argues that increased tax enforcement benefits all Russian firms even if targeted, as it increases efficiency and financial soundness more than compensated for by greater theft due to higher undeclared income value. Example given: Sibneft's tax increase led to increased dividends and more transparent financial position after Mr Putin came to power. However, the model does not fully cover complexities of Russian business-government connections and unclear enforcement.", "stablelm-zephyr:3b": "A new report from the Centre for Economic Policy Research suggests that Russia's more rigorous tax enforcement may be benefiting all companies, including targets of the tax police, rather than just those subjected to a harsh treatment like Yukos. The study argues that an increase in tax enforcement can lead to greater dividends and other income outside shareholders receive, while increasing tax rates encourages managers to steal more as undeclared income becomes more valuable. Since Vladimir Putin became president in 2000, the Russian stock market has trebled in value, partly due to the newly tough approach.", "chatgpt-4o-latest": "The report from the Centre for Economic Policy Research argues that despite the harsh treatment of Yukos, increased tax enforcement in Russia has benefited businesses by improving transparency and financial soundness. The study suggests that while higher tax rates often lead to more corporate theft, stricter enforcement compels companies to be more accountable, ultimately benefiting shareholders. Under Vladimir Putin, tax enforcement intensified without raising rates, contributing to a tripling of the Russian stock market's value. The case of Sibneft illustrates this trend, as its tax rate increased, yet it became more profitable and transparent. However, the report overlooks complexities such as the close ties between business and government, which can lead to selective enforcement. The unpredictable nature of tax enforcement, exemplified by the Yukos case, has raised concerns that political motives rather than fiscal discipline drive government actions, leading to market instability.", "stablelm2:1.6b": "A new report from the Centre for Economic Policy Research suggests that increased tax enforcement can benefit all Russian firms, even those targeted by tax police. The paper argues that more rigorous tax policing increases the amount of dividends and other income declared by companies, despite increased levels of taxation. In the West, higher tax rates result in greater government revenue. This analysis holds merit because corporate Russia has become far more orderly and law-abiding since 2000. However, the model assumes clear motivation from various parties: companies seek to maximize profit, while governments want to maximize tax revenue. The case against Yukos has moved in fits and starts due to varying government intentions and investor confidence that legal action will be carried out faithfully.", "granite3.1-dense:2b": "A new report from the Centre for Economic Policy Research suggests that increased tax enforcement in post-Soviet Russia, led by President Vladimir Putin since 2000, has benefited all domestic firms, even those initially targeted by the tax police. The study argues that while higher tax rates can encourage managerial theft due to undeclared income's increased value, rigorous tax collection promotes corporate transparency and efficiency. This shift has led to improved financial reporting, increased dividend payments, and enhanced overall financial health for companies like Sibneft, which saw its effective tax rate rise from 2.6% to 10.4% under Putin's rule. As a result, the Russian stock market has more than tripled in value.\n\nHowever, the analysis has limitations. The model assumes clear-cut motivations for corporate actions and government objectives, ignoring the entrenched connections between Russian businesses and the government, often facilitated by bribery. Additionally, the authors' definition of tax enforcement may not accurately represent how laws are enforced in practice, as seen in Yukos' case, where arrested founder Mikhail Khodorkovsky's detention has likely deterred foreign investment and raised uncertainty among investors. Consequently, the Russian market experienced a 10% drop following Khodorkovsky's imprisonment.", "reference": "But it argues that more rigorous tax policing has benefited all Russian firms, even targets of the tax police.The calculations demonstrated what many Russian analysts already knew: that increasing the tax rate increases the amount that managers steal, since undeclared income becomes relatively more valuable.The net result, the authors say, is that the extra amount companies pay in tax is more than compensated for by greater efficiency and financial soundness.Since then, the Russian stock market has more than trebled in value, a rise the authors attribute at least in part to the newly tough approach.The report highlights the case of Sibneft, a Russian oil company that came close to merging with Yukos last year.\"An increase in tax enforcement can increase the amount [of dividends and other income] outside shareholders will receive, even accounting for increased levels of taxation,\" the authors say.According to the authors, although a variety of changes were sweeping through Russian industry at the time, the increase in tax enforcement is the only likely explanation for the change of fortunes at Sibneft and many of its peers.Genuine, disinterested tax collection might well work wonders in Russia; the problem with recent examples has been the erratic and unpredictable way laws are enforced.And the authors' definition of tax enforcement seems unrealistically Western.The paper's reasoning is complex, and is based on a sophisticated model of the relationship between tax regimes and corporate governance - in particular, the propensity of management to steal from the company.On the other hand, increasing the rigour with which taxes are collected encourages companies to become more transparent, forcing them to be able to demonstrate their financial position far more accurately.For all its faults, corporate Russia has become far more orderly and law-abiding since 2000."}