{"raw_text": "Air China in $1bn London listing\n \n China's national airline is to make its overseas stock market debut with a dual listing in London and Hong Kong, the London Stock Exchange (LSE) has said.\n \n Air China plans to raise $1bn (£514m) from the flotation. Share trading will begin on 15 December, the LSE said. For China's aviation authorities, the listing is part of the modernisation of its airline sector to cope with soaring demand for air travel. No further details of the share price or number of shares were given.\n \n The LSE has been working hard to woo Chinese companies to choose London, rather than New York for their listings. It opened an Asia-Pacific office in Hong Kong last month. \"We are delighted that Air China has chosen London for its listing outside China,\" said LSE chief executive Clara Furse. \"The London Stock Exchange offers ambitious Chinese companies access to the world's most international equity market combined with high regulatory and corporate governance standards,\" she said. A spokesman for the LSE said: \"We've been engaged with them (Air China) for about 18 months, two years now.\" As part of its pitch to bring listings to London, the LSE is thought to be highlighting the extra costs and red-tape imposed by new US laws passed since the Enron scandal, whilst stressing London's strong regulatory environment.\n \n Germany's Chancellor Gerhard Schroeder began a three-day visit to Beijing on Monday by signing a deal worth 1bn euros ($1.3bn; £690m) for Airbus to sell 23 new planes to Air China, the Deutsche Welle radio station reported. China's booming economy has created huge demand for air travel among middle-class Chinese, turning the country into a sales battleground between rival plane makers Airbus and Boeing. Air China's long-awaited flotation is part of a strategy to modernise a dozen state-owned carriers, which have been reorganised into three groups under Air China, China Southern and China Eastern. Merrill Lynch are sole bookrunners for Air China's flotation, which will take the form of a share placing with institutional investors in London, though retail investors may be able to buy Air China shares in Hong Kong. Air China's primary listing will be in Hong Kong, with a secondary listing in London. The shares will be denominated in Hong Kong dollars. However, investors may be wary of Chinese stocks. The collapse last week of China Aviation Oil, the Singapore-listed arm of a Chinese jet fuel trader, has cast the spotlight on corporate governance shortcomings at Chinese firms.\n", "llama3.2:1b": "Air China plans to make its overseas stock market debut with dual listings in London and Hong Kong. It is expected to raise $1bn from the flotation. The listing is part of Air China's modernisation efforts to cope with soaring demand for air travel. The LSE has been working to woo Chinese companies to choose London for their listings, citing high regulatory standards and access to a global market.", "llama3.2:3b": "Air China is making its overseas stock market debut with a dual listing in London and Hong Kong, raising $1bn. Share trading begins on December 15, and the move aims to modernize China's airline sector as demand soars. The London Stock Exchange has been working to attract Chinese companies, highlighting regulatory benefits over US listings.", "gemma2:2b": "Air China is listing its shares in London and Hong Kong for $1 billion, starting December 15th.  The LSE worked to attract Air China away from New York listings by highlighting London's strong regulatory environment. This move comes amid growing demand for air travel in China, prompting a modernization effort among state-owned carriers. The listing will be done through a share placing with institutional investors and the primary listing will be in Hong Kong. \n", "qwen2.5:0.5b": "Air China's dual listing with London and Hong Kong stock markets follows an ambitious plan to modernize its airline sector. This decision reflects Air China's efforts to cater to increased air travel demand in China. The LSE is seeking to attract foreign companies, particularly from Germany, by presenting them with benefits of the London Stock Exchange while minimizing administrative hurdles. The deal involves Airbus selling 23 new planes to Air China and the company's share flotation taking the form of a Hong Kong listing followed by a secondary London placement for retail investors. There are concerns about corporate governance at Chinese firms.", "qwen2.5:1.5b": "Air China plans to list its shares on both the London Stock Exchange and Hong Kong Exchanges & Clearing Ltd., aiming for $1 billion in initial capital raise while modernizing its aviation sector with overseas listings. The LSE's Clara Furse highlights London's regulatory standards as attractive alternatives to US-listings. Airbus signs a $1 billion deal with Air China, leveraging the UK's strong regulatory environment against US legislation post-Enron scandal. China's booming economy drives increased demand for air travel, prompting Air China reforms and overseas listings strategies.", "qwen2.5:3b": "Air China is set to raise $1bn through a dual listing in London and Hong Kong by flotation. The deal aims to modernize China's airline sector and follows Air China's strategy to reorganise 12 state-owned carriers into three groups: Air China, China Southern, and China Eastern. The LSE has been working to attract Chinese companies, highlighting its regulatory standards and comparative lack of new US laws' red tape compared to New York. Additionally, Chancellor Gerhard Schroeder signed a $1.3bn deal for 23 Airbus planes with Air China in Beijing.", "opencoder:1.5b": "Air China, in $1bn London listing\n\nChina's national airline is making its overseas stock market debut with a dual listing in London and Hong Kong. Share trading will begin on 15 December, the LSE said.\n\nThe London Stock Exchange has been working hard to woo Chinese companies for choosing London. It opened an Asia-Pacific office in Hong Kong last month, saying \"We are delighted that Air China has chosen London for its listing outside China.\"\n\nA spokesman for the LSE said: \"We've been engaged with them (Air China) for about 18 months, two years now.\" As part of its pitch to bring listings to London, the LSE is thought to be highlighting the extra costs and red-tape imposed by new US laws passed since the Enron scandal. \n\nGermany's Chancellor Gerhard Schroeder began a three-day visit to Beijing on Monday, signing a deal worth 1bn euros ($1.3bn; £690m) for Airbus to sell 23 new planes to Air China.\n\nChina's booming economy has created huge demand for air travel among middle-class Chinese, turning the country into a sales battleground between rival plane makers Airbus and Boeing.\n\nAir China's long-awaited flotation is part of a strategy to modernise a dozen state-owned carriers. The shares will be denominated in Hong Kong dollars.\n\nInvestors may be wary of Chinese stocks. The collapse last week of China Aviation Oil, the Singapore-listed arm of a Chinese jet fuel trader, has cast the spotlight on corporate governance shortcomings at Chinese firms.\n", "smollm:1.7b": "Air China is expected to raise $1bn (£514m) from its London listing and will issue 23 new planes to Airbus, according to sources. The company plans to list in Hong Kong as well as London, with a secondary listing in New York. The listing is part of a strategy by Chinese airlines to modernise their fleets and compete more effectively in the global market. No further details on the share price or number of shares were given.\nThe London Stock Exchange (LSE) has been working hard to attract Chinese companies to choose London for their listings, offering high regulatory and corporate governance standards as well as access to the world's most international equity market combined with low costs and high competitiveness. The LSE is thought to be highlighting the extra costs and red-tape imposed by new US laws passed since the Enron scandal, while stressing London's strong regulatory environment.\nGermany's Chancellor Gerhard Schroeder began a three-day visit to Beijing on Monday by signing a deal worth 1bn euros ($1.3bn; £690m) for Airbus to sell 23 new planes to Air China, the Deutsche Welle radio station reported. The deal is part of a strategy by Chinese airlines to modernise their fleets and compete more effectively in the global market. No further details on the share price or number of shares were given.\nAir China's long-awaited flotation is expected to take place in Hong Kong, with a secondary listing in London. Air China will issue 23 new planes to Airbus, according to sources. The company plans to list in both Hong Kong and London, with a secondary listing in New York. The listing is part of a strategy by Chinese airlines to modernise their fleets and compete more effectively in the global market. No further details on the share price or number of shares were given.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving key ideas and details. Let me read through it carefully.\n\nThe main event is that Air China is listing for the first time in London and Hong Kong. The London Stock Exchange is involved, raising $1 billion. They plan a share trading on December 15th. There are no specific details provided about the stock price or shares, just that they're part of modernizing their airline sector.\n\nThe LSE has been working to attract more companies to list in Asia-Pacific, especially London. They opened an office in Hong Kong last month. Clara Furse says London's regulatory environment and ambitious companies' access make it appealing. She also mentions the 18 months relationship with Air China.\n\nThere's a deal between Germany's Schroeder and Air China for 23 planes, worth $1.3 billion. This is part of a global sales race against Airbus and Boeing. Air China's listing aims to modernize their carriers, which are being reorganized into three groups.\n\nMerrill Lynch are leading the listing, with Hong Kong shares primary listed and London secondary. Retail investors can buy Hong Kong shares, but there's some uncertainty about Chinese stocks due to recent financial turmoil at companies like China Aviation Oil.\n\nI need to condense this without losing important points: Air China's debut in two cities, funding from LSE, no specific stock price info, the regulatory benefits of London, Germany deal with Beijing, a strategy to modernize carriers, and investor sentiment around Chinese stocks.\n\nLet me make sure I include key elements like listing dates, funding, regulations, German deal details, and investor reactions. Also, mention the split between Hong Kong and London.\n</think>\n\nAir China is conducting its first international debut as part of London Stock Exchange (LSE) stock listings, raising $1 billion from their IPO. The LSE has chosen to list it in both London and Hong Kong. No specific share price details are provided but highlight LSE's efforts to attract companies with ambitious profiles. Germany's Schroeder plans a deal for 23 planes for Air China worth $1.3 billion, aiming to challenge competitors like Airbus and Boeing. The Air China's listing will be institutional investors' shares in Hong Kong, while retail investors can buy Hong Kong shares as well. Retail investors may face uncertainty due to recent financial challenges at companies like China Aviation Oil.", "tinyllama:1.1b": "Air China is set to make its overseas stock market debut with a dual listing in London and Hong Kong, as part of a modernisation of the country's aviation sector to cope with growing demand for air travel among mid-class Chinese. The LSE has been working hard to encourage more Chinese companies to choose London as their stock market listing destination, highlighting extra costs and red-tape imposed by new US laws since the Enron scandal. Air China's long-awaited float aims to raise $1bn from institutional investors in Hong Kong, while Air China's primary listing will be in Hong Kong. The company plans to raise $1bn through a share placing with retail investors in London. China Southern and China Eastern are also expected to list in Hong Kong. Investors may be wary of Chinese stocks as the recent stockmarket crash of China Aviation Oil has raised concerns over corporate governance shortcomings among Chinese firms.", "tinydolphin:1.1b": " Air China's overseas listing in London and Hong Kong is a significant milestone for the national airline, which aims to secure funds for its aviation sector modernization. Investment banking firm Merrill Lynch is the sole bookrunner for Air China's flotation, which will be a dual listing in London and Hong Kong. The primary listing in Hong Kong with a secondary listing in London will provide investors with better access to the market due to its proximity to major financial hubs.", "phi:2.7b": " Air China is set to make its overseas stock market debut with a dual listing in London and Hong Kong, raising $1bn from the flotation. The LSE will provide access to an international equity market for ambitious Chinese companies. Germany's Chancellor Gerhard Schroeder has signed a deal worth 1bn euros ($1.3bn; £690m) for Airbus to sell 23 new planes to Air China during his visit to Beijing. Air China'a long-awaited flotation is part of its strategy to modernise state-owned carriers, which will be organised into three groups under Air China, China Southern and China Eastern. Merrill Lynch are sole bookrunners for the share placing, which will take place in London but may also allow retail investors to buy Air China shares in Hong Kong. The primary listing will be in Hong Kong, with a secondary listing in London. However, investors may be wary of Chinese stocks due to corporate governance concerns highlighted by the recent collapse of China Aviation Oil.\n", "orca-mini:3b": " Air China plans to raise $1 billion through a London stock listing, with trading beginning on December 15th. The national airline of China is the first Chinese company to list outside of its home country, and the LSE is pitching itself as an attractive venue for Chinese companies due to its strong regulatory environment and reduced red tape compared to US laws. The deal involves Air China signing a deal with Airbus to purchase 23 new planes, and the shares will be denominated in Hong Kong dollars. However, investors may be hesitant to invest in Chinese stocks due to concerns about corporate governance shortcomings at Chinese companies.", "hermes3:3b": "Air China to raise $1bn through London listing, part of modernisation efforts for its aviation sector in response to rising demand. LSE welcomes Chinese companies over US costs and regulatory environment.", "stablelm-zephyr:3b": "Air China, China's national airline, is making its overseas stock market debut with a dual listing in London and Hong Kong. The London Stock Exchange (LSE) said it plans to raise $1bn (£514m). Share trading will begin on 15 December. LSE aims to attract Chinese companies by highlighting the extra costs and red tape imposed by new US laws passed since the Enron scandal, stressing London's strong regulatory environment. As part of its pitch, the LSE is also pointing out that Air China's planned long-awaited flotation is part of a strategy to modernise a dozen state-owned carriers under three groups: Air China, China Southern and China Eastern.", "chatgpt-4o-latest": "Air China plans a $1bn dual listing in London and Hong Kong, marking its overseas stock market debut. The move is part of China's efforts to modernize its airline sector amid rising air travel demand. The London Stock Exchange (LSE) has been actively attracting Chinese firms, emphasizing its regulatory standards and lower costs compared to the U.S. Meanwhile, Germany's Chancellor signed a €1bn deal for Airbus to sell 23 planes to Air China. The flotation, managed by Merrill Lynch, will primarily list in Hong Kong with a secondary listing in London. However, investor confidence in Chinese stocks may be affected by recent corporate governance concerns, such as the collapse of China Aviation Oil.", "stablelm2:1.6b": "China's national airline Air China is set to make its overseas stock market debut with a dual listing in London and Hong Kong, raising $1bn (££m). The listing will allow ambitious Chinese companies access to the world's most international equity market combined with high regulatory and corporate governance standards. Air China plans to trade on December 1st and share trading will begin shortly after. This follows LSE's efforts to attract Chinese companies to choose London over New York for their listings, highlighting extra costs and red-tap imposed by new US laws since the Enron scandal.", "granite3.1-dense:2b": "Air China, China's national airline, is set to launch its first international stock market listing in London and Hong Kong, raising $1 billion (£514m) from the flotation. The LSE has been actively courting Chinese companies to list in London over New York, emphasizing London's robust regulatory environment and low-cost advantages compared to the US. The listing is part of Air China's modernization plan for its state-owned carrier group, which includes China Southern and China Eastern. Merrill Lynch will serve as sole bookrunners for the dual listing, with primary shares in Hong Kong denominated in Hong Kong dollars and a secondary listing in London. The airline's move reflects the growing demand for air travel in China due to its economic boom, making it a competitive market for global plane manufacturers like Airbus and Boeing.", "reference": "Merrill Lynch are sole bookrunners for Air China's flotation, which will take the form of a share placing with institutional investors in London, though retail investors may be able to buy Air China shares in Hong Kong.\"We are delighted that Air China has chosen London for its listing outside China,\" said LSE chief executive Clara Furse.Air China's primary listing will be in Hong Kong, with a secondary listing in London.China's national airline is to make its overseas stock market debut with a dual listing in London and Hong Kong, the London Stock Exchange (LSE) has said.Air China's long-awaited flotation is part of a strategy to modernise a dozen state-owned carriers, which have been reorganised into three groups under Air China, China Southern and China Eastern.A spokesman for the LSE said: \"We've been engaged with them (Air China) for about 18 months, two years now.\"Air China plans to raise $1bn (£514m) from the flotation.The shares will be denominated in Hong Kong dollars."}