{"raw_text": "Arsenal 'may seek full share listing'\n \n Arsenal vice-chairman David Dein has said the club may consider seeking a full listing for its shares on the London Stock Exchange.\n \n Speaking at the Soccerex football business forum in Dubai, he said a full listing was \"one of the options\" for funding after the club moves to its new stadium. The club - which is currently listed on the smaller Ofex share exchange - is due to move into its new 60,000-seater Emirates Stadium at Ashburton Grove for the start of the 2006/07 season. Mr Dein also warned the current level of TV coverage of the Premiership may be reaching saturation level, with signs that match attendances have been dropping off in the first few months of this season.\n \n When Arsenal moves to its new stadium it will see its proportion of turnover from media earnings drop from 52% this season to 34% in two years' time. The club is hoping to increase matchday earnings from 29% to 40% of turnover, and has not ruled out other money-earning means, including a full share listing. \"When the new stadium opens we will go through a thorough financial review,\" Mr Dein said.\n \n \"Listing would be one option, but we are flexible and no decisions have been made on that issue yet. \"We want to be in the best financial health - maybe clubs can do it (listing), Manchester United have been a success.\"\n \n Mr Dein said that, although television money and coverage had driven the English game forward in the past 10 years, he feared there might now be too many games being shown. Since the formation of the Premier League in season 1992/93, Premiership clubs have seen their income from television soar. \"Television has been the driving force over the past 10 years... but we must constantly improve if we want to remain as the world's leading league competition. \"We must monitor the quality of the product and ensure attendances do not decline, and we must balance that with the quantity of exposure on TV too. \"I think we have practically reached saturation point... sometimes I think less is more.\"\n \n The club is funding its move to Ashburton Grove through a number of sources, including debt from banks, from money it already has and will receive in coming years from sponsors, and from the sale of surplus property, including its Highbury Stadium. It is also looking to create new revenue streams from overseas markets, including Asia. \"We have two executives travelling round Japan and China at the moment building relationships with organisations and clubs, and we know our supporters clubs are growing there too, as they are around the world. \"We have got a very good product, so it is very important we go and look at these markets, and make sure we are on the case.\"\n", "llama3.2:1b": "Arsenal may consider seeking a full share listing for its shares on the London Stock Exchange to fund its move to a new stadium and potentially increase matchday earnings. Vice-chairman David Dein has said that a full listing is \"one of the options\" but no decisions have been made yet. The club's proportion of turnover from media earnings will drop from 52% in this season to 34% by two years' time, and they want to increase matchday earnings from 29% to 40%. However, Dein notes that television money may be reaching saturation point due to the success of clubs like Manchester United.", "llama3.2:3b": "Arsenal may seek a full share listing to fund its move to a new stadium, with current TV coverage reaching saturation point and match attendances dropping. The club aims to increase matchday earnings from 29% to 40% of turnover, but is also considering other options, including listing on the London Stock Exchange, citing Manchester United's success as an example.", "gemma2:2b": "Arsenal may consider listing its shares on the London Stock Exchange to fund the move to its new stadium.  The club expects media earnings to decrease after the move, but aims to increase matchday revenue. The club acknowledges potential saturation in TV coverage of English football and plans to explore international markets for expansion. \n", "qwen2.5:0.5b": " Arsenal may consider a full share listing for its new stadium, but details of this option remain unclear. The club aims to increase matchday earnings from 29% to 40%, while television coverage has reached saturation point in recent seasons, with signs that attendances have dropped significantly earlier in the season.", "qwen2.5:1.5b": "Arsenal vice-chairman David Dein suggests Arsenal might seek full share listing after moving to new stadium in Dubai. The club aims for increased matchday earnings and may explore other financial options like a share listing.", "qwen2.5:3b": "Arsenal vice-chairman David Dein suggested seeking a full share listing on the London Stock Exchange to fund the club's move to its new stadium. Currently listed on Ofex, Arsenal will see media earnings drop from 52% to 34% when moving into the Emirates Stadium in 2006/07. Dein also highlighted concerns about match attendances and potential TV saturation, stating that television revenue has driven the Premier League forward but now faces issues of over-exposure. Arsenal is considering other money-earning means including a full share listing alongside increased matchday earnings from 29% to 40%. The club is funding its move through various sources like debt, sponsorship, and property sales, with plans for expanding into overseas markets.", "opencoder:1.5b": "Arsenal 'may seek full share listing' \n\nSaying the club may consider seeking a full listing for its shares on the London Stock Exchange. \n\nSpeaking at the Soccerex football business forum in Dubai, he said a full listing was \"one of the options\" for funding after the club moves to its new stadium. The club - which is currently listed on the smaller Ofex share exchange - is due to move into its new 60,000-seater Emirates Stadium at Ashburton Grove for the start of the 2006/07 season. Mr Dein alsowarned the current level of TV coverage of the Premiership may be reaching saturation level, with signs that match attendances have been dropping off in the first few months of this season.\n\nWhen Arsenal moves to its new stadium it will see its proportion of turnover from media earnings drop from 52% this season to 34% in two years' time. The club is hoping to increase matchday earnings from 29% to 40% of turnover, and has not ruled out other money-earning means, including a full share listing. \"When the new stadium opens we will go through a thorough financial review,\" Mr Dein said. \n\nHe also mentioned that although television money and coverage had driven the English game forward in the past 10 years, he felt there might now be too many games being shown. Since the formation of the Premier League in season 1992/93, Premiership clubs have seen their income from television soar. \"Television has been the driving force over the past 10 years... but we must constantly improve if we want to remain as the world's leading league competition. \"We must monitor the quality of the product and ensure attendances do not decline, and we must balance that with the quantity of exposure on TV too. \"I think we have practically reached saturation point... sometimes I think less is more.\"\n\nThe club is funding its move to Ashburton Grove through a number of sources, including debt from banks, from money it already has and will receive in coming years from sponsors, and from the sale of surplus property, including its Highbury Stadium. It is also looking to create new revenue streams from overseas markets, including Asia. \"We have two executives travelling round Japan and China at the moment building relationships with organisations and clubs, and we know our supporters clubs are growing there too, as they are around the world. \"We have got a very good product, so it is very important we go and look at these markets, and make sure we are on the case.\"\n", "smollm:1.7b": "The summary should be: Arsenal may seek full share listing after moving to Emirates Stadium in Dubai.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text about Arsenal's potential full share listing in its new stadium. Let me read through each part carefully.\n\nFirst, David Dein says Arsenal might seek a full share listing. He mentions the club is moving to a larger stadium and that it could be a funding option after moving. There were concerns about increased TV coverage causing drop-offs, with lower attendance and fewer games being shown.\n\nArsenal expects turnover from media earnings to decrease from 52% to 34% in two years. They aim for higher matchday earnings from 29% to 40%. They're considering a full share listing as one method but are flexible about it. They might also look into other revenue streams from international markets.\n\nThe article also mentions Dein's financial review and their desire for improved TV coverage, balancing the quality of content with increased TV exposure without losing support.\n\nNow, I need to condense this into a concise summary, including key points: possible share listing, moving to a larger stadium, concerns about TV coverage, media earnings changes, matchday earnings increase, flexibility in options, and international revenue plans.\n</think>\n\nArsenal may seek a full share listing as part of its plan to move to a new stadium. The club is likely seeking funding from increased revenue streams and potential stock purchases. Concerns about rising TV coverage with declining attendance are significant. Media earnings will decline from 52% to 34% in two years, while matchday earnings aim to rise from 29% to 40%. They may explore a full share listing but are open to other funding options. The move could also generate revenue from international markets.", "tinyllama:1.1b": "Arsenal 'may seek full share listing'\n\nArsenal vice-chairman David Dein has said that the club may consider seeking a full listing for its shares on the London Stock Exchange. He warned that TV coverage of Premier League matches is reaching a \"saturation point\", and that matchday earnings from media revenue have been dropping off in recent years. Arsenal currently lists on the smaller Ofex share exchange, but Dein warns that matchday earnings may not be able to maintain this level as the club moves into its new stadium at Ashburton Grove. The club is also funding its move to the newly built Highbury Stadium through debt from banks and sponsor money, as well as selling surplus property. Arsenal has been looking to create new revenues streams from overseas markets, including Asia.", "tinydolphin:1.1b": " Arsenal vice-chairman David Dein has revealed that his club may seek a full listing for its shares on the London Stock Exchange. Speaking at the Soccerex football business forum in Dubai, he said that a full listing would be \"one of the options\" for funding after the club moves to its new stadium. The move is expected to take place in September 2006 when Arsenal's current stadium, the smaller Ofex share exchange, will be replaced by its new 60,000-seater Emirates Stadium.", "phi:2.7b": " Arsenal vice-chairman David Dein mentioned that the club may consider seeking a full listing for its shares on the London Stock Exchange as an option for funding after moving to their new stadium. He also expressed concern about the current level of TV coverage and its impact on match attendances, as well as dropping attendance numbers. The club plans to monitor these factors while exploring alternative revenue streams from overseas markets like Asia.\n", "orca-mini:3b": " Arsenal may consider listing its shares on the London Stock Exchange after moving to its new stadium. The club is currently listed on the smaller Ofex exchange but plans to move to a 60,000-seater Emirates Stadium at Ashburton Grove for the start of the 2006/07 season. TV coverage has driven the English game forward in the past 10 years, but there may be too many games being shown. The club is funding its move to Ashburton Grove through a number of sources, including debt from banks, money it already has, and from sponsorships.", "hermes3:3b": "Arsenal considering full stock exchange listing", "stablelm-zephyr:3b": "Arsenal's vice-chairman, David Dein, mentioned that the club may consider seeking a full share listing on the London Stock Exchange after moving to their new stadium. This could be an option for funding, and no decisions have been made yet. Dein also warned that the current level of TV coverage might be reaching saturation, potentially leading to lower match attendances. Arsenal is looking to increase matchday earnings from 29% to 40% of turnover and is considering other money-earning means, such as a full share listing. The club funds their move through debt, existing resources, and revenue from selling surplus property and exploring new markets overseas.", "chatgpt-4o-latest": "Arsenal vice-chairman David Dein stated that the club may consider a full share listing on the London Stock Exchange as one of the options for funding after moving to its new Emirates Stadium in 2006. Currently listed on the smaller Ofex exchange, Arsenal aims to increase matchday earnings while reducing reliance on media revenue. Dein also warned that TV coverage of the Premiership may have reached saturation, potentially affecting match attendance. The club is funding its stadium move through bank debt, sponsorships, and property sales, while also exploring new revenue streams in overseas markets like Asia.", "stablelm2:1.6b": "Arsenal may consider seeking a full listing for its shares on the London Stock Exchange due to funding needs after moving to its new stadium. They hope to increase matchday earnings from 15% to 20% of turnover while also exploring other money-earning means, such..\nThe text talks about Arsenal's possible plan to seek a full share listing for its shares and how it might be a source of funding for their upcoming move to the new Emirates Stadium. The club wants to balance increasing matchday earnings with maintaining quality TV coverage and attendances. They are also looking into overseas markets like Japan and China to create new revenue streams from supporters' clubs.", "granite3.1-dense:2b": "Arsenal's vice-chairman, David Dein, suggested during the Soccerex forum in Dubai that the club might pursue a full share listing on the London Stock Exchange as part of its financial strategy post-new stadium. Currently listed on Ofex, Arsenal is moving to Emirates Stadium for the 2006/07 season, which will reduce media earnings from 52% to 34% over two years while increasing matchday earnings from 29% to 40%. Dein acknowledged concerns about TV coverage saturation and potential declining attendance, emphasizing the need for a balanced approach between TV exposure and live match attendances. The club's financial plan includes debt financing, sponsorships, and sales of Highbury Stadium surplus. Arsenal is also exploring overseas markets like Japan and China to expand revenue streams, recognizing its strong brand as an advantage in these regions.", "reference": "Speaking at the Soccerex football business forum in Dubai, he said a full listing was \"one of the options\" for funding after the club moves to its new stadium.Arsenal vice-chairman David Dein has said the club may consider seeking a full listing for its shares on the London Stock Exchange.The club - which is currently listed on the smaller Ofex share exchange - is due to move into its new 60,000-seater Emirates Stadium at Ashburton Grove for the start of the 2006/07 season.The club is hoping to increase matchday earnings from 29% to 40% of turnover, and has not ruled out other money-earning means, including a full share listing.\"When the new stadium opens we will go through a thorough financial review,\" Mr Dein said.When Arsenal moves to its new stadium it will see its proportion of turnover from media earnings drop from 52% this season to 34% in two years' time.The club is funding its move to Ashburton Grove through a number of sources, including debt from banks, from money it already has and will receive in coming years from sponsors, and from the sale of surplus property, including its Highbury Stadium.Mr Dein also warned the current level of TV coverage of the Premiership may be reaching saturation level, with signs that match attendances have been dropping off in the first few months of this season."}