{"raw_text": "Google shares fall as staff sell\n \n Shares in Google have fallen 6.7% after employees and early investors in the web search took advantage of the first chance to sell their holdings.\n \n Restrictions were imposed ahead of its flotation in August, to prevent shares being dumped quickly onto the market. In one of the most closely-watched initial public offerings in stock market history, the US-based company sold 19.6 million shares at $85 each. Google shares have risen since but fell $12.33 on Tuesday to close at $172.55. The restriction - known as a lockup - is being eased piecemeal: in all, some 227 million additional shares will become free to trade by February 2005. Selling the shares could turn many of Google's workers into millionaires.\n \n There were fears that the potential increase of shares in circulation from Tuesday would ease demand for stock. However, analysts say they expected most shareholders would be holding back from selling all their shares immediately, as Google's good performance and future growth potential means demand will hold.\n \n In its first earnings report since floating on the stock market, Google said it made a net profit of $52m in the three months ending 30 September. Sales surged to $805.9m in the third quarter, up from $393.9m a year earlier. Google's main service - its internet search - is free to users, so the firm makes much of its money from selling advertising space linked to the words for which its users search. It also sells the use of its technology to companies who need to make either their websites, or their internal information systems, searchable.\n", "llama3.2:1b": "Google shares have fallen 6.7% after staff sold around 19.6 million shares at $85 each ahead of flotation in August. Google will sell some 227 million additional shares by February 2005, but analysts expect most shareholders to hold back and keep their shares for at least a year.", "llama3.2:3b": "Shares in Google have fallen 6.7% after employees and early investors sold some of their holdings, taking advantage of the first chance to trade them since the company's initial public offering in August. The easing of restrictions on these shares could turn many workers into millionaires. Despite concerns that this increase would ease demand for stock, analysts expect most shareholders will hold back from selling all their shares immediately due to Google's strong performance and growth potential.", "gemma2:2b": "Google shares fell 6.7% after employees and early investors began selling their holdings due to restrictions being lifted on February 2005. The initial public offering (IPO) saw Google sell 19.6 million shares at $85 each and has seen a rise since but is currently trading at $172.55.  Analysts expect continued demand for the stock, despite some potential supply increase, citing strong performance and future growth potential. Google's profit increased to $52 million in its first earnings report following its IPO, with sales soaring to $805.9 million in Q3. \n", "qwen2.5:0.5b": "Key points:\n\n- Google shares fell 6.7% after employees and early investors sold their holdings.\n- The restriction known as a lockup was imposed ahead of its August flotation, preventing sales for a while.\n- Shares will become free to trade by February 2005; some 227 million additional shares will be available by then.\n- Analysts expect most shareholders to hold back from selling all their shares at once due to Google's good performance and future growth potential.", "qwen2.5:1.5b": "Google's stock fell 6.7% due to employee and early investor sales ahead of initial public offering restrictions being eased.", "qwen2.5:3b": "Google shares fell 6.7% after employees and early investors sold their holdings following August's initial public offering (IPO). The lockup period restricting share sales for those involved in the IPO was lifted, allowing an additional 227 million shares to enter the market by February 2005. Despite fears of easing demand due to increased shares, analysts expected most shareholders would hold back from selling all their shares immediately due to Google's positive performance and growth prospects. In its first earnings report post-IPO, Google reported a net profit of $52m in Q3 with sales reaching $805.9m, primarily through advertising and technology licensing.", "opencoder:1.5b": "Google shares have fallen after employees and early investors took advantage of the first chance to sell their holdings.\n\nRestrictions were imposed ahead of Google's flotation in August to prevent shares from being dumped quickly onto the market.\n\nIn one of the most closely watched initial public offerings in stock market history, US-based company sold 19.6 million shares at $85 each on Tuesday.\n\nThe company has risen since but fell $12.33 to close at $172.55. The restriction - known as a lockup - is being eased piecemeal in all, some 227 million additional shares that will become free to trade by February 2005.\n\nSelling the shares could turn many of Google's workers into millionaires if it means most of Google's investors can afford to take on more work.\n\nThere were fears that the potential increase of shares from Tuesday would ease demand for stock. However, analysts say they expected most shareholders would be holding back from selling all their shares immediately as Google's good performance and future growth potential mean that market demand will hold.\n", "smollm:1.7b": "Google shares fell 6.7% after employees and early investors in the web search took advantage of the first chance to sell their holdings. Restrictions were imposed ahead of its flotation in August to prevent shares being dumped quickly onto the market. In one of the most closely-watched initial public offerings in stock market history, the US-based company sold 19.6 million shares at $85 each. Google shares have risen since but fell $12.33 on Tuesday to close at $172.55. The restriction - known as a lockup - is being eased piecemeal: in all, some 227 million additional shares will become free to trade by February 2005. Selling the shares could turn many of Google's workers into millionaires.\nGoogle's good performance and future growth potential mean demand will hold. Analysts say they expected most shareholders would be holding back from selling all their shares immediately, as Google's good performance and future growth potential means demand will hold.", "deepseek-r1:1.5b": "<think>\nAlright, I'm looking at this query where the user wants me to summarize a given text concisely. They provided a paragraph about Google's stock performance and some related details. The key points are that shares fell by 6.7%, there were restrictions imposed before float, which were later eased with certain additional shares becoming free. There were concerns about potential demand increase affecting stock selling. Also, some earnings data is included.\n\nHmm, the user specified to output only the summary in plain text without any explanations or formatting. So I need to capture all these points succinctly. First, mention the 6.7% drop and that employees sold their shares. Then, explain the restrictions they had and later those being lifted with some additional shares opening up.\n\nI should ensure not to include details about the specific number of shares or analysts' expectations but stick to the main summary points. Also, make sure it's clear and concise, capturing all the essential information without unnecessary fluff.\n</think>\n\nGoogle shares fell 6.7% after employees sold their holdings as part of a rapid stock selling campaign. Restrictions were placed ahead of the IPO in August, designed to prevent early sells on the market. These restrictions were later eased by additional shares becoming freely tradable until February 2005. Since then, Google shares have risen but fell $12.33 to close at $172.55.", "tinyllama:1.1b": "Google's shares fell by 6.7% after employees and early investors took advantage of the first chance to sell. Restrictions were imposed ahead of Google's initial public offering (IPO), preventing sales being dumped quickly onto the market. The US-based company sold 19.6 million shares at $85 each, a figure that has risen since but fell by $12.33 on Tuesday to close at $172.55 per share. The lockup restrictions were being eased in pieces, with some 227 million additional shares potentially becoming free to trade in February 2005. Fear of selling all shares immediately led analysts to expect most shareholders to hold back from selling their stock at first, but this did not necessarily turn out to be the case. In its earnings report for the third quarter, Google reported net profit of $52 million, with sales surging to $805.9 million in the quarter, up from $393.9 million a year earlier. The company made money from selling advertising space linked to words used by users on its search engine and other services that it offers, as well as selling technology for companies to make their websites more user-friendly.", "tinydolphin:1.1b": " Google shares declined in value by around 6.7% after employees and early investors sold their holdings before the market opened on Tuesday. Selling restrictions were introduced ahead of Google's initial public offering (IPO) to prevent shares being sold quickly onto the market, which could have been used as a way for wealthy individuals to buy large amounts at a lower price. As a result, the company's shares fell in value by $12.33 on Tuesday, reaching a low of $172.55. However, this decline was due to an expectation that Google would experience significant growth and demand for its shares might increase once more shares were available to trade. Analysts predicted most shareholders would be holding back from selling all their shares immediately as the potential increase in shares in circulation could lead to increased demand. As a result, Google's first earnings report since its stock market debut is expected to show a net profit of $52 million for the three months ending September 30th. Sales have also grown by around $805 million in the third quarter, up from $393 million a year earlier.", "phi:2.7b": " Google's shares fell 6.7% after employees and early investors sold their holdings ahead of its initial public offering in August. Restrictions were imposed on selling shares immediately, but will be eased by February 2005, potentially turning many employees into millionaires. However, analysts predict that the increased supply of shares won't significantly impact demand for Google stock due to the firm's good performance and future growth potential. In its first earnings report since going public, Google made a net profit of $52m in the third quarter, with sales surging from $393.9m to $805.9m.\n", "orca-mini:3b": " Google's shares fell 6.7% after employees and early investors took advantage of the first chance to sell their holdings due to restrictions imposed ahead of the company's flotation in August. The restrictions are being eased piecemeal, and some 227 million additional shares will become free to trade by February 2005. While fears of increased shares in circulation led to a potential decrease in demand for stock, analysts expect most shareholders to hold back from selling all their shares immediately due to Google's good performance and future growth potential. In its first earnings report since floating on the stock market, Google said it made a net profit of $52m in the three months ending 30 September, while sales surged to $805.9m in the third quarter, up from $393.9m a year earlier. The company's main service is free to users, so the firm makes much of its money from selling advertising space linked to the words for which its users search. It also sells the use of its technology to companies who need to make either their websites or internal information systems searchable.", "hermes3:3b": "Google shares drop after employees sell 6.7% due to lockup restrictions easing, allowing more shares to enter market.", "stablelm-zephyr:3b": "Google's shares fell 6.7% as employees and early investors sold their holdings before the lockup period ended, preventing a rapid increase in the market. Google sold 19.6 million shares at $85 each during its August IPO. Analysts expect most shareholders will hold back from selling all their shares immediately due to demand holding and Google's good performance and future growth potential. In its first earnings report since floating on the stock market, Google announced a net profit of $52m and sales of $805.9m in the third quarter. The company makes money from advertising and selling technology to companies for searchable websites or internal information systems.", "chatgpt-4o-latest": "Google shares fell 6.7% as employees and early investors sold holdings after restrictions from its August IPO were eased. The stock dropped $12.33 to $172.55 amid concerns that increased share availability could reduce demand. However, analysts believe many investors will hold onto shares due to Google's strong performance and growth potential. Google's first earnings report since going public showed a net profit of $52 million for the third quarter, with sales rising to $805.9 million from $393.9 million a year earlier. The company generates revenue primarily from advertising linked to its search service and by licensing its technology.", "stablelm2:1.6b": "Google shares decreased by 6.7% due to employees and early investors selling their shares before the IPO. The initial restrictions were put in place to prevent quick market dumping. Google sold 0.6 million shares at $10 each but will have up to 0.9 million additional shares become free for trading by February. Selling these shares could turn some workers into millionaires, while demand is expected to hold given good performance and future growth potential. In its first earnings report since floating on the stock market, Google made a net profit of $5 million in the three months ending September. Its main service includes internet search which is free to users while generating revenue from selling advertising space and technology sales to companies needing searchable websites or information systems.", "granite3.1-dense:2b": "Google shares dropped 6.7% on Tuesday, falling to $172.55 after employees and early investors sold their first eligible shares following the company's initial public offering (IPO) in August. The restriction, or lockup, limiting these sales ended as planned, with 227 million additional shares becoming tradeable by February 2005. Despite concerns that increased supply might reduce demand, analysts anticipated most shareholders would wait before selling all their holdings due to Google's strong performance and growth potential. In its inaugural earnings report post-IPO, Google reported a net profit of $52 million for the quarter ending September 30, with sales increasing to $805.9 million, up from $393.9 million in the previous year. The company's primary revenue source is its free internet search service, which generates income through targeted advertising and technology licensing.", "reference": "Google shares have risen since but fell $12.33 on Tuesday to close at $172.55.There were fears that the potential increase of shares in circulation from Tuesday would ease demand for stock.In one of the most closely-watched initial public offerings in stock market history, the US-based company sold 19.6 million shares at $85 each.Selling the shares could turn many of Google's workers into millionaires.However, analysts say they expected most shareholders would be holding back from selling all their shares immediately, as Google's good performance and future growth potential means demand will hold."}