{"raw_text": "Turkey turns on the economic charm\n \n Three years after a gruelling economic crisis, Turkey has dressed its economy to impress.\n \n As part of a charm offensive - ahead of 17 December, when the European Union will decide whether to start entry talks - Turkey's economic leaders have been banging the drum to draw attention to recent achievements. The economy is growing fast, they insist. Education levels among its young and large population are rising. Unemployment levels, in percentage terms, are heading fast towards single digits. Inflation is under control. A new law to govern its turbulent banking system is on the cards. The tourism industry is booming and revenues from visitors should more than double to $21bn (£10.8bn) in three years.\n \n Moreover, government spending is set to be frozen and a burdensome social security deficit is being tackled. Income and corporate taxes will be cut next year in order to attract $15bn of foreign investment over the next three years. A loan restructuring deal with the International Monetary Fund (IMF) is pretty much in the can. And following recent macroeconomic restructuring efforts, its currency is floating freely and its central bank is independent.\n \n The point of all this has been to convince Europe's decision makers that rather than being a phenomenally costly exercise for the EU, allowing Turkey in would in fact bring masses of economic benefits.\n \n \"The cake will be bigger for everybody,\" said Deputy Prime Minister Abdullatif Sener earlier this month. \"Turkey will not be a burden for the EU budget.\" If admitted into the EU, Turkey would contribute almost 6bn euros ($8bn; £6bn) to its budget by 2014, according to a recent impact study by the country's State Planning Organisation. As Turkey's gross domestic output (GDP) is set to grow by 6% per year on average, its contribution would rise from less than 5bn euros in 2014 to almost 9bn euros by 2020. Turkey could also help alleviate a labour shortage in \"Old Europe\" once its population comes of age. By 2014, one in four Turks - or about 18 million people - will be aged 14 or less. \"A literate and qualified Turkish population,\" insisted Mr Sener, \"will make a positive impact on the EU.\"\n \n This runs contrary to the popular view that Turkey is getting ready to dig deep into EU taxpayers' wallets. However, Turkey's assertions are confirmed by Brussels' own impact studies, which indeed say that Turkish membership would be good news for the EU economy. But only over time. Costs are projected to be vast during the early years of Turkey's membership, with subsidies alone estimated to exceed 16.5bn euros and, according to some predictions, balloon to 33.5bn euros. This would include vast agricultural subsidies and regional aid, though such payments should decline as the country's farm sector, which currently employs one in three Turks, would employ just one in five by 2020.\n \n Such high initial expenses would be coupled with risks that the benefits flagged up by Turkey's government would never be delivered, say those who feel the Turkish project should be shunned.\n \n Some fear that rather than providing an educated, sophisticated labour force for Europe at large, the people who will leave Turkey to seek work abroad will be poor, uneducated - and plentiful. More recently, less palatable concerns - at least in liberal European circles - have been voiced, with senior EU or member state officials talking darkly of a \"river of Islam\", an \"oriental\" culture and a threat to Europe's \"cultural richness\". Of course, many opponents are politically motivated - their views ranging from xenophobic prejudices about the country's Muslim traditions to well-documented concerns about the government's human rights record. Yet their economic arguments should not be dismissed out of hand.\n \n Critics insist that much of the optimism about Turkey's economic roadmap has been over-egged - an argument amplified by a 134% rise in the country's current account deficit to $10.7bn during the first 10 months of this year.\n \n The country's massive debt - which includes $23bn owed to the IMF and billions borrowed via the international bond markets - also remains a major obstacle to its ambition of joining the EU. \"In the new member states of the European Union, gross public debt is typically about 40% of gross domestic product,\" says Reza Moghadam, assistant director of the IMF's European Department. \"At about 80% of GDP, Turkey's gross debt is double that figure.\" Turkey's debts have largely arisen from its efforts to push through banking reform after a run on the banks in 2001 caused the country's devastating recession. \"There is no question that although Turkey is doing much better than in the past, it remains quite vulnerable,\" says Michael Deppler, director of the IMF's European Department. \"Its debt is far too high for an emerging economy.\" A key factor for EU decision makers should be whether or not Turkey has met its economic criteria. But economics is not a science. And although the state of Turkey's economy is important, as is its pace of reform, the final decision on 17 December will be taken by politicians who will, of course, be guided by their political instincts.\n", "llama3.2:1b": "Turkey's economic charm offensive focuses on drawing attention to recent achievements in areas such as growth, education levels, unemployment rates, and inflation control. The government aims to persuade EU decision-makers that membership would bring significant benefits, including foreign investment. However, critics argue that the costs of membership could outweigh these benefits.", "llama3.2:3b": "Turkey is projecting economic growth and achievements ahead of EU membership talks on December 17, including rising education levels, low unemployment, booming tourism, and a growing economy with inflation under control. The country aims to attract foreign investment and improve its banking system. However, critics argue that the optimism about Turkey's economic roadmap has been over-egged, citing a large current account deficit and massive debt, which could pose a burden on EU taxpayers.", "gemma2:2b": "Turkey is presenting itself in a positive light to the EU ahead of entry talks.  Their argument emphasizes strong economic growth, low unemployment rates, control of inflation, and ambitious reforms.  It's argued that Turkey will bring substantial benefits to the EU economy while contributing minimally to its costs. Some critics argue that these claims are overoptimistic due to Turkey's high debt level and a potential influx of poorly educated labor into the EU market.   The decision by EU member states on December 17th will be influenced by both economic considerations and political factors.  \n", "qwen2.5:0.5b": "Turkey emphasizes its growing economic capabilities and contributions to the EU by entering the European Union. The country’s GDP is expected to grow at an average rate of 6%, making it a major contributor to the EU budget. However, Turkey's economy has high initial expenses due to large current-account deficits, which are projected to balloon to about $33.5 billion in three years and rise to almost $108 billion by 2020. These costs include subsidies for agricultural production and regional aid. Critics of the project argue that it is over-estimated due to a 40% current-account deficit, but economists point out that Turkey's debt-to-GDP ratio remains high at about 80%. The EU would likely be hesitant to approve if Turkey does not meet its economic criteria, but the country has made significant progress in recent years and can make up for past mistakes.", "qwen2.5:1.5b": "Turkish leaders are making a charm offensive ahead of EU accession talks in December to highlight recent economic improvements and future benefits for both Turkey and Europe. Key points include:\n- Rapid growth, rising education levels, low unemployment rates, inflation under control.\n- New banking law, growing tourism industry expected to triple revenue to $21bn in three years.\n- Government spending freeze, social security deficit tackled, IMF loan restructuring deal signed.\n- Future benefits: EU contribution of €6bn by 2020 from growing GDP, alleviating labor shortage as population ages. Critics point out high initial costs and fears over poor quality migration to the EU due to economic optimism.", "qwen2.5:3b": "Turkey is showcasing recent economic achievements to EU leaders ahead of potential accession talks in December. Key points include:\n- Economic growth, rising education levels and falling unemployment.\n- Tourism boom expected to double revenues to $21bn over 3 years.\n- Government plans to freeze spending and tackle a social security deficit.\n- Plans for IMF loan restructuring and independent central bank.\nTurkish officials argue accession would bring economic benefits despite initial costs. However, concerns exist about potential high costs during early years, risks of unqualified immigrants, and political motivations. Critics highlight Turkey's large debt and 134% current account deficit. EU decision on admission hinges on meeting economic criteria guided by political considerations.", "opencoder:1.5b": "Turkey turns on the economic charm \n\nThree years after gruelling economic crisis, Turkey has dressed its economy to impress. \n\nAs part of a charm offensive, ahead of European Union decision, Turkey's economic leaders have been banging the drum to draw attention to recent achievements. The economy is growing fast, they insist. Education levels among its young and large population are rising. Unemployment levels, in percentage terms, are heading fast towards single digits. Inflation is under control. A new law to govern turbulent banking system is on the cards. \n\nThe tourism industry is booming and revenues from visitors should more than double to $21bn (£10.8bn) in three years. Moreover, government spending is set to be frozen and a burdensome social security deficit is being tackled. Income and corporate taxes will be cut next year in order to attract $15bn of foreign investment over the next three years. A loan restructuring deal with the International Monetary Fund (IMF) is pretty much in the can. \n\nFollowing recent macroeconomic restructuring efforts, its currency is floating freely and its central bank is independent. \n\nThe point of all this has been to convince Europe's decision makers that rather than being a phenomenally costly exercise for the EU, allowing Turkey in would in fact bring masses of economic benefits.\n\nTurkey has contributed almost 6bn euros ($8bn; £6bn) to its budget by 2014, according to a recent impact study. As Turkey’s gross domestic output (GDP) is set to grow by 6% per year on average, its contribution would rise from less than 5bn euros in 2014 to almost 9bn euros by 20th century. \n\nTurkey could also alleviate a labour shortage in \"Old Europe\" once its population comes of age. By 2014, one in four Turks - or about 18 million people - will be aged 14 or less. \n\nThis runs contrary to the popular view that Turkey is getting ready to dig deep into EU taxpayers' wallets. However, Turkey's assertions are confirmed by Brussels’ own impact studies, which indeed say that Turkish membership would be good news for the EU economy. \n\nSuch high initial expenses would be coupled with risks that the benefits flagged up by Turkey’s government would never be delivered, say those who feel the Turkish project should be shunned.\n\nCritics argue that much of the optimism about Turkey's economic roadmap has been over-egged - an argument amplified by a 134% rise in the country's current account deficit to $10.7bn during the first 10 months of this year. \n\nThe country’s massive debt – which includes $23bn owed to the IMF and billions borrowed via the international bond markets – also remains a major obstacle to its ambition of joining the EU.\n", "smollm:1.7b": "Summarize the following text concisely, preserving key ideas and details. The text is about a country's economic development and its future prospects in relation to EU membership.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text about Turkey turning on its economic charm. Let me read through it carefully.\n\nFirst, Turkey has been trying to impress the European Union, especially before December 17 when they'll start talks. They've made several points: the economy is growing fast with rising education levels, unemployment dropping below single digits, inflation under control, and a new banking law in the offing. Tourism is booming too, generating $21bn in three years.\n\nThen, there are government spending freezes and cuts on taxes to attract foreign investment. They've also restructured their debt with the IMF, which should help them bridge the deficit. Turkey's population aging might reduce labor shortages in Europe once adults come of age.\n\nSener earlier said that if they join the EU, Turkey will contribute almost 6bn euros annually, about half of the EU budget by 2014. The country's GDP is expected to grow 6% per year on average.\n\nThere are also concerns about initial high expenses and potential delays in delivering benefits, which some fear might be too ambitious for the EU. Experts say their economic measures could help but require time and political support.\n\nTurkey has faced a massive debt issue from its banking reforms post-2001 and is vulnerable due to high debt levels. They've stressed that while they have good points, it's not a science and decisions need political backing.\n\nSo, putting this all together, the summary should highlight Turkey's efforts in attracting EU attention, key economic achievements, initial challenges, and their broader international impact.\n</think>\n\nTurkey has announced efforts to attract the European Union with its economic success. Key points include economic growth, rising education levels, falling unemployment, under control inflation, new banking reforms, booming tourism, aging population, and potential labor shortages in Europe. The EU decision is expected to see Turkey contribute nearly 6bn euros annually, about half of the EU budget by 2014, with GDP growing at a 6% annual rate. High initial spending and debt concerns are noted, with fears about delayed benefits and political resistance.", "tinyllama:1.1b": "TuRkey turns on the charm with a promise to help Europe's economy while aiming for European Union membership. The Turkish government has been working hard to reduce its debt, increase economic growth, and improve public services. As part of a package deal that includes EU accession talks and loan restructuring deals with IMF, the country is expected to meet financial criteria before the decision on Turkey's membership in December 2015. With a burdensome social security deficit but a highly educated workforce, Europe's decision-makers are convinced that admitting Turkey will bring economic benefits such as higher GDP growth and more jobs for young people. While criticism of the projected costs outweighs concerns about the impact on culture or language, critics argue that much is at stake for Europe's cultural richness and culutural norms. The final decision will be based on political considerations, but with Turkey's economic prospects looking promising, EU decision-makers are looking beyond Europe's troubled debt markets to secure a bright future for their members.", "tinydolphin:1.1b": " Turkish leaders argue that joining the European Union (EU) would help boost the country's economy and provide a much-needed source of foreign investment. This is due to Turkey's significant economic achievements in recent years, which include improving education, reducing inflation, attracting large numbers of tourists, and increasing its foreign currency earnings. \n\nThe EU has been considering Turkey's application for membership since 2009. Many critics argue that the benefits for Turkey would not be significant enough to warrant joining the EU, citing concerns about a \"river of Islam\" entering Europe or a threat to European cultural richness. However, the economic impact of accepting Turkey into the EU is seen as a positive for Europe as a whole.\n\nInitiatives such as the impact study by Turkey's State Planning Organisation and the European Commission's own impact studies have projected that joining the EU would lead to significant economic benefits. According to these studies, Turkey's membership in the EU would be good news for the EU economy. \n\nThis has led some EU member states and institutions, such as France and Germany, to express optimism about Turkey's prospects of becoming a full-fledged member. However, concerns persist regarding the impact on European cultures, including religious tolerance and the preservation of cultural heritage.\n\nIn summary, joining the European Union for Turkey would provide significant economic benefits, boosting its economy and potentially improving the quality of life for its citizens. This could lead to more educated and qualified workers contributing to its growth and prosperity, while also helping Europe avoid some of the pitfalls associated with rapid industrialization in regions such as Central Eastern Europe.", "phi:2.7b": " The text summarises Turkey's efforts to improve its economy and convince Europe of the benefits of admitting it into the European Union (EU). Turkey has seen positive economic growth and a decrease in unemployment levels, which have led to promises of further reforms such as reducing government spending and attracting foreign investment. However, some critics argue that the country's debt is still too high for an emerging economy, and there are concerns about human rights and a potential influx of unskilled workers from Turkey to Europe. Ultimately, EU decision makers will consider both economic and political factors when deciding whether or not to admit Turkey into the EU.\n", "orca-mini:3b": " Turkey has turned on charm to showcase recent achievements in the economy, including a fast-growing economy, rising education levels, and falling inflation. The government plans to freeze spending and tackle a social security deficit, while also hoping to attract $15bn of foreign investment over the next three years through cuts in income and corporate taxes. A loan restructuring deal with the IMF is also in progress. Some worry that Turkey's optimism may be overcooked, especially with a 134% rise in its current account deficit this year. However, EU decision-makers will likely weigh these economic achievements against concerns about high debts and a lack of cultural richness.", "hermes3:3b": "Key summary:\n- Turkey attempts to showcase economic improvement for European Union entry talks.\n- Recent achievements include rapid economic growth, increased education levels, low unemployment rates, inflation control, and banking reform.\n- Government spending is set to freeze, social security deficit tackled, and tax cuts are planned.\n- Economic benefits are expected to be substantial over time but come with risks of high initial expenses and debt issues.", "stablelm-zephyr:3b": "Turkey has undergone significant economic reforms in recent years to impress potential European Union (EU) members ahead of entry talks on 17 December. The economy is growing quickly, with inflation under control and a new banking law on the horizon. Turkey's tourism industry is also booming, with revenues from visitors expected to more than double to $21bn over the next three years. Government spending will be frozen, and income and corporate taxes will be cut next year to attract $15bn of foreign investment over the next three years. Brussels' own impact studies suggest that Turkish membership would bring economic benefits to the EU over time, despite high initial expenses and concerns about the quality of its workforce and cultural compatibility. Critics argue that much of Turkey's optimism regarding its economic prospects has been overstated, and that its massive debt remains a significant obstacle to joining the EU. The final decision on whether to admit Turkey will be taken by EU politicians based on their political instincts.", "chatgpt-4o-latest": "Turkey has made significant economic progress following a severe crisis, aiming to strengthen its case for EU membership ahead of the 17 December decision. The government highlights rapid economic growth, rising education levels, declining unemployment, controlled inflation, and a booming tourism sector. Fiscal policies include freezing government spending, addressing the social security deficit, and cutting taxes to attract foreign investment. A loan restructuring deal with the IMF is nearly complete, and the central bank operates independently. Turkey argues that EU membership would bring economic benefits rather than burdens, projecting contributions to the EU budget to grow significantly by 2020. However, critics warn of high initial costs, including substantial subsidies, and question whether Turkey can deliver on its promises. Concerns also include a large current account deficit, high public debt, and doubts about the quality of labor migration. While economic factors are crucial, the final EU decision will ultimately be influenced by political considerations.", "stablelm2:1.6b": "Turkey's economy has been revamped to impress European Union entry talks ahead of December, with recent achievements including a growing economy, rising education levels and low unemployment rates. Inflation is under control, and the tourism industry is booming with projected visitor revenues tripling within three years. A new banking law will be implemented, government spending will be frozen, and a social security deficit being tackled to attract foreign investment. Turkey's GDP is expected to grow by 6% annually, contributing almost 9 billion euros ($8.7bn; £6.8bn) to the EU budget by 2044 if it joins. However, critics warn that such benefits may not be realized due to high initial expenses, concerns about a \"river of Islam\" and threats to Europe's cultural richness.", "granite3.1-dense:2b": "Turkey, three years after an economic crisis, is presenting a revitalized image to the European Union (EU) as it prepares for entry talks on 17 December. Economic leaders highlight rapid growth, rising education levels, low unemployment, controlled inflation, and a thriving tourism industry projected to double revenues to $21bn by 2014. Key achievements include government spending freezing, addressing social security deficits, tax cuts for foreign investment, and currency independence.\n\nTurkey claims that EU membership would yield significant economic benefits: a growing GDP contribution of nearly 6 billion euros by 2014, rising to almost 9 billion by 2020; alleviating Europe's labor shortage as one in four Turks reaches adulthood. These projections counter the notion that Turkey would impose a financial burden on the EU.\n\nBrussels' impact studies support Turkish optimism, estimating economic benefits over time. However, initial costs could exceed 16.5 billion euros, with subsidies and regional aid declining as the agricultural sector's workforce diminishes from one in three to one in five by 2020.\n\nCritics express skepticism about Turkey's optimistic projections, citing concerns over an educated yet poor, unskilled labor force and potential cultural dilution. Some senior EU officials even warn of a \"river of Islam\" or threat to Europe's cultural richness. Economic arguments are dismissed as politically motivated by opponents; however, these concerns should not be ignored.\n\nTurkey faces substantial debt, including $23 billion owed to the IMF and billions borrowed through international bonds, which is double the typical level for European Union members (about 40% of GDP). Debt levels, arising from banking reform following a 2001 bank run, remain high at around 80% of GDP.\n\nUltimately, EU decision-makers will balance economic criteria and political instincts when deciding Turkey's fate on 17 December. The state of the Turkish economy and pace of reform are crucial factors, but politics will play a significant role in the final determination.", "reference": "If admitted into the EU, Turkey would contribute almost 6bn euros ($8bn; £6bn) to its budget by 2014, according to a recent impact study by the country's State Planning Organisation.Critics insist that much of the optimism about Turkey's economic roadmap has been over-egged - an argument amplified by a 134% rise in the country's current account deficit to $10.7bn during the first 10 months of this year.As Turkey's gross domestic output (GDP) is set to grow by 6% per year on average, its contribution would rise from less than 5bn euros in 2014 to almost 9bn euros by 2020.Three years after a gruelling economic crisis, Turkey has dressed its economy to impress.However, Turkey's assertions are confirmed by Brussels' own impact studies, which indeed say that Turkish membership would be good news for the EU economy.A key factor for EU decision makers should be whether or not Turkey has met its economic criteria.The point of all this has been to convince Europe's decision makers that rather than being a phenomenally costly exercise for the EU, allowing Turkey in would in fact bring masses of economic benefits.\"Turkey will not be a burden for the EU budget.\"The country's massive debt - which includes $23bn owed to the IMF and billions borrowed via the international bond markets - also remains a major obstacle to its ambition of joining the EU.Costs are projected to be vast during the early years of Turkey's membership, with subsidies alone estimated to exceed 16.5bn euros and, according to some predictions, balloon to 33.5bn euros.\"At about 80% of GDP, Turkey's gross debt is double that figure.\"Turkey's debts have largely arisen from its efforts to push through banking reform after a run on the banks in 2001 caused the country's devastating recession.The tourism industry is booming and revenues from visitors should more than double to $21bn (£10.8bn) in three years.\"In the new member states of the European Union, gross public debt is typically about 40% of gross domestic product,\" says Reza Moghadam, assistant director of the IMF's European Department.Such high initial expenses would be coupled with risks that the benefits flagged up by Turkey's government would never be delivered, say those who feel the Turkish project should be shunned.And although the state of Turkey's economy is important, as is its pace of reform, the final decision on 17 December will be taken by politicians who will, of course, be guided by their political instincts."}