{"raw_text": "Amex shares up on spin-off news\n \n Shares in American Express surged more than 8% on Tuesday after it said it was to spin off its less profitable financial advisory subsidiary.\n \n The US credit card to travel services giant said off-loading American Express Financial Advisors (AEFA) would boost its profitability. AEFA has more than 12,000 advisers selling financial advice, funds and insurance to 2.5 million customers. Over the years it has delivered poor profits and even some losses.\n \n \"This is an excellent move by American Express to focus on its core businesses, and sell off a laggard division, which has been a problem for quite some time,\" said Marquis Investment Research analyst Phil Kain. Analysts estimate that a stand-alone AEFA could have a market value of $10bn (£5.3bn). The unit was acquired by American Express 20 years ago as Investors Diversified Service, of Minneapolis, at a time when firms were amassing one-stop financial empires. However, the business of selling investments was never integrated with the rest of the group.\n", "llama3.2:1b": "American Express shares surged 8% after it announced plans to spin off its less profitable financial advisory subsidiary AEFA. The move aims to boost profitability by separating out a struggling division that has delivered poor profits and losses over the years. Analysts estimate a standalone AEFA could be worth $10bn.", "llama3.2:3b": "American Express shares rose over 8% after announcing it will spin off its less profitable subsidiary American Express Financial Advisors, which has delivered poor profits for nearly two decades and operates a large network of advisers. The move is expected to boost profitability as AEFA's market value could reach $10bn.", "gemma2:2b": "American Express shares rose more than 8% after announcing it will spin off its less profitable financial advisory subsidiary, American Express Financial Advisors (AEFA). The spinoff is expected to boost profitability by focusing on core businesses and separating a lagging division. Analysts estimate AEFA could have a $10 billion market value as a standalone unit.  \n", "qwen2.5:0.5b": "American Express’ shares have risen on the news that it is to split its less profitable financial advisory subsidiary AEFA into a stand-alone company.", "qwen2.5:1.5b": "American Express shares rose after announcing plans to spin off its less profitable financial advisory subsidiary, AEFA, citing improved profitability from focusing on core businesses and potentially doubling AEFA's market value. The unit, which includes over 12,000 advisers selling financial advice, funds, and insurance, has faced poor profits for decades. Analysts estimate a standalone AEFA could be worth $10 billion (£5.3 billion).", "qwen2.5:3b": "Amex shares surged over 8% after announcing plans to spin off its less profitable financial advisory subsidiary, American Express Financial Advisors (AEFA). With more than 12,000 advisers serving 2.5 million customers, AEFA has consistently delivered poor profits and even losses. Analysts estimate a stand-alone AEFA could have a market value of $10bn (£5.3bn). Amex hopes focusing on its core businesses will benefit from selling off this division, which it purchased in 20 years ago as Investors Diversified Service.", "opencoder:1.5b": "American Express shares up after a spin-off news. The US credit card giant is expected to boost profitability by off-loading its subsidiary. It has more than 12,000 advisers selling financial advice, funds and insurance to a million customers over the years. \"This is an efficient move for American Express,\" said Marquis Research analyst Phil Kain. Estimates suggest that an AEFA unit could have a market value of approximately $10 billion in U.S. dollars. The acquisition was made in 2007 as part of the Investors Diversified Service, which opened new avenues for investors looking to diversify their portfolios.\n", "smollm:1.7b": "The summary is concise and to the point, capturing the main points from the original text:\n\n1. Amex shares up on spin-off news (shares in American Express)\n2. Shares in American Express surged more than 8% on Tuesday after it said it was to spin off its less profitable financial advisory subsidiary (AEFA)\n3. The US credit card to travel services giant said off-loading American Express Financial Advisors (AEFA) would boost its profitability\n4. AEFA has more than 12,000 advisers selling financial advice, funds and insurance to 2.5 million customers\n5. Over the years it has delivered poor profits and even some losses\n6. This is an excellent move by American Express to focus on its core businesses, and sell off a laggard division (AEFA) which has been a problem for quite some time\n7. Analysts estimate that a stand-alone AEFA could have a market value of $10bn (£5.3bn)\n8. The unit was acquired by American Express 20 years ago as Investors Diversified Service, of Minneapolis, at a time when firms were amassing one-stop financial empires\n9. However, the business of selling investments was never integrated with the rest of the group\n\nThe summary captures the main points from the original text, including:\n\n* The main idea: Amex shares up on spin-off news (shares in American Express)\n* The supporting details: Shares in American Express surged more than 8% on Tuesday after it said it was to spin off its less profitable financial advisory subsidiary (AEFA)\n* The key takeaway: Shares in American Express Financial Advisors (AEFA) would boost profitability if sold off as a standalone unit\n* The supporting details: AEFA has more than 12,000 advisers selling financial advice, funds and insurance to 2.5 million customers; over the years it has delivered poor profits and even some losses\n* The key takeaway: This is an excellent move by American Express to focus on its core businesses and sell off a laggard division (AEFA) which has been a problem for quite some time\n* The supporting details: Analysts estimate that a stand-alone AEFA could have a market value of $10bn (£5.3bn); the unit was acquired by American Express 20 years ago as Investors Diversified Service, of Minneapolis; over the years it has delivered poor profits and even some losses\n* The key takeaway: This is an excellent move by American Express to focus on its core businesses and sell off a laggard division (AEFA) which has been a problem for quite some time\n\nThe summary captures the main points from the original text, including the main idea, supporting details, and key takeaways.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Amex spinning off its financial advisory subsidiary. The user wants only the summary in plain text without explanations or any formatting.\n\nFirst, the main points are that shares surged because Amex is divesting AEFA. AEFA has a lot of advisers and customers but hasn't made profits. They say it's good for profitability. There's an analyst's quote about focusing on core businesses. The current value estimate is $10 billion, which seems high. They mention it was bought 20 years ago as Investors Diversified Service, and investment wasn't integrated with the company yet.\n\nSo I should capture all these key points: share surge due to divesting, AEFA's size and lack of profits, analyst's opinion, estimated value, and history of the acquisition. Make sure it's concise and includes all important details without any extra explanations or formatting.\n</think>\n\n shares surged more than 8% on Tuesday after Amex announced that its less profitable financial advisory subsidiary, American Express Financial Advisors (AEFA), would be divested, signaling a shift in focus from advising to core business operations. AEFA had over 12,000 advisers and funds sold to 2.5 million customers, but faced poor profits and even some losses, though it hasn’t gone into debt as much as others. The company is set to sell off 95% of its AEFA unit, an estimated $10 billion, with investors noting the potential shift in strategy.", "tinyllama:1.1b": "American Express has reportedly announced plans to spin off its less profitable financial advisory subsidiary, American Express Financial Advisors (AEFA). The unit's sale is estimated to be worth $10bn (£5.3bn) and is expected to boost the company's profitability in the short term, while also enhancing its core businesses. This move by the credit card giant is seen as an excellent opportunity for the spin-off, with Marquis Investment Research analyst Phil Kain estimating that a standalone AEFA could have a market value of $10bn (£5.3bn).", "tinydolphin:1.1b": " Amex shares up on spin-off news - American Express (AMEX) announced plans to split its financial advisory subsidiary, American Express Financial Advisors (AEFA), into two separate businesses. This decision is expected to result in a significant boost to AEFA's profitability and potentially raise the value of the spun-off unit. Analysts have estimated the standalone value of AEFA at $10 billion, implying a 53% increase in value from its current market capitalization.", "phi:2.7b": " American Express has announced that it will spin off its less profitable financial advisory subsidiary, American Express Financial Advisors (AEFA), to boost profitability and focus on its core businesses. Over 12,000 advisers would be affected by this move, which is expected to have a market value of $10 billion. This decision was made as part of the group's efforts to streamline operations and improve performance in the financial services sector.\n", "orca-mini:3b": " American Express shares surged 8% on Tuesday after it announced plans to spin off its less profitable financial advisory subsidiary. The move is aimed at boosting profitability and will involve selling off AEFA, a unit that has been struggling for some time due to poor profits and losses. Analysts estimate that the standalone AEFA could have a market value of $10bn. The divestiture is part of American Express's broader strategy to focus on its core businesses and improve overall profitability.", "hermes3:3b": "American Exch. shares rise over 8% on spin-off of less profitable financial advisory subsidiary AEFA, expected to boost profitability.", "stablelm-zephyr:3b": "American Express shares surged 8% following the announcement of its plan to spin off its less profitable financial advisory subsidiary, American Express Financial Advisors (AEFA). The move is expected to boost profitability as AEFA, which has 12,000 advisers serving 2.5 million customers, has delivered poor profits and losses in the past. Analysts estimate that a stand-alone AEFA could have a market value of $10 billion.", "chatgpt-4o-latest": "American Express shares rose over 8% after announcing plans to spin off its less profitable financial advisory unit, American Express Financial Advisors (AEFA). The move aims to enhance profitability, as AEFA has struggled with poor profits and occasional losses. AEFA, which has 12,000 advisers serving 2.5 million customers, was acquired 20 years ago but was never fully integrated into the company. Analysts estimate AEFA could be valued at $10 billion as a standalone entity. Experts view the spin-off as a strategic decision to focus on core businesses and divest a lagging division.", "stablelm2:1.6b": "Amex shares jumped 8% due to spinning off its less profitable subsidiary, American Express Financial Advisors (AEFA), which advises on travel services, funds, and insurance for 2.5 million customers. The spin-off aims to boost profitability by focusing on core businesses while AEFA retains a potential market value of $10 billion (£5.3 billion).", "granite3.1-dense:2b": "American Express shares surged by over 8% on Tuesday following the company's announcement to spin off its less profitable subsidiary, American Express Financial Advisors (AEFA). AEFA, a financial advisory division with more than 12,000 advisers serving 2.5 million customers, has historically generated poor profits or losses. This move is expected to enhance American Express' core businesses by focusing on its credit card and travel services. Analysts anticipate that a standalone AEFA could be valued at around $10 billion (£5.3 billion). The division, previously known as Investors Diversified Service, was acquired 20 years ago during the trend of consolidating financial empires. Despite this acquisition, the investment sales aspect never integrated effectively with American Express' core operations.", "reference": "The US credit card to travel services giant said off-loading American Express Financial Advisors (AEFA) would boost its profitability.The unit was acquired by American Express 20 years ago as Investors Diversified Service, of Minneapolis, at a time when firms were amassing one-stop financial empires.Shares in American Express surged more than 8% on Tuesday after it said it was to spin off its less profitable financial advisory subsidiary.AEFA has more than 12,000 advisers selling financial advice, funds and insurance to 2.5 million customers."}