{"raw_text": "Tobacco giants hail court ruling\n \n US tobacco companies have welcomed an appeal court's decision to reject the government's $280bn (£155bn) claim for alleged deceit about smoking dangers.\n \n Tobacco stocks rose sharply on Wall Street after the 2-1 decision. The court in Washington found the case - filed by the Clinton administration in 1999 - could not be brought under federal anti-racketeering laws. Anti-smoking groups urge the government to fight on, but the Justice Department has not said if it will appeal. Among the accused were Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group and Brown and Williamson. They were delighted by the decision, which sent Reynolds shares up 4.5% and Altria shares up 5.11%.\n \n Charles A Blixt, executive vice-president of RJ Reynolds Tobacco, said the ruling \"dramatically transforms\" the government's lawsuit. Altria Group said, in a statement, the government now \"must not only prove that the companies have engaged in fraudulent behaviour in the past, but that they are likely to do so in the future.\"\n \n The government had claimed tobacco firms\n \n \n  - manipulated nicotine levels to increase addiction \n  - targeted teenagers with multi-billion dollar advertising campaigns \n  - lied about the dangers of smoking and ignored research to the contrary. \n  \n \n Prosecutors wanted the cigarette firms to \"disgorge\" $280bn in profits accumulated over the past 50 years and impose tougher rules on marketing their products. They brought the case under racketeering laws, which were passed to deny mafia gangs the profits of their crimes. But the tobacco companies denied that they illegally conspired to promote smoking and defraud the public. They also said they had already met many of the government's demands in a landmark $206bn settlement reached with 46 states in 1998. The three-judge panel in the District of Columbia's Court of Appeals ruled on Friday that the US government could not sue the firms under the anti-racketeering laws. Judge David Sentelle, in his ruling, said such laws were aimed at putting an end to illegal conduct going forward. \"We hold that the language of (the law) and the comprehensive remedial scheme of (the law) preclude disgorgement as a possible remedy in this case,\" he wrote. The Justice Department refused to say if it would appeal. \"All we're saying today is that we have received the ruling and are reviewing it,\" a spokeswoman said on Friday. But William Corr of the Campaign for Tobacco-Free Kids urged the government to continue pressing its case. \"Today's ruling should not be an excuse for this administration to seek a weak settlement that lets the tobacco industry off the hook,\" he said.\n", "llama3.2:1b": "US tobacco companies have welcomed a court ruling that rejected a $280bn claim by the US government against alleged deceit about smoking dangers. The company will see stock prices rise after the decision, which found the case could not be brought under federal anti-racketeering laws. The government had accused tobacco firms of manipulating nicotine levels and targeting teenagers with advertising campaigns.", "llama3.2:3b": "US tobacco companies welcome court decision rejecting $280bn claim, rejecting anti-racketeering lawsuit filed by Clinton administration in 1999, which alleged deceit about smoking dangers, with companies saying they must prove fraudulent behavior in the future and accusing them of already meeting demands through a 1998 landmark settlement.", "gemma2:2b": "US tobacco companies welcomed a court decision rejecting the $280 billion US government lawsuit alleging they deceived the public about smoking dangers. The court ruled the case could not be brought under federal anti-racketeering laws, finding that such laws were meant to end illegal conduct going forward and not for disgorgement of past profits.  Tobacco companies had argued they already met many of the government's demands in a previous settlement with 46 states. The Justice Department hasn't stated if it will appeal the ruling.  Anti-smoking groups urge the government to continue its case. \n", "qwen2.5:0.5b": "US tobacco companies welcomed a court ruling, rejecting accusations from the Clinton administration over alleged deceit about smoking dangers. RJ Reynolds Tobacco and Altria Group expressed satisfaction with the decision, while Brown and Williamson warned they had already met government demands in their $206bn settlement. The appeal was likely to result in tougher marketing rules for tobacco firms, not a refund of 280 billion dollars as initially suggested.", "qwen2.5:1.5b": "US tobacco companies celebrate court victory, with shares rising after the 2-1 decision rejecting the government's $280bn anti-smoking lawsuit under federal racketeering laws. This ruling allows firms to avoid disgorging profits and imposing tougher marketing rules, despite previously agreeing to settle for $206bn over state claims. The Justice Department has yet to comment on whether it will appeal.", "qwen2.5:3b": "US tobacco companies welcomed a court decision rejecting the government's $280bn claim alleging deceit about smoking dangers. Tobacco stocks rose on Wall Street after the 2-1 ruling in Washington, finding the case could not be brought under federal anti-racketeering laws. The government claimed firms manipulated nicotine levels, targeted teens, and lied about smoking risks. The court ruled against the government's lawsuit under racketeering laws aimed at preventing future illegal conduct rather than disgorging past profits. Altria Group and RJ Reynolds Tobacco were among those hailed by the decision, with their stocks rising sharply. The Justice Department has not announced if it will appeal. William Corr from the Campaign for Tobacco-Free Kids urged the government to continue its case despite the ruling.", "opencoder:1.5b": "Tobacco giants hail court ruling, US tobacco companies have welcomed an appeal court's decision to reject the government's $280bn (£155bn) claim for alleged deceit about smoking dangers. The court in Washington found the case - filed by the Clinton administration in 19xx - could not be brought under federal anti-racketeering laws. Anti-smoking groups urge the government to fight on, but the Justice Department has not said if it will appeal. Among the accused were Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group and Brown and Williamson. They were delighted by the decision, which sent Reynolds shares up 4.5% and Altria shares up 5.11%. Charles A Blixt, executive vice-president of RJ Reynolds Tobacco said the ruling \"dramatically transforms\" the government's lawsuit. Altria Group said, in a statement, the government now \"must not only prove that the companies have engaged in fraudulent behaviour in the past, but that they are likely to do so in the future.\" The government had claimed tobacco firms - manipulated nicotine levels to increase addiction; targeted teenagers with multi-billion dollar advertising campaigns; lied about the dangers of smoking and ignored research to the contrary. Prosecutors wanted the cigarette firms to \"disgorge\" $280bn in profits accumulated over the past 50 years and impose tougher rules on marketing their products. They brought the case under racketeering laws, which were passed to deny mafia gangs the profits of their crimes. But the tobacco companies denied that they illegally conspired to promote smoking and defraud the public. They also said they had already met many of the government's demands in a landmark $206bn settlement reached with 46 states in 1998. The three-judge panel in the District of Columbia's Court of Appeals ruled on Friday that the US government could not sue the firms under the anti-racketeering laws. Judge David Sentelle, in his ruling, said such laws were aimed at putting an end to illegal conduct going forward. \"We hold that the language of (the law) and the comprehensive remedial scheme of (the law) preclude disgorgement as a possible remedy in this case,\" he wrote.\n", "smollm:1.7b": "The US tobacco companies have welcomed an appeal court's decision to reject the government's $280bn (£155bn) claim for alleged deceit about smoking dangers. The court in Washington found the case - filed by the Clinton administration in 1999 - could not be brought under federal anti-racketeering laws. Anti-smoking groups urge the government to fight on, but the Justice Department has not said if it will appeal. Among the accused were Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group and Brown and Williamson. They were delighted by the decision, which sent Reynolds shares up 4.5% and Altria shares up 5.11%. Charles A Blixt, executive vice-president of RJ Reynolds Tobacco, said the ruling \"dramatically transforms\" the government's lawsuit. Altria Group said, in a statement, the government now \"must not only prove that the companies have engaged in fraudulent behaviour in the past, but that they are likely to do so in the future.\" Prosecutors wanted the cigarette firms to \"disgorge\" $280bn in profits accumulated over the past 50 years and impose tougher rules on marketing their products. They brought the case under racketeering laws, which were passed to deny mafia gangs the profits of their crimes. But the tobacco companies denied that they illegally conspired to promote smoking and defraud the public. They also said they had already met many of the government's demands in a landmark $206bn settlement with 46 states in 1998. The three-judge panel in the District of Columbia's Court of Appeals ruled on Friday that the US government could not sue the firms under the anti-racketeering laws. Judge David Sentelle, in his ruling, said such laws were aimed at putting an end to illegal conduct going forward. \"We hold that the language of (the law) and the comprehensive remedial scheme of (the law) preclude disgorgement as a possible remedy in this case,\" he wrote. The Justice Department refused to say if it would appeal. \"All we're saying today is that we have received the ruling and are reviewing it,\" a spokeswoman said on Friday. But William Corr of the Campaign for Tobacco-Free Kids urged the government to continue pressing its case. \"Today's ruling should not be an excuse for this administration to seek a weak settlement that lets the tobacco industry off the hook,\" he said.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text. The user provided a detailed news article about US tobacco companies appealing against a court decision regarding their claims of deceit in relation to smoking dangers. They have highlighted key points such as the court's ruling, the companies' responses, and the implications for tobacco stocks.\n\nFirst, I should identify the main events: the court ruled against the government's claim, which led to positive stock movements for tobacco companies. The companies are now vying over future claims.\n\nI need to make sure that all important details like the decision-making process, specific companies involved, their statements, and the Justice Department's stance are included concisely.\n\nAlso, I should avoid any explanations or formatting since the user specified. Just a plain text summary with key ideas.\n</think>\n\nThe US tobacco giants have welcomed a court ruling to reject the government's $280bn claim about deceit in claiming smoking dangers. The court found the case too vague for federal anti-racketeering laws, urging the government to fight and seek a dismissal of the case. Anti-smoking groups oppose the decision, while the Justice Department hasn't ruled on it. Tobacco stocks rose due to this ruling, with companies like RJ Reynolds tobacco benefiting from shares rising 5.11%. Altria Group shared a statement demanding past fraudulent behavior must be shown in the future. The government claimed companies manipulated nicotine levels, targeted teenagers, and lied about smoking dangers. These companies denied illegal cooperation with mafia groups, seeking a $206bn landmark settlement with 46 states, which is now being reviewed after the court decision. The Justice Department hasn't decided yet. Charles A Blixt of RJ Reynolds tobacco said the ruling \"dramatically transforms\" the case.", "tinyllama:1.1b": "The court ruled that US tobacco companies, including RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group and Brown & Williamson, can continue to defend themselves against charges of deceitful marketing practices in a landmark $280bn ($155bn) racketeering case. However, the court rejected the government's claims that the companies had committed fraudulent behavior dating back to 1999 and manipulated nicotine levels in products to increase addiction among teenagers. The three-judge panel ruled that the country's anti-racketeering laws did not apply to corporations and could not be used to prosecute companies over past decisions. Despite this ruling, campaigners have urged the US government to continue pressing its case, citing a lack of evidence of criminality in the firms' past business practices.", "tinydolphin:1.1b": " A US court has ruled that US tobacco companies can avoid paying $280bn in claims of deceit about the risks of smoking, rejecting claims made by the US government. The court based its decision on a ruling filed in 1999, which cleared the way for litigation against tobacco firms. This comes after a 2-1 verdict, with the majority ruling that the government's case could not be brought under federal anti-racketeering laws. This decision is expected to have far-reaching implications for the industry, as it allows the tobacco companies to challenge the claims made in the $206bn settlement reached between 46 states and the US government in 1998. The court's ruling represents a significant shift in how toxic substances are regulated and has sparked debate about the extent of government intervention in the tobacco industry. The three-judge panel found that the US government could not sue the firms under the anti-racketeering laws, but ruled that the companies could be forced to disgorge profits generated over the past 50 years and impose more stringent rules on marketing their products. The ruling is expected to have significant implications for the industry, as it allows the tobacco firms to challenge claims made in the $206bn settlement reached between 46 states and the US government in 1998.", "phi:2.7b": " US tobacco companies have won a court appeal in their $280bn lawsuit against the government, which accused them of lying about smoking dangers and targeting teenagers with advertising campaigns. The ruling under anti-racketeering laws means the government cannot sue the firms for future fraudulent behavior. Prosecutors had wanted the companies to pay back profits from over 50 years of deception, but the tobacco companies denied any wrongdoing and reached a settlement with 46 states in 1998.\n", "orca-mini:3b": " The court ruled against the US government's claim for $280bn in damages against tobacco companies, stating that the federal anti-racketeering laws do not allow such lawsuits. Tobacco giants hailed the decision, with some shareholders pleased by the rise in their stock prices. The government had accused the companies of manipulating nicotine levels to increase addiction, targeting teenagers with multi-billion dollar advertising campaigns, and lying about the dangers of smoking. However, the companies denied these claims and said they have already met many of the demands made in a 1998 settlement with states. The Justice Department has not said if it will appeal. Anti-smoking groups urged the government to continue fighting, but the decision may give the tobacco industry an excuse to avoid further legal action.", "hermes3:3b": "US tobacco companies welcome appeal court decision rejecting $280bn lawsuit over alleged deceit about smoking dangers, as they were found unable to sue under anti-racketeering laws.", "stablelm-zephyr:3b": "US appeal court rejects $280bn claim by US government against tobacco companies, accusing them of deceit regarding smoking dangers. Tobacco stocks rise on Wall Street following the decision. Anti-smoking groups urge the government to continue fighting; Justice Department has not yet announced whether it will appeal. The government claimed tobacco firms manipulated nicotine levels, targeted teenagers with advertising campaigns, and lied about the dangers of smoking while ignoring research to the contrary.", "chatgpt-4o-latest": "US tobacco companies welcomed a court ruling rejecting the government's $280bn claim for alleged deceit about smoking dangers. The Washington appeals court ruled 2-1 that the case, filed in 1999, could not be pursued under federal anti-racketeering laws. Tobacco stocks rose sharply following the decision. The government had accused firms of manipulating nicotine levels, targeting teenagers, and lying about smoking risks, seeking to recover profits and impose stricter marketing rules. The companies denied wrongdoing, citing a 1998 $206bn settlement with 46 states. The court ruled that racketeering laws were meant to prevent future illegal conduct, not recover past profits. The Justice Department has not decided whether to appeal, while anti-smoking groups urge continued legal action.", "stablelm2:1.6b": "US tobacco companies celebrate an appeal court's decision to reject the federal government's claim over alleged deceit about smoking dangers. The court ruled that the case filed by the Clinton administration cannot be brought under federal anti- racketeering laws; however  the Justice Department has not said if it will appeal. Among the accused are Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group and Brown and Williamson; they were delighted by the decision which sent Reynolds shares up 4.5% and Altria shares up 5%. The government claimed tobacco firms manipulated nicotine levels to increase addiction, targeted teenagers with multi-billion-dollar advertising campaigns, lied about the dangers of smoking, ignored research to the contrary and profited from their fraudulent activities.", "granite3.1-dense:2b": "US appeals court has ruled 2-1 against the government's $280bn claim of deceit by tobacco companies regarding smoking dangers, filed under federal anti-racketeering laws in 1999 by the Clinton administration. The ruling denies the government's demand for disgorgement of profits and imposition of stricter marketing regulations. Tobacco giants like Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group, and Brown & Williamson saw their stocks rise following the decision. Charles A Blixt of RJ Reynolds and an Altria Group statement highlighted that the government now must prove ongoing fraudulent behavior by these companies. Anti-smoking groups urge the government to persist in its lawsuit, but the Justice Department has not confirmed whether it will appeal. Judge David Sentelle emphasized that anti-racketeering laws were intended for future illegal activities, not reparations or stricter regulations on past conduct.", "reference": "Anti-smoking groups urge the government to fight on, but the Justice Department has not said if it will appeal.Charles A Blixt, executive vice-president of RJ Reynolds Tobacco, said the ruling \"dramatically transforms\" the government's lawsuit.US tobacco companies have welcomed an appeal court's decision to reject the government's $280bn (£155bn) claim for alleged deceit about smoking dangers.\"Today's ruling should not be an excuse for this administration to seek a weak settlement that lets the tobacco industry off the hook,\" he said.Among the accused were Altria Group, RJ Reynolds Tobacco, Lorillard Tobacco, Liggett Group and Brown and Williamson.Altria Group said, in a statement, the government now \"must not only prove that the companies have engaged in fraudulent behaviour in the past, but that they are likely to do so in the future.\"The three-judge panel in the District of Columbia's Court of Appeals ruled on Friday that the US government could not sue the firms under the anti-racketeering laws.The government had claimed tobacco firms   - manipulated nicotine levels to increase addiction - targeted teenagers with multi-billion dollar advertising campaigns - lied about the dangers of smoking and ignored research to the contrary."}