{"raw_text": "Cactus diet deal for Phytopharm\n \n A slimming aid made from a southern African cactus is set to be developed by UK firm Phytopharm and Unilever.\n \n Anglo-Dutch food giant Unilever will help the pharmaceutical firm develop the snacks containing Hoodia extract. Phytopharm shares jumped 10.7% on the news, with analysts saying sales of $600m (£309m) a year were possible. The plant, licensed to Phytopharm in 1997, has been used for thousands of years by the Sans bushmen of the Kalahari desert to stave off hunger. Studies have reportedly shown the plant curbs appetite instead of reducing calorific intake like many existing products.\n \n Phytopharm will receive an initial fee of £6.5m from Unilever - out of a potential total of £21m - as well as future royalties on product sales. Under the deal, production of the Hoodia cactus at Phytopharm's nursery in South Africa will also rise from eight million plants to potentially hundreds of millions, said Phytopharm chief executive Richard Dixey. The firm had initially hoped to market a slimming drug from Hoodia with Pfizer. But the research collaboration came to an end in 2003. Analysts said Unilever could launch the new products in 2007. \"This deal goes a long way to restoring the market faith in Phytopharm's pipeline after the Pfizer exit,\" said analyst Erling Refsum at Nomura.\n", "llama3.2:1b": "A UK firm Phytopharm and US company Unilever are partnering on a slimming aid made from Hoodia extract, a cactus used by the Kalahari desert's Sans bushmen to stave off hunger for thousands of years. The deal involves an initial fee of £6.5m, with potential future royalties on product sales worth up to £21m.", "llama3.2:3b": "Phytopharm, UK-based firm, will develop slimming aids with Unilever using Hoodia extract from a southern African cactus; initial fee £6.5m, potential sales £600m/year; production expected to increase significantly.", "gemma2:2b": "Phytopharm and Unilever have partnered to develop slimming snacks containing Hoodia extract. This will result in increased production of Hoodia plants by Phytopharm, with potential sales of $600 million annually.  The deal includes a significant upfront payment from Unilever and royalties on product sales. \n", "qwen2.5:0.5b": "A slimming aid from Hoodia cactus is set for development by UK firm Phytopharm, with Unilever contributing £6. 5m and future royalties on sales. Phytapharm shares are up 10. 7% after the news. It is hoped to use the drug to fight obesity instead of lowering calorie intake, a study says.", "qwen2.5:1.5b": "Phytopharm has partnered with Unilever to develop snacks containing Hoodia extract, potentially leading to $600 million annual sales and a rise in production from 8 million plants to hundreds of millions. Initial fees for the deal include £6.5 million and future royalties. The partnership aims to revive market confidence after the research collaboration with Pfizer ended in 2003.", "qwen2.5:3b": "A cactus-based slimming aid developed by UK firm Phytopharm and Unilever, with support from Anglo-Dutch food giant Unilever, is set to be launched. The plant, used by South African Bushmen for centuries to curb appetite rather than reduce caloric intake, will likely generate $600m annually. Phytopharm will receive an initial £6.5m fee and future royalties on product sales from the deal. Production of Hoodia cactus at its nursery in South Africa is expected to increase dramatically. The collaboration with Unilever comes after a failed research partnership with Pfizer, leading analysts to believe products could be launched by 2007.", "opencoder:1.5b": "Cactus diet deal for Phytopharm\n\nAnglo-Dutch food giant Unilever will help the pharmaceutical firm develop the snacks containing Hoodia extract. The plant, licensed to Phytopharm in 1997, has been used for thousands of years by the Sans bushmen of the Kalahari desert to stave off hunger. Studies have reportedly shown the plant curbs appetite instead of reducing calorific intake like many existing products. Under the deal, production of the Hoodia cactus at Phytopharm's nursery in South Africa will also rise from eight million plants to potentially hundreds of millions.\n", "smollm:1.7b": "The summary is concise and focuses on the key points of the text:\n\n1. Cactus diet deal for Phytopharm: This refers to a potential partnership between Unilever and Phytopharm, a UK-based company, to develop a slimming aid made from a southern African cactus.\n2. Anglo-Dutch food giant Unilever will help: The British multinational Unilever will assist in the development of the snacks containing Hoodia extract, which is used by the Sans bushmen of the Kalahari desert for centuries to stave off hunger.\n3. Sales of $600m (£309m) a year are possible: Based on market research and sales data, it's estimated that the company can sell around $600 million (approximately £309 million) in slimming products per year.\n4. Phytopharm will receive an initial fee of $6.5m from Unilever: The UK-based company will pay an initial fee of $6.5 million to Unilever for the rights to develop and market the slimming aid, as well as future royalties on product sales.\n5. Future royalties on product sales: In addition to the initial fee, Phytopharm can expect to earn a royalty of 10% on each unit sold of the slimming drug, which is expected to be around $20 per unit.\n6. Cactus cactus production increase: The firm will also receive an additional $45 million (approximately £23 million) in funding for the production of Hoodia cactus at its nursery in South Africa, which could potentially rise to hundreds of millions of plants.\n7. Restoring market faith: This deal is seen as a step towards restoring confidence in Phytopharm's pipeline after the Pfizer exit, and analysts believe that it will help to attract new customers and investors.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about a new product from Unilever and Phytopharm. Let me read through it carefully.\n\nThe main idea is that Unilever and Phytopharm are working on a slimming diet made from Hoodia extract. The plant has been used for thousands of years in the desert by the Sans bushmen to prevent hunger, which makes sense because without enough calories or nutrients, people tend to eat more and get full.\n\nPhytopharm shared that their sales grew 10.7% on the news, with $600 million a year possible. Unilever is involved in helping develop this snack plant, which is licensed from 1997 onwards.\n\nThe plant curbs appetite instead of reducing calories, so it's more effective for slimming. The deal involves an initial fee and future royalties. Production is increasing from eight million plants to potentially hundreds of millions, which shows the scale of the expansion.\n\nPhytopharm initially wanted a drug from Hoodia but faced problems with a research collaboration ending in 2003. Unilever might launch the products around 2007. The analyst Refsum thinks this deal restores Phytopharm's market trust after Pfizer went public.\n\nI need to make sure I include all key points: Unilever is involved, initial fee, increased production, successful plant for slimming, the contract details, possible timeline for launch, and the impact on market trust. Also, highlight the sales growth and how it benefits Phytopharm and Unilever.\n</think>\n\nA slimming aid based on Hoodia extract could be developed by UK firm Phytopharm and Anglo-Dutch food giant Unilever. The plant, licensed since 1997, has been used in the desert for centuries to slow hunger. Unilever is involved in developing it with a deal including an initial fee of £6.5m out of a potential £21m and future royalties. Production will increase from eight million plants to hundreds of millions, and sales are expected to reach $600m annually. The plant curbs appetite instead of reducing calories, and the deal aims to boost market trust for Phytopharm by starting sales in 2007.", "tinyllama:1.1b": "The UK firm Phytopharm has announced that it is set to develop Hoodia extract, which is made from a southern African plant that can curb appetite instead of reducing calorie intake like existing products. The company will receive an initial fee of £6.5m, out of a potential total of £21m, as well as future royalty payments on product sales under the deal with Unilever. Phytopharm's plant in South Africa has previously produced Hoodia plants that could potentially reach millions of seedlings, and there are prospects for increasing these levels further to possibly hundreds of millions. The company aims to introduce its new line of slippery drugs made from the plant in 2007 with Unilever. Phytopharm's shares jumped on the news, valued at £309m a year.", "tinydolphin:1.1b": " Cactus diet deals for Phytopharm are being developed by UK firm Phytopharm and Unilever. The company will receive an initial fee of £6.5 million from Unilever, out of a potential total of £21 million, while future royalties on product sales could also be generated. This follows the end of a joint venture with Pfizer, leading to Phytopharm abandoning the Hoodia slimming drug project. The new products will likely launch in 2007 under Unilever's brand, as suggested by analysts.", "phi:2.7b": " A company called Phytopharm, which specializes in pharmaceuticals derived from the Hoodia plant, has partnered with Unilever to develop slimming snacks containing this extract. The deal is estimated to bring in revenue of $600 million a year, and production of the Hoodia cactus will increase significantly as a result.\n", "orca-mini:3b": " Anglo-Dutch food giant Unilever will help UK firm Phytopharm develop the slimming aid made from a southern African cactus called Hoodia extract. The deal involves royalties on product sales, and Phytopharm will receive an initial fee of £6.5m from Unilever as well as future royalties on product sales.", "hermes3:3b": "Phytopharm, Unilever develop Hoodia-based slimming aid from southern African cactus, potential annual sales $600m, shares up 10.7%.", "stablelm-zephyr:3b": "UK firm Phytopharm and Unilever are set to collaborate on developing snacks containing Hoodia extract, a southern African cactus known for curbing appetite. The £6.5m initial fee and potential future royalties from product sales will see Phytopharm grow the production of Hoodia cactus from eight million plants to potentially hundreds of millions. Analysts predict sales of $600m a year are possible, restoring market faith in Phytopharm's pipeline following their collaboration with Pfizer ending in 2003.", "chatgpt-4o-latest": "UK firm Phytopharm and Unilever will develop a slimming aid using Hoodia, a southern African cactus known for curbing appetite. Phytopharm's shares rose 10.7% on the news, with potential annual sales estimated at $600m. The plant, used by the Sans bushmen for centuries, was licensed to Phytopharm in 1997. Under the deal, Phytopharm will receive up to £21m from Unilever, including an initial £6.5m, plus future royalties. Hoodia production in South Africa will expand significantly. Phytopharm had previously partnered with Pfizer, but that collaboration ended in 2003. Analysts expect Unilever to launch the product in 2007, restoring confidence in Phytopharm’s pipeline.", "stablelm2:1.6b": "UK firm Phytopharm is collaborating with UK-based Unilever and Anglo-Dutch food giant Unicef on a slimming aid made from a cactus, set to be developed into snacks containing Hoodia extract. The deal will see Unilever help develop the snacks for £6.5m upfront fee, potential royalty income and future growth of production at Phytopharm's nursery in South Africa. This is believed to be the first time the plant has been licensed outside of Africa, where it has been used by indigenous communities for centuries.", "granite3.1-dense:2b": "UK firm Phytopharm and Unilever have agreed to develop a slimming aid using Hoodia, a southern African cactus. The plant, licensed by Phytopharm in 1997, has been traditionally used by the San bushmen of the Kalahari desert to suppress hunger. Studies indicate Hoodia curbs appetite without reducing caloric intake. Unilever will fund the project with a £6.5m initial fee and potential future royalties, as well as boost production from eight million plants to potentially hundreds of millions in South Africa. Phytopharm shares surged 10.7%, with analysts predicting annual sales of $600m (£309m). This deal aims to revive confidence in Phytopharm's pipeline following its previous collaboration with Pfizer, which ended in 2003. Unilever is expected to introduce these new products around 2007.", "reference": "A slimming aid made from a southern African cactus is set to be developed by UK firm Phytopharm and Unilever.Under the deal, production of the Hoodia cactus at Phytopharm's nursery in South Africa will also rise from eight million plants to potentially hundreds of millions, said Phytopharm chief executive Richard Dixey.Phytopharm will receive an initial fee of £6.5m from Unilever - out of a potential total of £21m - as well as future royalties on product sales.The firm had initially hoped to market a slimming drug from Hoodia with Pfizer.Anglo-Dutch food giant Unilever will help the pharmaceutical firm develop the snacks containing Hoodia extract."}