{"raw_text": "AstraZeneca hit by drug failure\n \n Shares in Anglo-Swedish drug have closed down 8% in UK trade after the failure of its Iressa drug in a major clinical trial.\n \n The lung cancer drug did not significantly prolong survival in patients with the disease. This setback for the group follows the rejection by the US in October of its anti-coagulant pill Exanta. Meanwhile, another of its major money spinners - cholesterol drug Crestor - is facing mounting safety concerns. \"This would be two of the three blockbuster drugs that were meant to power the company forward failing... and we've got risks on Crestor,\" said Nick Turner, analyst at brokers Jefferies.\n \n AstraZeneca had hoped to pitch its Iressa drug against rival medicine Tarceva. But Iressa proved no better than a placebo in extending lives in the trial involving 1,692 patients. Tarceva - made by OSI Pharmaceuticals, Genentech and Roche - has already proved to be successful in helping prolong the life of lung cancer patients. AztraZeneca has now appointed a new executive director to the board. John Patterson will be in charge of drug development. The company said Mr Patterson would make \"substantial changes to the clinical organisation and its processes\". \"I am determined to improve our development and regulatory performance, restore confidence in the company and value to shareholders,\" said chief executive Tom McKillop.\n", "llama3.2:1b": "AstraZeneca's shares fell 8% in UK trade after a major clinical trial for its Iressa drug showed no significant improvement in prolonging survival in patients with lung cancer. The drug failed to demonstrate a benefit, despite being expected to be a top seller. This setback is part of AstraZeneca's declining fortunes, which include mounting safety concerns on its Crestor cholesterol drug and the rejection of its anti-coagulant pill Exanta in the US.", "llama3.2:3b": "AstraZeneca's shares dropped 8% after a major clinical trial failed to show Iressa, a lung cancer drug, prolonging survival. The setback follows Exanta's rejection in the US and mounting safety concerns over cholesterol drug Crestor. AstraZeneca has appointed John Patterson as executive director of drug development to make \"substantial changes\" to the company's processes.", "gemma2:2b": "AstraZeneca's Iressa lung cancer drug failed a major trial, impacting share prices and raising concerns about other blockbuster drugs like Crestor. The failure follows setbacks for Exanta and signals potential instability for the company. A new director has been appointed to lead drug development efforts with the goal of improving performance and restoring shareholder confidence. \n", "qwen2.5:0.5b": "AstraZeneca's lung cancer drug Iressa failed in a major trial and is facing mounting safety concerns. The cholesterol drug Crestor has faced mounting safety issues and may be on the verge of bankruptcy, while AstraZeneca appointed a new executive director to the board. Mr Patterson will be in charge of improving development processes and restoring confidence in the company and shareholders.", "qwen2.5:1.5b": "AstraZeneca's Iressa drug failed a major clinical trial for lung cancer patients, disappointing the company that hoped it would compete with Tarceva, which has been successful in extending life for other types of cancer. The failure comes as AstraZeneca faces mounting safety concerns over its cholesterol-lowering drug Crestor and is also struggling with an unsuccessful anti-coagulant pill rejection by the US market.", "qwen2.5:3b": "AstraZeneca shares fell 8% after its lung cancer drug Iressa failed a major clinical trial compared to Tarceva, which has already shown effectiveness. The setback follows earlier failure of Exanta for anti-coagulant use and concerns about Crestor's safety. A new executive director will focus on improving development and regulatory performance, aiming to restore confidence in the company and its value to shareholders.", "opencoder:1.5b": "The company has closed down 8% in UK trade after the failure of a drug similar to Iressa. The decline in supply was attributed to market conditions and safety concerns over Crestor. AstraZeneca has also made the announcement that they expect to pitch Tarceva against another major competitor. Despite the success of Tarceva, AstraZeneca still holds confidence in the company's development plans and has appointed a new executive director.\n", "smollm:1.7b": "The summary should be: AstraZeneca hit by drug failure after Iressa trial fails to show significant benefit for lung cancer patients.", "deepseek-r1:1.5b": "<think>\nAlright, so I'm looking at this query where the user wants a summary of a specific text about AstraZeneca's stock drop after their Iressa drug failed in a clinical trial. They provided the original text with several key points, and they want just a concise summary without any explanations or formatting.\n\nFirst, I need to identify the main ideas from each paragraph. The first sentence mentions that AstraZeneca shares have closed down by 8% after their Iressa failed. That's an important event because it directly affects investor sentiment.\n\nThe next part talks about how the lung cancer drug didn't significantly extend survival. It also notes that AstraZeneca rejected Exanta in October, which is a significant milestone for them since Exanta was their main money spinner. This rejection could have hurt their financial standing and reputation.\n\nThen there's an analyst quote from Nick Turner at Jefferies, mentioning that Iressa failed in the trial against Tarceva, so AstraZeneca didn't gain much from it. Tarceva is known to be effective for prolonging lung cancer patients' lives through other drugs like Crestor.\n\nFinally, the summary includes information about AstraZeneca's appointment of John Patterson as executive director and their new plans to improve drug development and regulatory performance. This shows their internal restructuring and focus on improving their operations.\n\nI should make sure to include all these key points: the stock drop due to Iressa failure, the effect on Tarceva effectiveness, the analyst's perspective, and the strategic changes AstraZeneca is considering for future development.\n</think>\n\nAstraZeneca shares have dropped 8% in the UK post their Iressa drug failed a major clinical trial. The lung cancer drug didn't significantly improve survival rates, while AstraZeneca rejected Exanta in October. Analyst Nick Turner noted that Iressa failed similarly to a placebo, suggesting its impact on their \\$19 billion block of cash. Tarceva's effectiveness has been strong, but the company's rejection of Exanta and new appointment of John Patterson highlight their need for changes to drug development and regulatory performance.", "tinyllama:1.1b": "As a result of the failure of drug Iressa in a major trial, Anglo-Swedish pharmaceutical group AstraZeNeCa has decided to close its shares in Anglo-Swedish drug CholesteroL down by 8%. The company's three major blockbuster drugs - Creator pill and the two blockbusters of the year - have also been facing mounting safety concerns. Meanwhile, AstraZeNeCa has appointed a new executive director to head up drug development after the failure of its Iressa drug in lung cancer patients. The company believes this will restore confidence in shareholder value, and Mr Patterson's appointment was made in order to \"improve\" the company's performance and bring back stock prices down.", "tinydolphin:1.1b": " AstraZeneca experienced a major drug failure at their experimental lung cancer drug Iressa, which led to the closure of shares in Anglo-Swedish drug company AstraZeneca UK in trade. The failure of this experimental drug has set off negative repercussions for the company's other drugs. \n\nCrestor, another major blockbuster drug from the group, is facing increasing safety concerns. This comes on the heels of a rejection by the US of a new pill, Exanta, which was meant to help Crestor succeed. These two setbacks have led to investors losing faith in AstraZeneca's future growth and potential for blockbuster drugs.\n\nJeffrey Turner, an analyst at Jefferies, has expressed concerns about the company's downfall. He believes that their current strategy of pitching their Iressa drug against rival medicine Tarceva is not producing the expected results. The failure of Iressa in a major clinical trial raises questions about the drug's efficacy and safety profile for lung cancer patients.\n\nIn response to this setback, AstraZeneca has appointed John Patterson as their new executive director. Patterson will oversee drug development and improve the company's performance in drug regulatory matters, according to Chief Executive Tom McKillop. This move highlights McKillop's commitment to improving AstraZeneca's standing among shareholders and investors.", "phi:2.7b": " AstraZeneca's lung cancer drug Iressa failed in a major clinical trial, causing a 8% decrease in UK stock shares. This is followed by concerns over another of their main money-spinners, cholesterol drug Crestor, as well as the rejection of their anti-coagulant pill Exanta by the US. The company has appointed a new executive director to lead their drug development and make substantial changes to restore confidence in the company.\n", "orca-mini:3b": " AstraZeneca's Iressa drug failed to significantly prolong survival in a major clinical trial, setting back the group's efforts to develop other blockbuster drugs. The failure of Iressa follows the rejection by the US of its anti-coagulant pill Exanta and another major money spinner, cholesterol drug Crestor, is facing mounting safety concerns. A new executive director to the board will oversee drug development, with changes expected to clinical organization and processes.", "hermes3:3b": "AstraZeneca shares fall 8% after Iressa lung cancer drug fails major clinical trial, extending no significant survival improvement over placebo for patients; Exanta rejected, Crestor faces safety concerns.", "stablelm-zephyr:3b": "AstraZeneca's shares fell 8% after the failure of its Iressa drug in a major clinical trial for lung cancer, not significantly extending survival. This setback followed the rejection of their anti-coagulant pill Exanta by the US in October. A significant money spinner, cholesterol drug Crestor, is also facing safety concerns. Analysts say two of the three blockbuster drugs were meant to power the company forward have failed, and now the company appoints a new executive director for drug development, with plans to improve clinical organization and processes.", "chatgpt-4o-latest": "AstraZeneca's shares fell 8% after its lung cancer drug Iressa failed to significantly extend patient survival in a major clinical trial. This follows the US rejection of its anti-coagulant Exanta and growing safety concerns over its cholesterol drug Crestor. Iressa was intended to compete with Tarceva, but it performed no better than a placebo, while Tarceva has proven effective. In response, AstraZeneca appointed John Patterson as executive director to oversee drug development, with plans for substantial changes. CEO Tom McKillop pledged to improve regulatory performance and restore shareholder confidence.", "stablelm2:1.6b": "AstraZeneca's shares dropped 8% due to the failure of their Iressa drug in a clinical trial for lung cancer patients. The drug did not significantly prolong survival. This is the second setback for the company after rejecting an anti-coagulant pill in October and facing safety concerns on its cholesterol drug, Crestor. AstraZeneca had hoped to compete with rival Tarceva but Iressa failed the trial. New executive director John Patterson will oversee changes to the clinical organization and processes to restore confidence in the company and boost value for shareholders.", "granite3.1-dense:2b": "AstraZeneca's shares plummeted 8% following the failure of its lung cancer drug Iressa in a clinical trial, which failed to extend patients' survival rates. This development follows the US rejection of AstraZeneca's anti-coagulant Exanta in October and mounting safety concerns about its blockbuster cholesterol drug Crestor. Analyst Nick Turner from Jefferies noted that this marks two out of three key drugs intended to drive company growth as failures. Iressa, aimed at rival medication Tarceva, underperformed in the trial involving 1,692 patients. To address these challenges, AstraZeneca appointed John Patterson as executive director of drug development, tasking him with revamping clinical processes to enhance performance and regain shareholder confidence.", "reference": "Shares in Anglo-Swedish drug have closed down 8% in UK trade after the failure of its Iressa drug in a major clinical trial.John Patterson will be in charge of drug development.AstraZeneca had hoped to pitch its Iressa drug against rival medicine Tarceva.The lung cancer drug did not significantly prolong survival in patients with the disease.\"This would be two of the three blockbuster drugs that were meant to power the company forward failing... and we've got risks on Crestor,\" said Nick Turner, analyst at brokers Jefferies."}