{"raw_text": "Irish company hit by Iraqi report\n \n Shares in Irish oil company Petrel Resources have lost more than 50% of their value on a report that the firm has failed to win a contract in Iraq.\n \n Reuters news agency reported that Iraq's Oil Ministry has awarded the first post-war oilfield contracts to a Canadian and a Turkish company. By 1700 GMT, Petrel's shares fell from 97p ($1.87) to 44p ($0.85). Petrel said that it has not received any information from Iraqi authorities to confirm or deny the report.\n \n Iraq is seeking to award contracts for three projects, valued at $500m (£258.5m). Turkey's Everasia is reported by Reuters to have won a contract to develop the Khurmala Dome field in the north of the country. A Canadian company, named IOG, is reported to have won the contract to run the Himrin field. Ironhorse Oil and Gas has denied to Reuters that it is the company in question. These two projects aim to develop Khurmala field to produce 100,000 barrels per day and raise the output of Himrin. The winners of the contract are to build new flow lines and build gas separation stations. The contract to develop the Suba-Luhais field has not yet been awarded as Iraq's Oil Ministry is studying the offers. If Iraq's cabinet approves the oil ministry's choice of companies, then this will be the first deal that Iraq has signed with a foreign oil company. Iraq is still trying to boost its production capacity to match levels last seen in the eighties, before the war with Iran. Oil officials hope to double Iraq's output by the end of the decade.\n", "llama3.2:1b": "Irish oil company Petrel Resources shares have lost over 50% of value after receiving a report that it has failed to win a contract in Iraq, despite claiming to not have received any information from authorities confirming or denying the report.", "llama3.2:3b": "Petrel Resources shares have lost over 50% of their value after being reported as losing a contract in Iraq. Iraq has awarded contracts to Canadian and Turkish companies for $500m projects, which will aim to develop three oilfields and increase production capacity to pre-80s levels.", "gemma2:2b": "Irish oil company Petrel Resources saw a 50% drop in share value due to a report that it lost a contract awarded by Iraq's Ministry of Oil. The report claims that Canadian and Turkish companies won these contracts, while Petrel denies receiving confirmation. Iraq aims to increase its oil production capacity by doubling current levels by the end of the decade. \n", "qwen2.5:0.5b": "Irish oil company Petrel Resources lost 50% of its value in response to a report that Iraqi authorities have awarded contracts for three projects worth $500 million (£258.5m). The company has not received any information from Iraq's Oil Ministry to confirm or deny the news.", "qwen2.5:1.5b": "Irish oil firm Petrel Resources' shares fell significantly due to an Iraqi report claiming they did not win a contract to work on three post-war oilfield projects valued at $500m, despite initial optimism following the war. Iraq is seeking contracts worth $258.5m for producing 100,000 barrels per day and raising Himrin's output.", "qwen2.5:3b": "Irish oil company Petrel Resources' shares fell 50% after Reuters reported that Iraqi Oil Ministry awarded contracts to a Canadian and Turkish companies for three projects valued at $500m. Petrel denied receiving any information about the report. Turkey's Everasia won Khurmala Dome field contract, Canada's IOG won Himrin field contract. Iraq aims to double its oil output by decade-end to match levels before 1980s war with Iran.", "opencoder:1.5b": "The Irish company that has hit the top dollar is reporting on a report that a U.S. company has failed to win a contract in Iraq. The shares of the company fell by 50% due to the report, which indicated that the company did not receive any information from the country's government to confirm or deny the report. Iraq is seeking to award contracts for three projects valued at $500m and another at $258.5m. Turkish companies have won the contract aimed at developing the Khurmala Dome field in the north of the country. The Canadian company, named IOG, has also won the contract focusing on running the Himrin field. Both these companies aim to provide 100,000 barrels per day and raise the output level of gas production.\n", "smollm:1.7b": "The Iraqi report failed to win a contract for three projects valued at $500 million (£258.5 million). The report also denied that it was the company in question, and Ironhorse Oil and Gas was not mentioned. The two companies are involved in developing Khurmala field to produce 100,000 barrels per day and build gas separation stations. The contract to develop Suba-Luhais field has not yet been awarded as Iraq's Oil Ministry is studying the offers. If Iraq's cabinet approves the oil ministry's choice of companies, then this will be the first deal that Iraq has signed with a foreign oil company.\n\nThe Iraqi report failed to win a contract for three projects valued at $500 million (£258.5 million). The report also denied that it was the company in question, and Ironhorse Oil and Gas was not mentioned. The two companies are involved in developing Khurmala field to produce 100,000 barrels per day and build gas separation stations. The contract to develop Suba-Luhais field has not yet been awarded as Iraq's Oil Ministry is studying the offers. If Iraq's cabinet approves the oil ministry's choice of companies, then this will be the first deal that Iraq has signed with a foreign oil company.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text about an Irish company's shares falling due to a contract dispute with Iraq. Let me read through it carefully.\n\nFirst, the paragraph mentions that Petrel Resources' shares have lost more than 50%, which is significant because they were trading at $1.87 and fell to $0.85. That’s a big loss for investors in both Ireland and the U.K. \n\nNext, I should note that the news came from Reuters. They reported Iraq's Oil Ministry awarded the first post-war oilfield contracts to Canadian IOG and Turkish Everasia. So,Petrel didn't hear about this yet.\n\nI need to include details like the timing: by 1700 GMT, the share price dropped from 97p to 44p. Petrel said they haven’t received any information about the report. \n\nThe contracts are worth $500m each. Turkey won one project for the Khurmala Dome field, which produces 100k b/d and has gas separation stations. Meanwhile, Ironhorse Oil & Gas won another contract at $265m to run Himrin's field. The other project is about building flow lines and gas separators.\n\nThe winners are working on new infrastructure but the oil ministry’s choice isn’t final yet because Iraq is studying offers. If they get the contract, it'll be the first foreign deal for Iraq. \n\nI should also mention that even thoughPetrel didn't hear about this dispute, it's a big deal for both Ireland and Britain since oil prices have been falling.\n\nPutting it all together, I need to capture the key points without explanations or formatting. Just a concise summary in plain text.\n</think>\n\nPetrel Resources’ shares fell by more than 50%, trading from $1.87 to $0.85. Iraq’s Oil Ministry awarded the first post-war oilfield contracts to IOG and Everasia, withPetrel not receiving any information. The contract projects total $500m each. Turkey won a $500m project for Khurmala Dome, while Ironhorse Oil & Gas secured a $265m Himrin field contract. If Iraq’s contract decision is final, Petrel will face the first foreign oil company deal.", "tinyllama:1.1b": "According to a news agecci report published on Reuter's website, Petrel Resources shares have lost more than 50% of their value after it was reported that Iraqi authorities had awarded post-war oilfield contracts to Canadian and Turkish companies. This move is expected to boost Iraq's production capacity, which is currently low due to the lack of investments during the war with Iran. However, Petrel Resources has not received any official confirmation or denial from Iraqi authorities regarding the report. The two winning projects aim to develop Khurmala field in the north and Himrin field in the northeast, while the Canadian company, IOG, is reportedly set to run Himrin. The winner of the contract for developing the Suba-Luhais field has not yet been approved by Iraq's Oil Ministry, which is currently studying the offers. If approved, it will be the first deal signed with a foreign oil company in Iraq. Iraq is still trying to boost its production capacity to match levels last seen in the eighties before the war with Iran, and hopes to double its output by the end of the decade.", "tinydolphin:1.1b": " In summary, the article discusses that Petrel Resources shares have plummeted due to a report claiming they failed to win a contract in Iraq. The company believes this is because they had not received any information from Iraqi authorities regarding their bid for the contracts. Iraq has announced it will award three contracts worth $500 million for development of oil fields in its northern province. The winners of these contracts are expected to be confirmed within the next 48 hours.", "phi:2.7b": " Irish oil company Petrel Resources lost more than 50% of their value due to a report that they have not won a contract in Iraq despite seeking to boost its production capacity. The contracts were awarded to a Canadian and Turkish company for three projects, valued at $500m. Iraq is still trying to increase its oil output and hopes to double it by the end of the decade.\n", "orca-mini:3b": " An Irish oil company, Petrel Resources, has lost over 50% of its value after reports emerged that it failed to win a contract in Iraq. The Canadian and Turkish companies were awarded contracts to develop two oilfields in northern Iraq. Ironhorse Oil and Gas denied any involvement in the projects. Iraq is seeking to boost its production capacity to match levels last seen in the eighties, before the war with Iran.", "hermes3:3b": "Irish oil company Petrel Resources shares fall over 50% after report they failed to win Iraqi contract.", "stablelm-zephyr:3b": "Shares in Irish oil company Petrel Resources lost over 50% of their value after reporting that they did not secure a contract in Iraq. A Canadian and Turkish firm won first post-war oilfield contracts worth $500m, with two projects aiming to develop Khurmala field to produce 100,000 barrels per day and increase Himrin's output. Petrel said it has not received any information from Iraqi authorities regarding the report. If approved, this will be Iraq's first deal with a foreign oil company.", "chatgpt-4o-latest": "Shares in Irish oil company Petrel Resources dropped over 50% after reports that it failed to secure an oil contract in Iraq. Reuters reported that Iraq's Oil Ministry awarded contracts to Canadian and Turkish firms, with Turkey's Everasia developing the Khurmala Dome field and a Canadian company, possibly IOG, managing the Himrin field. These projects aim to boost oil production and infrastructure. The Suba-Luhais field contract remains undecided. If approved, these deals would mark Iraq's first foreign oil agreements as it seeks to restore and double its oil output. Petrel has not received official confirmation of the report.", "stablelm2:1.6b": "Irish oil company Petrel Resources saw a 10% drop in shares due to a report that it failed to win a contract in Iraq despite not receiving any confirmation from Iraqi authorities. The Oil Ministry awarded contracts for three projects valued at $2 million, with Everasia winning one and IOG winning the other two. These projects aim to develop Khurmala and Himrin fields producing 200k barrels per day. If approved by the cabinet, it will be Iraq's first deal with a foreign oil company.", "granite3.1-dense:2b": "Petrel Resources, an Irish oil firm, has experienced a significant share price drop following a Reuters report claiming it hasn't secured a contract in Iraq for post-war oilfield projects worth $500m. These projects involve developing the Khurmala Dome field and Himrin field, with Turkey's Everasia reportedly winning the Khurmala project and Canada's IOG the Himrin project. Petrel denies involvement in these contracts. Iraq aims to increase its oil production, which hasn't been at pre-Iran War levels since the eighties, to double it by 2030. The Suba-Luhais field contract is still under consideration.", "reference": "Reuters news agency reported that Iraq's Oil Ministry has awarded the first post-war oilfield contracts to a Canadian and a Turkish company.The contract to develop the Suba-Luhais field has not yet been awarded as Iraq's Oil Ministry is studying the offers.Shares in Irish oil company Petrel Resources have lost more than 50% of their value on a report that the firm has failed to win a contract in Iraq.If Iraq's cabinet approves the oil ministry's choice of companies, then this will be the first deal that Iraq has signed with a foreign oil company.Ironhorse Oil and Gas has denied to Reuters that it is the company in question.A Canadian company, named IOG, is reported to have won the contract to run the Himrin field."}