{"raw_text": "S&N extends Indian beer venture\n \n The UK's biggest brewer, Scottish and Newcastle (S&N), is to buy 37.5% of India's United Breweries in a deal worth 4.66bn rupees ($106m:£54.6m).\n \n S&N will buy a 17.5% equity stake in United, maker of the well-known Kingfisher lager brand, and make a public offer to buy another 20% stake. A similar holding will be controlled by Vijay Mallya, chair of the Indian firm. The deal was a \"natural development\" of its joint venture with United, said Tony Froggatt, S&N's chief executive.\n \n Its top brands include Newcastle Brown Ale, Foster's, John Smith's, Strongbow and Kronenbourg. In 2002 S&N and United agreed to form a strategic partnership, one that would include a joint venture business and a UK investment in the Indian brewer. The joint venture was established in May 2003. with both parties having a 40% stake in the venture - Millennium Alcobev. Millennium Alcobev will now be merged with United, which expects post-merger to have about half of India's beer market.\n \n India, with a population of more than one billion, consumes about 1.2 billion bottles of beer every year. Kingfisher has market share of about 29%. In addition to the equity stake S&N is to invest 2.47bn rupees in United through non-convertible redeemable preference shares. Meanwhile, United's budget airline, Kingfisher Airlines, is to buy 10 A320 aircraft from Airbus and has the option to buy 20 more aircraft in a deal worth up to $1.8bn. The airline, the brainchild of Mr Mallya, expects to start its operations by the end of April. The new airline would break even in the very first year of operation, Mr Mallya said.\n", "llama3.2:1b": "Scottish and Newcastle (S&N) is buying 37.5% equity stake in Indian beer firm United Breweries for $106m. S&N will also buy an additional 20% stake through a public offer. The deal comes after S&N formed a joint venture with United in 2003, which has since merged and increased India's market share to around half of the country's beer consumption by 1.2 billion bottles per year.", "llama3.2:3b": "S&N is buying 37.5% of United Breweries for $106m, including a 17.5% stake and option to buy another 20%. This deal follows a strategic partnership between S&N and United, which formed in 2002 and established a joint venture business in 2003. India's beer market is large, with Kingfisher having 29% share. The company also plans to invest $1.8bn in Kingfisher Airlines, which will start operations by April and aims to break even in its first year.", "gemma2:2b": "S&N will acquire 37.5% stake in United Breweries, maker of Kingfisher beer, for $106 million.  This deal consolidates S&N's strategic partnership with United and enhances its presence in the Indian beer market. S&N investment includes a public offer to buy another 20% stake, along with a substantial financial injection through non-convertible redeemable preference shares. The deal also marks S&N's expansion into India's burgeoning airline industry as Kingfisher Airlines plans to launch by April with new Airbus aircraft.  \n", "qwen2.5:0.5b": "S&N extends Indian beer venture with 37.5% stake in United Breweries. It will buy another 20% equity stake from Vijay Mallya and its top brands include Newcastle Brown Ale, Foster's, John Smith's, Strongbow and Kronenbourg. India is a country consuming about 1.2 billion bottles of beer every year. UK’s biggest brewer S&N has a joint venture with United Breweries.", "qwen2.5:1.5b": "Scottish and Newcastle (S&N) plans to acquire a 37.5% stake in India's United Breweries, worth approximately $106 million, as part of a larger deal that includes S&N purchasing another 20% stake. The strategic partnership between S&N and United was formed in 2002 and aims to merge the two businesses and dominate India's beer market by half.", "qwen2.5:3b": "The UK's largest brewer, Scottish and Newcastle (S&N), is acquiring a 37.5% stake in India's United Breweries worth 4.66bn rupees ($106m:£54.6m). S&N will buy 17.5% equity and make a public offer for another 20%. Vijay Mallya, the Indian firm's chairperson, will control a similar stake. The deal represents a natural progression of their joint venture. S&N already has a partnership with United through Millennium Alcobev, which is being merged into United to form a company expected to dominate half of India’s beer market. Kingfisher, one of S&N's brands, holds about 29% share in the Indian market. Additionally, United will purchase A320 aircraft from Airbus and expects its budget airline to break even within the first year of operations.", "opencoder:1.5b": "S&N extends Indian beer venture\n\nThe UK's biggest brewer, S&N, is to buy 37.5% of India's United Breweries in a deal worth 4.66bn rupees ($106m:£54.6m).\n\nS&N will buy a 17.5% equity stake in United, maker of the well-known Kingfisher lager brand and make a public offer to buy another 20% stake. \n\nA similar holding will be controlled by Vijay Mallya, chair of the Indian firm.\n\nThe deal was a \"natural development\" of its joint venture with United, said Tony Froggatt, S&N's chief executive.\n\nIts top brands include Newcastle Brown Ale, Foster's, John Smith's, Strongbow and Kronenbourg. In 2002, S&N and United agreed to form a strategic partnership, one that would include a joint venture business and a UK investment in the Indian brewer.\n \nIndia, with a population of more than one billion, consumes about 1.2 billion bottles of beer every year. Kingfisher has market share of about 29%.\n\nS&N is to invest 2.47bn rupees in United through non-convertible redeemable preference shares.\n\nMeanwhile, United's budget airline, Kingfisher Airlines, is to buy 10 A320 aircraft from Airbus and has the option to buy 20 more aircraft in a deal worth up to $1.8bn.\n\nThe new airline would break even in the very first year of operation, Mr Mallya said.\n", "smollm:1.7b": "The UK's biggest brewer, Scottish and Newcastle (S&N), is to buy 37.5% of India's United Breweries in a deal worth $106 million ($4.66 billion). The deal will control 20% of the Indian brewery market, with S&N owning 17.5% of the equity stake and United holding 82%. In addition to the equity stake, S&N is to invest $2.47 billion in United through non-convertible redeemable preference shares. Meanwhile, United's budget airline, Kingfisher Airlines, is to buy 10 A320 aircraft from Airbus and has the option to buy 20 more aircraft in a deal worth up to $1.8 billion. The airline, the brainchild of Mr Mallya, expects to start its operations by the end of April. The new airline would break even in the very first year of operation, Mr Mallya said.\n", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about S&N acquiring United Breweries. Let me read through it again.\n\nSo, S&N is a big UK brewer, and they're buying 37.5% of India's UBE, which makes Kingfisher lager. That sounds like the first time any UK-based company buys into an Indian beer brand. The deal is valued at over $106 million.\n\nThe S&N CEO, Tony Froggatt, mentioned that this was a natural merger with their previous joint venture with UBE. Before this, they had a 40% stake in the partnership. After buying 37.5%, UBE's share drops to about half.\n\nI should list the key points: S&N buys 17.5% equity and another 20%, making a total of 37.5%. They're taking part in a joint venture from their previous agreement, which had both owning a 40% stake. UBE's market share drops to about half post-deal.\n\nAdditionally, S&N is investing $2.47 million in UBE through non-convertible redeemable preference shares. United has options to buy more planes by Kingfisher Airlines, starting operations in April with the new aircrafts.\n\nI need to condense this into a concise summary without explanations or formatting.\n</think>\n\nS&N acquires 37.5% of India's UBE, merging with their previous joint venture. The deal is valued at $106 million and includes equity investments and potential aircraft acquisitions for Kingfisher Airlines.", "tinyllama:1.1b": "S&N Extends Indian Beer Venture and Acquires a Stake in United Breweries in a Deal Worth 4.6 Billion Rupees ($106 Million) to Control 37.5% of India's Top Branded Beer Market", "tinydolphin:1.1b": " S&N extends Indian beer venture, buys minority stake and makes a public offer for another 20% stake. United becomes a 54.6m-rupee ($106m) company in the deal. India's beer market is worth about 1.2 billion liters annually. The Indian government has allowed foreign investment up to 74%.", "phi:2.7b": " UK's largest brewer, Scottish and Newcastle (S&N), will buy a 37.5% equity stake in India's United Breweries for 4.66bn rupees ($106m). S&N plans to also make a public offer to buy an additional 20% stake, with Vijay Mallya, the Indian firm's chairman, controlling a 17.5% equity stake and the deal being a \"natural development\" of their joint venture. The acquisition would give S&N control over popular beer brands such as Newcastle Brown Ale, Foster'S, John Smith's, Strongbow, and Kronenbourg. \nThis is the most concise summary possible while preserving the key ideas and details from the given text. It briefly mentions the companies involved, their partnership, the acquisition of United Breweries by S&N, and the expected impact on India's beer market. Additionally, it states that Kingfisher Airlines will purchase aircraft from Airbus and intends to start operations in April, with the CEO expecting it to break even in one year.\n", "orca-mini:3b": " Scottish and Newcastle (S&N), the UK's biggest brewer, has extended its Indian beer venture with a 17.5% equity stake in United Breweries, maker of Kingfisher lager brand, and will make a public offer to buy another 20% stake. The deal is worth 4.66bn rupees ($106m:£54.6m). S&N will also invest 2.47bn rupees in United through non-convertible redeemable preference shares, while United's Indian airline, Kingfisher Airlines, is to buy 10 A320 aircraft from Airbus and has the option to buy 20 more aircraft in a deal worth up to $1.8bn.", "hermes3:3b": "S&N buys 37.5% stake in Indian brewer United Breweries for $106m, controlling a 35% share in Kingfisher lager brand; merger with Millennium Alcobev to result in about half India's beer market.", "stablelm-zephyr:3b": "UK brewer Scottish and Newcastle (S&N) has acquired a 37.5% stake in Indian brewery United Breweries for £54.6m. S&N will also buy an additional 20% stake via a public offer. The deal is part of a joint venture between the two companies, which owns Millennium Alcobev. Following the acquisition, S&N will invest 2.47bn rupees in United through non-convertible redeemable preference shares. Meanwhile, United's budget airline, Kingfisher Airlines, plans to purchase 10 A320 aircraft from Airbus and has the option for 20 more.", "chatgpt-4o-latest": "Scottish and Newcastle (S&N), the UK's largest brewer, is acquiring a 37.5% stake in India's United Breweries for 4.66bn rupees ($106m). S&N will purchase a 17.5% equity stake and make a public offer for an additional 20%, while United's chairman, Vijay Mallya, will hold a similar stake. This move builds on their 2002 strategic partnership and joint venture, Millennium Alcobev, which will now merge with United, giving it about 50% of India's beer market. India consumes 1.2 billion beer bottles annually, with Kingfisher holding a 29% market share. S&N will also invest 2.47bn rupees in United through preference shares. Meanwhile, United's Kingfisher Airlines plans to buy 10 Airbus A320s, with an option for 20 more, in a deal worth up to $1.8bn, aiming to start operations by April and break even within the first year.", "stablelm2:1.6b": "UK's Scottish and Newcastle (S&N) is acquiring 5% equity stake in India's United Breweries for $1.3bn. S&N will buy another 50% stake through a public offer and merge it with United to form the joint venture, Millennium Alcobev. This strategic partnership includes a UK investment and a strategic business venture between both parties since 2012 when they formed a strategic partnership.", "granite3.1-dense:2b": "UK's largest brewer, Scottish and Newcastle (S&N), is acquiring a 37.5% stake in India's United Breweries for 4.66 billion rupees ($106m:£54.6m). This deal involves purchasing 17.5% equity and making a public offer for another 20%. Vijay Mallya, chair of the Indian firm, will maintain a similar holding. The transaction is a logical extension of their existing strategic partnership, formed in 2002 with a joint venture called Millennium Alcobev (40% each). Post-merger, United anticipates controlling around half of India's beer market.\n\nIndia, home to over one billion people, annually consumes about 1.2 billion bottles of beer, with Kingfisher holding a significant 29% market share. S&N will invest 2.47 billion rupees in United through non-convertible redeemable preference shares.\n\nConcurrently, Kingfisher Airlines, Mallya's brainchild, plans to buy 10 A320 aircraft from Airbus and has the option for additional 20 planes worth up to $1.8 billion. The airline aims to commence operations by April, expecting to become profitable in its first year of operation, according to Mallya.", "reference": "The UK's biggest brewer, Scottish and Newcastle (S&N), is to buy 37.5% of India's United Breweries in a deal worth 4.66bn rupees ($106m:£54.6m).S&N will buy a 17.5% equity stake in United, maker of the well-known Kingfisher lager brand, and make a public offer to buy another 20% stake.In 2002 S&N and United agreed to form a strategic partnership, one that would include a joint venture business and a UK investment in the Indian brewer.Millennium Alcobev will now be merged with United, which expects post-merger to have about half of India's beer market.In addition to the equity stake S&N is to invest 2.47bn rupees in United through non-convertible redeemable preference shares.Meanwhile, United's budget airline, Kingfisher Airlines, is to buy 10 A320 aircraft from Airbus and has the option to buy 20 more aircraft in a deal worth up to $1.8bn."}