{"raw_text": "Iraq and Afghanistan in WTO talks\n \n The World Trade Organisation (WTO) is to hold membership talks with both Iraq and Afghanistan.\n \n But Iran's bid to join the trade body has been refused after the US blocked its application for the 21st time. The countries stand to reap huge benefits from membership of the group, whose purpose is to promote free trade. Joining, however, is a lengthy process. China's admission in 2001 took 15 years and talks with Russia and Saudi Arabia have been taking place for 10 years. Membership of the Geneva-based WTO helps guarantee a country's goods receives equal treatment in the markets of other member states - a policy which has seen it become closely associated with globalisation.\n \n Iraq's Trade Minister Mohammed Mustafa al-Jibouri welcomed the move, describing it as significant as November's decision by the Paris Club of creditor nations to write off 80% of the country's debts. Assad Omar, Afghanistan's envoy to the United Nations in Geneva, said accession would contribute to \"regional prosperity and global security\". There are now 27 countries seeking membership of the WTO. Prospective members need to enter into negotiations with potential trading countries and change domestic laws to bring them in line with WTO regulations. Before the process gets under way, all 148 WTO members must give their backing to applicant countries. The US said it could not approve Iran's application because it is currently reviewing relations. But several nations criticised the approach, and European Union ambassador to the WTO, Carlo Trojan, said Iran's application \"must be treated independently of political issues\".\n", "llama3.2:1b": "Iraq and Afghanistan are seeking membership in the World Trade Organisation (WTO). \n\nIran has applied for WTO membership, but its bid has been blocked by the US due to its ongoing relations with countries like Israel. The US refused 21st time Iran's application.\n\nAfghanistan has also expressed interest in joining the WTO, with envoy Assad Omar saying it would contribute to regional prosperity and global security.\n\nIraq welcomed the move as significant, while the EU ambassador Carlo Trojan urged \"independent treatment\" of Iran's application.\n\nAll 148 WTO members must approve applicants before membership can be granted.", "llama3.2:3b": "The World Trade Organisation is holding membership talks with Iraq and Afghanistan while refusing Iran's bid due to US opposition. Membership benefits include equal treatment in global markets and guarantees against protectionism, as seen in China's 15-year accession process and Russia's decade-long negotiations.", "gemma2:2b": "Iraq and Afghanistan are seeking membership in the World Trade Organization (WTO).  Iran's application has been denied for the 21st time by the US.  Membership offers benefits such as equal market treatment for goods traded between member countries, a policy closely linked to globalization. The process can take many years, as evidenced by China's 15-year membership journey and negotiations with Russia and Saudi Arabia. There are now 27 countries seeking WTO membership.  \n", "qwen2.5:0.5b": "The World Trade Organization (WTO) will hold membership talks with both Iraq and Afghanistan amid a US veto on Iran's bid. Qatar recently proposed joining the organization, but it remains pending due to Washington's decision not to approve. Several countries are seeking WTO membership including Saudi Arabia, Turkey, Canada, Israel, China, Egypt, India, Japan, Kazakhstan, Malaysia, Mexico, Morocco, Pakistan, Singapore, Tunisia and several EU member states.", "qwen2.5:1.5b": "The World Trade Organisation (WTO) will hold talks with Iraq and Afghanistan. However, Iran's bid to join has been denied for the 21st time due to US opposition. Membership involves lengthy negotiations and changes in domestic laws, requiring support from all 148 members before an application can be accepted.", "qwen2.5:3b": "The World Trade Organisation (WTO) will hold talks with Iraq and Afghanistan for membership. Despite Iran’s 21st refusal, both countries stand to benefit from free trade. China took 15 years for admission and WTO talks with Russia and Saudi Arabia have been ongoing for 10 years. Membership ensures equal treatment of goods in other member states’ markets. Iraqi and Afghan officials welcomed the move as part of their regional prosperity and global security goals. Currently, 27 countries are seeking membership, requiring negotiations with potential trading nations and domestic law changes to comply with WTO regulations. The US blocked Iran’s application due to ongoing political review but EU ambassador criticized this approach, advocating for independent treatment of applications.", "opencoder:1.5b": "The World Trade Organisation (WTO) aims to promote free trade between countries that are willing to negotiate international agreements, which include membership talks. It is a global initiative aimed at ensuring economic and financial stability for the world. The countries involved in this process include Iraq and Afghanistan. After the US blocked its application for the 21st time, they have successfully joined the group, marking significant progress in free trade practices.\n", "smollm:1.7b": "The summary should preserve key ideas and details from the original text:\n\n1. The WTO is holding membership talks with both Iraq and Afghanistan.\n2. But Iran's bid to join the trade body has been refused after the US blocked its application for the 21st time.\n3. The countries stand to reap huge benefits from membership of the group, whose purpose is to promote free trade.\n4. Joining, however, is a lengthy process.\n5. China's admission in 2001 took 15 years and talks with Russia and Saudi Arabia have been taking place for 10 years.\n6. Membership of the WTO helps guarantee a country's goods receive equal treatment in the markets of other member states - a policy which has seen it become closely associated with globalisation.\n7. The US said it could not approve Iran's application because it is currently reviewing relations. But several nations criticized the approach, and European Union ambassador to the WTO, Carlo Trojan, said Iran's application \"must be treated independently of political issues\".", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about Iraq and Afghanistan joining the WTO with Iran as a no-go. Let me read through it carefully.\n\nFirst, it mentions that the WTO is going to hold talks with both Iraq and Afghanistan. But then it says Iran's bid to join the trade body has been refused after the US blocked its 21st application for membership in 2023. That’s a key point because it's about why Iran won't join now.\n\nNext, it talks about how joining the WTO would give them big benefits from free trade. So they can get better treatment in other countries' markets. But membership is a long process involving years of negotiations with various countries and changing laws. This might take a while compared to countries like China or Russia, which have already done it quickly.\n\nThe text also mentions that China joined the WTO back in 2001 after 15 years of delay, and so has Saudi Arabia. Meanwhile, talks are ongoing between China and Russia for another round with 10 years left. That shows that some countries can do this faster than others.\n\nThen there's a quote from Iraq's Trade Minister saying the move is significant to November's decision by Paris where they closed off debt writes. It sounds like it's making them feel better about joining, especially in the context of global trade.\n\nAs for Afghanistan, their envoy to the UN in Geneva, Asad Assad, says admission would help regional prosperity and security. They have 27 countries looking to join now, which is a lot, so the process must be lengthy.\n\nEuropean Union ambassador to the WTO, Carlo Trojan, said that Iran's application should be treated separately from politics, but this might not hold water because some already applied in previous years. He’s concerned about political issues here.\n\nI think I need to condense all these points into a concise summary without adding any extra info or explanations. Just focus on the main ideas: why Iran's join is denied, benefits for both Iraq and Afghanistan, the process being time-consuming, China's similar experience, the current state of global membership in the WTO.\n</think>\n\nThe World Trade Organisation (WTO) is set to hold talks with both Iraq and Afghanistan, but Iran's application for membership has been refused after the US blocked its 21st proposal. The WTO aims to promote free trade among member countries, so this move could benefit both nations significantly. However, joining requires long negotiation processes involving multiple countries and changing laws, which is time-consuming compared to other WTO members like China. Already, China and Saudi Arabia have joined the WTO in their respective years. 27 countries are seeking membership, with a lengthy process expected to follow. The EU ambassador to the WTO expressed concern over potential political issues in Iran's application. The United States has already reviewed relations before considering Iran's entry, while other nations criticized the approach.", "tinyllama:1.1b": "The World Trade Organisation (WTO) has announced plans to hold membership talks with Iraq and Afghanistan. However, Iran's application for admission into the group has been blocked due to its US-backed rejection. The WTO holds a lengthy process of admissions and has previously accepted nations like China and Russia as members. Its goal is to promote free trade and its membership talks are seen as critical for ensuring countries receive equal treatment in markets. Meanwhile, Iraq welcomed the decision by Paris Club members to write off some of their country's debts and Assad Omar, the Afghan environment minister, said accession would contribute to regionally prosperous and secure global security. The US is still reviewing relations with Iran before approving or blocking its application for WTO membership.", "tinydolphin:1.1b": " In a meeting with top international trade officials, US officials rejected Iran's application for membership in the World Trade Organization (WTO). Despite this, both Iraq and Afghanistan are set to take part in the long-awaited membership talks. The US has repeatedly blocked their applications, leading to uncertainty over how members can benefit from the free trade group.", "phi:2.7b": " The World Trade Organisation (WTO) will hold membership talks with Iraq and Afghanistan. Iran has been blocked by the US from joining for the 21st time despite its potential benefits. Membership can take years, as seen in China's admission in 2001 which took 15 years. Membership can bring equal treatment for a country' s goods in global markets. The Paris Club of creditor nations recently wrote off 80% of Iraq's debts. Both countries stand to benefit from membership and are expected to contribute to regional prosperity and global security.\n", "orca-mini:3b": " Iraq and Afghanistan are holding talks to become members of the World Trade Organisation (WTO), which promotes free trade. However, the US has blocked Iran's bid for membership, citing concerns over political issues. The process involves negotiating with potential trading countries and changing domestic laws to meet WTO regulations. If all 148 WTO members give their approval, the process can begin. However, the US is reviewing its relations with Iran, which could impact the application. Some nations criticize the approach as insufficient, while others argue that Iran's application must be considered independently of political issues.", "hermes3:3b": "WTO to hold talks with Iraq, Afghanistan for membership; Iran's bid refused due to US block (21th time). Benefits from joining, lengthy process similar to China's 15-year admission.", "stablelm-zephyr:3b": "The World Trade Organisation (WTO) will hold membership talks with Iraq and Afghanistan, while Iran's bid to join has been denied for the 21st time by the US. Both countries stand to benefit from WTO membership, which promotes free trade. However, joining is a lengthy process with previous candidates taking 15 years to be admitted. The US said it could not approve Iran's application due to its review of relations, but some nations criticized this approach. Iraq's Trade Minister welcomed the move, and Afghanistan's envoy emphasized regional prosperity and global security. Currently, there are 27 countries seeking membership to the WTO.", "chatgpt-4o-latest": "The World Trade Organisation (WTO) is beginning membership talks with Iraq and Afghanistan, while Iran's bid has been blocked by the US for the 21st time. WTO membership offers significant trade benefits but involves a lengthy process, as seen with China, Russia, and Saudi Arabia. Iraq's Trade Minister welcomed the move, comparing it to debt relief from the Paris Club, while Afghanistan's envoy highlighted its potential for regional prosperity and security. There are 27 countries seeking WTO membership, requiring negotiations and legal adjustments. The US cited a review of relations as its reason for blocking Iran, though some nations, including the EU, criticized this stance, arguing Iran's application should be considered separately from political issues.", "stablelm2:1.6b": "The World Trade Organisation (WTO) will hold membership talks with Iraq and Afghanistan, while Iran's bid for join was refused due to US opposition. Both countries stand to benefit from free trade through the WTO, which promotes equal treatment in markets among member states. Membership takes years of negotiations and changes to domestic laws to align with WTO policies. China's admission into the WTO took several years, while talks with Russia and Saudi Arabia have been ongoing for more than a year. Currently, there are 24 countries seeking WTO membership. Prospective members must receive backing from current WTO members before proceeding with negotiations. The US could not approve Iran's application due to political issues, but several nations criticized the approach, including European Union Ambassador Carlo Trojan who said Iran's application should be treated independently of politics.", "granite3.1-dense:2b": "The World Trade Organisation (WTO) will initiate membership talks with Iraq and Afghanistan, aiming to promote free trade and ensure equal market treatment for their goods. Iran's bid for WTO membership was denied after 21 unsuccessful attempts due to US objections. China joined the WTO in 2001 following 15 years of negotiations, while talks with Russia and Saudi Arabia have persisted for a decade. Iraq's Trade Minister views this move as significant, comparable to the Paris Club's debt relief. Afghanistan's envoy anticipates enhanced regional prosperity and global security from WTO membership. Currently, 27 countries are in the application process. Prospective members must engage in negotiations with trading nations and amend domestic laws to align with WTO standards. Before starting, all 148 WTO members must endorse applicant countries. The US blocked Iran's application due to ongoing relations review, but the European Union urged independent consideration of Iran's bid.", "reference": "There are now 27 countries seeking membership of the WTO.The World Trade Organisation (WTO) is to hold membership talks with both Iraq and Afghanistan.But several nations criticised the approach, and European Union ambassador to the WTO, Carlo Trojan, said Iran's application \"must be treated independently of political issues\".Before the process gets under way, all 148 WTO members must give their backing to applicant countries.Membership of the Geneva-based WTO helps guarantee a country's goods receives equal treatment in the markets of other member states - a policy which has seen it become closely associated with globalisation.But Iran's bid to join the trade body has been refused after the US blocked its application for the 21st time."}