{"raw_text": "Troubled Marsh under SEC scrutiny\n \n The US stock market regulator is investigating troubled insurance broker Marsh & McLennan's shareholder transactions, the firm has said.\n \n The Securities and Exchange Commission has asked for information about transactions involving holders of 5% or more of the firm's shares. Marsh has said it is co-operating fully with the SEC investigation. Marsh is also the focus of an inquiry the New York attorney-general into whether insurers rigged the market. Since that inquiry was launched in October, Marsh has replaced its chief executive and held a boardroom shake-out to meet criticism by lessening the number of company executives on the board. Prosecutors allege that Marsh - the world's biggest insurance broker - and other US insurance firms may have fixed bids for corporate cover. This is the issue at the heart of the inquiry by New York's top law officer, Eliot Spitzer, and a separate prosecution of five insurers by the State of California. The SEC's investigation into so-called related party transactions includes dealings in the Trident Funds, managed by MMC Capital, the company's private equity firm. Marsh's new chief executive, Michael Cherkasky, is trying to negotiate a settlement with Mr Spitzer. Mr Spitzer has built up a reputation as a fierce critic and campaigner against corporate America's misdeeds.\n \n The uncertainty unleashed by the scandal has prompted three credit rating agencies - Standard & Poor's, Moody's and Fitch - to downgrade Marsh in recent weeks. According to the Financial Times, insurance analysts are now questioning whether Marsh will be able to maintain its strong record of earning growth as they draw up forecasts for the first quarter of next year. Doubts also exist over how much the company may have to pay regulators and lawyers to put the scandal behind.\n", "llama3.2:1b": "Marsh & McLennan's shareholder transactions are under investigation by SEC and New York attorney-general Eliot Spitzer due to allegations that insurers rigged the market and fixed bids for corporate cover. Marsh has replaced its CEO and held a boardroom shake-out to meet criticism. The company is cooperating with the investigations, but prosecutors allege it may have been involved in such activities.", "llama3.2:3b": "The US Securities and Exchange Commission is investigating troubled insurance broker Marsh & McLennan's shareholder transactions, amid allegations that insurers fixed bids for corporate cover. The firm has replaced its CEO and is cooperating with the SEC investigation, which also involves an inquiry by New York's attorney-general into whether insurers rigged the market.", "gemma2:2b": "The SEC is investigating Marsh & McLennan's shareholder transactions. The New York attorney general is also investigating allegations of market rigging by the firm and other US insurers. Marsh & McLennan is facing criticism for its internal practices, including executive compensation and board structure.  Credit rating agencies have downgraded Marsh due to the scandal. \n", "qwen2.5:0.5b": "The US stock market regulator is investigating troubled insurance broker Marsh & McLennan's shareholder transactions. The firm has co-operated with the SEC investigation but faces scrutiny from the New York attorney-general inquiry into whether insurers rigged the market since that inquiry began in October. The new chief executive and the company's shake-up have caused uncertainty, prompting credit rating agencies to downgrade Marsh after three-quarters of insurance analysts question its ability to maintain strong growth records for next year.", "qwen2.5:1.5b": "SEC investigating troubled Marsh & McLennan's shareholder transactions, with investigations into related party dealings including those involving the Trident Funds managed by Marsh's private equity firm. The firm has replaced its CEO and held a boardroom shake-out amid criticism of insurance firms rigging the market. The SEC is seeking information about 5%+ shareholdings. The scandal has prompted credit rating agencies to downgrade Marsh, while analysts question Marsh's ability to maintain earnings growth and pay regulatory and legal fees following the investigation.", "qwen2.5:3b": "US stock market regulator SEC is investigating troubled insurance broker Marsh & McLennan's shareholder transactions, following requests for information about 5%+ share holders. The SEC probe includes dealings in Trident Funds managed by MMC Capital. NY attorney-general Eliot Spitzer is also looking into possible market rigging by US insurers. This investigation has led to Marsh replacing CEO and board shake-up. Credit ratings agencies have recently downgraded Marsh, raising questions among analysts about its ability to maintain growth forecasts and potential regulatory fines.", "opencoder:1.5b": "Troubled insurance broker Marsh & McLennan's transactions involving shareholders are being investigated by the US stock market regulator under Securities and Exchange Commission's SEC investigation. The firm said it is fully cooperating with the investigation, replacing its chief executive in an inquiry into its boardroom shake-out to meet criticism.\n\nSince then, Marsh has replaced its chief executive and held a boardroom shake-out to investigate a related party transaction by the New York attorney-general, which is an issue of related securities. Prosecutors have alleged that Marsh may have fixed bids for corporate cover and insurers, including five, have filed separate lawsuits in California and other states.\n\nThe SEC's investigation into related party transactions reveals that the dealings with Trident Funds, managed by MMC Capital, are part of the investigation. Marsh's new chief executive, Michael Cherkasky, is trying to negotiate a settlement with Eliot Spitzer, who represents a separate inquiry by New York's top law officer.\n\nThe uncertainty brought about by the scandal has prompted three credit rating agencies to downgrade Marsh in recent weeks and analysts are now questioning whether Marsh will maintain its strong earnings record as they draw up forecasts for the first quarter of next year. Doubts also exist over how much the company may have to pay regulators and lawyers.\n", "smollm:1.7b": "The US stock market regulator is investigating troubled insurance broker Marsh & McLennan's shareholder transactions, the firm has said. The Securities and Exchange Commission (SEC) has asked for information about transactions involving holders of 5% or more of the firm's shares. Marsh has said it is co-operating fully with the SEC investigation. Marsh is also the focus of an inquiry by New York Attorney-General Eric Schneiderman into whether insurers rigged the market. Since that inquiry was launched in October, Marsh has replaced its chief executive and held a boardroom shake-out to meet criticism by lessening the number of company executives on the board. Prosecutors allege that Marsh - the world's biggest insurance broker - and other US insurance firms may have fixed bids for corporate cover. This is the issue at the heart of the inquiry by New York's top law officer, Eliot Spitzer, and a separate prosecution of five insurers by the State of California. The SEC's investigation into so-called related party transactions includes dealings in the Trident Funds, managed by MMC Capital, the company's private equity firm. Marsh's new chief executive, Michael Cherkasky, is trying to negotiate a settlement with Mr Spitzer. Mr Spitzer has built up a reputation as a fierce critic and campaigner against corporate America's misdeeds. The uncertainty unleashed by the scandal has prompted three credit rating agencies - Standard & Poor's, Moody's and Fitch - to downgrade Marsh in recent weeks. According to the Financial Times, insurance analysts are now questioning whether Marsh will be able to maintain its strong record of earning growth as they draw up forecasts for the first quarter of next year. Doubts also exist over how much the company may have to pay regulators and lawyers to put the scandal behind.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving key ideas and details. Let me read through it carefully.\n\nSo, the main point is about a troubled insurance broker named Marsh & McLennan facing SEC scrutiny. They're looking into shareholder transactions for 5% or more ownership. The firm's shares are involved in corporate coverage bids fixed by MMC Capital. New CEO Michael Cherkasky is being investigated too, as well as other insurers.\n\nThe SEC is asking for info on these transactions, which include Trident Funds. They’re part of an inquiry into whether insurers rigged the market. This led to changes in MMC's leadership and a new board due to criticism. The NY attorney general is involved in this as well.\n\nAlso, there are different prosecutions from California and others. The SEC’s investigation includes related parties, especially in Trident. Rating agencies Standard & Poor's, Moody's, and Fitch have downgraded Marsh because of the scandal affecting their growth forecasts and regulations.\n\nSo, key points are: MMC facing SEC, shareholder issues, changes in CEO, criticism, inquiry by NY attorney general, other prosecutions, impact on ratings.\n\nI need to condense this into a summary without adding any extra information. Just keep it straightforward.\n</think>\n\nThe insurance broker Marsh & McLennan is under scrutiny by the US Securities and Exchange Commission for investigations involving 5% or more ownership of its shares. The firm has also been involved in bids from MMC Capital, including Trident Funds, which had a track record of fixing corporate coverage. MMC's CEO, Michael Cherkasky, is being questioned, as are other insurancemakers. Additionally, the New York attorney general is investigating whether insurers rigged the market. The SEC's investigation includes related parties, particularly in Trident Funds. Rating agencies have downgraded the firm, citing the impact on its growth and regulatory responsibilities.", "tinyllama:1.1b": "The US stock market watchdog, the Securities and Exchange Commission (SEC), has initiated an investigation into the shareholder transactions of troubled insurance firm Marsh & McLean. The investigation is focused on allegations of rigging the financial markets through a strategy known as 'related party transactions', involving dealings in the TriDent Funds managed by MM Capital, which are owned by the company's private equity arm. In addition to the scrutiny brought about by a recent probe by the New York attorney-general, there is also an ongoing inquiry into insurer fraud and rigging by Marsh, in collaboration with other US firms. Marsh's chief executive Michael Cherkasky has been trying to negotiate a settlement with SEC investigators, but so far, they remain skeptical of the company's ability to maintain its financial strength. The uncertainty caused by the irregularities has prompted three credit rating agencies - Standard & Poor's, Moody's and Fitch - to downgrade Marsh in recent weeks. Insurance analysts have expressed concerns over how much regulators and lawyers may have to pay out for the investigation into the shareholder transactions, which could potentially affect the company's finances and reputation.", "tinydolphin:1.1b": " The US stock market regulator is investigating Marsh & McLennan's shareholder transactions, focusing on transactions involving holders of 5% or more of the firm's shares. The New York attorney-general inquiry has also launched into whether insurers rigged the market. This issue at the heart of the inquiry is being probed by prosecutors led by Eliot Spitzer and a separate probe of five insurance companies by California. The SEC's investigation includes dealings in Trident Funds managed by MMC Capital, which is owned by Marsh & McLennan. \n\nIn recent weeks, three credit rating agencies - Standard & Poor's, Moody's and Fitch - have downgraded Marsh in a bid to reduce its risk. The uncertainty has prompted analysts to question whether the firm will be able to maintain its strong earnings growth as they prepare for the first quarter of next year. There are also concerns over how much the company may have to pay regulators and lawyers to resolve the crisis.", "phi:2.7b": " The US stock market regulator is investigating troubled insurance broker Marsh's shareholder transactions, including those involving holders of 5% or more of its shares. Marsh has stated that it is cooperating fully with the SEC investigation, while also facing criticism from New York's top law officer for potentially rigging the market. Three credit rating agencies have downgraded Marsh as a result, causing uncertainty over the company's ability to maintain its earning growth and potential legal fees and fines.\n", "orca-mini:3b": " Marsh is under investigation by the US stock market regulator, SEC, for shareholder transactions. The firm has co-operated fully with the inquiry. In addition, MMC Capital, a private equity firm managing Trident Funds, is also being investigated for related party transactions. Michael Cherkasky, the new chief executive, is trying to negotiate a settlement with Eliot Spitzer, the New York attorney-general. The scandal has led to three credit rating agencies downgrading Marsh, and insurance analysts are now questioning its ability to maintain earnings growth.", "hermes3:3b": "Marsh & McLennan investigated by SEC over shareholder transactions, New York attorney-general inquiry into market rigging by insurers.", "stablelm-zephyr:3b": "The US Securities and Exchange Commission (SEC) is investigating insurance broker Marsh & McLennan's shareholder transactions, focusing on those involving holders of 5% or more of the firm's shares. This investigation comes amid a New York attorney-general inquiry into potential market rigging by Marsh and other US insurance firms, as well as a separate prosecution by the State of California. Since the scandal erupted, all three major credit rating agencies have downgraded Marsh, and there are concerns over the company's ability to maintain strong earnings growth.", "chatgpt-4o-latest": "Marsh & McLennan is under investigation by the SEC regarding shareholder transactions involving major stakeholders. The company is also being scrutinized by New York Attorney General Eliot Spitzer for alleged bid-rigging in the insurance market. Since the inquiry began, Marsh has replaced its CEO and restructured its board. The SEC is also examining related party transactions involving Trident Funds, managed by MMC Capital. New CEO Michael Cherkasky is negotiating a settlement with Spitzer. The scandal has led to credit rating downgrades by major agencies, and analysts are questioning Marsh’s future earnings growth and potential legal costs.", "stablelm2:1.6b": "US stock market regulator investigates Marsh, the world's largest insurance broker, over shareholder transactions and potential market rigging involving insurers. The Securities and Exchange Commission has requested information from 5% or more of Marsh shares; the firm is cooperating with the investigation. The inquiry includes the replacement of chief executive and actions regarding the Trident Funds managed by MMC Capital. Credit rating agencies have downgraded Marsh amid concerns over earnings growth, regulators, and legal expenses following a scandal involving potentially rigged insurance markets.", "granite3.1-dense:2b": "Marsh & McLennan, a leading global insurance broker, is under scrutiny by the US Securities and Exchange Commission (SEC) for its shareholder transactions involving holders of 5% or more shares. The SEC investigation also covers dealings in the Trident Funds managed by MMC Capital, Marsh's private equity firm. This follows an inquiry by New York Attorney General Eliot Spitzer into allegations that Marsh and other US insurance firms may have colluded to rig corporate insurance bids. Marsh has replaced its CEO and restructured the board in response to these accusations. The company is also negotiating a settlement with Spitzer, who has a history of targeting corporate misconduct. Credit rating agencies have downgraded Marsh due to the uncertainty caused by this scandal, casting doubt on its future earnings growth and potential settlement costs.", "reference": "The US stock market regulator is investigating troubled insurance broker Marsh & McLennan's shareholder transactions, the firm has said.Marsh has said it is co-operating fully with the SEC investigation.Marsh is also the focus of an inquiry the New York attorney-general into whether insurers rigged the market.Since that inquiry was launched in October, Marsh has replaced its chief executive and held a boardroom shake-out to meet criticism by lessening the number of company executives on the board.Prosecutors allege that Marsh - the world's biggest insurance broker - and other US insurance firms may have fixed bids for corporate cover.The uncertainty unleashed by the scandal has prompted three credit rating agencies - Standard & Poor's, Moody's and Fitch - to downgrade Marsh in recent weeks."}