{"raw_text": "Boeing secures giant Japan order\n \n Boeing is to supply Japan Airlines with up to 50 of its forthcoming 7E7 planes in a deal that could be worth as much as $6bn (£3.1bn) for the US giant.\n \n Japan Airlines has made a firm order for 30 of the aircraft, at $120m each, with the option to buy 20 more. Asia's biggest airline joins Japanese rival All Nippon as one of the first carriers to order the mid-size 7E7, which Boeing says is super-economical. Airbus this week announced the first pre-sale of its 7E7 rival - the A350. Boeing's great European competitor is to sell 10 of its forthcoming A350 to Spanish carrier Air Europe, which has the option to buy two more in a deal that could be worth more than $1.8bn. Both the 7E7 and the A350 are being designed to be as fuel-efficient as possible in the 200- to 300-seat sector, and each will be available in both short and long range versions.\n \n Japan Airlines said it had looked at both aircraft before choosing the 7E7, also known as the Dreamliner. \"We chose the 7E7 after carefully considering both it and Airbus' aircraft,\" said a Japan Airlines spokesman. \"The 7E7 fits better for what we needed and it could be delivered when we hoped to get it.\" Boeing continues to enjoy a dominance over Airbus in Japan, and Japanese companies are taking key roles in building the 7E7. The first 7E7s will be delivered to Japan Airlines in April 2008. Boeing has set itself a target of getting 200 firm commitments for the 7E7 by the end of this year, and has orders for 56 so far. Airbus hopes to have 50 orders in place for the A350 by mid-2005.\n", "llama3.2:1b": "Boeing secures giant Japan order for up to 50 7E7 planes worth $6bn. Japan Airlines makes a firm order for 30, with option to buy 20 more. Boeing's rival Airbus plans to sell 10 A350s to Air Europe and could offer two more in a deal worth over $1.8bn.", "llama3.2:3b": "Boeing secures order from Japan Airlines for up to 50 of its 7E7 planes, valued at $6 billion. Japan Airlines also considered Airbus' A350 but chose the 7E7. The first deliveries are expected in April 2008.", "gemma2:2b": "Boeing will supply Japan Airlines with up to 50 of its 7E7 planes worth potentially $6 billion.  Japan Airlines made a firm order for 30 aircraft and has an option for 20 more, joining All Nippon as one of the first carriers to order the fuel-efficient midsize plane.  Both Boeing's 7E7 and Airbus' A350 are aimed at the 200-300 seat market with similar efficiency and range options. Japanese companies play a crucial role in 7E7 construction, with the first deliveries to Japan Airlines expected in April 2008.  Boeing is aiming for 200 firm commitments by year-end and Airbus seeks 50 A350 orders by mid-2005.   \n", "qwen2.5:0.5b": "Boeing secures a major Japanese order with its forthcoming 7E7 aircraft, which could potentially amount to $6 billion (£310 million). Japan Airlines is currently ordering two-thirds of the 7E7s and has the option to buy the remaining one-third. Both the A350 rival from Airbus and Boeing have plans for delivery in the same year.", "qwen2.5:1.5b": "Boeing secures a giant Japan order worth up to $6bn with 50 7E7 planes, joining All Nippon as one of the first carriers ordering the aircraft, designed for efficiency and availability in the 200-300 seat market. Airbus announces the A350 pre-sale deal and targets 50 orders by mid-2005. Boeing also aims for 200 firm commitments for the 7E7 by year-end, while Airbus is expected to secure at least 50 for the A350.", "qwen2.5:3b": "Boeing secured a $6bn order from Japan Airlines for up to 50 7E7 planes worth $120m each, with options for 20 more. The deal includes Japan Airlines’ firm order of 30 aircraft and its purchase option of 20. The 7E7 is designed for the mid-size market and is touted as super-economical. Airbus also announced orders for its A350. Japan Airlines chose the 7E7 over Airbus’s rival, citing better fit and quicker delivery. Boeing aims to secure 200 firm commitments by year-end, with 56 so far.", "opencoder:1.5b": "\"Boeing secures giant Japan order\"\n\nThe text is summarizing a deal between Boeing and Japan Airlines that aims to get up to 50 of its forthcoming 7E7 planes, which are designed for as efficient as possible. The Japanese company orders 30 of these aircraft at $120/m which allows them to buy 20 more. It's notable that the 7E7 is seen as a super-economical option to Japan Airlines' fleet. Airbus, announced this week, also has a potential pre-sale for the A350 in addition to the 7E7.\n\nJapan Airlines has already considered the 7E7 and decided to go with it because it's known for being more fuel-efficient than Airbus's A350. As such, it was chosen as the Dreamliner by Japanese companies.\n\nThe deal is priced at approximately $6bn (£3.1bn) which translates to a potential worth of about $120bn (£100bn). Japan Airlines has a firm order that will be available in April 2008 and they anticipate having more than 200 orders planned for the 7E7s, with around 56 so far.\n\nBoeing continues to enjoy a dominance over Airbus in Japan and is taking key roles in building the 7E7. The aim is to secure more of these aircraft and hope to have the 50 orders ready by the end of this year.\n", "smollm:1.7b": "The summary should be: Boeing secures giant Japan order", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text about Boeing securing a large Japan order for their 7E7 planes. Let me read through it again carefully.\n\nSo, Boeing is supplying Japan Airlines with up to 50 7E7 planes, which could be worth $6 billion. They're offering both 30 and 20 more planes at $120 million each. They’re part of a big group called Asia's largest airline, which is now joining Japanese rivals like All Nippon for the first mid-size planes.\n\nThe A350 from Airbus is another major plane, being sold to Air Europe, with plans to get 50 orders by mid-2005. Both planes are fuel-efficient, designed for medium-sized planes (200-300 seats). Boeing still dominates Airbus in Japan and companies are building the planes.\n\nI need to make sure I include all key points without getting too detailed. Let me list them out: Boeing has 50 7E7 orders with a total value of up to $6 billion. They’re selling 30 at $120M each, plus two more. The A350 is being sold by Airbus and they plan to sell 50. Both planes are efficient for mid-size and come from Asian competitors.\n\nI should structure this into a concise summary without adding any extra details or explanations.\n</think>\n\nBoeing has secured a major Japan order for 50 of their 7E7 planes, potentially worth $6 billion. The aircraft is being sold in two batches: 30 planes at $120 million each plus an option to buy two more, and all Nippon is joining Japanese airlines as first carriers. Airbus has introduced the A350 for another major plane, part of their European competition, with plans to sell 50 units by mid-2005. Both planes are fuel-efficient and designed for medium-sized planes.", "tinyllama:1.1b": "Boeing has secured a giant order from Japan Airlines for up to 50 of its forthcoming 7E7 planes, worth approximately $6bn (£3.1bn) each. The deal also includes the option for a further 20 orders at an estimated value of around $1.8bn. Both the 7E7 and A350 are being designed to be fuel-efficient in the 200- to 300-seat sector, with Boeing's Dreamlineer series featuring both short and long range versions. Japan Airlines has cited the need for a more efficient aircraft as a reason for choosing Boeing over Airbus, citing their expertise in building planes for the region. Despite enjoying a strong market share in Japan, Boeing has continued to benefit from orders for its 7E7, and is expecting to secure at least 200 firm commitments by the end of this year. Airbus has already secured 56 firm orders for the A350, but hopes to have around 50 orders in place before mid-2005.", "tinydolphin:1.1b": " Boeing is securing a massive order from Japan Airlines for up to 50 aircraft, valued at $6 billion or around £3 billion. This is the first significant Japanese aircraft order for Boeing in recent times, and represents a strong endorsement of its Super-Jumbo 7E7 model by one of the biggest airlines in Asia. Japan Airlines has placed a firm order for 30 aircraft, with an option to purchase 20 more at $120 million each. The A350 is another competitor from Airbus that promises to be even more fuel-efficient than its predecessor, the 747. Boeing's first pre-sale of the A350 was for a company in Spain, while Air Europe has selected a pair of A350s as part of its initial purchase. Both models are designed to be ultra-fuel efficient and can operate in both short and long ranges, making them perfect for the 200- to 300 seat market.", "phi:2.7b": " The article reports that Japan Airlines has signed a deal with Boeing to buy up to 50 of the 7E7 planes, which are known as super-economical and fuel-efficient, for $120m each. The order is the first for the 7E7 model, and Japan Airlines has chosen it over Airbus' A350 because it suits its needs better. The deal is worth as much as $6bn for Boeing, and both planes are being designed to be more economical than the existing models in the 200-300 seat sector.\n", "orca-mini:3b": " Boeing secures $6bn deal with Japan Airlines for 50 7E7 planes, with an option to buy another 20. The deal could be worth up to $6bn for the US giant's mid-size Dreamliner plane. Japan Airlines has chosen the 7E7 over Airbus' A350, and both planes are designed to be super-economical in the 200-to-300-seat sector. Boeing is targeting a goal of 200 firm commitments for the 7E7 by the end of this year, with orders for 56 so far. Airbus hopes to have 50 orders for its A350 by mid-2005.", "hermes3:3b": "Boing (Japan Jales order) ( $6bn potential worth for Boeing )\nBoeing supplied up to 50 7E7 planes for Japan Airlines, potentially worth $6b. Japan Airlines ordered 30 with option for 20 more.", "stablelm-zephyr:3b": "Boeing secures a major order from Japan Airlines, agreeing to supply up to 50 of its 7E7 planes, potentially worth $6bn. The deal includes 30 firm aircraft at $120m each and an option for 20 more. This places Japan Airlines alongside All Nippon as one of the first carriers to order the mid-size, fuel-efficient 7E7. Airbus announced the first pre-sale of its A350 rival in the same sector, with plans for 10 planes sold to Spanish carrier Air Europe and options for two additional aircraft. Both Boeing's 7E7 and Airbus' A350 target maximum fuel efficiency within the 200-300 seat sector, with both available in short and long range versions. The first 7E7s will be delivered to Japan Airlines in April 2008.", "chatgpt-4o-latest": "Boeing has secured a major order from Japan Airlines for up to 50 of its new 7E7 aircraft, worth up to $6 billion. The airline placed a firm order for 30 planes at $120 million each, with an option for 20 more. Japan Airlines chose the 7E7 over Airbus' A350, citing better suitability and delivery timing. Boeing maintains dominance in Japan, with Japanese firms playing key roles in building the 7E7. The first deliveries are set for April 2008. Meanwhile, Airbus has announced its first pre-sale of the A350, selling 10 to Spain's Air Europe with an option for two more, in a deal worth over $1.8 billion. Both aircraft are designed for fuel efficiency in the 200- to 300-seat market. Boeing aims for 200 firm 7E7 commitments by year-end, with 56 so far, while Airbus targets 50 A350 orders by mid-2005.", "stablelm2:1.6b": "Boeing receives a significant order from Japan Airlines for up to 70 of its forthcoming 7E7 planes, with an estimated value of $6bn (£3.1bn). The deal includes Japan Airlines' firm order for 25 aircraft and the option to buy another 25. This marks Asia's largest airline as one of the first carriers to order the mid-size 7E7. Both Boeing's 7E7 and Airbus' Aeronautical Aircraft will be designed to be fuel-efficient, with each aircraft available in both short and long-range versions. The first delivery of the 7E7s is scheduled for April 2018, with Boeing aiming for 75 firm commitments by the end of this year.", "granite3.1-dense:2b": "Japan Airlines has placed a significant order for up to 50 Boeing 7E7 (Dreamliner) planes, valued at approximately $6bn (£3.1bn), with an initial commitment of 30 aircraft priced at $120m each and the potential to buy 20 more. This order positions Japan Airlines as one of the first carriers to secure the mid-size, fuel-efficient 7E7, which outperforms Boeing's European competitor, the A350, in terms of cost and delivery time.\n\nThe 7E7, designed for the 200-300-seat market, will be available in both short and long-range versions. Japan Airlines opted for the 7E7 due to its better fit for their needs and schedule, with deliveries expected to begin in April 2008. Boeing aims to secure 200 firm commitments for the 7E7 by the end of this year, having already received 56 orders.\n\nMeanwhile, Airbus has seen Spanish carrier Air Europe secure the first pre-sale of its A350, with an option for two more aircraft, potentially worth over $1.8bn. Despite Japan Airlines' commitment to the 7E7, Boeing maintains dominance in the Japanese market, with key roles filled by Japanese companies during the 7E7's construction.", "reference": "\"We chose the 7E7 after carefully considering both it and Airbus' aircraft,\" said a Japan Airlines spokesman.Japan Airlines has made a firm order for 30 of the aircraft, at $120m each, with the option to buy 20 more.Boeing is to supply Japan Airlines with up to 50 of its forthcoming 7E7 planes in a deal that could be worth as much as $6bn (£3.1bn) for the US giant.Japan Airlines said it had looked at both aircraft before choosing the 7E7, also known as the Dreamliner.Boeing continues to enjoy a dominance over Airbus in Japan, and Japanese companies are taking key roles in building the 7E7.Airbus this week announced the first pre-sale of its 7E7 rival - the A350."}