{"raw_text": "Building giant in asbestos payout\n \n Australian building products group James Hardie has agreed to pay $1.1bn (£568m) to victims of asbestos-related diseases.\n \n The landmark deal could see thousands of people suffering from lung diseases - caused by asbestos the company once made - receive compensation. The move follows angry protests after the firm said a previous compensation fund was running out of money. A subsequent New South Wales state inquiry criticised Hardie's actions. In September, the inquiry found that the company had misled the public about the amount of money set aside to cover its asbestos-related liabilities, sparking the resignation of its then chief executive, Peter MacDonald.\n \n Campaigners welcomed news of the preliminary agreement. \"This is a momentous day in the fight for victims and their families,\" said asbestosis sufferer Bernie Banton, who leads a victims' association. \"There is still a long way to go, but we are getting there.\" James Hardie chairwoman, Meredith Hellicar, said the deal provided for a funding arrangement \"that is affordable, sensible and workable\". \"At the end of the day we are dealing with compensation for people who are terminally ill. We don't know exactly how many of them there will be, we don't know over what exact period they will fall ill,\" she said. However, the deal still has to receive the approval of Hardie's shareholders.\n \n Hardie, which currently makes more than 80% of its revenues in the US, was once Australia's biggest supplier of asbestos building materials. In 2001, the company set up a fund to compensate asbestos victims, but it later admitted the fund was running short of money. A decision by Hardie to move its headquarters to the Netherlands - while remaining a listed company in Australia - provoked a damaging public outcry. Victims groups accusing it of trying to escape its responsibilities by moving abroad, a charge the company denies. Australia's securities watchdog is currently investigating Hardie's former chief executive and former chief financial officer over allegations of misleading investors and the general public.\n", "llama3.2:1b": "Australian building products group James Hardie has agreed to pay $1.1 billion (£568m) to victims of asbestos-related diseases following a previous compensation fund being deemed inadequate. The company will provide funding for thousands of people suffering from lung diseases. A New South Wales state inquiry criticized the company's actions, leading to its then-chief executive Peter MacDonald's resignation and subsequent criticism of the company's handling of asbestos liabilities.", "llama3.2:3b": "James Hardie agrees to pay $1.1bn in asbestos payout to thousands of victims of lung diseases caused by its products, following a New South Wales state inquiry that criticised the company's actions and led to the resignation of its CEO. The deal is still subject to shareholder approval, but campaigners say it's a \"momentous day\" for those affected by asbestos-related diseases.", "gemma2:2b": "James Hardie agreed to pay $1.1 billion to compensate victims of asbestos-related diseases. The deal comes after protests following the company's admission that its previous compensation fund was running out of money, leading to a New South Wales state inquiry into their actions.  The agreement still needs shareholder approval and will likely provide compensation for thousands suffering from lung diseases caused by asbestos. \n", "qwen2.5:0.5b": "James Hardie agreed to pay $1. 1bn (£568m) in a deal with victims of asbestos-related diseases. The company said it would use part of its compensation money for research into alternatives to asbestos materials.", "qwen2.5:1.5b": "James Hardie has agreed to pay $1. 1 billion in compensation for victims of asbestos-related diseases after an initial deal fell through due to a previous fund running low on money. The move follows intense protests and criticism from campaigners and regulators. The settlement provides funding for thousands of people suffering from lung diseases related to past asbestos use, which the company once manufactured. However, it still needs shareholder approval and is part of ongoing investigations into Hardie's leadership practices.", "qwen2.5:3b": "Australian building products group James Hardie has agreed to pay $1.1bn for asbestos-related diseases compensation. The move follows previous criticisms, including a state inquiry which found the company had misled the public about its asbestos liabilities. Campaigners welcomed the deal, while James Hardie’s chairwoman noted it provides an affordable funding arrangement for terminally ill victims who number uncertainly and over what period they will fall ill. However, the deal still requires shareholder approval. Previously, Hardie faced public outcry after moving its headquarters to avoid Australian responsibilities.", "opencoder:1.5b": "Building giant in asbestos payout\n\nAustralian building products group James Hardie has agreed to pay $1.1bn (£568m) to victims of asbestos-related diseases.\n\nThe landmark deal could see thousands of people suffering from lung diseases - caused by asbestos the company once made - receive compensation. The move follows angry protests after the firm said a previous compensation fund was running out of money. A subsequent New South Wales state inquiry criticised Hardie's actions. In September, the inquiry found that the company had misled the public about the amount of money set aside to cover its asbestos-related liabilities, sparking the resignation of its then chief executive, Peter MacDonald.\n\nCampaigners welcomed news of the preliminary agreement. \"This is a momentous day in the fight for victims and their families,\" said asbestosis sufferer Bernie Banton, who leads a victims' association. \"There is still a long way to go, but we are getting there.\" James Hardie chairwoman, Meredith Hellicar, said the deal provided for a funding arrangement \"that is affordable, sensible and workable\". However, the deal still has to receive the approval of Hardie's shareholders.\n", "smollm:1.7b": "The text summarizes the key points of the article \"Building giant in asbestos payout\" in concise and clear language. The main idea is that James Hardie, an Australian building products company, has agreed to pay $1.1 billion (£568 million) to victims of asbestos-related diseases. The agreement follows a previous compensation fund run out of money, which was criticized by the New South Wales state inquiry. A subsequent investigation found that the company had misled the public about the amount set aside for compensation. The deal provides for a funding arrangement \"that is affordable, sensible and workable\", but it still needs to be approved by Hardie's shareholders.\n\nThe summary highlights the key points of the article:\n\n1. James Hardie, an Australian building products company, has agreed to pay $1.1 billion (£568 million) to victims of asbestos-related diseases.\n2. The agreement follows a previous compensation fund run out of money, which was criticized by the New South Wales state inquiry.\n3. A subsequent investigation found that the company had misled the public about the amount set aside for compensation.\n4. The deal provides for a funding arrangement \"that is affordable, sensible and workable\", but it still needs to be approved by Hardie's shareholders.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about James Hardie paying for asbestos-related diseases. Let me read through it carefully.\n\nSo, James Hardie has agreed to pay $1.1 billion in compensation to their asbestos victims. That's a big deal because they were once a major supplier of asbestos materials in Australia.\n\nThe story says that this is a milestone towards healing the emotional trauma caused by asbestos exposure. It mentions thousands of people being treated for lung diseases due to the disease-causing material.\n\nThere was an angry protest after Hardie initially used a compensation fund, but it ran out. Then, a New South Wales state inquiry criticized their actions, leading to Peter MacDonald resigning as CEO.\n\nCampaigners were hopeful about this move, with Bernie Banton from the victims' group saying they're getting closer. The chairwoman, Meredith Hellicar, highlighted that James Hardie isn't trying to hide their costs because it's affordable and makes sense.\n\nThe deal needs shareholders' approval, but the company has moved its headquarters abroad. There might be more investigations into whether they lied about the funding.\n\nSo, putting this together into a concise summary without explanations or formatting, just plain text.\n</think>\n\nJames Hardie has agreed to pay $1.1 billion in compensation for asbestos-related diseases of their victims. This marks a significant step toward healing the emotional toll caused by asbestos exposure. The company previously provided compensation funds but later admitted the fund was short, prompting criticism from a New South Wales state inquiry. The CEO resigned due to misleading investors and public. Campaigners expect this deal to bring the fight for victims closer to completion, though compensation approval still pending.", "tinyllama:1.1b": "In a major step towards compensation for victims of asbestos-related diseases, Australian building products group James Hardie has agreed to pay $1.1 billion (£568 million) to those who suffered from lung disease caused by its products in the past. The agreement follows an earlier compensation fund set aside by the company running out of money and a state inquiry criticising its actions. Victims' groups and campaigners hailed the preliminary settlement as a \"memorable day\" in the fight for victim and their families, with $50 million (£32 million) pledged to the Australian Consumer Council. James Hardie chairwoman Meredith Hellicar said the deal provided a funding arrangement that was \"affordable, sensible, and workable\". The settlement is subject to shareholder approval and the company's headquarters moving to the Netherlands while it remains listed in Australia, a charge the company denies. Victims groups have accused Hardie of trying to escape its responsibilities by moving abroad, with a decision by the company to move their headquartersextracted from news reports. The Australian Securities & Investments Commission (ASIC) is currently investigating former chief executive Peter MacDonald and former finance chief Chris Hutchinson for allegations of misleading investors and the general public.", "tinydolphin:1.1b": " James Hardie has reached an initial preliminary agreement to pay $1.1 billion (£568 million) in compensation to victims of asbestos-related diseases, after initially denying responsibility for the harm. This is a momentous day in the fight for victims and their families, with the deal providing a funding arrangement that is affordable, sensible, and workable. Hardie's decision to move its headquarters to the Netherlands sparked outrage from Australian campaigners, who accused the company of attempting to evade its responsibilities by moving abroad. The deal has received the approval of Hardie's shareholders but still needs the approval of the company's American suppliers before it can be implemented.", "phi:2.7b": " Australian building products group James Hardie has agreed to pay $1.1 billion to victims of asbestos-related diseases, sparking protests after the firm said a previous compensation fund was running out of money. The landmark deal could see thousands of people receive compensation for lung diseases caused by asbestos that the company once made. It follows angry protests and an inquiry which found that Hardie had misled the public about the amount of money set aside to cover its liabilities, leading to the resignation of then-chief executive Peter MacDonald. Campaigners welcomed the deal but acknowledged that there is still a long way to go in the fight for victims and their families.\n", "orca-mini:3b": " Australian building products group James Hardie has agreed to pay $1.1bn to victims of asbestos-related diseases following an inquiry into its actions and a previous compensation fund running out of money. The deal provides for a funding arrangement that is affordable, sensible and workable, but still requires approval from shareholders.", "hermes3:3b": "James Hardie $1.1b asbestos payout for victims of asbestos-related diseases. Follows state inquiry criticism and previous fund shortage. Deal needs shareholder approval.", "stablelm-zephyr:3b": "James Hardie, an Australian building products group, has agreed to pay $1.1bn to victims of asbestos-related diseases. The preliminary agreement could see thousands of people receiving compensation for lung diseases caused by asbestos the company once produced. This comes after a New South Wales state inquiry criticized Hardie's actions and found that the company had misled the public about its compensation fund. The deal must receive approval from Hardie's shareholders.", "chatgpt-4o-latest": "James Hardie, an Australian building products company, has agreed to pay $1.1 billion to compensate victims of asbestos-related diseases. The deal follows public outrage and a New South Wales inquiry that found the company misled the public about the adequacy of its previous compensation fund, leading to the resignation of its CEO. Campaigners welcomed the agreement, though it still requires shareholder approval. Hardie, once Australia's largest asbestos supplier, faced criticism for relocating its headquarters to the Netherlands, with victims' groups accusing it of evading responsibility. Australia's securities watchdog is investigating the company's former executives for allegedly misleading investors and the public.", "stablelm2:1.6b": "Australian building products firm James Hardie has agreed to pay $1.1bn (£1m) to victims of asbestos-related diseases in a deal that could potentially compensate thousands who were suffering from lung diseases caused by previous asbestos use. The payment follows criticism and protests after previous compensation fund was running out of money, and an NSW state inquiry found the company had misled the public about the amount set aside for its liabilities. This comes after campaigners welcomed the news of the preliminary agreement with the company. However, the deal still requires shareholder approval before it becomes final.", "granite3.1-dense:2b": "Australian building materials giant James Hardie has agreed to pay $1.1 billion in compensation to victims of asbestos-related diseases, affecting potentially thousands of people with lung conditions caused by the company's historically produced products. This decision follows a state inquiry criticizing Hardie for misleading the public about its ability to cover asbestos liabilities, leading to the resignation of its then CEO, Peter MacDonald. The deal, still subject to shareholder approval, aims to provide affordable and workable compensation, despite uncertainties regarding the number and timeline of affected individuals. Hardie, now primarily a US-based company, previously established an asbestos victim fund but faced funding shortages. Victims' groups accuse the company of attempting to avoid responsibility by relocating its headquarters to the Netherlands, a claim Hardie denies. The Australian securities watchdog is currently investigating Hardie's former executives for misleading investors and the public.", "reference": "In 2001, the company set up a fund to compensate asbestos victims, but it later admitted the fund was running short of money.The move follows angry protests after the firm said a previous compensation fund was running out of money.The landmark deal could see thousands of people suffering from lung diseases - caused by asbestos the company once made - receive compensation.However, the deal still has to receive the approval of Hardie's shareholders.In September, the inquiry found that the company had misled the public about the amount of money set aside to cover its asbestos-related liabilities, sparking the resignation of its then chief executive, Peter MacDonald.Hardie, which currently makes more than 80% of its revenues in the US, was once Australia's biggest supplier of asbestos building materials.Australian building products group James Hardie has agreed to pay $1.1bn (£568m) to victims of asbestos-related diseases."}