{"raw_text": "Police detain Chinese milk bosses\n \n Chinese police have detained three top executives at milk firm Yili, with reports suggesting that they are being investigated for embezzlement.\n \n Yili - full name Inner Mongolia Yili Industrial - confirmed its chairman, chief financial officer and securities representative were all in custody. The company, China's third-largest milk producer, is to hold an emergency meeting to debate the issue. A Yili spokesman said it may now move to oust chairman Zheng Junhuai. The spokesman did not say why the three had been detained by the police. The official Xinhua News Agency said the arrest was linked to alleged embezzlement.\n \n Yili has recently been the subject of intense media speculation over its financial operations. Executives are suspected of wrongly using 417m yuan ($50.4m; £26m) of company funds to support a management buyout back in July 2003. Yili's shares were suspended on Tuesday, having fallen by 10% on Monday. The company and its two main rivals - market leader Mengniu Dairy and second place Bright Dairy - dominate a Chinese milk market that has grown by almost 30% over the past five years. Analysts wondered if the scandal at Yili - the latest to befall Chinese companies this year - could be followed by further revelations of corporate wrongdoing. \"Investors wonder if Yili's scandal, one of a slew to be uncovered this year, isn't just the tip of the iceberg,\" said Chen Huiqin, an analyst at Huatai Securities.\n", "llama3.2:1b": "Chinese police have detained three top executives from milk firm Yili: chairman Zheng Junhuai, CFO Li Rong, and securities representative Wang Xianli, on allegations of embezzlement. The company plans to hold an emergency meeting to discuss the issue. Police did not specify why they were investigating these officials.", "llama3.2:3b": "Chinese police detained three top executives at milk firm Yili, suspected of embezzlement and using $50.4m in company funds for a management buyout in 2003. Yili shares fell by 10% on Tuesday after being suspended. Analysts worry if the scandal is just the tip of the iceberg, following recent corporate wrongdoing cases this year.", "gemma2:2b": "Three executives from milk firm Yili have been detained for suspected embezzlement.  Yili is facing investigation and a potential shake-up after allegations that they misused company funds for a management buyout in 2003. Shares were suspended on Tuesday following the news, raising concerns about further corporate wrongdoing in the Chinese market. \n", "qwen2.5:0.5b": "Yili has been under investigation for suspected embezzlement by its top executives. Chinese police have detained three of Yili's employees and are expected to hold an emergency meeting to discuss the matter. The company is holding back shares due to concerns about potential future scandals. Analysts are concerned that the scandal at Yili could be a prelude to more corporate wrongdoing.", "qwen2.5:1.5b": "Chinese police have detained three executives at milk firm Yili, amid concerns over alleged embezzlement. Yili shares suspended, company holding emergency meeting to discuss potential changes. Yili is China's third-largest milk producer and market leader. Investigation linked to July 2003 management buyout using company funds totaling 417 million yuan. Market speculation rises over corporate wrongdoing in the dairy industry.", "qwen2.5:3b": "Police in China have detained three top executives from milk firm Yili for suspected embezzlement. The chairman and chief financial officer were also under investigation by officials who linked the arrest to allegations of misusing 417m yuan ($50.4m; £26m) company funds for a management buyout in 2003. This incident has led to Yili's shares being suspended, as it is China’s third-largest milk producer and part of a market experiencing significant growth. Analysts suggest this may be indicative of potential corporate wrongdoing within the industry.", "opencoder:1.5b": "\"The Chinese police have detained three top executives at the milk firm Yili with reports that they are being investigated for embezzlement. The company is to hold an emergency meeting to debate the issue. Yili has recently been discussed by intense media speculation over its financial operations and two rivals - market leaders Mengniu Dairy and Bright Dairy have dominated a Chinese milk market.\"\n", "smollm:1.7b": "The text is concise and to the point, summarizing the key points about the detention of Chinese milk bosses by police. It does not provide any additional information or explanations, only the facts as they are presented in the text. The summary is accurate and faithful to the original text, preserving the main ideas and details.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to help summarize the given text into a concise summary in plain text without any explanations or formatting. First, let me read through the entire text carefully.\n\nThe main points are: Chinese police detained three top executives of Yili-based milk company Inner Mongolia Yili. They were reported to be investigating embezzlement. The company's chairman, chief financial officer, and securities representative were detained in custody. There was an emergency meeting planned where they might face removal from the board. The spokesperson mentioned that the company may move to oust chairman Zheng Junhuai. Another statement said that three individuals were detained due to linked embezzlement accusations.\n\nAdditionally, there's some context about Yili being a major milk producer with a large market share and recent media speculation about its financial operations. Executives used funds improperly for a management buyout in 2003, leading to suspended shares on Tuesday after a 10% drop from Monday.\n\nNow, I need to condense this into a summary that includes all these key points without adding any extra information or explanations. I should make sure not to include any reasoning process or examples beyond the main idea.\n\nFirst sentence: \"Chinese police detained three top executives at Yili-based milk firm.\"\n\nSecond sentence: \"Three executives were reported for embezzlement investigation.\"\n\nThird sentence: \"Emergency meeting planned where they may face removal or action.\"\n\nFourth sentence: \"Yili's financial operations are being speculated over.\"\n\nFifth sentence: \"Executives wrongly used funds during a previous buyout, leading to suspended shares.\"\n\nSixth sentence: \"Company is the third-largest milk producer in China with a growing market.\"\n\nSeventh sentence: \" Analysts are considering further investigations.\"\n\nPutting it all together concisely, I'll make sure each part flows smoothly and covers all essential details without being repetitive.\n</think>\n\nChinese police detained three top executives at Yili-based milk firm. The individuals were reported for embezzlement investigation. An emergency meeting is planned where they might face removal or action. Yili, a major milk producer, dominates China's milk market which has grown by 30% in the past five years. Concerns are raised about recent financial operations involving executives who improperly used funds from a previous management buyout in 2003. Analysts question if this could lead to further investigations of corporate wrongdoing.", "tinyllama:1.1b": "Chinese police detained three top executives from milk firm Yili, with reports suggesting that they are being investigated for alleged misdeeds. The company has announced its chairman, chief financial officer, and security representative were all in custody, while an official news agency said the arrest was linked to alleged embellishment of Yili's finances. Yili has been embroiled in intense media speculation over recent operations, with executives being suspected of misusing company funds for management buyouts back in July 2003. The suspension of Yili's shares on Tuesday and the company's market position is seen as a potential result of these allegations. Analysts expect further revelations to follow, with investors wondering whether another corruption scandal will be uncovered in China this year.", "tinydolphin:1.1b": " Police detained Chinese milk bosses, including executives, at Yili, according to reports. The company is facing criticism over the alleged embezzlement of funds used for a management buyout back in July 2003. This marks the latest in a series of scandals affecting China's dairy industry and raises questions about the financial integrity of major companies. Analysts are closely watching these developments, wondering if more major corporate misdeeds may be on the horizon.", "phi:2.7b": " Chinese police detained three top executives from milk firm Yili, suspected of embezzlement. The company is holding an emergency meeting and may remove its chairman due to the arrest. The issue has sparked speculation over Yili's financial operations and concerns about further corporate wrongdoing in China.\n", "orca-mini:3b": " Chinese police have detained three top executives at milk firm Yili, including its chairman Zheng Junhuai. They are suspected of embezzlement and a company spokesman said they may now move to oust the chairman. The issue has been linked to alleged financial wrongdoing. It is the latest scandal to hit Chinese companies this year. Investors wonder if the situation is just the tip of the iceberg.", "hermes3:3b": "Chinese police detain Yili executives for embezzlement investigation. Yili (Inner Mongolia Yili Industrial) top officials detained; company's chairman and financial officer among them.", "stablelm-zephyr:3b": "Chinese police have detained three top executives at milk firm Yili, reportedly for embezzlement. The company, which is China's third-largest milk producer, confirmed that its chairman, chief financial officer, and securities representative were all in custody. Yili may now move to oust chairman Zheng Junhuai. The arrest is linked to alleged embezzlement of 417 million yuan ($50.4 million). This scandal could affect Chinese companies as they face increasing scrutiny and potential for further revelations of corporate wrongdoing.", "chatgpt-4o-latest": "Chinese police have detained three top executives of milk firm Yili, including its chairman, chief financial officer, and securities representative, reportedly for embezzlement. Yili confirmed their detention and is holding an emergency meeting, possibly to remove chairman Zheng Junhuai. The executives are suspected of misusing 417 million yuan ($50.4 million) in company funds for a management buyout in 2003. Yili's shares were suspended after a 10% drop. The company, along with rivals Mengniu Dairy and Bright Dairy, dominates China's growing milk market. Analysts speculate that this scandal may indicate broader corporate misconduct in China.", "stablelm2:1.6b": "Chinese police have detained three executives at milk firm Yili for suspected embezzlement. The company's chairman, CFO, and security representative are in custody, possibly leading to a board meeting to discuss the issue. This is amid intense speculation over Yili's financial operations, with executives previously accused of using company funds for a management buyout. Yili's shares fell by 10% before being suspended. Chinese companies have recently been under scrutiny due to corporate scandals, raising concerns if this could be the start of more revelations.", "granite3.1-dense:2b": "Chinese police have arrested three top executives from milk giant Yili—chairman Zheng Junhuai, chief financial officer, and securities representative—allegedly for embezzlement of 417 million yuan (approximately $50.4 million) intended for a management buyout in July 2003. Yili, China's third-largest milk producer, will convene an emergency meeting to discuss the issue and may potentially dismiss chairman Zheng Junhuai. The company's shares have been suspended due to a significant drop of 10% on Monday following the arrests. This incident adds to a series of corporate scandals in China, raising concerns among analysts about potential broader wrongdoings in the country's rapidly growing dairy market.", "reference": "Chinese police have detained three top executives at milk firm Yili, with reports suggesting that they are being investigated for embezzlement.Analysts wondered if the scandal at Yili - the latest to befall Chinese companies this year - could be followed by further revelations of corporate wrongdoing.A Yili spokesman said it may now move to oust chairman Zheng Junhuai.Yili - full name Inner Mongolia Yili Industrial - confirmed its chairman, chief financial officer and securities representative were all in custody.Yili has recently been the subject of intense media speculation over its financial operations."}