{"raw_text": "India's Deccan seals $1.8bn deal\n \n Air Deccan has ordered 30 Airbus A320 planes in a $1.8bn (£931m) deal as India's first low-cost airline expands in the fast-growing domestic market.\n \n Air Deccan was set up last year and wants to lure travellers away from the railway network and pricier rivals. The potential of the Indian market has attracted attention at home and abroad. Beer magnate Vijay Mallya recently set up Kingfisher Airlines, while UK entrepreneur Richard Branson has said he is keen to start a local operation.\n \n The country has a population of more than a billion people and many observers feel that it is underserved by airlines. Recently however, the booming economy has boosted personal spending power and helped swell the middle classes and the corporate sector. India's government has given its backing to cheaper and more accessible air travel. \"The days of flying being a symbol of only maharajas or the rich are over,\" the minister for civil aviation Praful Patel said earlier. Infrastructure is being built to handle the expected increase in demand and on Tuesday, Agence France Presse reported that a group led by Germany's Siemens won the contract to build a private airport near Bangalore. India's airports authority and the state government will own 13% each of the finished transport hub. For its part, Air Deccan, set up by army officer and silk farmer Gorur Gopinath, plans to increase its fleet to 60 aircraft within five years. To help finance the expansion the company may sell a 25% stake to an investor for about $50m. When it was set up the firm offered tickets that were 50% cheaper than other Indian airlines. It said it was basing its business model on European firms such as Ireland's Ryanair.\n", "llama3.2:1b": "Air Deccan has ordered 30 Airbus A320 planes worth $1.8 billion in a deal with India's Air Deccan to expand into the country's growing domestic market. The airline, set up last year by Indian businessman Gorur Gopinath, wants to attract travelers away from the railway network and pricier rivals like Kingfisher Airlines.", "llama3.2:3b": "Air Deccan has ordered 30 Airbus A320 planes in a $1.8 billion deal, India's first low-cost airline expansion. The company plans to lure travelers away from the railway network and pricier rivals with cheaper tickets. The Indian market is expected to boost personal spending power and swell the middle classes and corporate sector, leading to increased demand for air travel.", "gemma2:2b": "Air Deccan, India's first low-cost airline, has ordered 30 Airbus A320 planes for $1.8 billion. The company aims to compete with the railway system and pricier rivals in India's growing domestic market. With a large population and a burgeoning middle class, demand for affordable air travel is high.  The Indian government supports cheaper air travel and infrastructure projects are underway to accommodate increasing passenger numbers. Air Deccan plans to expand its fleet to 60 aircraft within five years and may seek investment of $50 million. The company's business model draws inspiration from European low-cost airlines like Ryanair. \n", "qwen2.5:0.5b": "India’s Air Deccan, a low-cost airline, has signed an agreement worth $1.8 billion to purchase 30 Airbus A320 jets from China's Kingfisher Airlines and Indian Railways. The company aims to expand its presence in India by catering to the growing domestic market. With a population of over a billion people, the country is under-represented by airlines. However, with rising personal spending power and a booming economy, there is increasing interest in cheaper air travel options. Agence France Presse reported that a Siemens consortium won a contract for an airport near Bangalore. India's airports authority and state governments will own 13% of the new transport hub. The firm offers tickets that are 50% cheaper than other Indian airlines and bases its business model on European firms such as Ireland's Ryanair.", "qwen2.5:1.5b": "India's Deccan airline, backed by Vijay Mallya and Richard Branson, has ordered 30 Airbus A320 planes from Air Deccan for a $1.8bn deal to expand in the fast-growing domestic market. The project aims to appeal to middle-class travelers away from railway networks and pricier rivals, benefiting from India's growing economy and government support for cheaper air travel.", "qwen2.5:3b": "India's Deccan orders 30 Airbus A320 planes in $1.8bn deal, expanding in domestic market aimed at railway and pricier rivals. Air India's growth driven by large population, booming economy boosting personal spending and middle classes. Government supports affordable travel, investing in infrastructure like a new airport near Bangalore. Deccan plans to increase its fleet to 60 aircraft within five years, potentially selling 25% stake for $50m.", "opencoder:1.5b": "India’s Deccan Seals $1.8bn Deal\n\nAir Deccan has ordered 30 Airbus A320 planes in a $1.8bn (£931m) deal as India’s first low-cost airline expands in the fast-growing domestic market.\n\nAir Deccan was set up last year and aims to lure travellers away from the railway network and pricier rivals. The potential of the Indian market has attracted attention at home and abroad, with beer magnates like Vijay Mallya and UK entrepreneurs Richard Branson keen on starting a local operation.\n\nIndia's population is more than a billion and many observers find it underserved by airlines. However, recently, the booming economy has helped boost personal spending power and strengthened the middle classes and corporate sector. India’s government supports cheaper and more accessible air travel, and the country’s chief minister praised its backing to cheaper and efficient air travel.\n\nIndia's airports authority and the state government own 13% of the transport hub. For its part, Air Deccan plans to increase its fleet to 60 aircraft within five years. To finance the expansion, it may sell a 25% stake to an investor for about $50m. The company also offers tickets priced 50% cheaper than other Indian airlines.\n\nIt bases its business model on European firms such as Ireland's Ryanair.\n", "smollm:1.7b": "India's Deccan seals a $1.8bn deal for Air Deccan, an airline aiming to lure travellers away from the railway network and pricier rivals. The potential of India's domestic market has attracted attention at home and abroad. Beer magnate Vijay Mallya recently set up Kingfisher Airlines, while UK entrepreneur Richard Branson is keen to start a local operation.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Air Deccan getting a $1.8 billion deal with Airbus A320 planes. First, the key points are: they're expanding in India, this is their first low-cost airline. The deal includes $931 million, and it's part of India's growing domestic market.\n\nThey mention that Air Deccan was set up last year, aiming to attract travelers away from railways and more expensive airlines. This market has been attracting attention both here and abroad. Recently, Vijay Mallya started Kingfisher Airlines, and Richard Branson is interested in local operations.\n\nIndia's population is over a billion, but many say it's underserved by airlines. The economy has boosted personal spending, middle classes, and the corporate sector, which makes air travel more accessible. The government supports cheaper and easier air travel. Infrastructure like railways is being built to handle the increased demand. \n\nAir Deccan was founded by a soldier and silk carrier, Gorur Gopinath, plans to increase their fleet to 60 planes in five years. They might sell a part of them for $50 million. Previously, tickets were half price compared to other airlines, similar to European firms like Ryanair.\n\nSo the summary should capture all these points concisely without extra details. I need to make sure key ideas are included: the deal's amount, Air Deccan's purpose, market expansion appeal, government backing, infrastructure build, past operations, pricing strategy, and financial plan for expansion.\n</think>\n\nAir Deccan has secured a $1.8 billion deal with Airbus A320 planes. This marks India's first low-cost airline expansion in the growing domestic market. The deal is part of India's booming economy, attracting attention locally and internationally. Air Deccan was set up last year, aiming to attract travelers away from railways and more expensive airlines. The potential for India's market has drawn significant attention. The government supports cheaper air travel. Infrastructure projects include building tracks to handle increased demand. Air Deccan, founded by a soldier and silk carrier, plans to increase its fleet to 60 planes in five years. They may sell a portion of their fleet for $50 million to finance expansion. Previously, tickets were half price compared to other Indian airlines, similar to European firms like Ryanair.", "tinyllama:1.1b": "India's Air Deccan has announced a $1.8bn deal to order 30 A320 planes, marking the first low-cost airline expansion in the country. The potential for the Indian market has attracted attention at home and abroad, with British entrepreneur Richard Branson recently setting up Kingfisher Airlines. Recent economic growth has boosted personal spendings power and has helped to sweep away some of the mid-class and corporate segments. Air Deccan's government and infrastructure support could help it expand its fleet in time for a 60 aircraft takeoff within five years, according to reports. The company is planning to increase its fleet to 60 aircraft within five years to cater to a predicted increase in demand due to the growing economy. The deal will help Air Deccan finance expansion plans, with the potential sale of 25% stake expected for $50m.", "tinydolphin:1.1b": " India's Deccan, a low-cost airline in India, has ordered 30 Airbus A320 planes worth $1.8 billion. The deal is part of the country's ambitious plans to expand its domestic market. Air Deccan will use these planes to attract more passengers away from the railway network and expensive rivals. With a population of over a billion people, India has a thriving low-cost air travel market, but there have been concerns that it is underserved by airlines. Last year, Kingfisher Airlines was launched by British entrepreneur Richard Branson with an initial investment of $10m. UK-based airline company Flyadeco is also considering its options in India. The growth in spending power has led to increased demand for cheaper and more accessible air travel. The government's recent announcement that it will provide financial support for this expansion has boosted the market for low-cost airlines.", "phi:2.7b": " India's Deccan seals $1.8bn deal by ordering 30 Airbus A320 planes, with Air Deccan aiming to offer cheaper flights and expand in the country's domestic market. The potential of the Indian aviation industry has attracted attention from overseas investors, including British entrepreneur Richard Branson. With a growing middle class and increased spending power, India is underserved by airlines, and the government has encouraged more accessible air travel through infrastructure development. Air Deccan plans to grow its fleet to 60 aircraft over five years with support from investors. The company's business model is based on European low-cost airlines like Ryanair, offering tickets that are 50% cheaper than other Indian airlines.\n", "orca-mini:3b": " India's Air Deccan has ordered 30 Airbus A320 planes worth $1.8 billion in a bid to expand in the country's domestic market, which is underserved by airlines despite a booming economy. The government supports cheaper and more accessible air travel, and Air Deccan is set to increase its fleet to 60 aircraft within five years. The firm may sell a stake to an investor for about $50 million to finance the expansion.", "hermes3:3b": "Air Deccan orders $1.8b 30 Airbus A320 planes for India's low-cost airline market, attracted by growing domestic demand and underserved population of over billion people.", "stablelm-zephyr:3b": "Air Deccan, India's first low-cost airline, has ordered 30 Airbus A320 planes for $1.8bn in a deal aimed at expanding in the fast-growing domestic market. The Indian market, with a population of over a billion people, is seen as underserved by airlines. Cheaper and more accessible air travel is supported by India's booming economy and infrastructure improvements. Air Deccan plans to increase its fleet size to 60 aircraft within five years and may sell a 25% stake for about $50m to finance expansion. The company is based on the European model of firms such as Ireland's Ryanair.", "chatgpt-4o-latest": "India's first low-cost airline, Air Deccan, has ordered 30 Airbus A320 planes in a $1.8 billion deal to expand in the growing domestic market. Founded last year, the airline aims to attract travelers from railways and pricier competitors. India's aviation sector is drawing interest from local and international investors, including Vijay Mallya's Kingfisher Airlines and Richard Branson. With a population exceeding a billion, India remains underserved by airlines, but rising incomes and government support for affordable air travel are driving growth. Infrastructure is being developed, including a private airport near Bangalore led by Germany's Siemens. Air Deccan, founded by Gorur Gopinath, plans to expand its fleet to 60 aircraft in five years and may sell a 25% stake for $50 million. The airline follows a low-cost model similar to Ryanair, initially offering fares 50% lower than competitors.", "stablelm2:1.6b": "Air Deccan, India's first low-cost airline, has secured a $1.8bn deal to purchase Airbus aircraft from Airbus. The company aims to expand in the domestic market and attract travelers away from the railway network and rivals. This follows the setting up of Kingfisher Airlines by beer magnate Vijay Mallya and Richard Branson's interest in starting local operations. India has a billion+ population, with many people underserved by airlines, and the government supporting cheaper and accessible air travel. Air Deccan plans to increase its fleet to 180 aircraft within five years through potential stake sales and aims to base its business model on European firms like Ireland's Ryanair.", "granite3.1-dense:2b": "Air Deccan, India's first low-cost airline established by army officer Gorur Gopinath, has secured a $1.8bn (£931m) deal to acquire 30 Airbus A320 planes. This investment aims to capitalize on the rapidly growing domestic market, which benefits from an expanding middle class and corporate sector due to India's booming economy. The government supports affordable air travel, as declared by Civil Aviation Minister Praful Patel, who noted that flying is no longer exclusive to the wealthy. To accommodate increased demand, infrastructure improvements are underway, including a private airport near Bangalore, owned equally by India's airports authority and state government. Air Deccan intends to expand its fleet to 60 aircraft within five years, potentially selling a 25% stake for about $50m to finance this growth. The airline models itself after European budget carriers like Ryanair, offering tickets half the price of competitors when it launched.", "reference": "India's government has given its backing to cheaper and more accessible air travel.When it was set up the firm offered tickets that were 50% cheaper than other Indian airlines.Air Deccan has ordered 30 Airbus A320 planes in a $1.8bn (£931m) deal as India's first low-cost airline expands in the fast-growing domestic market.Beer magnate Vijay Mallya recently set up Kingfisher Airlines, while UK entrepreneur Richard Branson has said he is keen to start a local operation.Air Deccan was set up last year and wants to lure travellers away from the railway network and pricier rivals.The potential of the Indian market has attracted attention at home and abroad."}