{"raw_text": "Quake's economic costs emerging\n \n Asian governments and international agencies are reeling at the potential economic devastation left by the Asian tsunami and floods.\n \n World Bank president James Wolfensohn has said his agency is \"only beginning to grasp the magnitude of the disaster\" and its economic impact. The tragedy has left at least 25,000 people dead, with Sri Lanka, Thailand, India and Indonesia worst hit. Some early estimates of reconstruction costs are starting to emerge. Millions have been left homeless, while businesses and infrastructure have been washed away.\n \n Economists believe several of the 10 countries hit by the giant waves could see a slowdown in growth.\n \n In Sri Lanka, some observers have said that as much as 1% of annual growth may be lost. For Thailand, that figure is much lower at 0.1%. Governments are expected to take steps, such as cutting taxes and increasing spending, to facilitate a recovery.\n \n \"With the enormous displacement of people...there will be a serious relaxation of fiscal policy,\" Glenn Maguire, chief economist for the region at Societe Generale, told Agence France Presse. \"The economic impact of it will certainly be large, but it should not be enough to derail the momentum of the region in 2005,\" he said. \"First and foremost this is a human tragedy.\" India's economy, however, is less likely to slow because the areas hit are some of the least developed. The regional giant has enjoyed strong growth in 2004. But India now faces other problems, with aid workers under pressure to ensure a clean supply of water and sanitation to prevent an outbreak of disease.\n \n Thailand's Prime Minister Thaksin Shinawatra has estimated the destruction at 20bn baht ($510m). Analysts said that figure is likely to rise and the country's tourist industry is likely to be hardest hit. Thailand's fishing and real estate sectors also will be affected by Sunday's 9.0 magnitude earthquake, which sent huge waves from Malaysia to Africa. Malaysia said as many as 1,000 fishermen will be affected and that damage to the industry will be \"significant\", Agence France Presse reported. Rapid rebuilding will be key to limiting the impact of the tragedy. \"In three months, we should rebuild 70% of the damage in the three worst hit provinces,\" said Juthamas Siriwan, governor of the Tourism Authority of Thailand. The outlook for Sri Lanka is less optimistic, with analysts predicting that the country's tourist industry will struggle to recovery quickly. Tourism is a vital to many developing countries, providing jobs for 19 million people in the south east Asian region, according to the World Travel and Tourism Council (WTTC).\n", "llama3.2:1b": "Asian governments and international agencies are reeling at the economic costs of the Asian tsunami and floods, with estimated losses including 25,000 deaths, 10 countries affected, and millions displaced. Economists predict several countries could experience a slowdown in growth due to the devastation. In Sri Lanka, some economists estimate up to 1% annual loss of growth, while Thailand is expected to see minimal impact on its economy, given it has less developed areas.", "llama3.2:3b": "Asian tsunami and floods have left at least 25,000 dead, millions homeless, and billions of dollars in destruction. Countries such as Sri Lanka, Thailand, India, and Indonesia are expected to see a slowdown in growth. Governments plan to cut taxes and increase spending to facilitate recovery. Analysts predict rapid rebuilding will be key to limiting the impact. The tourism industry is particularly vulnerable, with Sri Lanka's industry likely to struggle quickly.", "gemma2:2b": "The Asian tsunami has caused severe economic devastation with potential slowdowns in growth for affected countries.  Preliminary estimates suggest losses of up to 1% of Sri Lanka's annual growth and 0.1% for Thailand. Governments will likely implement measures to facilitate recovery, including tax cuts and increased spending. India, though facing its own challenges, is less likely to see significant economic slowdown due to the low development level of the affected areas. The tourism industry in Thailand is expected to suffer the most significant impact. \n", "qwen2.5:0.5b": "The Asian governments and international agencies are trying to evaluate the economic costs of the tsunami and floods that have left at least 25,000 people dead. The World Bank president James Wolfensohn is concerned about the disaster's economic impact, as he says his agency only has started to grasp its magnitude. Economists think several Asian countries could see a slowdown in growth. Some observers say that as much as 1% of annual growth may be lost for Sri Lanka and Thailand. The region's economies have been suffering from human tragedy since the tsunami struck, with India experiencing economic impact but Thailand facing other problems. Rapid rebuilding is key to limiting the effects of the disaster. Tourism is a vital industry in many developing countries, providing jobs for millions of people, according to the World Travel and Tourism Council (WTTC).", "qwen2.5:1.5b": "Asian tsunami and floods caused at least 25,000 deaths, leaving millions homeless and businesses destroyed. Economists predict a slowdown in growth for some affected countries, with Sri Lanka expecting up to 1% loss of annual growth and Thailand's likely impact minimal. Thailand's Prime Minister has estimated the destruction at 20bn baht ($510m), while tourism and fishing industries are expected to be severely impacted.", "qwen2.5:3b": "Asian governments and international agencies are grappling with potential economic devastation from the tsunami and floods. The World Bank estimates reconstruction costs could be significant, affecting at least 25,000 lives and costing millions in infrastructure damage. Economists predict growth slowdowns in affected countries like Sri Lanka (up to 1% loss) and Thailand (0.1% loss). Governments are likely to increase spending or cut taxes to support recovery, though the impact may be manageable if swift rebuilding occurs. The tsunami will lead to economic downturns due to displacement of people, damage to businesses, and a decline in industries like fishing and real estate. While tourism is expected to recover somewhat in Thailand within three months, it could take longer in Sri Lanka where the industry provides vital jobs for many in the region.", "opencoder:1.5b": "Asian governments and international agencies are reeling at the potential economic disaster left by the Asian tsunami and floods. The World Bank president James Wolfensohn has said his agency is \"only beginning to grasp the magnitude of the disaster\" and its economic impact. In Sri Lanka, some observers have said that as much as 1% of annual growth may be lost. For Thailand, that figure is much lower at 0.1%. The economies of India are less likely to slow down because the areas hit are some of the least developed. A recovery effort from countries like Malaysia and Thailand, analysts said, is critical. In three months, we should rebuild 70% of the damage in the three worst hit provinces, providing jobs for 19 million people in the south east Asian region.\n", "smollm:1.7b": "The economic costs of the Asian tsunami and floods have been significant, with estimates suggesting that at least $25 billion could be lost in the short term. The disaster has left millions homeless, destroyed infrastructure and disrupted trade, leading to concerns about a slowdown in growth for several countries in the region.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about the economic costs of an Asian tsunami or flood. Let me read through it carefully.\n\nFirst, the main points are that the economic impacts are still coming out as news. They mention some countries like Sri Lanka, Thailand, India, and Indonesia have lost lives. Early estimates for reconstruction costs are emerging. Millions are homeless, businesses destroyed, infrastructure ruined. Economists think several of the 10 affected countries might slow down their growth.\n\nLooking at specific regions: Sri Lanka has a 1% loss in growth potential. Thailand's is lower at 0.1%. Governments are trying to help recover with tax cuts and increased spending. A bank's chief economist says fiscal policies will relax, but the impact could be significant. But it won't derail the region in 2005, especially considering the global economic momentum.\n\nIndia might not slow down much because the affected areas are less developed. Thailand's economy has been strong this year, but they're still struggling with water and sanitation issues from their earthquake. Malaysia is a bigger problem there, with fishers affected. The report also says rebuilding will be crucial to limit the disaster's impact.\n\nSo I need to capture all these key points in a concise summary without explanations or formatting.\n</think>\n\nEconomic damages from the Asian tsunami and flood are still being assessed. Countries like Sri Lanka, Thailand, India, and Indonesia have lost lives, with early estimates of reconstruction costs emerging. Millions are homeless, businesses destroyed, and infrastructure ruined. Economists believe several countries may experience growth slowdowns. governments plan to cut taxes and increase spending for recovery. A bank economist notes relaxed fiscal policies but acknowledges the region's momentum will stay strong. India is less affected due to smaller regions. Thailand faces issues with water and sanitation from a major earthquake, while others like Malaysia are in immediate trouble. Rebuilding efforts will be crucial for limiting disaster impact.", "tinyllama:1.1b": "The Asian government and international organizations are reeling at the potential economic devastaition left by the Asian tsunami and floods. The tragic event has resulted in at least 25,000 deaths, with Sri Lanka, Thailand, and India being worst affected. Economists believe that several of the 10 countries hit by the giant waves could see a slowdown in growth, while Indonesia and Malaysia are less likely to experience such a fall. The region is expected to take steps to facilitate recovery in 2005, including cutting taxes and increasing investment. However, India's economy will face other problems, with aid workers under pressure to ensure clean water supplies to prevent the spread of disease. The catastrophe has led to a range of economic impacts, from job losses for tourists in Thailand to real estate damage in Malaysia. Despite the losses, however, the region's growth is expected to outpace 2004.", "tinydolphin:1.1b": " In response to the recent tsunami disaster, governments and international agencies are grappling with the potential economic devastation caused by the destruction. The tragedy has left at least 25,000 people dead, with thousands more missing. In Sri Lanka alone, estimates suggest that reconstruction costs may be around 1% of annual growth. Thailand is predicted to experience a slowdown in growth due to the loss of several of its regions, while India may see an increase in tourism revenue. The region's economies are also less likely to suffer significant disruptions as aid workers have been praised for their efforts in ensuring clean water and sanitation supply amidst the crisis.", "phi:2.7b": " The economic impact of the Asian tsunami and floods has been significant. Several countries, including Sri Lanka, Thailand, India, and Indonesia, are expected to see a slowdown in growth as businesses and infrastructure have been destroyed, leaving millions homeless. Economists believe that tax cuts and increased spending by governments will be necessary to facilitate a recovery, but the impact of the disaster is likely to be large.\n", "orca-mini:3b": " Asian tsunami and floods have left at least 25,000 people dead and several countries could experience a slowdown in economic growth. Governments are expected to take steps such as cutting taxes and increasing spending to facilitate a recovery. However, the region's tourism industry is likely to be hardest hit, with estimates suggesting that as much as 70% of damage to the industry will be repaired in three months.", "hermes3:3b": "Asian tsunami causing potential economic slowdown & reconstruction costs; estimates suggest growth loss of up to 1% annually for some countries.", "stablelm-zephyr:3b": "The devastating Asian tsunami and floods have left governments and international agencies concerned about the potential economic devastation. World Bank president James Wolfensohn acknowledges that initial estimates of reconstruction costs are only beginning to grasp the magnitude of the disaster. Sri Lanka, Thailand, India, and Indonesia have been worst hit, with millions homeless and businesses and infrastructure destroyed. Economists predict growth slowdowns in several of the affected countries; however, India's less developed regions may avoid the impact altogether. The destruction in Thailand is estimated at 20 billion baht ($510 million), with the country's tourist industry likely to be hardest hit, as well as its fishing and real estate sectors. Rapid rebuilding will be crucial in limiting the impact of the tragedy on these countries' already recovering economies.", "chatgpt-4o-latest": "Asian governments and international agencies are assessing the economic devastation caused by the tsunami and floods. The World Bank acknowledges the vast scale of the disaster, which has left at least 25,000 dead and millions homeless, with Sri Lanka, Thailand, India, and Indonesia worst affected. Reconstruction costs are emerging, and economists predict slowed growth in several affected countries. Sri Lanka may lose 1% of annual growth, while Thailand's impact is estimated at 0.1%. Governments are expected to implement fiscal measures to aid recovery. India's economy is less likely to slow due to the affected areas being underdeveloped, but concerns over water and sanitation persist. Thailand's Prime Minister estimates damages at $510 million, with tourism, fishing, and real estate sectors hit hardest. Malaysia's fishing industry also faces significant losses. Rapid rebuilding is crucial, with Thailand aiming to restore 70% of damage in three months, while Sri Lanka's tourism sector is expected to struggle. Tourism is vital to the region, supporting 19 million jobs.", "stablelm2:1.6b": "Asian governments and international agencies are facing potential economic devastation from the Asian tsunami and floods that resulted in at least 100,0 S people deaths. The disaster has left millions homeless, destroyed businesses and infrastructure, and possibly causing a slowdown in growth for several affected countries. In Sri Lanka, the estimated loss of up to 1% of annual growth is possible; for Thailand, it's lower at 0.1%. Governments will likely need to cut taxes and increase spending to aid recovery. The disaster is both a human tragedy and an economic one, with India's economy less likely to slow due to its development level compared to other affected countries. Aid workers face challenges such as ensuring water supply sanitation to prevent disease outbreak in Thailand, which is estimated at around 1 billion baht ($1.2 million). Rapid rebuilding will be essential to minimize the impact of the tragedy on tourism industry and millions of people working in developing Southeast Asian countries.", "granite3.1-dense:2b": "The Asian tsunami and floods have caused significant economic devastation across 10 affected nations, with at least 25,000 fatalities. Sri Lanka, Thailand, India, and Indonesia bear the brunt of the disaster. Businesses and infrastructure in these countries have been destroyed, leaving millions homeless. Economists predict slowdowns in growth for several nations: Sri Lanka may lose up to 1% of its annual growth, while Thailand's potential loss is around 0.1%.\n\nGovernments are implementing fiscal stimulus measures, such as tax cuts and increased spending, to aid recovery. However, the extent of the economic impact is substantial but unlikely to derail regional growth in 2005. India's less developed regions should not experience significant slowdowns due to their existing low growth rates.\n\nThailand's Prime Minister estimates reconstruction costs at 20 billion baht ($510 million), a figure that may rise further, with the tourism industry expected to suffer most. Fishermen in Thailand and Malaysia face significant damage, potentially impacting their livelihoods. Rapid rebuilding is crucial for minimizing economic damage in the worst-affected provinces of Thailand.\n\nSri Lanka's tourism industry is projected to recover slowly, given its vital role as a source of employment for 19 million people in the region. Tourism, being an essential sector for many developing countries, faces potential long-term challenges due to the disaster.", "reference": "The tragedy has left at least 25,000 people dead, with Sri Lanka, Thailand, India and Indonesia worst hit.Analysts said that figure is likely to rise and the country's tourist industry is likely to be hardest hit.World Bank president James Wolfensohn has said his agency is \"only beginning to grasp the magnitude of the disaster\" and its economic impact.In Sri Lanka, some observers have said that as much as 1% of annual growth may be lost.Malaysia said as many as 1,000 fishermen will be affected and that damage to the industry will be \"significant\", Agence France Presse reported.\"In three months, we should rebuild 70% of the damage in the three worst hit provinces,\" said Juthamas Siriwan, governor of the Tourism Authority of Thailand.\"The economic impact of it will certainly be large, but it should not be enough to derail the momentum of the region in 2005,\" he said.The outlook for Sri Lanka is less optimistic, with analysts predicting that the country's tourist industry will struggle to recovery quickly.Economists believe several of the 10 countries hit by the giant waves could see a slowdown in growth.The regional giant has enjoyed strong growth in 2004."}