{"raw_text": "US to probe airline travel chaos\n \n The US government is to investigate two airlines- US Airways and Delta Air Lines' Comair subsidiary - after travel chaos over the Christmas weekend.\n \n Staff calling in sick at US Airways and computer failures at Comair left 30,000 passengers stranded and 10,000 pieces of baggage undelivered. US Airways is in Chapter 11 bankruptcy protection for the second time in two years, and battling to cut costs. It is currently trying to negotiate pay cuts with flight and baggage staff.\n \n Transportation Secretary Norman Mineta said he was \"deeply concerned\" at the disruption to passengers, and ordered a thorough investigation. Comair's computer breakdown plunged its flight-crew scheduling system into disarray. Altogether, some 1,100 flights were cancelled over the holiday long weekend. Mr Mineta said it was important to understand \"what happened, why it happened and whether the carriers properly planned for the holiday travel period and responded appropriately to consumer needs in the aftermath\".\n \n Adding to the atmosphere of chaos were mountains of luggage left to pile up when a third of US Airways' baggage handling staff called in sick. There was also a shortage of US Airways flight attendants, with nearly a fifth saying they were too sick to work, leading to many flight cancellations. However, union officials denied there had been a deliberate \"sickout\". They said that many people have flu at this time of year and that the airline is chronically understaffed.\n \n US Airways ended up cancelling over 100 flights on Christmas Day, stranding passengers in as many as 119 airports. Ground crews at US Airways, the seventh-largest US airline, which is now in Chapter 11 bankruptcy protection, face a court-imposed pay cut next month. The airline needs to negotiate other paycuts if it is to find a route out of bankruptcy. It is looking for paycuts totalling $800m.\n \n \"US Airways has a full-scale employee mutiny on its hands,\" commented Michael Boyd, an industry consultant. Disruptions to flight schedules could discourage customers from flying with US Airways, reducing revenues. US Airways had to cancel approximately 65 flights on Thursday, 180 on Friday, 140 on Saturday, 43 on Sunday and 15 on Monday, said industry officials. The airline said it was \"embarrassed by the situation\" and \"deeply regrets any inconvenience caused to customers,\" The probe will focus on the industry's compliance with a 1999 agreement aimed at improving the quality of passenger service that has so far allowed airlines to avoid congressionally-mandated standards. Analysts said the Christmas chaos cast doubt on US Airway's ability to emerge from bankruptcy - and was likely to worsen the finances of troubled Delta, parent of Comair. Comair \"deeply regrets the inconvenience to all of our customers caused by the severe winter storm in the Ohio River Valley during the busy holiday season, exacerbated by problems with the airline's crew scheduling system, causing additional flight delays and cancellations,\" the Delta subsidiary said in a statement.\n", "llama3.2:1b": "The US government is investigating two airlines: US Airways and Comair subsidiary of Delta Air Lines. The investigation will look into travel disruptions over the Christmas weekend, including:\n\n* 30,000 passengers stranded on flights\n* 10,000 pieces of baggage undelivered\n* 1,100 cancelled flights\n* Mountains of luggage left to pile up due to staff shortages\n\nThe investigation is focused on understanding what happened and whether the airlines properly planned for holiday travel and responded appropriately to consumer needs.", "llama3.2:3b": "US government to investigate US Airways and Comair after Christmas weekend travel chaos due to staff calling in sick and computer failures, leaving 30,000 passengers stranded and 10,000 pieces of baggage undelivered.", "gemma2:2b": "The US government is investigating US Airways and Comair after travel chaos over Christmas weekend. 30,000 passengers were stranded, and 10,000 pieces of baggage went un delivered due to staff illness at US Airways, computer failures at Comair, and a lack of flight attendants.  US Airways is in Chapter 11 bankruptcy for the second time, seeking pay cuts to address financial issues. The investigation will examine compliance with industry agreements intended to improve passenger service quality. This incident has raised concerns about US Airways' ability to emerge from bankruptcy and its impact on Delta, Comair's parent company.  \n", "qwen2.5:0.5b": "US Airways and Comair are facing serious disruptions during the Christmas travel period. US Airways had to cancel over 100 flights, while Comair has suffered from computer failures and shortages of staff. Airlines have been forced to cut costs by negotiating pay cuts with flight and baggage staff. A severe winter storm in Ohio caused delays for both airlines, leading to many cancellations. The investigation is aimed at understanding the reasons behind the disruption and whether the carriers properly planned for holiday travel.", "qwen2.5:1.5b": "The US government is investigating two airlines - US Airways and Comair (a subsidiary of Delta Air Lines) - after chaotic Christmas weekend travel disruptions involving 30,000 stranded passengers and undelivered baggage. Airlines are facing budget challenges; US Airways faces Chapter 11 bankruptcy protection for the second time in two years, while Delta's Comair has a computer failure affecting its scheduling system. The investigation focuses on compliance with an industry agreement to improve passenger service quality.", "qwen2.5:3b": "US government investigates US Airways and Delta Air Lines' Comair after Christmas travel chaos involving 30,000 stranded passengers and 10,000 undelivered bags. US Airways is in Chapter 11 bankruptcy, facing pay cuts with staff; computer failures at Comair led to flight cancellations. Transportation Secretary Norman Mineta ordered a thorough investigation focusing on whether airlines adequately planned for holiday travel and responded appropriately to consumer needs. Chaos was exacerbated by sick staff, especially baggage handlers and flight attendants. The probe will examine compliance with 1999 passenger service agreement that has allowed airlines to avoid mandated standards, raising concerns about US Airways' bankruptcy viability and impacting Delta's finances.", "opencoder:1.5b": "The US government is set to investigate two airlines' bankruptcy after travel chaos over Christmas weekend. The investigation will probe into why US Airways faced severe disruptions during the holiday period and how they could manage it effectively. A thorough investigation by Comair's computer breakdown, which caused flights to be canceled, will lead to significant delays and stranding of passengers across many airports. Meanwhile, the airline faces a pay-cut imposed by Delta Airlines, which is expected to topple in the future due to its more exhaustive handling of customer complaints. The probe also focuses on the airline's compliance with a 19-99 agreement aimed at improving passenger service.\n", "smollm:1.7b": "The US government is investigating two airlines-US Airways and Delta Air Lines' Comair subsidiary - after travel chaos over the Christmas weekend. Staff calling in sick at US Airways and computer failures at Comair left 30,000 passengers stranded and 10,000 pieces of baggage undelivered. US Airways is in Chapter 11 bankruptcy protection for the second time in two years, and battling to cut costs. It is currently trying to negotiate pay cuts with flight and baggage staff.\nThe US government is deeply concerned about the disruption to passengers caused by the travel chaos. The airline's computer failures led to a shortage of flight attendants, and many passengers were left stranded without food or drink on Christmas Day. However, union officials denied there had been a deliberate \"sickout\" by US Airways' staff.\nUS Airways ended up cancelling over 100 flights on Christmas Day, stranding passengers in as many as 119 airports. Ground crews at US Airways, the seventh-largest US airline, which is now in Chapter 11 bankruptcy protection, face a court-imposed pay cut next month. The airline needs to negotiate other paycuts if it is to find a route out of bankruptcy. It is looking for paycuts totalling $800m.\nUS Airways has a full-scale employee mutiny on its hands. US Airways' staff are demanding higher wages and better working conditions, citing the company's poor reputation among employees. The airline said it was \"embarrassed by the situation\" and \"deeply regretted any inconvenience caused to customers.\" US Airways had to cancel approximately 65 flights on Thursday, 180 on Friday, 140 on Saturday, 43 on Sunday and 15 on Monday. The airline said it was \"embarrassed by the situation\" and \"deeply regrets the inconvenience caused to all of our customers.\"\nUS Airways' staff are demanding higher wages and better working conditions in response to the travel chaos. US Airways is currently facing a $200m debt settlement with the Department of Transportation, which it owes for unpaid taxes. The airline's management team said that the company will need to make significant changes to its operations if it wants to avoid bankruptcy.\nAnalysts said the Christmas chaos cast doubt on US Airway's ability to emerge from bankruptcy - and was likely to worsen the finances of troubled Delta, parent of Comair. Comair \"deeply regrets the inconvenience caused to all of our customers\" because of the severe winter storm in the Ohio River Valley during the busy holiday season, exacerbated by problems with flight scheduling.\nUS Airways' management team said that it will need to make significant changes to its operations if it wants to avoid bankruptcy. US Airways is currently facing a $200m debt settlement with the Department of Transportation, which it owes for unpaid taxes. The airline's management team said that the company needs to make significant changes to its operations if it wants to avoid bankruptcy.\nUS Airways' staff are demanding higher wages and better working conditions in response to the travel chaos. US Airways is currently facing a $200m debt settlement with the Department of Transportation, which it owes for unpaid taxes. The airline's management team said that the company will need to make significant changes to its operations if it wants to avoid bankruptcy.", "deepseek-r1:1.5b": "<think>\nAlright, so I've got this query where the user wants me to summarize a given text into just plain text without any explanations or formatting. The summary needs to include key ideas and details from the original passage.\n\nFirst, I need to read through the provided text carefully. It's about an airline investigation after Christmas weekend chaos. There are mentions of two airlines, US Airways and Comair, with their issues: 30,000 passengers stranded, 10,000 bags undelivered, US Airways being in bankruptcy for two years, and efforts to reduce costs by cutting staff.\n\nThen there's a section about the Transportation Secretary ordering a thorough investigation into the computer failure in Comair and some cancellations. It also mentions other issues like lack of flight attendants and possible union-backed actions against those causing the issue.\n\nNext, the US Airways financials: 100 flights canceled on Christmas Day, a bankruptcy protection, pay cuts needed for recovery. The company had to cancel around 65 flights in four days across different weeks.\n\nFinally, Delta's situation is mentioned as regretting severe storm-related issues with crew scheduling and additional delays.\n\nThe user wants the summary concise but preserving key points. I'll need to identify the main events: airline investigations, passenger stranded, baggage undelivered, US Airways' financials, and Delta's response.\n\nI should make sure not to include any explanations or reasoning—just a straightforward summary. So, each paragraph needs to be condensed without losing the critical info.\n</think>\n\nUS to probe airline travel chaos  \n\nThe U.S. government is investigating two airlines - US Airways and Comair's Comair subsidiary - after Christmas weekend chaos. 30,000 passengers were stranded, and 10,000 pieces of baggage were undelivered. US Airlines faced Chapter 11 bankruptcy protection twice in the past year. They are trying to reduce costs.  \n\nThe investigation included disruptions due to computer failures in Comair, leading to cancellations totaling 1,100 flights over the holiday weekend. A third of their flight attendants called in sick, causing additional cancellations. 65 flights were canceled on Christmas Day, stranding passengers at 119 airports.  \n\nUS Airlines has a pay cut next month due to the court-imposed payment for its employees. They need total $800 million if they wish to escape bankruptcy.  \n\nComair faced a severe winter storm in Ohio during the holiday season, causing delays and cancellations due to crew scheduling issues. The airline regretfully lost customers due to these disruptions.", "tinyllama:1.1b": "The US government is investigating two airlines - US Airways and Comair subsidiary - after travel chaos over the Christmas weekend. Around 10,000 pieces of luggage were left to pile up due to a shortage of flight attendants, with some cancelled flights resulting from the chaos. The airlines are fighting to cut costs and US Airways is in Chapter 11 bankruptcy protection for the second time in two years. Transportation Secretary Norman Mineta ordered an investigation into what happened and if the carriers properly planned for the holiday travel period and responded appropriately to consumer needs. This resulted in mounting luggaage left, cancelled flights and a shortage of staff which led to several mountains of luggage. The industry is facing a mutiny from employees, who are calling for further cuts in pay and the need for a better quality of service in accordance with congressional standards.", "tinydolphin:1.1b": " The United States government is conducting an investigation into the two airlines- US Airways and Delta Air Lines - after they experienced significant disruptions during the Christmas weekend, with around 30,000 passengers stranded at airports across the country and around 10,000 pieces of baggage undelivered. This follows a similar incident in 2005 when US Airways canceled over 200 flights due to flight crews being sick with the flu. The investigation is looking into whether there was a deliberate \"sickout\" among US Airways' flight attendants, and if so, whether it impacted passenger safety or led to more flight delays.", "phi:2.7b": " The US government is investigating two airlines - US Airways and Delta Air Lines' Comair subsidiary - after travel chaos over the Christmas weekend due to staff calling in sick at US Airways, computer failures at Comair's subsidiary, and 30,000 passengers being stranded with 10,000 pieces of baggage left undelivered.\n", "orca-mini:3b": " The US government is investigating two airlines-US Airways and Delta Air Lines' Comair subsidiary after travel chaos over the Christmas weekend. Staff calling in sick at US Airways and computer failures at Comair left 30,000 passengers stranded and 10,000 pieces of baggage undelivered. Transportation Secretary Norman Mineta said he was \"deeply concerned\" at the disruption to passengers, and ordered a thorough investigation. Comair's computer breakdown plunged its flight-crew scheduling system into disarray. Altogether, some 1,100 flights were cancelled over the holiday long weekend. US Airways is in Chapter 11 bankruptcy protection for the second time in two years, and battling to cut costs. It is currently trying to negotiate pay cuts with flight and baggage staff.", "hermes3:3b": "US government probes airline US Airways and Delta Air Lines' Comair after Christmas travel chaos, where 30k passengers were stranded, 10k bags not delivered due to staff illness, computer failure, and cancelled flights.", "stablelm-zephyr:3b": "The US government is investigating two airlines, US Airways and Comair, after travel chaos over Christmas weekend left 30,000 passengers stranded and 10,000 pieces of baggage undelivered. The disruptions affected 1,100 flights and led to significant issues within the airline industry. Both US Airways and Comair are currently facing financial challenges due to bankruptcy protection and cuts in staff and costs needed for survival. The investigations will focus on understanding the causes of these disruptions, planning for holiday periods, and consumer needs.", "chatgpt-4o-latest": "The US government is investigating US Airways and Delta Air Lines' Comair subsidiary after severe travel disruptions over Christmas weekend. US Airways, in Chapter 11 bankruptcy protection, faced staff shortages as many employees called in sick, leading to flight cancellations and baggage pile-ups. Comair suffered a computer failure that disrupted flight-crew scheduling, resulting in 1,100 canceled flights. Transportation Secretary Norman Mineta ordered a probe into whether the airlines properly planned for the holiday period and responded to consumer needs. US Airways, struggling to cut costs and negotiate pay reductions, canceled hundreds of flights, raising concerns about its financial stability. Analysts believe the chaos could harm US Airways' chances of emerging from bankruptcy and worsen Delta's financial troubles. The investigation will assess compliance with a 1999 agreement on passenger service standards.", "stablelm2:1.6b": "The US government will investigate two airlines, US Airways and Delta Air Lines' Comair subsidiary, due to travel chaos over Christmas weekend. Passengers were left stranded due to staff calling in sick at US Airways and computer failures at Comair, leading to cancelled flights and undelivered baggage. The investigation aims to understand if the carriers properly planned for holiday travel and responded appropriately to consumer needs. US Airways and Comair face pay cuts as part of their bankruptcy protection, which could discourage customers from flying with US Airways and negatively impact Delta's finances.", "granite3.1-dense:2b": "The US government is investigating two major airlines, US Airways and Comair (Delta's subsidiary), following extensive disruptions during the Christmas holiday weekend. This chaos resulted from 30,000 stranded passengers, 10,000 undelivered bags, and over 1,100 cancelled flights. US Airways, in Chapter 11 bankruptcy for the second time in two years, faced issues such as sick staff (a third called off) and a shortage of flight attendants due to illness. Comair experienced computer failures that disrupted its crew scheduling system.\n\nTransportation Secretary Norman Mineta expressed deep concern over the disruptions and ordered an in-depth investigation to understand the root causes, the carriers' preparedness for the holiday travel period, and their responses to consumer needs. The probe will examine compliance with a 1999 agreement meant to enhance passenger service, which has prevented airlines from meeting congressionally mandated standards thus far.\n\nThe situation may negatively impact US Airways' reputation and financial health due to the widespread cancellations and disruptions. Analysts suggest that this incident could worsen Delta's already troubled financial status, as both airlines are interconnected through Comair. Both carriers have deeply regretted the inconvenience caused by the severe winter storm and related issues.", "reference": "Ground crews at US Airways, the seventh-largest US airline, which is now in Chapter 11 bankruptcy protection, face a court-imposed pay cut next month.There was also a shortage of US Airways flight attendants, with nearly a fifth saying they were too sick to work, leading to many flight cancellations.The US government is to investigate two airlines- US Airways and Delta Air Lines' Comair subsidiary - after travel chaos over the Christmas weekend.US Airways ended up cancelling over 100 flights on Christmas Day, stranding passengers in as many as 119 airports.Analysts said the Christmas chaos cast doubt on US Airway's ability to emerge from bankruptcy - and was likely to worsen the finances of troubled Delta, parent of Comair.US Airways had to cancel approximately 65 flights on Thursday, 180 on Friday, 140 on Saturday, 43 on Sunday and 15 on Monday, said industry officials.Staff calling in sick at US Airways and computer failures at Comair left 30,000 passengers stranded and 10,000 pieces of baggage undelivered.US Airways is in Chapter 11 bankruptcy protection for the second time in two years, and battling to cut costs.Disruptions to flight schedules could discourage customers from flying with US Airways, reducing revenues."}