{"raw_text": "Deutsche attacks Yukos case\n \n German investment bank Deutsche Bank has challenged the right of Yukos to claim bankruptcy protection in the US.\n \n In a court filing on Tuesday, it said the Russian oil giant has few Texas ties beyond bank accounts and a Texas-based finance chief. Deutsche Bank claimed Yukos had artificially manufactured a legal case to stop the sale of its main asset. It had wanted to help fund Gazprom's plans for a $10bn (£5.18bn) bid for Yukos unit Yuganskneftegas.\n \n Deutsche Bank would have earned large fees from the deal, which could not be carried out because US chapter 11 bankruptcy rules made the Kremlin's auction of Yuganskneftegas on 19 December illegal under US law.\n \n But the US bankruptcy court judge in Texas granted Yukos an injunction that barred Gazprom and its lenders from taking part. Yuganskneftegas will ultimately end up with Gazprom. The winning bidder at the auction was a previously unknown firm, Baikal Finance Group, which was snapped up days later by Rosneft, a Russian oil firm that is in the process of merging with Gazprom. The effect of these transactions is to renationalise Yuganskneftegas. Deutsche Bank contends Yukos filed for bankruptcy earlier this month in Texas in a desperate and unsuccessful bid to stave off the 19 December auction of its top unit by the Russian government, which was in a tax dispute with Yukos.\n \n \"This blatant attempt to artificially manufacture a basis for jurisdiction constitutes cause to dismiss this case,\" Deutsche Bank said in its court filing. Mike Lake, a spokesman for Yukos' lawyers, said on Tuesday that the company stands by its legal action. Yukos is confident of its right to US bankruptcy protection, and \"we are prepared to be back in court defending that position again,\" he said. Yukos has said it intends to seek $20bn in damages from the buyer of Yuganskneftegas once the sale finally goes through. In its filing, Deutsche Bank said Houston was \"a jurisdiction in which Yukos owns no real or personal property and conducts no business operations.\"\n \n It also said the US bankruptcy court should not become involved in \"a tax dispute between the Federation and one of its corporate citizens\". It suggested the European Court or an international arbitration tribunal were more appropriate jurisdictions for the legal fight between Russia and Yukos. The next hearing in the bankruptcy is expected on 6 January. Analysts believe the tax dispute between the Russian government and Yukos is partly driven by Russian president Vladimir Putin's hostility hostility to the political ambitions of ex-Yukos boss Mikhail Khordokovsky. Mr Khodorkovsky is in jail, and on trial for fraud and tax evasion.\n", "llama3.2:1b": "Deutsche Bank has challenged Yukos' right to claim bankruptcy protection in the US, claiming that the Russian oil giant has few connections to Texas beyond bank accounts and a finance chief. The court filing alleges that Yukos had artificially manufactured a case to stop the sale of its main asset, Yuganskneftegas, which was ultimately won by Baikal Finance Group.", "llama3.2:3b": "Deutsche Bank challenges Yukos' bankruptcy protection in US, claiming it artificially manufactured a legal case to block Gazprom's bid for Yuganskneftegas. The bank argues that the Russian oil giant has few ties to Texas beyond bank accounts and would have earned large fees from the deal if it were allowed to proceed.", "gemma2:2b": "Deutsche Bank challenged Yukos' bankruptcy filing in the US, claiming it was an artificial attempt to delay a sale of its assets. They argue that Yukos filed for protection in Texas based on a desperate bid to avoid Russia’s auction of its asset Yuganskneftegas after a tax dispute with the Russian government. Yukos maintains their right to bankruptcy protection and plans to seek damages from the buyer of Yuganskneftegas once the sale is complete.  \n", "qwen2.5:0.5b": "Deutsche Bank challenges Yukos's bankruptcy rights against the US, citing evidence of a legal case. The judge granted Yukos an injunction against Gazprom and its lenders, leaving Yuganskneftegas to be sold by Baikal Finance Group in Rosneft's merger. Analysts believe this dispute could lead to a tax dispute between Russia and Yukos.", "qwen2.5:1.5b": "Deutsche Bank challenges Yukos' claim to bankruptcy protection in US court; disputes over oil asset sale fueled by Russian government's illegal auction.", "qwen2.5:3b": "Deutsche Bank has challenged Yukos' right to US bankruptcy protection over the sale of its main asset, Yuganskneftegas. Deutsche claims Yukos artificially manufactured a case to prevent Gazprom's planned $10bn acquisition. The court ruled in favor of Yukos, allowing the auction and subsequent sale to Gazprom/Rosneft, effectively renationalizing Yuganskneftegas. Deutsche argues that Yukos filed for bankruptcy to stop this auction, which it now contends was driven by tax disputes between Russia and Yukos. Analysts suggest the dispute is also related to Putin's stance against ex-Yukos boss Khodorkovsky. The case is scheduled for further hearing in January.", "opencoder:1.5b": "Deutsche Bank has challenged the right of Yukos to claim bankruptcy protection in the US, which was a case created by a Russian brokerage firm to halt the sale of its main asset. The deal involved the merger of two multinational companies, with both entities now operating in Russia. The action is designed to renatalise Yuganskneftegas and restore liquidity for businesses that were previously in a tax conflict with Russia's government.\n\nYukos contends he has a stronghold in Texas, bearing multiple ties beyond bank accounts. However, the case was dismissed by US bankruptcy court judges who granted him an injunction banning Gazprom from taking part in the auction. The end result of these transactions is that Yuganskneftegas will end up under Gazprom's control.\n\nThe defense by Deutsche Bank claims it has been a successful bid to stave off the 19 December auction and the sale of its top unit. The firm contends that the tax dispute between Russia and the Russian government was mainly driven by the Russian President Vladimir Putin, who has publicly criticized the political aims of Yugoslaw's boss Mikhail Khordokovsky.\n\nThe filing also highlights the importance of the firm in combating political conflicts in Russia, which has become a hotbed of threats since the 2016 elections. In addition to being a US bankruptcy and stockholder, the firm also serves as a tax advisor, serving customers across Europe, and as an insurance company for foreign governments.\n", "smollm:1.7b": "The German bank challenged the right of Yukos to bankruptcy protection in the US because:\n\n1. Deutsche Bank claimed that Yukos had few Texas ties beyond bank accounts and a Texas-based finance chief.\n2. Deutsche Bank argued that it was artificially manufactured a legal case to stop the sale of Yuganskneftegas on 19 December.\n3. Deutsche Bank believed that Gazprom and its lenders would not have been able to take part in the US auction because of US bankruptcy rules.\n4. Deutsche Bank contended that Gazprom and its lenders had artificially manufactured a basis for jurisdiction to stop the sale of Yuganskneftegas on 19 December.\n5. Deutsche Bank believed that Gazprom and its lenders would not have been able to take part in the US auction because of US bankruptcy rules.\n6. Deutsche Bank argued that Gazprom and its lenders had filed for bankruptcy earlier this month in Texas in a desperate bid to stave off the 19 December auction of Yuganskneftegas on 19 December.\n7. Deutsche Bank believed that Gazprom and its lenders would not have been able to take part in the US auction because of US bankruptcy rules.\n8. Deutsche Bank contended that Gazprom and its lenders had claimed that they owned no real or personal property and conducted no business operations.\n9. Deutsche Bank suggested that the European Court or an international arbitration tribunal were more appropriate jurisdictions for the legal fight between Russia and Yukos.\n10. Deutsche Bank believed that the tax dispute between the Russian government and Yukos was partly driven by Russian president Vladimir Putin's hostility towards the political ambitions of ex-Yukos boss Mikhail Khordokovsky.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to help the user summarize a provided text concisely while preserving key ideas and details. The user has given me a detailed legal case summary from Deutsche Bank challenging Yukos' bankruptcy protection in the US. \n\nFirst, I should read through the entire passage carefully to understand the main points. It starts by mentioning that Deutsche Bank is challenging the right of Yukos to claim bankruptcy protection. Then it goes into specifics about their financial ties with Texas, their claims against Gazprom for a $10 billion bid, and how this auction was affected by US chapter 11 rules.\n\nI also notice that Deutsche Bank argues that the Russian government's involvement in Yuganskneftegas' acquisition was to stop them from going public. They mention that Gazprom couldn't proceed because of tax issues. The court granted an injunction stopping Gazprom and its lenders from participating, ultimately allowing Yuganskneftegas to be bought by a new firm which is part of Rosneft, the Russian company involved in mergers.\n\nThe text also states that in Texas, Deutsche Bank filed for bankruptcy protection as a desperate move, despite being unsuccessful. They said there was no property or business ties there. It mentions Yulksnyneftegas' rights to US bankruptcy protection and says they have damages plans if they win the sale.\n\nAdditionally, the court suggests avoiding American tax disputes with Russia by choosing appropriate international arbitration courts like the European Court or an ICJ instead of getting involved with Texas's bankruptcy case. The next hearing is on January 6th.\n\nI should make sure to capture all these key points without making it too long. I'll need to structure the summary to include the main events: Deutsche Bank's challenge, their ties, the auction process affected by US laws, the court decision granting an injunction, the final acquisition, Yulksnyneftegas' rights, and the tax dispute. Also, note that they filed in Texas as a last-ditch effort despite failing.\n\nI need to keep it concise but include all necessary details. Maybe start with the case outcome, then their financial ties, auction impact, court decision, acquisition details, rights, and finally the tax dispute and suggested court choice.\n</think>\n\nDeutsche Bank has challenged Yukos' right to bankruptcy protection in the US, arguing that Russian firm Yuganskneftegas had artificially claimed its bankruptcy status to prevent it from participating in a $10 billion acquisition by Gazprom. In Texas, Deutsche Bank filed for bankruptcy protection despite failing the deadline, with few financial ties beyond bank accounts and a finance chief in Texas. The court granted an injunction blocking Gazprom and its lenders from participating, allowing Yulksnyneftegas to ultimately end up with Gazprom under a new buyer, Baikal Finance Group. The merger of Rosneft and GAZCOM finalized Yulksnyneftegas' rights to bankruptcy protection.", "tinyllama:1.1b": "The German investment bank Deutsche Bank has challenged the legal case filed by oil giant Gazprom against its main asset Yukonesltd, claiming that it had no ties beyond bank accounts and a Texas-based financing chief. The Russian oil giant has few Texas tieins beyond bank accounts and a finance chief, but Deutsche Bank claims that Gazprom's acquisition of Yukonesltd will lead to \"large fee\" from US chapter 11 bankruptcy rules, which can not be carried out under US law. However, the US bankruptcy court granted Yukonesltd an injunction barring Gazprom and its lenders from taking part in the acquisition, while Yukonesltd's successful bidder, Baikal Finance Group, was snapped up by Rosneft, a Russian oil firm that is in the process of merging with Gazprom. The bankruptcy judge has also ruled that the legal action filed by Yukonesltd is not an attempt to artificially manufacture a basis for jurisdiction constituents, and that the company stands by its legal action.", "tinydolphin:1.1b": " The German investment bank Deutsche Bank has filed a court document in Texas accusing Yukos of attempting to manipulate its legal case for US bankruptcy protection. Deutsche Bank claimed that Yukos had artificially manufactured a legal case to stop the sale of Yukos's main asset, which is its Yuganskneftegas unit. Deutsche Bank argued that the Russian oil giant has no Texas ties and only uses Texas-based finance chief as a way to funnel money for Gazprom's planned bid for the Yukos unit. In response, Yukos intends to seek $20 billion in damages from the buyer of Yuganskneftegas once the sale finally goes through.", "phi:2.7b": " Deutsche Bank challenges Yukos bankruptcy case. The German investment bank claims that Yukos had artificially manufactured a legal case and should not receive bankruptcy protection in the US. Deutsche Bank argues that Texas is not where Yukos has any real or personal property or business operations. It also suggests that the US court system should not be involved in a tax dispute between Russia and Yukos, but instead refer the case to an international arbitration tribunal. The next hearing is expected on January 6th.\n", "orca-mini:3b": " German investment bank Deutsche Bank challenged Yukos' right to bankruptcy protection in the US, claiming the Russian oil giant had manufactured a legal case to stop the sale of its main asset. The bid was to help fund Gazprom's plans for a $10bn takeover of Yuganskneftegas. However, the US bankruptcy court judge granted an injunction that barred Gazprom and its lenders from taking part in the auction. Yukos won the bid, and the winning bidder at the auction was a previously unknown firm, Baikal Finance Group, which was snapped up days later by Rosneft, a Russian oil firm that is merging with Gazprom. The effect of these transactions is to renationalize Yuganskneftegas. Deutsche Bank contends Yukos filed for bankruptcy earlier this month in Texas in a desperate and unsuccessful bid to stave off the 19 December auction of its top unit by the Russian government, which was in a tax dispute with Yukos.", "hermes3:3b": "Deutsche Bank challenges Yukos's bankruptcy claim in US, arguing it created artificial case to stop asset sale.", "stablelm-zephyr:3b": "Deutsche Bank challenged Yukos' right to bankruptcy protection in the US, claiming that the Russian oil giant manufactured a legal case to stop the sale of its main asset. The US bankruptcy court judge granted Yukos an injunction barring Gazprom and its lenders from participating in the auction of Yuganskneftegas, ultimately allowing Rosneft to acquire the asset. Deutsche Bank suggested that the European Court or an international arbitration tribunal would be more appropriate jurisdictions for the legal fight between Russia and Yukos.", "chatgpt-4o-latest": "Deutsche Bank has challenged Yukos' right to US bankruptcy protection, arguing that the Russian oil firm has minimal ties to Texas and filed for bankruptcy to block the sale of its key asset, Yuganskneftegas. Deutsche Bank, which sought to finance Gazprom’s $10bn bid for the unit, claims the bankruptcy filing was an artificial legal maneuver. A US court granted Yukos an injunction preventing Gazprom from participating in the sale, but Yuganskneftegas was ultimately acquired by Rosneft, effectively renationalizing it. Deutsche Bank argues the US court should not intervene in a Russian tax dispute and suggests the case be handled by European or international arbitration courts. Yukos maintains its legal stance and plans to seek $20bn in damages. Analysts link the dispute to Russian President Putin’s opposition to ex-Yukos chief Mikhail Khodorkovsky, who is jailed for fraud and tax evasion. The next bankruptcy hearing is set for 6 January.", "stablelm2:1.6b": "German bank Deutsche Bank challenges Yukos bankruptcy claim; arguing that the Russian oil giant has few Texas ties & manufactured a legal case to stop the sale of its asset. US chapter 7 bankruptcy rules make it impossible for Gazprom to bid for Yuganskneftegas, but an injunction was granted by the Texas judge which prevents Gazprom and lenders from taking part. Baikal Finance Group won the auction but was later bought by Rosneft. Yukos filed for bankruptcy in Texas earlier this month as a desperate attempt to stave off the sale of its top unit by the Russian government in a tax dispute with Yukos. Deutsche Bank says it's not a jurisdiction where Yukos owns any real or personal property and conducts business operations. It suggests the European Court or an international arbitration tribunal is more appropriate for the legal fight between Russia & Yukos.", "granite3.1-dense:2b": "Deutsche Bank has contested Yukos' bankruptcy filing in a US court, arguing that the Russian oil giant lacks significant Texas connections beyond financial accounts and a finance chief based there. The German bank claims Yukos fabricated a legal case to prevent Gazprom's $10bn bid for Yuganskneftegas, a Yukos unit. Deutsche Bank anticipates substantial fees from this deal but cannot proceed due to US chapter 11 bankruptcy rules, which deemed the Kremlin's December auction illegal under US law.\n\nYukos sought Texas bankruptcy protection in late November, allegedly to delay the Gazprom-led sale of Yuganskneftegas. Deutsche Bank asserts this was a desperate bid to stall the auction over a tax dispute between Russia and Yukos. The bank argues that Houston, Texas, is not an appropriate jurisdiction for resolving such a dispute and recommends international courts or arbitration tribunals instead.\n\nYukos maintains its bankruptcy filing, asserting its right to US protection and plans to seek $20bn in damages from the buyer of Yuganskneftegas once the sale concludes. The next court hearing is scheduled for 6 January. Analysts suggest Russian President Vladimir Putin's opposition to ex-Yukos boss Mikhail Khodorkovsky, now imprisoned on fraud and tax evasion charges, may fuel the tax dispute between Russia and Yukos.", "reference": "Deutsche Bank contends Yukos filed for bankruptcy earlier this month in Texas in a desperate and unsuccessful bid to stave off the 19 December auction of its top unit by the Russian government, which was in a tax dispute with Yukos.German investment bank Deutsche Bank has challenged the right of Yukos to claim bankruptcy protection in the US.Yukos is confident of its right to US bankruptcy protection, and \"we are prepared to be back in court defending that position again,\" he said.But the US bankruptcy court judge in Texas granted Yukos an injunction that barred Gazprom and its lenders from taking part.In its filing, Deutsche Bank said Houston was \"a jurisdiction in which Yukos owns no real or personal property and conducts no business operations.\"Yukos has said it intends to seek $20bn in damages from the buyer of Yuganskneftegas once the sale finally goes through.It also said the US bankruptcy court should not become involved in \"a tax dispute between the Federation and one of its corporate citizens\".Deutsche Bank claimed Yukos had artificially manufactured a legal case to stop the sale of its main asset."}