{"raw_text": "Durex maker SSL awaits firm bid\n \n UK condom maker SSL International has refused to comment on reports it may be subject to a takeover early in 2005.\n \n A Financial Times report said business intelligence firm GPW was understood to be starting due diligence work on SSL International, for a corporate client. An spokesman for SSL, which makes the famous Durex brand of condom, would not to comment on \"market speculation\". However the news sent shares in SSL, which also makes Scholl footwear, up more than 6%, or 16.75 pence to 293.5p.\n \n The FT said most the high-profile firm that might woo SSL was Anglo-Dutch household products group Reckitt Benckiser. Eighteen months ago Reckitt Benckiser was at the centre of a rumoured takeover bid for SSL - but that came to nothing. Other firms that have been seen as would-be suitors include Kimberly-Clark, Johnson & Johnson, and private equity investors. Analysts have seen SSL as a takeover target for years. It sold off its surgical gloves and antiseptics businesses for £173m to a management team in May. SSL was formed by a three-way merger between Seton Healthcare, footwear specialists Scholl and condom-maker London International Group. Its other brands include Syndol analgesic, Meltus cough medicine, Sauber compression hosiery and deodorant products, and Mister Baby.\n", "llama3.2:1b": "UK condom maker Durex maker SSL International has refused to comment on takeover speculation, but shares in the company increased by 16.75% after a Financial Times report mentioned GPW as starting due diligence work on it. The firm has sold off its surgical gloves and antiseptics businesses for £173m to management in May, making it a potential target for other companies.", "llama3.2:3b": "UK condom maker SSL International faces potential takeover bid from Reckitt Benckiser, with GPW starting due diligence work for an undisclosed client. Shares rose 6% as news sent shockwaves through the company. Analysts have seen SSL as a target for years, following its previous sale of surgical gloves and antiseptics businesses for £173m.", "gemma2:2b": "SSL International, maker of Durex condoms, is the subject of potential takeover bids from companies like Reckitt Benckiser. The company has refused to comment on market speculation surrounding a possible acquisition.  \nShares in SSL rose significantly following the news of potential interest. \nThe company owns various other brands in addition to Durex and Scholl footwear.   \n", "qwen2.5:0.5b": "UK-based condom maker SSL International is reportedly being pursued by a major company for the acquisition of its Durex brand (SSL brand) in 2005. The Financial Times reported that business intelligence firm GPW was reviewing SSL's corporate client due diligence work before making any decisions. SSL, which makes various brands like London International Group and London Medical Products, is currently up more than 6% or $16.75 per share on the FT after receiving positive news from the FT about Reckitt Benckiser buying SSL. Analysts have suggested that SSL could be a potential target for a major acquisition in the not-so-distant future.", "qwen2.5:1.5b": "UK condom maker SSL International has refused to comment on reports it may be subject to a takeover in early 2005, citing \"market speculation\". Shares of the company rose more than 6% following rumors of a potential deal with business intelligence firm GPW. The FT mentions that Reckitt Benckiser and other firms have expressed interest in SSL over the years but no action has been taken so far.", "qwen2.5:3b": "UK condom maker SSL International has refused to comment on reports of a potential takeover early in 2005 by business intelligence firm GPW for a corporate client. An FT report suggests Reckitt Benckiser might be the main contender among Anglo-Dutch household products group, Kimberly-Clark, Johnson & Johnson, and private equity investors who have shown interest in SSL International over years. The company's shares spiked after the news due to its sale of surgical gloves and antiseptics businesses for £173m last year, which left it with brands like Durex condoms, Scholl footwear, Syndol analgesic, Meltus cough medicine, Sauber compression hosiery, deodorant products, and Mister Baby.", "opencoder:1.5b": "Durex maker SSL awaits firm bid\n\nUK condom maker SSL International has refused to comment on reports it may be subject to a takeover early in 2005.\n\nFinancial Times report said GPW was understood to be starting due diligence work on SSL International, for a corporate client. An spokesman for SSL would not comment on \"market speculation\". However the news sent shares in SSL, which also makes Scholl footwear, up more than 6%, or 16.75 pence to 293.5p.\n\nFT said most the high-profile firm that might woo SSL was Anglo-Dutch household products group Reckitt Benckiser. Eighteen months ago Reckitt Benckiser was at the centre of a rumoured takeover bid for SSL - but that came to nothing. Other firms that have been seen as would-be suitors include Kimberly-Clark, Johnson & Johnson, and private equity investors. Analysts have seen SSL as a takeover target for years. It sold off its surgical gloves and antiseptics businesses for £173m to a management team in May. SSL was formed by a three-way merger between Seton Healthcare, footwear specialists Scholl and condom-maker London International Group. Its other brands include Syndol analgesic, Meltus cough medicine, Sauber compression hosiery and deodorant products, and Mister Baby.\n", "smollm:1.7b": "Durex maker SSL awaits firm bid", "deepseek-r1:1.5b": "<think>\nOkay, let me tackle this query step by step. The user has provided a text that needs summarization into just plain text with no explanations or formatting. They also specified not to include any reasoning process.\n\nFirst, I'll read through the original content carefully. It seems to be about two companies: Durex (from SSL) andSSL International, which made condom products. The user is asking for a concise summary preserving key ideas and details.\n\nI need to extract the main points from each paragraph. For the first sentence, it mentions that SSL awaits a firm bid from Durex UK, focusing on its potential takeover. Then, there's a response about SSL International refusing to comment due to reports of possible takeovers. The financial report suggests that GPW is starting due diligence and shares in SSL went up.\n\nThe next part is more detailed about Reckitt Benckiser's takeover bid for SSL but notes it didn't pan out. Other potential suitors like Kimberly-Clark, Johnson & Johnson, and private equity are also mentioned. The company was formed through a merger of three companies: Seton Healthcare, Scholl, and London International Group. Their other products include analytical products and deodorant.\n\nI need to condense this into a summary without losing any critical information. I'll start with the key event about SSL receiving a bid, then mention the potential takeovers affecting shares. Include Reckitt Benckiser as the main rival, their bid being unsuccessful. Also, note the merger details and the products they offer.\n\nI should ensure that all important points like SSL's focus on condense personal care products, Durex's role, Reckitt Benckiser's involvement, the timing of the buyout, the potential for multiple takeovers, and the financial implications are covered concisely without any fluff.\n</think>\n\nSSL awaiting a firm bid by Durex UK; SSL International faces possible early takeover; GPW reports starting due diligence on SSL with shares rising 16.75 pence to 293.5p in shares trading at £1.46; Reckitt Benckiser, Anglo-Dutch household products group, is a high-profile rival for SSL but no takeover bid was successful; SSL formed through merger of Seton Healthcare, Scholl, and London International Group; includes condense personal care products (analogous to Durex); other potential suitors like Kimberly-Clark, Johnson & Johnson, and private equity; company sells surgical gloves/antiseptics for £173m in May; shares up 6%.", "tinyllama:1.1b": "Durex maker SSL awaits firm bid for early in 2005, after reports suggested it may be subject to takeover by UK condom-maker SSL International or other interested parties. However, an analyst reported that the stock had seen \"market speculation\" and SSL declined to comment on rumoured takeovers. Reckitt Benckiser was rumored for a potential bid for SSL in 2014, but it failed to materialize. The company has also sold its surgical gloves and anti-inflammatory businesses for £173m to a management team. Its other brand names include syndoL analgesic, MeltuS cough medicine, Sauber compression hosiery and deodorant products, and Mister Baby.", "tinydolphin:1.1b": " Durex maker SSL International has refused to comment on reports it may be subject to a takeover early in 2005. However, the Financial Times reports that business intelligence firm GPW is starting due diligence work on SSL International, for a corporate client. An spokesman for SSL, which makes popular brands like Durex condom and Scholl footwear, would not comment on \"market speculation.\" The news sent shares in the company up more than 6%, or 16.75 pence to 293.5p.", "phi:2.7b": " The UK condom maker SSL International is reportedly being considered for a takeover by the business intelligence firm GPW on behalf of a corporate client. Some high-profile companies that may be interested include Reckitt Benckiser, Kimberly-Clark, Johnson & Johnson, and private equity investors. SSL has also sold off its surgical gloves and antiseptics businesses in May.\n", "orca-mini:3b": " SSL International, a UK condom maker, may be subject to a takeover early in 2005. It is rumored that Reckitt Benckiser, an Anglo-Dutch household products group, is interested in making an offer. However, no firm bids have been made public. The news caused shares in SSL International to rise by more than 6%, or 16.75 pence, to 293.5p.", "hermes3:3b": "SSL International takeover: Potential buyer GPW, Durex maker", "stablelm-zephyr:3b": "UK condom maker SSL International remains silent on possible takeover reports in early 2005. GPW starting due diligence for a corporate client, raising shares by over 6%. Reckitt Benckiser, Kimberly-Clark, Johnson & Johnson, and private equity investors were previously mentioned potential suitors. SSL, formed by a merger between Seton Healthcare, Scholl footwear, and London International Group, sold off its surgical gloves and antiseptics businesses in May 2004.", "chatgpt-4o-latest": "UK condom maker SSL International is speculated to be a takeover target, with reports suggesting business intelligence firm GPW is conducting due diligence for a corporate client. SSL, which produces Durex condoms and Scholl footwear, declined to comment on the speculation, but its shares rose over 6%. Potential bidders include Reckitt Benckiser, which was previously linked to SSL, as well as Kimberly-Clark, Johnson & Johnson, and private equity firms. Analysts have long viewed SSL as a takeover target, especially after selling its surgical gloves and antiseptics businesses for £173m. Formed through a merger, SSL owns brands such as Syndol, Meltus, Sauber, and Mister Baby.", "stablelm2:1.6b": "UK condom maker SSL International has reportedly received interest from business intelligence firm GPW for due diligence on the company. Financial Times reported that Reckitt Benckiser, along with other potential suitors like Kimberly-Clark, Johnson & Johnson, and private equity investors, have been eyed as potential acquirers of SSL. The move could make it a takeover target again; however, an SSL spokesperson declined to comment on market speculation. Shares in the company surged after the news.", "granite3.1-dense:2b": "SSL International, the UK-based company behind the popular Durex condom brand, experienced a share price increase of over 6% following reports of potential takeover bids in early 2005. Business intelligence firm GPW was allegedly conducting due diligence for an unnamed corporate client, with Reckitt Benckiser and other firms like Kimberly-Clark, Johnson & Johnson, and private equity investors previously rumored to be interested. SSL, which also produces Scholl footwear, was formed through a merger between Seton Healthcare, Scholl, and London International Group's condom business. The company's portfolio includes various healthcare products such as Syndol analgesic, Meltus cough medicine, Sauber compression hosiery, deodorant products, and Mister Baby. Analysts have long considered SSL a potential takeover target.", "reference": "UK condom maker SSL International has refused to comment on reports it may be subject to a takeover early in 2005.A Financial Times report said business intelligence firm GPW was understood to be starting due diligence work on SSL International, for a corporate client.The FT said most the high-profile firm that might woo SSL was Anglo-Dutch household products group Reckitt Benckiser.Analysts have seen SSL as a takeover target for years.SSL was formed by a three-way merger between Seton Healthcare, footwear specialists Scholl and condom-maker London International Group."}