{"raw_text": "WMC says Xstrata bid is too low\n \n Australian mining firm WMC Resources has said it is worth up to 30% more than a hostile 7.4bn Australian dollar ($5.8bn; £3bn) bid by rival Xstrata.\n \n There is now pressure on Swiss-based Xstrata to increase its takeover offer. A report from investment firm Grant Samuel in WMC defence documents values WMC shares at A$7.17 to A$8.24, against Xstrata's bid of A$6.35 a share. Analysts said the defence documents provided more details on WMC, and may trigger a possible rival bid. \"If a bid is going to emerge it is probably likely in the next one to two weeks,\" said Daiwa Securities analyst Mark Pervan. He said the valuation would put increased pressure on Xstrata to look at \"sweetening\" its offer. Marc Gonsalves, an executive at Xstrata, said: \"We will review the information contained in the target's statement over the next week or so.\" He added: \"While we will review the assumptions made by Grant Samuel in detail, we are extremely sceptical of their conclusion, and suggest that WMC shareholders take extreme care in presuming that these optimistic assumptions are capable of being realised.\"\n \n Last month Australia's competition watchdog said it would not oppose the purchase of WMC by Zurich and London-based Xstrata. On Tuesday, WMC chairman Tommie Bergman said in a statement the directors believed it was in shareholders' best interest to reject the offer. He said WMC would pursue \"value-creating options\" provided by a portfolio of \"world class assets\". And WMC chief executive Andrew Michelmore claimed the Xstrata offer was aimed at creating value for Xstrata's shareholders, and was not being made for the benefit of WMC's shareholders. Grant Samuel said its valuation of WMC was based on lower average prices for nickel, copper and uranium than current market levels. \"Any longer term commodity price improvements would only improve our outlook,\" Mr Michelmore said.\n \n In 2003 Xstrata acquired Australia's largest copper miner - MIM Holdings. WMC Resources is the world's third-largest producer of concentrated nickel, and also a miner of copper and uranium. It owns the Olympic Dam mine in South Australia, which contains about one-third of the world's known uranium resources and is also the world's fourth largest copper mine. Xstrata is a global mining giant with operations in Australia, South Africa, Spain, Germany, Argentina and the UK. Its core products are copper, coking coal, thermal coal, ferrochrome, vanadium and zinc. It also has growing businesses in gold, lead and silver.\n", "llama3.2:1b": "WMC Resources says Xstrata's bid of $5.8bn is too low. WMC values shares at A$7.17-A$8.24, which may trigger a rival takeover offer from Xstrata. Daiwa Securities analyst Mark Pervan suggests increased pressure on Xstrata to review its offer.\n\nXstrata executive Marc Gonsalves says the valuation is \"sceptical of their conclusion\" and he is reviewing it in detail. WMC chairman Tommie Bergman believes rejecting the bid would be in shareholders' best interest, citing a need for value-creating options from a portfolio of assets.\n\nWMC Resources is a global mining company with operations in Australia, South Africa, Spain, Germany, Argentina, and the UK, producing concentrated nickel, copper, and uranium.", "llama3.2:3b": "WMC Resources values itself at A$7.17 to A$8.24 per share, higher than Xstrata's A$6.35 offer. Analysts say the valuation may trigger a possible rival bid, putting pressure on Xstrata to increase its offer. WMC chairman Tommie Bergman says rejecting the offer is in shareholders' best interest and will pursue \"value-creating options\".", "gemma2:2b": "WMC Resources believes its share value is worth more than Xstrata's A$6.35 bid and may explore other options. The Grant Samuel valuation suggests WMC shares are worth up to 30% more. Xstrata says it will review the report but remains skeptical. Competition watchdog approved the takeover. WMC wants to pursue other value-creating opportunities, while Andrew Michelmore states the offer is not for the benefit of WMC shareholders.  \n", "qwen2.5:0.5b": "Australian mining firm WMC Resources said it was worth up to 30% more than a hostile Xstrata bid of the Australian mining company, Zurich and London-based Xstrata's share value had fallen to 82 cents from 94 cents last month due to a report by investment firm Grant Samuel in WMC defence documents. Analysts are also considering a potential rival bid for the mine, with Daiwa Securities analyst Mark Pervan saying it was possible a bid could emerge \"in two weeks or so\". Xstrata's share value had fallen from A$6.35 to A$7.17 and Australian Competition and Consumer Affairs (ACCA) watchdog said it would not oppose the purchase of WMC by Xstrata, with chairman Tommie Bergman saying shareholders wanted \"value-creating options\" and chief executive Andrew Michelmore claiming the offer was made for the benefit of shareholders.", "qwen2.5:1.5b": "Australian mining firm WMC Resources values itself at up to 30% more than Xstrata's hostile $7.4 billion bid for the company. Swiss-based Xstrata will likely increase its offer or consider a rival bid due to lower valuations provided by analyst Grant Samuel, who valued WMC shares at A$7.17 to A$8.24 per share compared to Xstrata's bid of A$6.35 per share.", "qwen2.5:3b": "WMC Resources is valued at up to 30% higher than Xstrata's hostile $5.8bn bid of A$6.35 per share. WMC argues its stock is worth between A$7.17 and A$8.24, citing investment firm Grant Samuel's valuation. Analysts expect pressure on Xstrata to increase its offer. While Australia's competition watchdog cleared the acquisition, WMC chairman Tommie Bergman rejects the bid as not in shareholders' best interest. WMC owns world-class assets including Olympic Dam mine with significant uranium resources. The deal faces scrutiny from analysts and potential rival bids, given Grant Samuel's valuation of WMC shares at a premium to Xstrata's offer.", "opencoder:1.5b": "WMC Resources has stated that its investment offer is worth up to 30% more than a hostile Australian dollar bid by a rival Xstrata company. The pressure from Xstrata's takeover offers increased. A report from the investment firm Grant Samuel provides values WMC shares at approximately $7.17 to $8.24, against Xstrata's bid of approximately $6.35 per share. Daiwa Securities analyst Mark Pervan has indicated that the valuation would put increased pressure on Xstrata to look for a \"sweetening\" offering.\n\nLast month, Australia's competition watchdog expressed dissatisfaction with the purchase of WMC by Swiss-based Xstrata. The chief executive Andrew Michelmore insisted the Xstrata offer was aimed at creating value for shareholders and it wasn't to benefit WMC's shareholders. Xstrata's valuation based on lower average prices for nickel, copper anduranium compared to current market levels suggests that its valuation is more likely to improve in future.\n", "smollm:1.7b": "WMC Resources is worth up to 30% more than a hostile bid by rival Xstrata.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text that someone wrote about WMC Resources and Xstrata. Let me read through it carefully to understand the key points.\n\nFirst paragraph says that WMC is considering a bid from Xstrata, which is worth up to 30% more than their $5.8 billion offer. That's significant because if Xstrata wants to increase its offer, it might pressure them further.\n\nNext, there's a report by Grant Samuel in WMC's defense documents showing that WMC shares are valued at about $7.17 to $8.24, while Xstrata's bid is around $6.35. This suggests WMC has a higher valuation but needs more info before moving forward.\n\nThe analyst Mark Pervan from Daiwa Securities mentions that the defense documents provide details which might lead to a possible rival bid in the next couple of weeks. He thinks increased pressure on Xstrata to get \"sweetened\" deal makes sense because they're looking for better terms, maybe to retain control.\n\n Marc Gonsalves at Xstrata also says he'll review Grant Samuel's info over the next week or so but is skeptical about their conclusion and prefers WMC shares to be taken seriously. He thinks it's more important to get good terms from Xstrata than protecting their own interests.\n\nThen, last month Australia's watchdog said they'd oppose Xstrata taking WMC over Zurich and London. But on Tuesday, WMC's chairman Tommie Bergman stated that directors think WMC is better off rejecting the offer because shareholders are in its best interest. He mentions WMC will focus on value-creating options from a portfolio of \"world-class assets.\" WMC's CEO Andrew Michelmore says Xstrata's offer aims to create value for their own shareholders, not WMC's.\n\nLastly, Xstrata was acquired by WMC Resources in 2003 when they owned the largest copper miner. WMC now has nickel, copper, and uranium mines, among others. There are growing businesses in gold, lead, and silver too.\n\nPutting this together, I need to create a concise summary that captures all these points: WMC's consideration of Xstrata's high bid, Xstrata's defense documents showing higher valuation, potential pressure on their offer, analyst views on possible rival bids, director concerns about rejecting the offer, Xstrata aiming for value gains over WMC, and some historical context.\n\nI need to make sure I include all these elements without adding extra details. So, the summary should mention WMC's bid being up to 30% more, Xstrata's defense documents with higher valuations, the potential pressure on their offer, analysts' views about possible rival bids, directors' concerns, Xstrata's focus on value gains, and their historical acquisition.\n\nI think that covers everything in the text without getting into too much detail. Now I just need to put it all together as a single, clear sentence.\n</think>\n\nWMC Resources is considering a high bid from rival Xstrata, potentially up to 30% more than their $5.8 billion offer, supported by defense documents showing WMC's shares valued at around $7.17 to $8.24, while Xstrata's offer of $6.35 per share. Analysts suggest increased pressure on Xstrata to \"sweeten\" its terms. Daiwa Securities analyst Mark Pervan notes that the defense documents provide details but may lead to a possible rival bid in the next few weeks. Marc Gonsalves at Xstrata doubts Grant Samuel's conclusion and believes WMC shares should be taken seriously, while maintaining control. WMC chairman Tommie Bergman concerns directors with WMC prioritizing rejection of the offer for shareholders' best interests. He mentions focusing on value-creating assets from a portfolio of \"world-class\" mines. Meanwhile, Xstrata's 2003 acquisition of the largest copper miner by WMC Resources and their focus on nickel, copper, uranium, and other industries complete this summary.", "tinyllama:1.1b": "Concise summary of the following text:\n\nAustralian mining firm WMC Resources (WMCL) says it is worth up to 30% more than a hostile 7.4bn Australian dollar ($5.8bn; £3bn) bid by rival Xstrata. The defencetive documents value WMCL shares at A$7.17 per share, against Xstrata's bid of A$6.35 a share. Analysts say the valuation would increase pressure on Swiss-based Xstrata to consider a rival bid, while WMC chairman Tommie Bergman says WMCL will explore \"value-creating options\" if rejected by Xstrata. Grant Samuel's valuation of WMCL based on lower average prices for nickel, copper and uranium than current market levels suggests any longer term commodity price improvements would only improve outlook. The firm's operations include the Olympic Dam mine in South Australia, which contains about one-third of the world's known uraniu resources and is also a major copper producer. Xstrata is a global mining giant with operations in Australia, South Africa, Spain, Germany, Argentina and the UK. Its core products are copper, coal, ferrochrome, vanadium and zinc, as well as growing businesses in gold, lead and silver.", "tinydolphin:1.1b": " The Xstrata bid for WMC Resources is considered too low by Australian mining firm WMC Resources. This comes as a surprise to the Swiss-based company, which has offered up to 30% more than what WMC's directors currently value their shares at. According to Grant Samuel’s defense documents, WMC shares are currently worth between A$7.17 and A$8.24 per share. This valuation puts significant pressure on Xstrata to increase its takeover offer, as a result of which analysts have suggested that the rival bid is likely in the next few weeks.", "phi:2.7b": " Australian mining company WMC Resources believes it is worth up to 30% more than Xstrata's hostile takeover bid of 7.4bn Australian dollars, according to investment firm Grant Samuel. The report suggests that WMC shares are valued at A$7.17-8.24 per share, while Xstrata's bid values them at A$6.35 per share. Analysts say the value provided by the defence documents on WMC may encourage a rival bid from other companies. Marc Gonsalves, an executive at Xstrata, said that they will review the information and suggest shareholders take extreme care in believing the optimistic assumptions made in Grant Samuel's report. However, Australia's competition watchdog has not yet announced its position on the takeover. WMC chairman Tommie Bergman said it is in shareholders' best interest to reject the offer as they would pursue value-creating options with a portfolio of \"world class assets\". Meanwhile, Xstrata believes their acquisition will create long-term value for shareholders and are unlikely to increase their bid. Grant Samuel's report suggests that WMC shares would be worth more than Xstrata's current valuation if commodity prices improve in the future.\n", "orca-mini:3b": " Xstrata's hostile bid for WMC Resources is worth up to 30% more than the Australian company, valued by a rival investment firm Grant Samuel at A$7.17 to A$8.24 per share, against Xstrata's A$6.35 bid. This has put pressure on the Swiss-based company to increase its takeover offer, as analysts predict that the defense documents may trigger a possible rival bid. WMC Resources is the world's third-largest producer of concentrated nickel, and also a miner of copper and uranium. Its Olympic Dam mine in South Australia contains about one-third of the world's known uranium resources and is also the world's fourth largest copper mine. Xstrata's core products are copper, coking coal, thermal coal, ferrochrome, vanadium and zinc. It also has growing businesses in gold, lead and silver.", "hermes3:3b": "WMC Resources deems Xstrata takeover bid 30% lower than offered price, increasing pressure on Xstrata to raise offer amount within 1-2 weeks.", "stablelm-zephyr:3b": "Australian mining firm WMC Resources stated that a hostile $7.4 billion bid by rival Xstrata is worth up to 30% more. Analysts expect a potential rival bid to emerge within one to two weeks as WMC's defense documents value its shares at A$7.17 to A$8.24, against Xstrata's offer of A$6.35 per share. WMC's chairman believes rejecting the offer is in shareholders' best interest and that the company will pursue \"value-creating options.\" Meanwhile, Xstrata maintains its core products are copper, coking coal, thermal coal, ferrochrome, vanadium, and zinc, with growing businesses in gold, lead, and silver.", "chatgpt-4o-latest": "WMC Resources has rejected Xstrata's A$7.4bn hostile takeover bid, claiming it undervalues the company by up to 30%. A report by Grant Samuel values WMC shares higher than Xstrata's offer, increasing pressure on Xstrata to raise its bid and potentially attracting rival offers. WMC's board urges shareholders to reject the bid, arguing it benefits Xstrata rather than WMC investors. Xstrata remains skeptical of Grant Samuel's valuation. Australia's competition watchdog has not opposed the takeover. WMC, a major producer of nickel, copper, and uranium, owns the Olympic Dam mine, which holds a significant portion of the world's uranium resources. Xstrata, a global mining firm, has extensive operations in multiple countries and a diverse portfolio of commodities.", "stablelm2:1.6b": "Australian firm WMC Resources has said its shares are worth up to A$8 ($7.4bn) more than the hostile $5.8bn ($3bn) bid by rival Xstrata for the company. With Swiss- based Xstrata now under pressure to increase its offer, analysts have suggested that WMC's documents may lead to a rival bid or an increased offer from Xstrata. Last month, Australia's competition watchdog approved the purchase of WMC by Xstrata without opposing it. However, WMC chairman Tommie Bergman said on Tuesday that the company believed rejecting the offer was in shareholders' best interest.", "granite3.1-dense:2b": "Australian mining firm WMC Resources has rejected a 7.4 billion Australian dollar bid from Xstrata, asserting its worth could be up to 30% higher at A$7.17 to A$8.24 per share, according to an analysis by investment firm Grant Samuel. This valuation has put pressure on Xstrata to raise its offer or risk a rival bid within the next week to two weeks. WMC's executives remain skeptical of Grant Samuel's assumptions but intend to review the information. In 2003, Xstrata acquired MIM Holdings, making it the largest copper miner in Australia. WMC is the world's third-largest nickel producer and also mines copper and uranium. Its Olympic Dam mine holds one-third of the world's known uranium resources and is a significant copper mine. Xstrata, a global mining giant with operations in various countries, specializes in copper, coking coal, thermal coal, ferrochrome, vanadium, zinc, gold, lead, and silver. The Australian competition watchdog previously approved the transaction.", "reference": "Grant Samuel said its valuation of WMC was based on lower average prices for nickel, copper and uranium than current market levels.Last month Australia's competition watchdog said it would not oppose the purchase of WMC by Zurich and London-based Xstrata.He said the valuation would put increased pressure on Xstrata to look at \"sweetening\" its offer.WMC Resources is the world's third-largest producer of concentrated nickel, and also a miner of copper and uranium.Australian mining firm WMC Resources has said it is worth up to 30% more than a hostile 7.4bn Australian dollar ($5.8bn; £3bn) bid by rival Xstrata.Analysts said the defence documents provided more details on WMC, and may trigger a possible rival bid.On Tuesday, WMC chairman Tommie Bergman said in a statement the directors believed it was in shareholders' best interest to reject the offer.He said WMC would pursue \"value-creating options\" provided by a portfolio of \"world class assets\"."}