{"raw_text": "Madagascar completes currency switch\n \n Madagascar has completed the replacement of its Malagasy franc with a new currency, the ariary.\n \n From Monday, all prices and contracts will have to be quoted in the ariary, which was trading at 1,893 to the US dollar. The Malagasy franc, which lost almost half its value in 2004, is no longer legal tender but will remain exchangeable at banks until 2009. The phasing out of the franc, begun in July 2003, was intended to distance the country from its past under French colonial rule and address the problem of the large amount of counterfeit francs in circulation. \"It's above all a question of sovereignty,\" Reuters quoted a central bank official as saying. \"It is symbolic of our independence from the old colonial ways. Since we left the French monetary zone in 1973 we should have our own currency with its own name.\" The ariary was the name of a pre-colonial currency in the Indian Ocean island state.\n", "llama3.2:1b": "Madagascar has completed the replacement of its Malagasy franc with a new currency, the ariary, and will now quote prices and contracts in it from Monday. The ariary replaced the franc after 2004, when the latter lost almost half its value and is no longer legal tender. Madagascar is transitioning away from its past under French colonial rule and has adopted an independent economy with its own currency since leaving the French monetary zone in 1973.", "llama3.2:3b": "Madagascar has completed the replacement of its Malagasy franc with the ariary, trading at 1,893 to the US dollar. The old franc is no longer legal tender but will remain exchangeable until 2009.", "gemma2:2b": "Madagascar has switched its currency to the ariary, replacing the Malagasy franc.  The new currency will be used for all pricing and contracts starting Monday. The Malagasy franc is being phased out until 2009 with limited exchangeability at banks. \n", "qwen2.5:0.5b": "Madagascar completed the replacement of the Malagasy franc with the ariary on Monday, trading at 1,893 to the US dollar. This new currency has replaced the Malagasy franc as legal tender and remains exchangeable at banks until 2009. The transition began in July 2003 but was intended to address the problem of counterfeit francs and distance Madagascar from colonial influences.\n\nKey points:\n- Madagascar completed the currency switch\n- Ariary replaced Malagasy franc as legal tender\n- It remains exchangeable at banks until 2009\n- The transition began in July 2003, but aimed to address colonial influences", "qwen2.5:1.5b": "Madagascar completes transition to new currency, replacing Malagasy franc with ariary from Monday; prices and contracts will be quoted only in the ariary at 1,893 to US dollar; the old franc will remain exchangeable until 2009, aimed at national independence and addressing counterfeit issues.", "qwen2.5:3b": "Madagascar has completed replacing its Malagasy franc with the ariary, now trading at 1,893 to the US dollar. The new currency aims to distance Madagascar from French colonial rule and address counterfeit issues. Introduced in 2003, it replaced the obsolete franc which was no longer legal tender but could be exchanged until 2009. The ariary, named after pre-colonial currency, symbolizes independence from past colonial influences.", "opencoder:1.5b": "Madagascar completes currency switch.\n\nMadagascar has completed the replacement of its Malagasy franc with a new currency, the ariary. From Monday, all prices and contracts will have to be quoted in the ariary, which was trading at 1,893 to the US dollar. The Malagasy franc, which lost almost half its value in 2004, is no longer legal tender but will remain exchangeable at banks until 2009. The phasing out of the franc, begun in July 2003, was intended to distance the country from its past under French colonial rule and address the problem of the large amount of counterfeit francs in circulation. \"It's above all a question of sovereignty,\" Reuters quoted a central bank official as saying.\n", "smollm:1.7b": "Madagascar has completed the replacement of its Malagasy franc with a new currency, the Ariary. From Monday, all prices and contracts will have to be quoted in the Ariary, which was trading at 1,893 to the US dollar. The Malagasy franc, which lost almost half its value in 2004, is no longer legal tender but will remain exchangeable at banks until 2009. The phasing out of the franc, begun in July 2003, was intended to distance the country from its past under French colonial rule and address the problem of the large amount of counterfeit francs in circulation. \"It's above all a question of sovereignty,\" Reuters quoted a central bank official as saying. \"It is symbolic of our independence from the old colonial ways. Since we left the French monetary zone in 1973 we should have our own currency with its own name.\" The Ariary was the name of a pre-colonial currency in the Indian Ocean island state.", "deepseek-r1:1.5b": "<think>\nAlright, let's tackle this query. The user has provided a text about Madagascar switching to the ariary as their main currency. They want a concise summary that includes key ideas and details.\n\nFirst, I need to identify the main points. Madagascar completed the currency switch from the Malagasy franc to the ariary. It was done starting in 2005. The ariary trades at 1,893 against the US dollar. The monetary authority phased out the franc in July 2003, which had been part of French colonial rule.\n\nI should make sure not to include any explanations or additional information beyond what's necessary. The output needs to be plain text without any markdown or reasoning.\n\nLet me structure this. Start with Madagascar completing the switch, mention the dates, price of the new currency, and the intent behind the change. Also, note the phasing out of the old currency and its symbolic meaning.\n\nI need to ensure clarity and conciseness while capturing all important details. Double-checking the key terms like \" Ariary,\" \"phasing out,\" and \"symbolic independence\" will help in delivering an accurate summary.\n</think>\n\nMadagascar completed the currency switch from the Malagasy franc to the ariary on January 1, 2005, with the new ariary trading at 1,893 against the US dollar. The phasing out of the franc was intended to reflect independence from French colonial influences and address counterfeit circulation.", "tinyllama:1.1b": "Madagascar completes currency switch, replacing the Malagasy franc with the aria ry. From Monday, prices and contracts will have to be quoted in the aria ry, which traded at 1,893 to the US dollar as of July 2004 but is no longer legal tender. The phasing out of the franc began in 2003 as a way to distance the country from its colonial past and address the issue of the large number of counterfeit franc coins in circulation. Madagascar's central bank official stated that it was a symbolic step toward independence from the Frecnh monetary system, which left the country under French control since 1973.", "tinydolphin:1.1b": " Madagascar has completed the transition from the Malagasy franc to the ariary, an updated version of the country's currency designed to maintain sovereignty and independence from French colonial rule. The switch began on July 1st, 2003, with the introduction of the ariary as the new legal tender. This change in currency has been made due to concerns over the large amount of counterfeit francs in circulation, as well as an aim to distance the country from its past under French colonial rule. It's expected that by the end of 2009, all prices and contracts will have to be quoted in the new currency, and the Malagasy franc will continue to trade at a rate of one-third to the US dollar. The transition was intended to demonstrate Madagascar's independence from France and address the issue of counterfeit dollars, which had plagued the country for decades.", "phi:2.7b": " Madagascar has completed the replacement of its Malagasy franc with a new currency, the ariary, effective from Monday. All prices and contracts must now be quoted in the ariary. Although the Franc is no longer legal tender, it will remain exchangeable at banks until 2009. The phasing out of the Franc was intended to distance Madagascar from its past under French colonial rule, and address the problem of counterfeit francs in circulation.\n", "orca-mini:3b": " Madagascar completed the switch to a new currency, the ariary, on Monday, July 15, 2008. The Malagasy franc, which lost almost half its value in 2004, is no longer legal tender but will remain exchangeable at banks until 2009. The move was intended to strengthen Madagascar's economy and address the problem of counterfeit francs in circulation. The ariary was the name of a pre-colonial currency in the Indian Ocean island state.", "hermes3:3b": "Madonia changes currency to ariary, replacing Malagasy franc; last legal tender until 2009.", "stablelm-zephyr:3b": "Madagascar replaces Malagasy franc with ariary, starting at 1,893 to USD. Phasing out the franc began in July 2003 to distance from French colonial past and address counterfeit issues. Aritely was pre-colonial currency revived for new currency.", "chatgpt-4o-latest": "Madagascar has completed its transition from the Malagasy franc to the ariary, which is now the official currency. As of Monday, all prices and contracts must be in ariary, which was trading at 1,893 to the US dollar. The Malagasy franc, which lost nearly half its value in 2004, is no longer legal tender but can be exchanged at banks until 2009. The switch, initiated in 2003, aimed to break from French colonial influence and combat counterfeit currency. A central bank official emphasized that the change symbolizes Madagascar's sovereignty, as the country left the French monetary zone in 1973. The ariary was historically a pre-colonial currency in Madagascar.", "stablelm2:1.6b": "Madagascar completes transition to new currency, dropping Malagasy franc after losing almost half its value. Prices and contracts will now be quoted in ariary (previously known as \"Madagascy franc\"), which trades at 1:1 with US dollar, having lost much of its value since July 3, 2014. The phasing out of the franc symbolizes independence from past colonial influence and combating counterfeit francs in circulation.", "granite3.1-dense:2b": "Madagascar officially transitioned from the Malagasy franc to the ariary on Monday, making it the new legal tender for all prices and contracts. The ariary traded at 1,893 to the US dollar upon adoption. This change aims to sever Madagascar's colonial ties with France and combat widespread counterfeit francs. The Malagasy franc, which depreciated nearly half its value in 2004, remains exchangeable at banks until 2009 but is no longer legal tender. The shift signifies Madagascar's sovereignty and independence from French monetary influence since 1973. The ariary name echoes a pre-colonial currency in the country.", "reference": "Madagascar has completed the replacement of its Malagasy franc with a new currency, the ariary.The ariary was the name of a pre-colonial currency in the Indian Ocean island state.The phasing out of the franc, begun in July 2003, was intended to distance the country from its past under French colonial rule and address the problem of the large amount of counterfeit francs in circulation.From Monday, all prices and contracts will have to be quoted in the ariary, which was trading at 1,893 to the US dollar."}