{"raw_text": "Ban on forced retirement under 65\n \n Employers will no longer be able to force workers to retire before 65, unless they can justify it.\n \n The government has announced that firms will be barred from 2006 from imposing arbitrary retirement ages. Under new European age discrimination rules, a default retirement age of 65 will be introduced. Workers will be permitted to request staying on beyond this compulsory retirement age, although employers will have the right to refuse. Trade and Industry Secretary Patricia Hewitt said people would not be forced to work longer than they wanted, saying the default age was not a statutory, compulsory retirement age. She said employers would be free to continue employing people for as long as they were competent.\n \n Under age discrimination proposals from the Department of Trade and Industry last year workers were to be allowed to work on till 70 if they wished.\n \n Business leaders had opposed the plan as they said it would be too costly and cumbersome. The British Chambers of Commerce welcomed the latest proposal. \"This move today is the best of both worlds,\" it said. \"Employers have the ability to define the end point of the employer-employee relationship and employees have flexibility with a right to request to work past the age of 65.\" But Age Concern said imposing a retirement age of 65 was \"cowardly\" and a \"complete u-turn\". \"This makes a mockery of the Government's so-called commitment to outlawing ageism, leaving the incoming age discrimination law to unravel,\" said Gordon Lishman, director general of Age Concern England . \"It is now inevitable that older people will mount legal challenges to the decision using European law.\" The decision will have no impact on the age at which workers can collect their state pension, the government has said.\n", "llama3.2:1b": "Employers will be barred from forcing employees to retire before 65 unless they can justify it, and a default retirement age of 65 is being introduced under new European age discrimination rules. Workers are permitted to request staying on past this age, but employers have the right to refuse. The proposal allows for flexibility in defining the end point of the employer-employee relationship.", "llama3.2:3b": "Employers can no longer force workers to retire before 65 unless justified. A default retirement age of 65 is introduced in 2006, allowing workers to request to stay beyond this age. Employers may refuse, but must consider competence. Business leaders approve, while Age Concern says it's \"cowardly\" and will lead to legal challenges.", "gemma2:2b": "Employers cannot force retirement before 65, unless they have a valid justification. A default retirement age of 65 is being implemented. Workers can request to work past this age, but employers can refuse. This change updates earlier proposals that allowed workers to work until 70 if they wished.  Some business groups welcome the new policy, while others criticize it as undermining efforts against age discrimination. Age Concern and other groups plan to challenge this move using European law. \n", "qwen2.5:0.5b": "Employers are prohibited from imposing a mandatory retirement age of 65 for older workers under the age of 65 in Britain and Europe. Under this new system, if an employer decides to work on beyond the compulsory retirement age, it will have to accept that fact and not seek to force employees to leave their jobs. Workers can still request staying at the pre-retirement age, although they might be subject to the employer's right to refuse. Trade and Industry Secretary Patricia Hewitt emphasized this as a better deal for workers than the old compulsory retirement age of 65. Business leaders opposed the plan due to its potential cost and complexity, while Age Concern criticized it as \"cowardly\" and an \"unfashionable solution\". It's now unclear whether older people will have recourse to legal action against employers in England and Wales under European law, which they say is a complete break with ageism.", "qwen2.5:1.5b": "Employers cannot force employees to retire before 65 under new EU guidelines and default rules. Workers may request to stay longer than this age limit without penalty but must justify it; firms can refuse unless they provide a valid reason. Age discrimination proposals allow workers to continue working until 70, pending government approval. This update aims to balance flexibility with practical considerations while maintaining the state pension age at 65 and protecting older workers from legal challenges under EU law.", "qwen2.5:3b": "Ban on forced retirement under 65 under way in UK; firms barred from imposing arbitrary retirement ages before 65. Default retirement age of 65 with employers having right to refuse beyond this age if deemed competent. Proposal welcomed by business but criticized as \"cowardly\" and a \"complete u-turn\" by Age Concern, potentially leading to legal challenges under EU law. Decision will not affect state pension eligibility age.", "opencoder:1.5b": "Employers will no longer be able to force workers to retire before 65, unless they can justify it. Workers are permitted to request staying on beyond this compulsory retirement age, although employers will have the right to refuse. Trade and Industry Secretary Patricia Hewitt said people would not be forced to work longer than they wanted, saying the default age was not a statutory, compulsory retirement age. She mentioned that employers would continue to serve as long as they were competent under new European rules. Business leaders had opposed the proposal, insisting it was too costly and cumbersome.\n", "smollm:1.7b": "The summary should be:\nBan on forced retirement under 65\nEmployers will no longer be able to force workers to retire before 65, unless they can justify it.\nThe government has announced that firms will be barred from 2006 from imposing arbitrary retirement ages. Under new European age discrimination rules, a default retirement age of 65 will be introduced. Workers will be permitted to request staying on beyond this compulsory retirement age, although employers will have the right to refuse. Trade and Industry Secretary Patricia Hewitt said people would not be forced to work longer than they wanted, saying the default age was not a statutory, compulsory retirement age. She said employers would be free to continue employing people for as long as they were competent.\nThe government has announced that workers will not be forced to retire before 65 unless they can justify it. The government has introduced new European age discrimination rules, which allow firms to refuse to employ people over the age of 65 if they are incompetent or unfit to work. Under these rules, a default retirement age of 65 will be introduced. Workers will be permitted to request staying on beyond this compulsory retirement age, although employers will have the right to refuse. Trade and Industry Secretary Patricia Hewitt said people would not be forced to work longer than they wanted, saying the default age was not a statutory, compulsory retirement age. She said employers would be free to continue employing people for as long as they were competent.\nThe British Chambers of Commerce welcomed the latest proposal from the Department of Trade and Industry last year, which allowed workers to work on till 70 if they wished. The British Chambers of Commerce welcomed the latest proposal. \"This move today is the best of both worlds,\" it said. \"Employers have the ability to define the end point of the employer-employee relationship and employees have flexibility with a right to request to work past the age of 65.\" But Age Concern said imposing a retirement age of 65 was \"cowardly\" and a \"complete u-turn\". \"This makes a mockery of the Government's so-called commitment to outlawing ageism, leaving the incoming age discrimination law to unravel,\" said Gordon Lishman, director general of Age Concern England . \"It is now inevitable that older people will mount legal challenges to the decision using European law.\" The decision will have no impact on the age at which workers can collect their state pension, the government has said.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text concisely while preserving the key ideas and details.\n\nFirst, the main points are about forcing retirement under 65 being abolished. Employers won't force people to retire before that unless justified. The government is removing a restriction on setting an age for forced retirement, introducing a default of 65 with possible job Extension. Trade Secretary Patricia Hewitt said this isn't a statutory requirement but allows workers to work longer.\n\nEarlier, from Trade and Industry last year, some workers were allowed until 70. Business leaders opposed it due to cost and complexity. The British Chamber of Commerce liked the new plan, emphasizing flexibility for employees over 65.\n\nAge Concern and others criticize 65 as a cowardly age and see it as a u-turn. They argue this will harm the government's efforts against ageism. The decision won't affect pension ages but might push older people to work longer.\n\nI should combine these points, focusing on the removal of forced retirement, default age, trade Secretary's stance, opposition from business leaders, criticism by Age Concern, and the impact on pensions.\n</think>\n\nThe government has removed a restriction on forcing workers under 65 to retire. Employers now cannot force anyone to retire before 65 unless justified. The new rule introduces a default retirement age of 65 with job Extension, allowing longer employment. Trade Secretary Patricia Hewitt noted this isn't a statutory requirement but provides flexibility for employees over 65. Employees could work until 70 last year, while the government's stance remains unchanged on pension ages. Age Concern and others criticize 65 as Cowardly, calling it a \"u-turn,\" arguing it complicates efforts to combat ageism.", "tinyllama:1.1b": "The British government has announced a new age discrimination policy, which bans employers from forcing workers above the default retirement age of 65. This move is based on new European age discrimination rules, and comes after business leaders had opposed the proposal in the past. Under this new policy, workers will be allowed to request staying on beyond their compulsory retirement age of 65 if they choose to do so, but employers will have the right to refuse. Employees will also have the right to work until their competence is exhausted, while business leaders welcome the latest proposal as a \"best of both worlds\". The decision will not impact on workers' ability to collect their state pension.", "tinydolphin:1.1b": " Employers in the UK will be prohibited from forcing workers to retire before the age of 65 under new government proposals announced this week. Under the proposed legislation, employers will have the right to set a compulsory retirement age for their employees, but workers will have the choice to stay active longer than they desire. This move is intended to address concerns about the potential impact on productivity and competitiveness of businesses that have been forced to rely on older workers. Business leaders had opposed this proposal in the past, with some fearing it would lead to a significant reduction in staff numbers. However, the UK Department of Trade and Industry has now announced that employees will no longer be required to retire before the age of 65, unless they can justify their request for continued employment. This move is seen as an important step towards addressing the issue of age discrimination in the workplace.", "phi:2.7b": " A new European directive has introduced a default retirement age of 65 for employers to follow, but employees can request to work past this age unless there are justifiable reasons. This move is seen as a balance between employee and employer needs, with trade groups supporting it while Age Concern criticizes it for undermining the government's commitment to fight against ageism.\n", "orca-mini:3b": " The government has announced a ban on forced retirement before 65, unless employers can justify it. This change comes under new European age discrimination rules, and workers will be permitted to request staying on beyond the default retirement age of 65, although employers will have the right to refuse. Business leaders opposed the plan as it would be too costly and cumbersome. The British Chambers of Commerce welcomed the latest proposal. Age Concern criticized the decision to impose a retirement age of 65 as \"cowardly\" and a \"complete u-turn\". Older people will mount legal challenges to the decision using European law. The change has no impact on the age at which workers can collect their state pension.", "hermes3:3b": "Ban on forced retirement before 65 introduced; employees allowed to work past 65 but employers can refuse if competent, default age is 65.", "stablelm-zephyr:3b": "The government has prohibited employers from imposing arbitrary retirement ages below 65, with the option for workers to request staying on beyond this compulsory retirement age, subject to employer refusal. This decision follows new European age discrimination rules and is in contrast to previous proposals allowing employees to work till 70 if they wished. While business leaders welcomed this flexibility, Age Concern criticized it as a \"cowardly\" turnaround and anticipates legal challenges using European law. The decision doesn't impact the state pension collection age.", "chatgpt-4o-latest": "Employers will be banned from forcing workers to retire before 65 unless justified, under new European age discrimination rules effective from 2006. A default retirement age of 65 will be introduced, but employees can request to work beyond this, though employers can refuse. Trade and Industry Secretary Patricia Hewitt emphasized that the default age is not compulsory, allowing competent employees to continue working. Business leaders, initially opposing a higher retirement age, welcomed the compromise, while Age Concern criticized it as a reversal of the government's commitment to ending age discrimination. Legal challenges under European law are expected. The decision does not affect the state pension age.", "stablelm2:1.6b": "Employers cannot force employees to retire before the default retirement age of 65 unless they provide a justifiable reason for doing so under new European age discrimination rules. Workers can request staying beyond this compulsory retirement age, and employers can refuse if they choose. The British Chambers of Commerce supports the move, while Age Concern is opposed as it considers imposing a retirement age of 65 as \"cowardly\" and contradictory to the government's commitment against ageism. This decision will not affect the state pension eligibility for workers.", "granite3.1-dense:2b": "In 2006, the UK government implemented a new rule prohibiting employers from forcing employees to retire before age 65, unless specific justifications exist. This move aligns with European age discrimination laws and allows workers to request extended work beyond the default age of 65, subject to employer approval. Initially, business leaders opposed a proposed plan extending work until 70 due to perceived costs. The British Chambers of Commerce supports this latest proposal, viewing it as a balance between employer and employee rights. However, Age Concern criticizes the decision as \"cowardly\" and undermines the government's commitment against ageism, predicting legal challenges based on European law. Notably, this change does not affect workers' state pension eligibility.", "reference": "Trade and Industry Secretary Patricia Hewitt said people would not be forced to work longer than they wanted, saying the default age was not a statutory, compulsory retirement age.But Age Concern said imposing a retirement age of 65 was \"cowardly\" and a \"complete u-turn\".Under new European age discrimination rules, a default retirement age of 65 will be introduced.The decision will have no impact on the age at which workers can collect their state pension, the government has said.\"This makes a mockery of the Government's so-called commitment to outlawing ageism, leaving the incoming age discrimination law to unravel,\" said Gordon Lishman, director general of Age Concern England .Under age discrimination proposals from the Department of Trade and Industry last year workers were to be allowed to work on till 70 if they wished."}