{"raw_text": "Egypt to sell off state-owned bank\n \n The Egyptian government is reportedly planning to privatise one of the country's big public banks.\n \n An Investment Ministry official has told the Reuters news agency that the Bank of Alexandria will be sold sometime in 2005. The move is seen as evidence of a new commitment by the government to reduce the size of public sector. The official said the government has not yet decided whether the sale will take the form of a public flotation. \"The most important thing to decide now is the method - whether by selling shares to the public or to a strategic investor from abroad,\" he said.\n \n Analysts say the public-sector banks have suited the government's monetary, credit and exchange policies. Nevertheless, the Egyptian government has spoken for years about privatising one of the big four state banks - Banque Misr, National Bank of Egypt, Banque du Caire and Bank of Alexandria. It had been expected one of the smallest of the four big public banks - Bank of Alexandria or Banque du Caire - would be sold first. The announcement reinforces the hopes of investors and international financial bodies for a revival of Egypt's privatisation programme. About 190 state-run companies and facilities were sold off from the early 1990s to 1997. The appointment of Mahmoud Mohieldin, a reform-minded technocrat, to the new post of investment minister in July was taken as a sign that more sell-offs were on the way. Both the IMF and World Bank have urged Egypt to remove obstacles to the development of the private sector which they say has a vital role to play in reducing poverty by expanding the economy.\n", "llama3.2:1b": "The Egyptian government is planning to privatise one of its state-owned banks, Bank of Alexandria, with plans to sell it sometime in 2005 through either public flotation or investment from abroad. The move aims to reduce the size of the public sector and has been expected since a previous plan was announced two years ago. Analysts see this as part of Egypt's broader efforts to revive its privatisation programme.", "llama3.2:3b": "Egypt plans to privatize the Bank of Alexandria, one of its state-owned banks, with a potential sale in 2005. The move is part of the government's effort to reduce the size of the public sector and follows years of discussions about privatising one of the country's big four state banks.", "gemma2:2b": "The Egyptian government plans to privatize the Bank of Alexandria sometime in 2005. The move is expected to reduce the size of the public sector and boost the privatization program. Analysts expect the sale to be in either a public offering or an agreement with a foreign strategic investor. This decision supports hopes for revived privatization efforts.  The Egyptian government has been working towards this goal since the early 1990s, after selling off 190 state-run companies and facilities from that time. \n", "qwen2.5:0.5b": "Egypt plans to privatize one of its big public banks, likely Banque du Caire or Bank of Alexandria. Analysts believe this move will bolster Egypt's privatisation program and create more jobs. Despite initial expectations that Banque du Caire would be sold first, the government is expected to pursue a strategy involving both private and public companies for the future.", "qwen2.5:1.5b": "The Egyptian government plans to privatize the Bank of Alexandria sometime in 2005, despite repeated promises to sell off one of its four state-owned banks. The move is seen as part of efforts to reduce the size of public sector and revive Egypt's privatisation program. Analysts see it as a sign that more sell-offs are on the horizon.", "qwen2.5:3b": "Egyptian government plans to privatise state-owned Bank of Alexandria, seen as part of commitment to reduce public sector. The move is expected after years of discussing privatisation with four big banks. Analysts view it as encouraging for Egypt's privatisation programme following sell-offs in 1990s and recent changes like appointing Mahmoud Mohieldin as investment minister. Both IMF and World Bank support development of private sector to reduce poverty.", "opencoder:1.5b": "Egyptian government is planning to privatise one of the country's big public banks, an Investment Ministry official says that the Bank of Alexandria will be sold in 2005. The move reflects a new commitment by the government on reducing public sector. The official also notes that the government has not yet decided whether the sale will take the form of a public flotation. The most important decision now is the method - whether it's selling shares to the public or to an international investor. The analysts point out the public-sector banks have followed the government's monetary, credit and exchange policies, but the Egyptian government has been speaking for years about privatizing one of the biggest banks and its announcement reinforces investors' anticipation and potentials of a revival in Egypt's privatisation programme.\n", "smollm:1.7b": "The Egyptian government is reportedly planning to privatise one of its big public banks, with an investment minister saying the sale will take place sometime in 2005. The move is seen as evidence of a new commitment by the government to reduce the size of the public sector and increase economic efficiency. Analysts say that the Egyptian government has spoken for years about privatising one of its big state banks, but it had been expected one of the smallest of the four big public banks - Bank of Alexandria or Banque du Caire - would be sold first. The announcement reinforces the hopes of investors and international financial bodies for a revival of Egypt's privatization programme. About 190 state-run companies and facilities were sold off from the early 1990s to 1997, but the appointment of Mahmoud Mohieldin, a reform-minded technocrat, to the new post of investment minister in July was taken as a sign that more sell-offs are on the way. Both the IMF and World Bank have urged Egypt to remove obstacles to the development of the private sector which they say has a vital role to play in reducing poverty by expanding the economy.", "deepseek-r1:1.5b": "<think>\nAlright, I need to help the user summarize this text about Egypt selling their state-owned bank. The user provided specific instructions: only plain text with key ideas and details, no explanations or formatting.\n\nFirst, I'll read through the original text carefully. It mentions that the Egyptian government is considering privatizing one of their large public banks. There's an official from the Investment Ministry saying that the Bank of Alexandria will be sold in 2005. The government hasn't yet decided on the sale method—whether it's a public float or a strategic sale.\n\nI should note that analysts agree that these public banks fit the government's monetary and credit policies but are not privatised yet. They've talked about this for years, especially focusing on one of the smallest banks—the Bank of Alexandria and Banque du Caire. The government has been eyeing this move since 1985 and is still deciding.\n\nThe announcement by Mahmoud Mohieldin in July was a sign that more sell-offs are coming. Additionally, both the IMF and World Bank are pushing for better support for the private sector to reduce poverty and boost the economy.\n\nI need to make sure I include all these key points without adding extra information. The summary should be concise, capturing each important aspect: the decision, the government's approach, past actions, current plans, and the international backing.\n</think>\n\nEgyptian government is considering privatizing one of its state-owned banks, with the Bank of Alexandria to be sold in 2005. The government has not yet decided on the sale method but is committed to reducing public sector size. Analysts agree that these banks fit the government's policies but have been largely unpriced since 1985. Mahmoud Mohieldin's appointment in July signals more sell-offs. Both IMF and World Bank are pushing for private-sector support.", "tinyllama:1.1b": "Egypt is planning to sell off one of its big public banks, according to an official report from the Reuters news agency. The government is reportedly set to privatize Bank of Alexandria sometime during 2005, with an option for strategic investors like foreign firms to participate. Analysts say Egypt's monetary, credit, and trade policies have resulted in the government selling off several big state banks over the years, but it has yet to announce a deal for Bank of Alexandria. The privatization of this public bank is seen as an important step towards reducing the size of the Egyptian public sector and promoting private sector growth. Investors and international financial bodies have welcomed the government's plans for reviving its privatisations program, which was halted in 1997 due to concerns about bureaucracy and corruption. The appointment of Mahmood Mohieldin as investment minister in July was seen as a signal that more sales were on the way.", "tinydolphin:1.1b": " Egypt is considering selling off one of its big public banks, the Bank of Alexandria, according to an official at the Investment Ministry. The move is seen as a way for the government to reduce the size of the public sector and open new investment opportunities. Analysts believe that privatizing one of the bigger state-owned banks could pave the way for further reforms in Egypt's privatization program. This announcement comes after years of discussions about selling off smaller banks, but the timing may be coincidental as Egypt has not yet decided whether to sell shares or take on a strategic investor for its public-sector banks. Investors and international financial bodies have been waiting with bated breath for the government's decision.", "phi:2.7b": " The Egyptian government plans to privatize one of its big public banks, Bank of Alexandria, in 2005. The move is part of the government's effort to reduce the size of the public sector and encourage the growth of the private sector. The bank will be sold either through a public flotation or by selling shares to foreign investors. This decision has been welcomed by investors and international financial bodies who have called for more sell-offs in Egypt.\n", "orca-mini:3b": " Egypt plans to privatize one of the country's big public banks, the Bank of Alexandria, sometime in 2005. The move is seen as evidence of a new commitment by the government to reduce the size of the public sector. Analysts expect the sale of one of the smaller state banks, Banque du Caire or Bank of Alexandria, first. The announcement reinforces expectations among investors and international financial bodies for a revival of Egypt's privatization programme.", "hermes3:3b": "Egypt to privatise state-owned bank Bank of Alexandria", "stablelm-zephyr:3b": "The Egyptian government plans to privatize one of the country's major public banks,Bank of Alexandria, in 2005. This move aims to reduce the size of the public sector. The method of sale has not been decided, potentially involving a strategic investor or a public flotation. Analysts believe that public-sector banks have suited the government's monetary and credit policies. Egypt had previously sold around 190 state-run companies between the early 1990s and 1997. The appointment of reform-minded investment minister Mahmoud Mohieldin in July signals more sell-offs are likely. International financial bodies, such as the IMF and World Bank, encourage Egypt to remove obstacles and develop its private sector for economic growth and poverty reduction.", "chatgpt-4o-latest": "The Egyptian government plans to privatize the Bank of Alexandria in 2005 as part of efforts to reduce the public sector. Officials have not yet decided whether the sale will be through public flotation or to a foreign strategic investor. Analysts note that public-sector banks have supported government policies, but Egypt has long considered privatizing one of its four major state banks. The move signals a revival of Egypt’s privatization program, which saw 190 state-run companies sold between the early 1990s and 1997. The appointment of reformist Investment Minister Mahmoud Mohieldin suggests further sell-offs. The IMF and World Bank support privatization, arguing it will boost the private sector and help reduce poverty.", "stablelm2:1.6b": "The Egyptian government plans to sell the state-owned Bank of Alexandria, with no decision yet made on whether it will be sold publicly or through a strategic investor. This move is seen as evidence of Egypt's commitment to reduce public sector size and follows years of discussions about privatizing one of the big four public banks: Banque Misr, National Bank of Egypt, Banque du Caire, and Bank of Alexandria. Analysts believe that these banks have suited the government's monetary, credit, and exchange policies. Both the IMF and World Bank encourage Egypt to remove obstacles for the development of the private sector in order to reduce poverty and expand the economy.", "granite3.1-dense:2b": "Egypt's government intends to privatise its state-owned Bank of Alexandria, as reported by an Investment Ministry official to Reuters. The decision, expected in 2005, signifies a renewed commitment to shrink the public sector. The method for the sale—public flotation or direct purchase by foreign investors—remains undecided. This move aligns with the government's long-standing intention to privatise one of Egypt's major state banks among Banque Misr, National Bank of Egypt, Banque du Caire, and Bank of Alexandria. The announcement boosts investor optimism regarding the revival of Egypt's privatisation efforts, following previous sales of around 190 state-run companies from the early 1990s to 1997. Mahmoud Mohieldin's appointment as investment minister in July further indicates forthcoming sell-offs. The International Monetary Fund and World Bank emphasize the importance of a robust private sector for poverty reduction through economic expansion.", "reference": "It had been expected one of the smallest of the four big public banks - Bank of Alexandria or Banque du Caire - would be sold first.Nevertheless, the Egyptian government has spoken for years about privatising one of the big four state banks - Banque Misr, National Bank of Egypt, Banque du Caire and Bank of Alexandria.An Investment Ministry official has told the Reuters news agency that the Bank of Alexandria will be sold sometime in 2005.The official said the government has not yet decided whether the sale will take the form of a public flotation.The Egyptian government is reportedly planning to privatise one of the country's big public banks."}