{"raw_text": "US Airways staff agree to pay cut\n \n A union representing 5,200 flight attendants at bankrupt US Airways have agreed to a new contract that cuts pay by nearly 10%.\n \n The deal will help the carrier, trying to survive by cutting costs by nearly $1bn (£530m) a year, save about $94m. More than two thirds of its 28,000 staff have now accepted wage cuts. But talks are still continuing with a union representing mechanics, baggage handlers and cleaners, which has so far failed to negotiate a new contract. The seventh largest carrier in the US sought bankruptcy protection for a second time in two years last September. It had been one of the quickest to deal with difficulties faced by the aviation industry after the 9/11 attacks in 2001. But it emerged from Chapter 11 bankruptcy in March 2003 to face competition from low-cost carriers and higher fuel costs. US Airways management has said it may need to start liquidating assets if it does not receive concessions from all staff by the middle of this month.\n", "llama3.2:1b": "US Airways staff agree to pay cut due to bankrupt status, which will help save about $94m and reduce wage cuts for approximately two-thirds of its 28,000 staff by nearly 10%. Talks are ongoing with unions representing mechanics, baggage handlers, and cleaners.", "llama3.2:3b": "US Airways' flight attendants agree to a new contract that cuts pay by nearly 10% as part of cost-cutting measures. The deal saves about $94m, with over two thirds of its 28,000 staff accepting wage cuts. US Airways is trying to survive after filing for bankruptcy for the second time in two years and talks continue with a union representing mechanics and cleaners.", "gemma2:2b": "US Airways flight attendant union agreed to a 9.5% pay cut, saving the airline nearly $94 million per year.  The deal applies to nearly 30% of US Airways employees and negotiations are ongoing with other unions representing mechanics, baggage handlers, and cleaners. If concessions aren't received by the middle of the month, US Airways may need to liquidate assets. \n", "qwen2.5:0.5b": "US Airways' flight attendants have agreed to a pay cut, which will help them save about $94 million per year. The union representing mechanics and baggage handlers have also reached an agreement to cut wages by nearly 10%. More than two-thirds of US Airways staff have accepted the new contract terms. However, negotiations with a mechanic's union continue, while others are seeking alternative solutions.", "qwen2.5:1.5b": "US Airways flight attendants agree to wage cuts, saving $94m while carrier seeks $1bn in cost reductions, facing potential bankruptcy; talks continue with union representing mechanics and cleaners.", "qwen2.5:3b": "A union representing 5,200 flight attendants at bankrupt US Airways agreed to a new contract cutting pay by nearly 10%. The deal will save about $94m for the carrier, which has been cutting costs by over $1bn annually. Over two-thirds of its 28,000 staff have accepted wage cuts so far. Talks with unions representing mechanics, baggage handlers, and cleaners are still ongoing. US Airways, now seeking bankruptcy protection again after two years, emerged from Chapter 11 in March 2003 but has struggled due to competition from low-cost carriers and higher fuel costs. If no concessions are received by mid-month, management may need to liquidate assets.", "opencoder:1.5b": "\"US Airways staff agree to pay cut, A union representing 5,200 flight attendants at bankrupt US Airways have agreed to a new contract that cuts pay by nearly 10%. The deal will help the carrier, trying to survive by cutting costs by nearly $1bn (£530m) a year. Save about $94m, More than two thirds of its 28,000 staff have now accepted wage cuts. However, talks are still continuing with a union representing mechanics, baggage handlers and cleaners, which has so far failed to negotiate a new contract. The seventh largest carrier in the US sought bankruptcy protection for a second time in two years last September. It had been one of the quickest to deal with difficulties faced by the aviation industry after the 9/11 attacks in 2001. But it emerged from Chapter 11 bankruptcy in March 2003, to face competition from low-cost carriers and higher fuel costs. US Airways management has said it may need to start liquidating assets if it does not receive concessions from all staff by the middle of this month.\"\n", "smollm:1.7b": "The agreement between US Airways and its employees will lead to a significant reduction in their wages, resulting in a loss of around 94 million dollars per year. This is likely to be one of the largest pay cuts in the airline industry's history. The deal aims to help the carrier save around $1 billion (approximately £530 million) over the next two years by reducing costs and increasing efficiency.\n\nThe agreement will affect nearly 28,000 employees, with more than half of them agreeing to take on a pay cut. This is likely to be one of the largest workforce reductions in US Airways' history. The union representing mechanics, baggage handlers, and cleaners has so far failed to negotiate a new contract, which means that the airline will need to rely on its existing agreement with the union for the next two years.\n\nThe seventh largest carrier in the US sought bankruptcy protection for a second time in two years last September. It had been one of the quickest to deal with difficulties faced by the aviation industry after 9/11 attacks in 2001. But it emerged from Chapter 11 bankruptcy in March 2003 to face competition from low-cost carriers and higher fuel costs. US Airways management has said it may need to start liquidating assets if it does not receive concessions from all employees by the middle of this month.\n\nOverall, the agreement between US Airways and its employees is likely to have a significant impact on the airline industry's finances in the coming years. While the deal will help the carrier save money, it may also lead to job losses and changes in the way the airline operates.", "deepseek-r1:1.5b": "<think>\nOkay, let me try to figure out how to summarize this text concisely while preserving the key ideas. The user provided a detailed passage about US Airways and their union contract agreement.\n\nFirst, I notice that the main points are: a union at 5,200 flight attendants has agreed to a pay cut of nearly 10%. This helps them survive by cutting costs over $1 billion annually, which also saves around $94 million. About two-thirds of their 28,000 staff have accepted the cuts. However, talks with mechanics, baggage handlers, and cleaners haven't resulted in a new contract yet. US Airways is second in bankruptcy, having beenChapter 11 in March 2003, which means they're struggling with debts and facing competition from cheaper airlines and higher fuel costs. Management suspects they might need to liquidate assets if no concessions come.\n\nNow, I need to condense this into a summary without explanations or formatting. The user specified to output only the summary as plain text. So, I'll make sure to capture all these key points succinctly: union's new contract, cost savings, staff acceptance rate, bankruptcy status, current situation in negotiations with other unions.\n\nI should avoid mentioning specific locations like \"flight attendants\" since that might be too detailed and not necessary for a concise summary. Instead, focus on the financial impact, savings, staff acceptances, and ongoing issues with union negotiations and bankruptcy.\n</think>\n\nUS Airways has agreed to a new contract with a union representing 5,200 flight attendants, promising a pay cut of nearly 10%. This plan aims to help the carrier reduce costs by over $1 billion annually while saving approximately $94 million. About two-thirds of its 28,000 employees have accepted the wage cuts. However, discussions with unions representing mechanics, baggage handlers, and cleaners have not yet led to a new contract. US Airways is second in bankruptcy in the U.S., having been Chapter 11 in March 2003, and faces competition from lower-cost airlines while facing higher fuel costs. Management is considering liquidating assets if no concessions are received by the middle of this month.", "tinyllama:1.1b": "US Airways' union staff members have agreed to a new contract that will see wage cuts of nearly 10% in exchange for salary reductions, with over two thirds accepting these changes. The deal is intended to help the bankrupt airline save $94m annually and has already been approved by US Airways management, who are continuing to negotiate with a union representing mechanics, baggage handlers, and cleaner staff. Despite being one of the fastest-to-bankruptcy-reversals in aviation history, US Airways emerged from Chapter 11 bankruptcy in March 2003 to compete with low-cost carriers and higher fuel costs. The company's management has stated that they may need to liquidate assets if they do not receive consensus from all staff by the mid-month.", "tinydolphin:1.1b": " The text given describes an agreement between airline employees and their union regarding wage cuts at US Airways. This suggests that the company is in financial difficulties and has had to make significant adjustments to its business model. However, the reduction in pay is not a significant issue; rather, it highlights the need for cost-cutting measures to save the airline. The talks between both parties are ongoing as they work towards finding a resolution that benefits both parties.", "phi:2.7b": " The union representing 5,200 flight attendants at bankrupt airline US Airways agreed to a new contract that cuts pay by nearly 10%. This deal will help the carrier save about $94 million per year and avoid having to start liquidating assets if it does not receive concessions from all staff by the middle of this month. Talks are still ongoing with other unions representing mechanics, baggage handlers, and cleaners who have yet to negotiate a new contract. The airline sought bankruptcy protection for a second time in two years due to competition from low-cost carriers and higher fuel costs after 9/11 attacks in 2001.\n", "orca-mini:3b": " The US Airways union representing 5,200 flight attendants agreed to a new contract that cut their pay by nearly 10%. Talks are still ongoing with mechanics, baggage handlers, and cleaners, which has failed to negotiate a new contract. The carrier is trying to save $94m by cutting costs by nearly $1bn. It emerged from Chapter 11 bankruptcy in March 2003 and faces competition from low-cost carriers and higher fuel costs. US Airways management may need to start liquidating assets if they do not receive concessions from all staff by the middle of this month.", "hermes3:3b": "US Airways flight attendants agree to pay cut of nearly 10%, saving $94m. 5,200 staff accept reduction; talks with other employees continue.", "stablelm-zephyr:3b": "A union representing 5,200 flight attendants at bankrupt US Airways has agreed to a new contract that cuts pay by nearly 10%. This deal will help the carrier save about $94m a year. More than two-thirds of its 28,000 staff have accepted wage cuts. Talks with other unions, including mechanics, baggage handlers and cleaners, are ongoing. US Airways faced bankruptcy protection twice in two years and may need to start liquidating assets if it doesn't receive concessions from all staff by the middle of this month.", "chatgpt-4o-latest": "US Airways' flight attendants' union agreed to a nearly 10% pay cut, helping the bankrupt airline save about $94 million as part of its $1 billion annual cost-cutting plan. Over two-thirds of its 28,000 employees have accepted wage reductions, but negotiations continue with a union representing mechanics, baggage handlers, and cleaners. The airline, which filed for bankruptcy protection for the second time in two years in September, had previously emerged from Chapter 11 in 2003 but struggled with competition from low-cost carriers and rising fuel costs. Management warned that asset liquidation might be necessary if all staff do not agree to concessions by mid-month.", "stablelm2:1.6b": "US Airways flight attendants union agrees to a nearly 1% pay cut in a new contract, which helps the airline save $500,0 GHS (approximately £12 million) annually and will affect over two-thirds of its staff. Talks with mechanics, baggage handlers, and cleaners are ongoing, but only one-third of their employees have accepted wage cuts so far. US Airways sought bankruptcy protection twice, first in 2007 and then in 2009, and emerged from Chapter 11 to face competition from low-cost carriers and increased fuel costs.", "granite3.1-dense:2b": "US Airways, a struggling airline with 28,000 employees, including 5,200 flight attendants, has secured a new contract from its union, reducing pay by approximately 10%. This agreement will save the company nearly $94 million annually. Over two-thirds of US Airways staff have agreed to wage cuts; however, negotiations with a union representing mechanics, baggage handlers, and cleaners are ongoing. Founded in 2001 as one of the quickest responders to aviation industry post-9/11 challenges, US Airways filed for bankruptcy protection twice in two years due to competition from low-cost carriers and rising fuel costs. If staff concessions aren't secured by mid-month, management may consider asset liquidation.", "reference": "The seventh largest carrier in the US sought bankruptcy protection for a second time in two years last September.A union representing 5,200 flight attendants at bankrupt US Airways have agreed to a new contract that cuts pay by nearly 10%.The deal will help the carrier, trying to survive by cutting costs by nearly $1bn (£530m) a year, save about $94m.US Airways management has said it may need to start liquidating assets if it does not receive concessions from all staff by the middle of this month."}