{"raw_text": "Profits jump at China's top bank\n \n Industrial and Commercial Bank (ICBC), China's biggest lender, has seen an 18% jump in profits during 2004.\n \n The increase in earnings has allowed the firm to write off bad loans and pave the way for a state bailout and eventual stock-market listing. China is trying to clean up its banking system, which is weighed down by billions of dollars of unpaid loans. It has already pumped $45bn (£24bn) into two of its largest banks, and has identified ICBC as a recipient of aid. ICBC's profits were 74.7bn yuan ($9bn; £4.8bn) in 2004, the bank said in a statement. The percentage of non-performing loans dropped to 19.1%, down about 2 percentage points. ICBC was founded in 1984 and had total assets of 5.3 trillion yuan at the end of 2003. China committed to gradually opening up its banking sector when it joined the World Trade Organisation in 2002.\n", "llama3.2:1b": "Profits at Industrial and Commercial Bank (ICBC) rose 18% to 74.7 billion yuan ($9 billion) in 2004, allowing the bank to write off bad loans and pave the way for a potential state bailout and stock-market listing.", "llama3.2:3b": "ICBC's profits jumped 18% in 2004, allowing for bad loan write-offs and a state bailout. China is cleaning up its banking system, which has unpaid loans worth billions. ICBC was founded in 1984 with total assets of 5.3 trillion yuan by the end of 2003.", "gemma2:2b": "ICBC, China's largest bank, saw a 18% increase in profits during 2004. This growth allowed them to write off bad loans and prepare for a state bailout followed by a stock-market listing. China has injected $45 billion into two of its banks, targeting ICBC as another recipient of aid. Their non-performing loan ratio declined, dropping from 19.1% in 2004 down about 2 percentage points.  \n", "qwen2.5:0.5b": "China's largest lender, Industrial and Commercial Bank (ICBC), has experienced a significant increase in profits. This rise was attributed to the bank successfully eliminating bad loans, which were previously seen as risky investments for China's banking system. To address this issue, ICBC plans to write off non-performing loans and seek further aid from the government. The bank is currently valued at around $4.8 billion.", "qwen2.5:1.5b": "Industrial and Commercial Bank of China's profits rose 18% to 74.7 billion yuan, aiding cleanup efforts in China's banks, including a $45bn bailout and potential stock listing.", "qwen2.5:3b": "Profits at China's top bank, Industrial and Commercial Bank (ICBC), increased by 18% to 74.7bn yuan ($9bn; £4.8bn) in 2004. This boost allowed the firm to write off bad loans, paving the way for a state bailout and eventual stock-market listing as part of China's efforts to clean up its banking system, which is burdened by unpaid loans totaling billions of dollars. ICBC had already received a $45bn (£24bn) bailout from the government in 2003 for two largest banks, with it identified as another recipient. The percentage of non-performing loans dropped to 19.1%, down about 2 percentage points from previous years. Founded in 1984, ICBC had total assets of 5.3 trillion yuan by the end of 2003 when China committed to opening up its banking sector after joining the World Trade Organisation in 2002.", "opencoder:1.5b": "\"Industrial and Commercial Bank (ICBank) has seen an 18% increase in profits from 2004, allowing the firm to write off bad loans and prepare for a state bailout plan. The company is trying to clean up its banking infrastructure, which is heavily reliant on unpaid loans. ICBank has already invested $45 billion (£24 billion) into two banks, along with funds allocated to international aid initiatives.\".\n", "smollm:1.7b": "The profits jumped at ICBC, China's biggest bank, by 18% during 2004. The increase in earnings has allowed the firm to write off bad loans and pave the way for a state bailout and eventual stock-market listing. China is trying to clean up its banking system which is weighed down by billions of dollars of unpaid loans. It has already pumped $45bn (£24bn) into two of its largest banks, and has identified ICBC as a recipient of aid. ICBC's profits were 74.7 billion yuan ($9bn; £4.8bn) in 2004, the bank said in a statement. The percentage of non-performing loans dropped to 19.1%, down about 2 percentage points. ICBC was founded in 1984 and had total assets of $5.3 trillion at the end of 2003. China committed to gradually opening up its banking sector when it joined the World Trade Organisation in 2002.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text concisely. Let's read through it first.\n\nThe main point is about Industrial and Commercial Bank (ICBC) of China experiencing a significant profit jump. It had an 18% increase in profits during 2004, which allowed them to write off bad loans and pave the way for state bailouts and listing. The bank's profitability was around $9 billion when they started with $45 billion in investments into two banks, ended up with a 19% drop in non-performing loans, had a total asset size of about 5 trillion yuan, and committed to gradually opening its banking sector upon joining the World Trade Organization in 2002.\n\nSo I need to capture all these key points. The summary should be concise, so maybe just list the main achievements and key dates without going into too much detail.\n</think>\n\nICBC saw an 18% profit increase in 2004, allowing them to write off bad loans and facilitate state bailouts and listing. With $9 billion profits in 2004, it started investing $45 billion into two banks, achieved a 19.1% drop in non-performing loans, and had total assets of over 5 trillion yuan. China committed to banking sector expansion when joining WTO in 2002.", "tinyllama:1.1b": "In 2004, Industrial and Commercial Bank (ICBC) saw a 18% increase in profit, as it was able to write off bad loans and prepare for a state bailoft and eventual stock-market listing. The bank identified ICBC as one of its largest recipients of aid from the government, and has also targeted China's top bank, ICBC, for restructuring and cleaning up its banking system, which is weighed down by billion-dollar unpaid loan debts. ICBC reported a 74.7bn yuan profit in 2004, marking a 19.1% decrease in non-performing loans compared to the previous year. ICBC has committed to gradually opening up its banking system when it joined the World Trade Organisation in 2002.", "tinydolphin:1.1b": " Industrial and Commercial Bank (ICBC), China's largest lender, has experienced an impressive 18% rise in profits during the year 2004. The rise in earnings allowed the bank to write off bad loans and pave the way for a potential stock-market listing. This is part of the nationwide clean-up process aimed at improving China's banking system and weighing down unpaid loan debts. Currently, ICBC has about $45 billion in outstanding loans, which is more than double its 2003 figures. The bank's profits are up by 74.7 billion yuan, or roughly $9 billion, in the same period. ICBC was founded in 1984 and has over $5 trillion in assets. China committed to opening up its banking sector when it joined the World Trade Organisation in 2002.", "phi:2.7b": " ICBC, the largest bank in China, reported an 18% increase in profits during 2004. This allowed them to write off bad loans and pave the way for a state bailout and eventual stock-market listing. The Chinese government is working to clean up its banking system which has been burdened by unpaid loans. The percentage of non-performing loans at ICBC dropped from 19.1% to 18.9%.\n", "orca-mini:3b": " China's top bank, Industrial and Commercial Bank (ICBC), saw a 18% jump in profits during 2004, allowing the firm to write off bad loans and pave the way for a state bailout and eventual stock-market listing. The Chinese government has already pumped $45bn into two of its largest banks, and identified ICBC as a recipient of aid. In 2003, ICBC had total assets of 5.3 trillion yuan.", "hermes3:3b": "ICBC's 18% profit increase, despite 2004, helps China's top bank write off bad loans, leading to state bailout and potential stock listing as part of clean-up efforts for weighed-down banking system.", "stablelm-zephyr:3b": "ICBC, China's largest bank, saw an 18% increase in profits in 2004, allowing for bad loan write-offs and potential state bailout and stock market listing. The percentage of non-performing loans dropped by 2 percentage points. This comes as China continues to clean up its banking sector, having already invested $45bn in two of its largest banks.", "chatgpt-4o-latest": "ICBC, China's largest bank, reported an 18% profit increase in 2004, reaching 74.7 billion yuan ($9 billion). This growth helped the bank reduce non-performing loans to 19.1% and positioned it for a state bailout and future stock-market listing. China is working to clean up its banking sector, already injecting $45 billion into two major banks and identifying ICBC for aid. ICBC, founded in 1984, had total assets of 5.3 trillion yuan by the end of 2003. China pledged to gradually open its banking sector after joining the WTO in 2002.", "stablelm2:1.6b": "ICBC, the largest lender in China with an 8% jump in profits during Q4, has become eligible for state aid and a stock-market listing after cleaning up its banking system amidst a $10bn bailout. The percentage of non-performing loans dropped to 1%, down 2 pcts from Q3. Established in 1984 with total assets of ¥5.3tn at the end of 2013, ICBC was committed to gradually opening up its sector when it joined the WTO in 2011.", "granite3.1-dense:2b": "ICBC, China's leading lender, reported an 18% rise in profits for 2004, reaching 74.7 billion yuan ($9bn; £4.8bn). This profit surge enabled the bank to reduce non-performing loans by 2 percentage points, lowering this figure to 19.1%. The significant earnings boost positions ICBC for potential state bailout and eventual stock-market listing. China has already committed $45bn (£24bn) in aid to two of its major banks, with ICBC identified as a recipient. Founded in 1984, ICBC held total assets worth 5.3 trillion yuan by the end of 2003. As part of its commitment to open up its banking sector post-World Trade Organisation membership in 2002, China has been working on enhancing the industry's health and reducing bad loans.", "reference": "It has already pumped $45bn (£24bn) into two of its largest banks, and has identified ICBC as a recipient of aid.ICBC's profits were 74.7bn yuan ($9bn; £4.8bn) in 2004, the bank said in a statement.Industrial and Commercial Bank (ICBC), China's biggest lender, has seen an 18% jump in profits during 2004.China is trying to clean up its banking system, which is weighed down by billions of dollars of unpaid loans."}