{"raw_text": "Monsanto fined $1.5m for bribery\n \n The US agrochemical giant Monsanto has agreed to pay a $1.5m (£799,000) fine for bribing an Indonesian official.\n \n Monsanto admitted one of its employees paid the senior official two years ago in a bid to avoid environmental impact studies being conducted on its cotton. In addition to the penalty, Monsanto also agreed to three years' close monitoring of its business practices by the American authorities. It said it accepted full responsibility for what it called improper activities.\n \n A former senior manager at Monsanto directed an Indonesian consulting firm to give a $50,000 bribe to a high-level official in Indonesia's environment ministry in 2002. The manager told the company to disguise an invoice for the bribe as \"consulting fees\".\n \n Monsanto was facing stiff opposition from activists and farmers who were campaigning against its plans to introduce genetically-modified cotton in Indonesia. Despite the bribe, the official did not authorise the waiving of the environmental study requirement. Monsanto also has admitted to paying bribes to a number of other high-ranking officials between 1997 and 2002.\n \n The chemicals-and-crops firm said it became aware of irregularities at a Jakarta-based subsidiary in 2001 and launched an internal investigation before informing the US Department of Justice and the Securities and Exchange Commission (SEC). Monsanto faced both criminal and civil charges from the Department of Justice and the SEC. \"Companies cannot bribe their way into favourable treatment by foreign officials,\" said Christopher Wray, assistant US attorney general. Monsanto has agreed to pay $1m to the Department of Justice, adopt internal compliance measures, and co-operate with continuing civil and criminal investigations. It is also paying $500,000 to the SEC to settle the bribe charge and other related violations. Monsanto said it accepted full responsibility for its employees' actions, adding that it had taken \"remedial actions to address the activities in Indonesia\" and had been \"fully co-operative\" throughout the investigative process.\n", "llama3.2:1b": "Monsanto has agreed to pay a $1.5m fine to the US Department of Justice for bribing an Indonesian official to avoid environmental impact studies on its cotton. The company admitted that one employee paid a bribe to the official in 2002, and also faced charges from the Department of Justice and Securities and Exchange Commission (SEC) due to similar bribery incidents between 1997-2002.", "llama3.2:3b": "Monsanto agreed to pay a $1.5m fine for bribing an Indonesian official two years ago. The bribe was made to avoid environmental impact studies on genetically-modified cotton. Monsanto also agreed to three years of monitoring and admitted to improper activities, including paying bribes to other officials between 1997-2002.", "gemma2:2b": "Monsanto will pay a $1.5 million fine for bribing an Indonesian official to avoid environmental impact studies on cotton. The bribe was paid in 2002, disguised as consulting fees. Monsanto admitted responsibility and agreed to three years of monitoring by US authorities.  They faced legal action from the Department of Justice and SEC, but have cooperated with investigations and implemented internal compliance measures. \n", "qwen2.5:0.5b": "Monsanto agreed to pay $1. 5 million to settle a bribery charge with an Indonesian official in exchange for avoiding environmental impact studies on its cotton, but it faces ongoing legal challenges and will still face criminal and civil penalties from both the Department of Justice and the Securities and Exchange Commission (SEC).", "qwen2.5:1.5b": "US agrochemical giant Monsanto fined $1.5 million for bribing Indonesian officials involved with environmental impact studies of cotton production. The company acknowledged improper practices, agreed to three years' monitoring by US authorities, and paid fines to both the Department of Justice and the Securities and Exchange Commission.", "qwen2.5:3b": "Monsanto has agreed to pay a $1.5m fine for bribing an Indonesian official in 2002 to avoid environmental impact studies on its cotton. The firm admitted to paying one of its employees to bribe the official, who did not authorize the waiver. Monsanto also faced criminal and civil charges from the US Department of Justice and SEC over multiple bribery incidents between 1997 and 2002 in Indonesia. The company accepted full responsibility for its actions, agreed to internal compliance measures, and paid settlements with both agencies.", "opencoder:1.5b": "Monsanto has agreed to pay a $1.5m (£799,000) fine for bribing an Indonesian official. Monsanto has told the company that it accepted full responsibility for what it called improper activities in response to accusations of environmental impact studies being conducted on its cotton. The manager at the Indonesian consulting firm directed an Indonesian consulting firm to give a $50,000 bribe to a high-level official in Indonesia's environment ministry in 2002 and disguised this as \"consulting fees\". It has been challenging for activists and farmers who are campaigning against its plans to introduce genetically-modified cotton in Indonesia. Despite the bribe, the official did not authorise the waiving of the environmental study requirement. Monsanto has also admitted to bribes to a number of high-ranking officials between 1997 and 2002. The company has also been paying $1m to the Department of Justice and the SEC for violations. Companies cannot bribe their way into favourable treatment by foreign officials, Monsanto is fully co-operating with both civil and criminal investigations.\n", "smollm:1.7b": "The US agrochemical giant Monsanto has agreed to pay a $1.5 million fine for bribing an Indonesian official. The company admitted one of its employees paid the senior official two years ago in a bid to avoid environmental impact studies being conducted on its cotton. In addition to the penalty, Monsanto also agreed to three years' close monitoring of its business practices by the American authorities. It said it accepted full responsibility for what it called improper activities.\nThe former senior manager at Monsanto directed an Indonesian consulting firm to give a $50,000 bribe to a high-level official in Indonesia's environment ministry in 2002. The manager told the company to disguise an invoice as \"consulting fees\". Monsanto was facing stiff opposition from activists and farmers who were campaigning against its plans to introduce genetically-modified cotton in Indonesia. Despite the bribe, the official did not authorise the waiving of the environmental study requirement. Monsanto also paid $1 million to the Department of Justice and the SEC.\nThe chemicals-and-crops firm said it became aware of irregularities at a Jakarta-based subsidiary in 2001 and launched an internal investigation before informing the US Attorney General's Office and the Securities and Exchange Commission (SEC). Monsanto faced both criminal and civil charges from the Department of Justice and the SEC. \"Companies cannot bribe their way into favourable treatment by foreign officials,\" said Christopher Wray, assistant US Attorney General. Monsanto has agreed to pay $1 million to the Department of Justice, adopt internal compliance measures, and co-operate with continuing civil and criminal investigations. It is also paying $500,000 to the SEC to settle the bribe charge and other related violations. Monsanto said it accepted full responsibility for its employees' actions, adding that it had taken \"remedial actions to address the activities in Indonesia\" and had been \"fully co-operative\" throughout the investigative process.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text about Monsanto's fine for bribery. The user provided a detailed paragraph with specific details like who paid, when, where, penalties involved, and other related information. \n\nFirst, I should identify the key points. The main facts are that Monsanto was fined $1.5 million for bribing an Indonesian official. They admitted to paying bribes over two years in 2002 and agreed to three years of monitoring. There were previous bribes mentioned, including a $50k bribe by a former senior manager's firm.\n\nI also need to note that while the fine was given, activists and farmers opposed the introduction of genetically-modified cotton in Indonesia. However, Monsanto hasn't faced direct legal repercussions for this part except for the bribery-related penalties.\n\nThe summary should keep all these details but in a concise manner without adding any extra information or explanations.\n</think>\n\nMonsanto agreed to pay $1.5 million for bribing an Indonesian official, admitting to two years of bribing and three years of monitoring. The company also acknowledged paying $50k in bribes before and accepted full responsibility for its improper activities, accepting full responsibility for its employees' actions despite the bribery fine.", "tinyllama:1.1b": "MonSanto, a US agrichemical giant, has agreed to pay $1.5m (£799,000) for breaching environmental impact studies in Indonesia. The firm admitted one of its employees paid the senior official two years ago to avoid the necessary environmental research being conducted on cotton crops. MonSanto also agreed to three years' close monitoring of its business practices by American authorities and pay a fine as part of a plea deal with the US Department of Justice and Securities & Exchange Commission (SEC). The firm faced criminal and civil charges from the DoJ and SEC, which demanded an internal company compliance measure, and $1m to fund ongoing investigations. MonSanto admitted full responsibility for its employees' activities and stated that it had taken \"measures to address\" the infringements in Indonesia, and had been fully co-operative throughout the investigative process.", "tinydolphin:1.1b": " Monsanto, an American multinational chemical company, has agreed to pay a $1.5 million fine for bribing an Indonesian official in order to avoid environmental impact studies being conducted on their cotton crops. The fine was imposed by the US Department of Justice (DoJ) and the Securities and Exchange Commission (SEC), which both accused Monsanto of wrongdoing, stating that they were compelled to do so due to the company's deception tactics. \n\nThe company admitted to bribing the official in Indonesia, acknowledging that their actions breached their commitment to upholding the standards and guidelines set by the international community for responsible corporate conduct. They also committed to implementing measures aimed at preventing any future similar occurrences, such as ensuring full transparency regarding their interactions with officials in foreign countries.\n\nMonsanto has been facing charges from both the DoJ and the SEC since 2001 for allegedly bribing officials overseas to secure favorable treatment for its genetically modified (GMO) cotton crops. The firm admitted that they were aware of these wrongdoings in 2001, but did not make any amends at the time.\n\nThe DoJ and the SEC are now seeking to recover damages from Monsanto and requiring them to implement strict internal compliance measures to prevent such behavior in the future. This action underscores the importance of transparency and accountability for organizations that engage in such activities, as it may have far-reaching consequences for the global supply chain.", "phi:2.7b": " A US agrochemical giant called Monsanto agreed to pay a $1.5 million fine for bribing an Indonesian official two years ago. The company admitted that one of its employees paid the official $50,000 to avoid environmental impact studies on their cotton in 2002. Despite this, the bribe did not authorize the waiving of the requirement. In addition to the penalty, Monsanto also agreed to three years' close monitoring of its business practices by American authorities. The company admitted to paying bribes to other high-ranking officials between 1997 and 2000. This led to both criminal and civil charges from the US Department of Justice and Securities and Exchange Commission (SEC). Monsanto has accepted full responsibility for its employees' actions and will pay $1m in fines. It is also adopting new internal compliance measures and cooperating with ongoing investigations.\n", "orca-mini:3b": " US agrochemical giant Monsanto agreed to pay $1.5 million in fines for bribing an Indonesian official two years ago. The company admitted one of its employees paid the official $50,000 bribe to avoid environmental impact studies being conducted on its cotton. Monsanto also faced stiff opposition from activists and farmers who were campaigning against its plans to introduce genetically-modified cotton in Indonesia. However, it did not authorise the waiving of the environmental study requirement, despite paying bribes to high-ranking officials between 1997 and 2002. The company became aware of irregularities at a Jakarta-based subsidiary in 2001 and launched an internal investigation before informing the US Department of Justice and the Securities and Exchange Commission (SEC). Monsanto faced both criminal and civil charges from the Department of Justice and the SEC.", "hermes3:3b": "Monsanto fines $1.5m for bribery\nMonsanto pays $1.5m fine for bribing Indonesian official to avoid environmental impact studies on cotton.", "stablelm-zephyr:3b": "Monsanto agrees to pay $1.5m fine and undergo close monitoring for bribing an Indonesian official in order to avoid environmental impact studies on its cotton product. The company has also admitted to paying bribes to several high-ranking officials between 1997 and 2002. In addition, Monsanto will adopt internal compliance measures and cooperate with ongoing investigations.", "chatgpt-4o-latest": "Monsanto has agreed to pay a $1.5 million fine for bribing an Indonesian official to bypass environmental impact studies on its cotton. A former senior manager directed a $50,000 bribe through a consulting firm in 2002, disguising it as consulting fees. Despite the bribe, the official did not waive the study requirement. Monsanto admitted to additional bribes between 1997 and 2002. The company discovered irregularities in 2001, conducted an internal investigation, and reported to US authorities. Facing criminal and civil charges, Monsanto will pay $1 million to the Department of Justice and $500,000 to the SEC, implement compliance measures, and cooperate with ongoing investigations. The company accepted full responsibility and took remedial actions.", "stablelm2:1.6b": "US agrochemical giant Monsanto has agreed to pay $1.5m (£2,500) fine for bribing an Indonesian official to avoid conducting environmental impact studies on genetically-modified cotton. The company also accepts three years' close monitoring of its business practices. Former senior manager at Monsanto directed an Indonesian consulting firm to give a bribe to the environment ministry official. Despite the bribe, the official did not authorize the waiving of the environmental study requirement. Monsanto has admitted to paying bribes to other high-ranking officials between 2015 and 2017. The company accepted full responsibility for its employees' actions and took remedial actions to address activities in Indonesia.", "granite3.1-dense:2b": "Monsanto, an American agrochemical company, was fined $1.5 million for bribing a high-ranking Indonesian official in 2002 to delay environmental impact studies on its genetically modified cotton. A former Monsanto manager directed an Indonesian consulting firm to pay the official $50,000 as \"consulting fees.\" The company also admitted to bribing other Indonesian officials between 1997 and 2002. Monsanto acknowledged internal irregularities in its Jakarta subsidiary in 2001 and launched an investigation, leading to criminal and civil charges from the US Department of Justice and the Securities and Exchange Commission (SEC). The company agreed to pay $1 million to the DOJ, implement internal compliance measures, and collaborate with ongoing investigations. It also paid $500,000 to the SEC for settling bribe charges and related violations. Monsanto accepted full responsibility for its employees' actions and had taken remedial steps to address the issues in Indonesia.", "reference": "Monsanto also has admitted to paying bribes to a number of other high-ranking officials between 1997 and 2002.A former senior manager at Monsanto directed an Indonesian consulting firm to give a $50,000 bribe to a high-level official in Indonesia's environment ministry in 2002.The US agrochemical giant Monsanto has agreed to pay a $1.5m (£799,000) fine for bribing an Indonesian official.Monsanto faced both criminal and civil charges from the Department of Justice and the SEC.Monsanto has agreed to pay $1m to the Department of Justice, adopt internal compliance measures, and co-operate with continuing civil and criminal investigations.Monsanto admitted one of its employees paid the senior official two years ago in a bid to avoid environmental impact studies being conducted on its cotton."}