{"raw_text": "Marsh executive in guilty plea\n \n An executive at US insurance firm Marsh & McLennan has pleaded guilty to criminal charges in connection with an ongoing fraud and bid-rigging probe.\n \n New York Attorney General Elliot Spitzer said senior vice president Robert Stearns had pleaded guilty to scheming to defraud. The offence carries a sentence of 16 months to four years in state prison. Mr Spitzer's office added Mr Stearns had also agreed to testify in future cases during the industry inquiry. \"We are saddened by the development,\" Marsh said in a statement. The company added it would continue to co-operate in the case, adding it was \"committed to resolving the company's legal issues and to serving our clients with the highest standards of transparency and ethics\".\n \n According to a statement from Mr Spitzer's office, the Marsh executive admitted he instructed insurance companies to submit non-competitive bids for insurance business between 2002 and 2004. Those bids were then \"conveyed to Marsh clients under false and fraudulent pretences\". Through the practice, Marsh was allowed to determine which insurers won business from clients, and so control the insurance market, Mr Spitzer's office added. It also protected incumbent insurers when their business was up for renewal and helped Marsh to maximise its fees, a statement said. In one case, an email showed Mr Stearns had instructed a colleague to solicit a non-competitive - or \"B\" - quote from AIG that was \"higher in premium and more restrictive in coverage\" and so fixed the bids in a way that would support the present provider Chubb. The company is also still being examined by US stock market regulator the Securities and Exchange Commission (SEC). Late last month the SEC asked for information about transactions involving holders of 5% or more of the firm's shares.\n", "llama3.2:1b": "An executive at Marsh & McLennan has pleaded guilty to criminal charges related to insurance fraud and bid-rigging. He admitted instructing insurance companies to submit non-competitive bids, which were then conveyed to clients under false pretenses. The practice allowed Marsh to control the insurance market and maximize its fees.", "llama3.2:3b": "A senior executive at Marsh & McLennan has pleaded guilty to bid-rigging and defrauding, instructing insurance companies to submit non-competitive bids between 2002 and 2004. The offence carries a sentence of 16 months to four years in prison and Mr Stearns agreed to testify in future cases.", "gemma2:2b": "Robert Stearns, a Marsh & McLennan executive, pleaded guilty to scheming to defraud. He admitted to instructing insurance companies to submit non-competitive bids, which were then presented as legitimate to clients under false pretenses. This allowed Marsh to control the market and maximize fees while potentially favoring existing insurers during renewals.  Marsh is cooperating with investigations by the New York Attorney General and the SEC. \n", "qwen2.5:0.5b": "A senior executive at US insurance firm Marsh & McLennan has pleaded guilty to criminal charges in connection with an ongoing fraud and bid-rigging probe. He admitted instructing insurance companies to submit non-competitive bids between 2002 and 2004 for insurance business, which he then used to \"convey\" these bids to his clients under false pretenses. The practice protected incumbent insurers from future renewals and helped increase Marsh & McLennan's fees. The company is still being examined by US stock market regulator the Securities and Exchange Commission (SEC). Late last month, the SEC asked for information about transactions involving 5% or more of its shares.", "qwen2.5:1.5b": "An executive at Marsh & McLennan, Robert Stearns, pleaded guilty to a fraud and bid-rigging scheme with sentences ranging from 16 months to four years in state prison, while also agreeing to cooperate on future cases related to the investigation. The company continues to cooperate with the inquiry and maintains its commitment to ethical practices despite these developments.", "qwen2.5:3b": "Marsh executive Robert Stearns has pleaded guilty to scheming to defraud insurance companies through non-competitive bid-rigging between 2002 and 2004, allowing Marsh to control insurance market decisions and maximize fees for clients. Stearns admitted instructing insurers to submit biased bids under false pretenses. His plea carries a sentence of up to four years in prison and involves cooperating with future industry inquiries. The case is also being examined by the Securities and Exchange Commission.", "opencoder:1.5b": "An executive at US insurance firm Marsh & McLennan has pleaded guilty to criminal charges in connection with an ongoing fraud and bid-rigging probe, New York Attorney General Elliot Spitzer said that Robert Stearns had pleaded committed to scheming to defraud, the company added it would continue to co-operate in the case \"committed to resolving the company's legal issues and to serving our clients with the highest standards of transparency and ethics\". According to a statement from Mr Spitzer's office, the Marsh executive admitted he instructed insurance companies to submit non-competitive bids for insurance business between 2002 and 2004. Those bids were then \"conveyed to Marsh clients under false and fraudulent pretences\", Mr Spitzer's office added that the company also protected incumbent insurers when their business was up for renewal and helped Marsh to maximise its fees.\n", "smollm:1.7b": "The summary should be: Marsh executive in guilty plea", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving key ideas and details. Let me read through it carefully.\n\nFirst, there are two main points here: one about Marsh & McLennan executives pleading guilty and another from the Attorney General. The executive pleaded guilty for fraud and bid-rigging, involving insurance companies submitting non-competitive bids under false pretenses. They use these bids to influence which insurers get contracts. Marsh was able to control the market and protected incumbent insurers, but they also made them charge more than usual.\n\nThe Attorney General, Elliot Spitzer, added that Senior Vice President Robert Stearns agreed to testify in future cases during an industry inquiry. The court is considering a sentence of 16 months to four years in prison. Also, Marsh will continue to cooperate with the agency and aim for transparency and ethics across all cases.\n\nI should make sure not to include any explanations or formatting. Just keep it plain text summarizing both parts.\n</think>\n\nMarsh executive pleaded guilty to fraud charges in a fraud and bid-rigging probe. Senior Vice President Robert Stearns agreed to testify in future cases during an industry inquiry. The case is being heard, with Marsh continuing to cooperate with the SEC and striving for transparency across all legal issues.", "tinyllama:1.1b": "A Marsh executive has pleaded guilty to criminal charges in connection with an ongoing fraud and bid-rigging probe by the US insurance industry inquiry, known as \"Marsh\". Senior vice president Robert Stearns has admitted scheming to defraud by scheming to deceive clients into submitting non-competitive bids for insurance business. The matter involves Marsh and its current parent company Chubb, with the SEC now also seeking information about transactions involving 5% or more of the firm's shares.", "tinydolphin:1.1b": " Marsh & McLennan, a leading global insurance company, has agreed to plead guilty to criminal charges and cooperate with an investigation into potential fraudulent activities within its business. The executive responsible for these actions, Robert Stearns, will face a range of possible penalties, including up to four years in prison. The decision by Marsh & McLennan to settle the case is a significant acknowledgment of wrongdoing on their part and a commitment to maintaining high standards of transparency and ethics within their operations. The investigation remains open, with more information being sought from companies linked to this scandal.", "phi:2.7b": " An executive from insurance giant Marsh pleaded guilty to criminal charges in connection with a fraud and bid-rigging probe, admitting he instructed insurance companies to submit non-competitive bids between 2002 and 2004. The company is still being investigated by the SEC for similar actions that may have affected their stock price.\n", "orca-mini:3b": " An executive at Marsh & McLennan pleaded guilty to scheming to defraud in connection with an ongoing fraud and bid-rigging probe. The executive admitted that he instructed insurance companies to submit non-competitive bids for insurance business between 2002 and 2004. This allowed Marsh to determine which insurers won business from clients, control the insurance market, and maximize fees. In one case, an email showed the executive instructing a colleague to solicit a non-competitive quote from AIG that was \"higher in premium and more restrictive in coverage\" and fix the bids in a way that supported the present provider Chubb. Marsh is also being examined by the SEC.", "hermes3:3b": "Marsh executive pleads guilty, admitted scheming fraud to defraud insurance companies between 2002-2004.", "stablelm-zephyr:3b": "A senior executive at insurance firm Marsh & McLennan has pleaded guilty to scheming to defraud in connection with a fraud and bid-rigging probe. New York Attorney General Elliot Spitzer revealed that Robert Stearns, the company's senior vice president, admitted to instructing insurance companies to submit non-competitive bids for insurance business between 2002 and 2004, which were then conveyed under false and fraudulent pretenses. This practice allowed Marsh to control the insurance market, determine which insurers won business from clients, and maximize fees. The company is also being examined by the US Securities and Exchange Commission.", "chatgpt-4o-latest": "Marsh & McLennan executive Robert Stearns pleaded guilty to scheming to defraud in a fraud and bid-rigging probe led by New York Attorney General Elliot Spitzer. Stearns admitted to instructing insurers to submit non-competitive bids between 2002 and 2004, allowing Marsh to control the insurance market and maximize fees. He agreed to testify in future cases. Marsh expressed regret and pledged cooperation. The SEC is also investigating the company’s transactions involving major shareholders.", "stablelm2:1.6b": "Marsh executive Robert Stearns pleaded guilty to criminal charges in connection with a fraud and bid-rigging investigation, according to New York Attorney General Elliot Spitzer. The plea resulted in a sentence of months to four years in state prison for Stearns. Marsh agreed to cooperate in the case, maintaining their commitment to resolving legal issues and serving clients with high transparency and ethics standards. According to the attorney general's office, Stearns admitted he manipulated insurance bids to secure business for Marsh and protect incumbent insurers when renewing contracts. The ongoing probe includes examination by the Securities and Exchange Commission (SEC).", "granite3.1-dense:2b": "Senior Marsh & McLennan executive Robert Stearns pleaded guilty to conspiring with insurance companies to submit non-competitive bids between 2002 and 2004, which were then presented to clients under false pretenses. This allowed Marsh to control the insurance market, maximize fees, and protect incumbent insurers' renewals. Stearns faces 16 months to four years in state prison and will testify in future industry cases. Marsh remains committed to resolving its legal issues and upholding ethical standards, while continuing to cooperate with the ongoing investigation by New York Attorney General Elliot Spitzer's office and US stock market regulator, the Securities and Exchange Commission (SEC). The SEC recently requested information on transactions involving significant Marsh shareholders.", "reference": "According to a statement from Mr Spitzer's office, the Marsh executive admitted he instructed insurance companies to submit non-competitive bids for insurance business between 2002 and 2004.Through the practice, Marsh was allowed to determine which insurers won business from clients, and so control the insurance market, Mr Spitzer's office added.It also protected incumbent insurers when their business was up for renewal and helped Marsh to maximise its fees, a statement said.Mr Spitzer's office added Mr Stearns had also agreed to testify in future cases during the industry inquiry.\"We are saddened by the development,\" Marsh said in a statement.An executive at US insurance firm Marsh & McLennan has pleaded guilty to criminal charges in connection with an ongoing fraud and bid-rigging probe."}