{"raw_text": "WorldCom bosses' $54m payout\n \n Ten former directors at WorldCom have agreed to pay $54m (£28.85m), including $18m from their own pockets, to settle a class action lawsuit, reports say.\n \n James Wareham, a lawyer representing one of the directors, told Reuters the 10 had agreed to pay those who lost billions when the firm collapsed. The remaining $36m will be paid by the directors' insurers. But, a spokesman for the prosecutor, New York State Comptroller Alan Hevesi, said no formal agreement had been made.\n \n Corporate governance experts said that if the directors do dip into their own pockets for the settlement, it will set a new standard for the accountability of bosses, when the firms they oversee face problems.\n \n \"Directors very rarely pay,\" said Charles Elson, chairman of the Center for Corporate Governance at the University of Delaware. He added that the settlement \"sends a pretty strong shockwave through the director world\". A formal agreement on the payout is expected to be signed on Thursday in a US district court in Manhattan. Earlier, the New York Times had reported that the personal payments were required as part of any deal at the start of negotiations. The ten former outside directors are James Allen, Judith Areen, Carl Aycock, Max Bobbitt, Clifford Alexander, Stiles Kellett, Gordon Macklin, John Porter, Lawrence Tucker and the estate of John Sidgmore, who died last year. It has not yet been determined how much each director will have to pay. \"None of the 10 former directors was a direct participant in the accounting machinations of the WorldCom fraud,\" said the Wall Street Journal (WSJ).\n \n Two other outside former directors, Bert Roberts and Francesco Galesi, remain defendants in the lawsuit, said the newspaper. According to the WSJ, which cites people familiar to the case, the settling directors are expected to deny wrongdoing and state they are settling the case to eliminate the uncertainties and expense of further litigations. The second-largest US long-distance telecoms operator filed for bankruptcy in 2002 when an $11bn accounting scandal was unearthed. The company emerged from Chapter 11 protection last year and changed its name to MCI Inc. Former WorldCom chief executive Bernard Ebbers is to face trial this month on criminal charges that he oversaw the fraud.\n", "llama3.2:1b": "WorldCom's former directors will pay $54m (£28.85m) in a settlement with a class action lawsuit, including $18m from their own pockets. The remaining $36m will be paid by the directors' insurers. A spokesman for New York State Comptroller Alan Hevesi said no formal agreement had been made.", "llama3.2:3b": "Ten former WorldCom directors agree to pay $54m, including $18m from their own pockets, to settle a class action lawsuit; remaining amount will be paid by insurers; settlement may set new standard for director accountability; two other directors remain defendants.", "gemma2:2b": "Ten former WorldCom directors agreed to pay $54 million to settle a class action lawsuit, with $18 million from their own pockets. The remaining $36 million will be paid by the directors' insurers. This settlement could set a new standard for accountability of corporate leaders facing problems within their firms. \n", "qwen2.5:0.5b": "WorldCom former directors agree to pay $54 million, with $36m paid by their insurers but not yet formally agreed upon. The settlement sets a new standard for corporate governance and accountability when companies are faced with problems.", "qwen2.5:1.5b": "Ten former WorldCom directors have settled a class-action lawsuit, paying $54 million with $18 million coming from their own pockets and the rest from insurers. The settlement comes as part of ongoing negotiations for WorldCom's bankruptcy filing in 2002 due to an accounting scandal involving over $11 billion.", "qwen2.5:3b": "Ten former WorldCom directors have agreed to pay $54 million, including $18 million from their own pockets, to settle a class action lawsuit over losses caused by the firm's collapse. The remaining amount will be covered by insurers. Experts suggest this could establish new standards for director accountability. The settlement will be signed on Thursday in Manhattan. Former directors James Allen, Judith Areen, Carl Aycock, and others admitted no wrongdoing but settled to avoid further legal disputes. Two other former outside directors remain defendants. WorldCom filed for bankruptcy in 2002 due to an $11 billion accounting scandal.", "opencoder:1.5b": "WorldCom bosses agreed to pay a total of $54 million (£28.85 million) including settlements by some outside parties, noting they paid their own pockets and other third-party companies. The directors reported they held meetings with some executives when the firm collapsed. With no formal agreement, the Corporation's director world is expected to shock and alter the balance of power. It has been decided that each director will pay a certain amount to each party involved in the settlement. The personal payouts are required as part of any deal at the start of negotiations. The past few years, a New York Times article reported that the settlements were paid by some outside parties, including former directors.\n", "smollm:1.7b": "The summary should contain:\n\n1. Key ideas: \"WorldCom bosses' $54m payout\" - The main idea of the text is that ten former directors at WorldCom have agreed to pay $54 million (£28.85 million) to settle a class action lawsuit, which includes $18 million from their own pockets.\n2. Key details: \"Ten former directors at WorldCom have agreed to pay those who lost billions when the firm collapsed\" - The text provides more information about the number of former directors involved in the settlement and how much each director will have to pay.\n3. Main points: \"WorldCom bosses' $54m payout\" - This is a key point that summarizes the main idea of the text, which is that WorldCom bosses agreed to pay their own pockets for the settlement.\n4. Supporting details: \"Corporate governance experts said that if the directors do dip into their own pockets for the settlement, it will set a new standard for the accountability of bosses\" - This sentence provides additional information about the impact of the settlement on corporate governance and the accountability of WorldCom's management.\n5. Conclusion: \"The settlement sends a pretty strong shockwave through the director world\" - The text concludes by summarizing the main idea, which is that the settlement will send a strong message to other companies about the importance of corporate governance and accountability.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about WorldCom's $54 million payout summary concisely. First, I'll read through the provided text carefully to identify the key points.\n\nThe main points seem to be: ten former directors agreed to settle a class action lawsuit for $54 million, which includes personal contributions from themselves and their insurers. They lost billions when WorldCom collapsed. There were mentions of James Wareham as a lawyer representing some directors, who mentioned paying $18 million personally. A New York State Comptroller said no formal agreement was made yet.\n\nThe article also mentions corporate governance experts pointing out that the payout could set new standards for accountability among bosses in similar firms when they face problems. It's expected to be signed in Manhattan on Thursday. Before the negotiations, the New York Times reported that personal payments were required as part of any deal.\n\nOther figures include specific names like James Allen through Lawrence Tucker, and Wall Street Journal cited Bert Roberts and Francesco Galesi as defendants, with another former director remaining a defendant. The CEO Bernard Ebbers is facing trial this month for overseeing the fraud.\n\nNow, I'll structure this into a concise summary by including all these key points without explanations or formatting. Make sure it's only plain text without any extra info.\n</think>\n\nTen former directors of WorldCom agreed to settle a class action lawsuit for $54 million, with $18 million going directly to them and the remaining $36 million covered by their insurers. A New York State Comptroller mentioned no formal agreement was made. Corporate governance experts noted this payment could set a new standard for accountability. The case is expected in Manhattan on Thursday. Before negotiations, personal payments were required from the directors' side. Key figures include James Allen through Lawrence Tucker and former CEO Bernard Ebbers facing trial.", "tinyllama:1.1b": "A group of 10 former WorldCom board members have agreed to pay $54m ($18m from their own pockets) to settle a class action lawsuit filed against them, according to a report by Reuters. Former external directors, Bert Roberts and Francesco Galesi, remain defendants in the case, said the Wall Street Journal (WSJ). However, corporate governance experts said that if these directors diverted their own money for the settlements set a new standard for the accountability of board members. The ten former directors agreed to pay $54m, including $18m from their own pocket as part of an agreement made with the New York State Comptrollers Alan Hevesi and Charles Elsom. The remaining $36m will be paid by the insurers. The WSJ reported that the settlement also set a precedent for directors facing criminal charges, with the former WorldCom chief executive Bernard Ebbers set to face trial on charges related to the fraud.", "tinydolphin:1.1b": " Summarizing: \nFormer directors at WorldCom agreed to pay $54m (£28.85m) to settle a class action lawsuit, with each director paying $18m of their own pocket. The settlement includes $18m from their former employer, and the remaining $36m will be paid by WorldCom's insurers. This decision is seen as a major breakthrough for corporate governance and has set a new standard for directors' pay. If all 10 settling directors pay nothing, it could send a strong signal that boardroom decisions have significant impact on shareholders.", "phi:2.7b": " Ten former directors of WorldCom, who lost billions when the company collapsed, have agreed to pay $54m in a class action lawsuit, including $18m from their own pockets. Personal payments are expected to set a new standard for accountability among bosses. The settlement is expected to be finalized on Thursday. Two other former directors remain defendants in the case.\n", "orca-mini:3b": " Ten former directors at WorldCom have agreed to pay $54m to settle a class action lawsuit, including $18m from their own pockets. If formal agreement is reached, it will set a new standard for accountability of bosses when firms face problems. Corporate governance experts say directors rarely pay. The ten former outside directors are James Allen, Judith Areen, Carl Aycock, Max Bobbitt, Clifford Alexander, Stiles Kellett, Gordon Macklin, John Porter, Lawrence Tucker and the estate of John Sidgmore, who died last year. They deny any wrongdoing and state they are settling to eliminate uncertainties and expenses of further litigations. The second-largest US long-distance telecoms operator filed for bankruptcy in 2002 when an $11bn accounting scandal was unearthed. It emerged from Chapter 11 protection last year and changed its name to MCI Inc. Bernard Ebbers is to face trial this month on criminal charges that he oversaw the fraud.", "hermes3:3b": "WorldCom directors agree to $54m payout of $18m personal, rest by insurers to settle class action lawsuit. This could set new standard for bosses' accountability during company troubles.", "stablelm-zephyr:3b": "Ten former directors of WorldCom have agreed to pay $54m, including $18m from their own pockets, to settle a class action lawsuit. This includes paying those who lost billions when the firm collapsed. The remaining $36m will be paid by the directors' insurers. If they dip into their own pockets for the settlement, it sets a new standard for corporate governance accountability. Two other outside former directors remain defendants in the lawsuit.", "chatgpt-4o-latest": "Ten former WorldCom directors have agreed to a $54 million settlement for a class action lawsuit, with $18 million coming from their own funds and the rest covered by insurers. This move, if finalized, would set a precedent for corporate accountability. A formal agreement is expected soon, though no official deal has been confirmed. The directors, who were not directly involved in the fraud, are settling to avoid further litigation. WorldCom collapsed in 2002 due to an $11 billion accounting scandal, later rebranding as MCI Inc. Former CEO Bernard Ebbers is set to face trial for his role in the fraud.", "stablelm2:1.6b": "Ten former directors at WorldCom agreed to pay $10 million, including their own contributions, in a class action lawsuit settlement. The remaining amount will be paid by their insurers; however, no formal agreement has been made. If these directors pay from their personal funds, it could set a new precedent for accountability of CEOs facing issues with companies they oversee. A US court district judge is expected to sign a formal agreement on Thursday in Manhattan. The ten former outside directors include James Allen, Judith Areen, Carl Aycock, Max Bobbitt, Clifford Alexander, Stiles Kellett, Gordon Macklin, John Porter, Lawrence Tucker and the estate of John Sidgmore who died last year. It's not yet clear how much each director will have to pay as it hasn", "granite3.1-dense:2b": "Ten former directors of WorldCom have agreed to pay $54 million, including $18 million from their personal funds, to settle a class action lawsuit stemming from the company's $11 billion accounting scandal in 2002 that led to its bankruptcy. The settlement, if finalized, will establish a new standard for director accountability when firms they oversee encounter problems. Corporate governance experts note this unprecedented move as significant, with Charles Elson, chairman of the Center for Corporate Governance at the University of Delaware, stating that directors rarely pay such personal amounts in settlements. The 10 former directors are James Allen, Judith Areen, Carl Aycock, Max Bobbitt, Clifford Alexander, Stiles Kellett, Gordon Macklin, John Porter, Lawrence Tucker, and the estate of John Sidgmore. Two other former directors, Bert Roberts and Francesco Galesi, remain defendants in the lawsuit. The settling directors are expected to deny wrongdoing and claim they're settling to avoid further litigation costs. Former WorldCom CEO Bernard Ebbers is scheduled for trial this month on charges of overseeing the fraud.", "reference": "\"None of the 10 former directors was a direct participant in the accounting machinations of the WorldCom fraud,\" said the Wall Street Journal (WSJ).Ten former directors at WorldCom have agreed to pay $54m (£28.85m), including $18m from their own pockets, to settle a class action lawsuit, reports say.Corporate governance experts said that if the directors do dip into their own pockets for the settlement, it will set a new standard for the accountability of bosses, when the firms they oversee face problems.\"Directors very rarely pay,\" said Charles Elson, chairman of the Center for Corporate Governance at the University of Delaware.Two other outside former directors, Bert Roberts and Francesco Galesi, remain defendants in the lawsuit, said the newspaper.It has not yet been determined how much each director will have to pay.But, a spokesman for the prosecutor, New York State Comptroller Alan Hevesi, said no formal agreement had been made."}