{"raw_text": "Tsunami cost hits Jakarta shares\n \n The stock market in Jakarta has seen its biggest slide in a month, after the country doubled the likely cost of rebuilding from the Asian tsunami.\n \n The fall came as Indonesia said it expected debt repayments of up to 30 trillion rupiah ($3.2bn; £1.7bn) to be frozen to help pay for the recovery. By Monday's close, the Jakarta Stock Exchange was down 2.1% at 1,011.15. Bar a slight dip at the New Year, The JSE had risen steadily by 4.7% since the tsunami hit on 26 December. Construction and property companies in particular have gained ground, although banks were among the main fallers on Monday.\n \n So far, more than 100,000 people are believed to have been killed in Indonesia, the country closest to the earthquake which triggered the great wave.\n \n On Friday, the government said its five-year estimate of rebuilding costs for Banda Aceh province - much of which was flattened by the quake and the tsunami - was 20 trillion rupiah ($2.2bn; £1.1bn), twice what it had previously estimated. That cost could be defrayed by temporary debt relief. On Monday, Indonesian economy minister Aburizal Bakrie told reporters that the Paris Club group of creditor countries was expected to freeze 20-30bn rupiah in payments due in 2005 and 2006. \"We hope we can resume the repayments at least from 2007,\" Mr Bakrie said. French finance minister Herve Gaymard said on Sunday that the Paris Club had already agreed to a moratorium on repayments for tsunami-hit countries ahead of its meeting on 12 January.\n", "llama3.2:1b": "The stock market in Jakarta fell by 2.1% at its close, down from an up 4.7% since the Asian tsunami hit on December 26. The fall was caused by Indonesia's expected debt repayments of up to 30 trillion rupiah ($3.2bn), which are frozen to help pay for recovery efforts.", "llama3.2:3b": "Jakarta Stock Exchange fell 2.1% as Indonesia doubled estimated cost of rebuilding from Asian tsunami, citing up to 30 trillion rupiah in debt repayments to be frozen. Construction and property companies rose, while banks fell. The country has over 100,000 confirmed deaths. Rebuilding costs are estimated at 20 trillion rupiah.", "gemma2:2b": "The Jakarta Stock Exchange fell sharply after Indonesia doubled the estimated cost of rebuilding from the Asian tsunami, partly due to potential debt relief from creditors. More than 100,000 people have died in Indonesia, the country most affected by the earthquake and tsunami. The government expects debt repayment freezes in 2005 and 2006, with the goal of resuming payments in 2007. Construction and property companies saw gains, while banks suffered losses. \n", "qwen2.5:0.5b": "The stock market in Jakarta has seen a big slide, with the Indonesian government expected to pay for reconstruction costs up to $30 trillion rupiah ($3.2 billion). The construction and property companies have gained ground, while banks were among the main fallers. The tsunami caused over 100,000 deaths in Indonesia. Many people are still missing, with the government estimating the cost of rebuilding Banda Aceh province to be twice what it previously estimated. The Paris Club has agreed to freeze payments due in 2005 and 2006 for Indonesia's tsunami-hit countries.", "qwen2.5:1.5b": "Jakarta stock market falls sharply after doubling expected cost of rebuilding from Asian tsunami, with banks among major losers on Monday. Indonesia's government says it expects debt payments totaling up to 30 trillion rupiah to be frozen temporarily to aid recovery. Nearly 100,000 people killed in Indonesian province hit by earthquake/tsunami.", "qwen2.5:3b": "Jakarta stock market has experienced its biggest monthly decline following Indonesia's increase in rebuilding costs from the Asian tsunami. The JSE fell 2.1% to 1,011.15 by Monday, down from a previous 4.7% rise since December 26. Construction and property companies saw gains while banks were main fallers. Over 100,000 people are believed dead in Indonesia, hit hardest by the earthquake/tsunami. The government estimated reconstruction costs at up to 20 trillion rupiah, twice earlier projections. Economy Minister Aburizal Bakrie expects temporary debt relief from Paris Club creditor countries for 20-30 billion rupiah in payments due in 2005 and 2006. French Finance Minister Hervé Morard confirmed the Paris Club's agreement to a moratorium on tsunami-hit country repayments ahead of its January meeting.", "opencoder:1.5b": "\"Tsunami cost hits Jakarta shares\". \nThe stock market in Jakarta has seen its biggest slide as the country doubled the likely cost of rebuilding from the Asian tsunami. Construction and property companies have gained ground, although banks were among the main fallers.\nOver the course of the weekend, a government estimate of 20 trillion rupiah ($2.2bn; £1.1bn) was expected to be defrayed by temporary debt relief, confirmed by Indonesian economy minister Aburizal Bakrie. The Paris Club group of creditor countries had agreed to a moratorium on repayments in 2005 and 2006 for tsunami-hit countries ahead of the meeting on 12 January.\nThe country has seen more than 100,000 people die from the tsunami as it caused widespread panic and financial distress. The tsunami hit in Indonesia resulted in a steep drop in the Jakarta Stock Exchange, with the JSE rising steadily by 4.7% since the earthquake hit on 26 December. Construction and property companies have recovered, while banks were among the main fallers.\nThe government’s five-year estimate of rebuilding costs for Banda Aceh province - much of which was flattened by the quake and the tsunami - is set at 20 trillion rupiah ($2.2bn; £1.1bn) twice what it had previously estimated, confirmed by reporters on Friday.\nIt's a significant event that could be used to rejuvenate the country, opening up new markets and driving down global debt levels.\n", "smollm:1.7b": "The summary should preserve key ideas and details, while omitting unnecessary information. The main points are:\n\n1. The stock market in Jakarta has seen its biggest slide in a month.\n2. Indonesia said it expected debt repayments of up to 30 trillion rupiah ($3.2bn; £1.7bn) to be frozen to help pay for the recovery.\n3. By Monday's close, the Jakarta Stock Exchange was down 2.1% at 1,011.15.\n4. Bar a slight dip at the New Year, the Jakarta Stock Exchange had risen steadily by 4.7% since the tsunami hit on 26 December.\n5. Construction and property companies in particular have gained ground, although banks were among the main fallers on Monday.\n6. The government said its five-year estimate of rebuilding costs for Banda Aceh province - much of which was flattened by the earthquake - was 20 trillion rupiah ($2.2bn; £1.1bn), twice what it had previously estimated.\n7. On Friday, the government said its two-year estimate of rebuilding costs for Banda Aceh province - also much of which was flattened by the earthquake - was 40 trillion rupiah ($5.3bn; £3.6bn).\n8. The Paris Club group of creditor countries is expected to freeze 20-30bn rupiah in payments due in 2005 and 2006.\n9. Herve Gaymard said on Sunday that the Paris Club had already agreed to a moratorium on repayments for tsunami-hit countries ahead of its meeting on 12 January.", "deepseek-r1:1.5b": "<think>\nAlright, let's tackle this query step by step. The user has provided a text about Jakarta's stock market performance after the Indonesia tsunami and some government estimates regarding rebuilding costs. They want a concise summary that preserves key ideas and details.\n\nFirst, I need to identify the main points in each paragraph. In the first paragraph, it mentions Jakarta's biggest drop in a month, due to the cost of rebuilding. The JSE closed down 2.1%, with construction companies gaining traction but banks losing ground. Indonesia expects debt repayments up to 30 trillion rupiah to be frozen.\n\nThe second part gives more details: more than 100,000 people killed in Indonesia near the earthquake, with Banda Aceh heavily damaged. The government's revised estimate for Banda Aceh was double previous guesses, and payments were expected to be paused due to a moratorium from Paris Club.\n\nI need to condense all this into a summary without explanations or formatting. Let me check each section:\n\n1. Jakarta's stock market drop due to rebuilding costs.\n2. The JSE close: down 2.1%, gains in construction, losses for banks.\n3. Indonesia's debt freeze estimates and revised Banda Aceh cost.\n4. Government figures on Banda Aceh rebuild cost (revised estimate) and payments freeze.\n\nI should include all these points clearly but succinctly. I'll start with Jakarta's fall, mention the JSE performance, then Indonesia's expected payments, and finally government's numbers for Banda Aceh. That should cover everything without missing key details.\n</think>\n\nThe Jakarta Stock Exchange experienced a 2.1% drop in its stock market due to the cost of rebuilding following Indonesia's devastating tsunami, after doubling the likely recovery expenses. Construction and property companies saw gains while banks lost ground. More than 100,000 people are believed to have been killed in Indonesia near the earthquake. The government revised its estimate for Banda Aceh province's rebuild costs at least from 2007, with payments frozen due to a moratorium set by the Paris Club group before its meeting on January 12.", "tinyllama:1.1b": "The Jakarta Stock Exchange has taken a steep dive on Tuesday, after Indonesia announced that they expected debt payments from various industries to be frozen in order to help pay for the rebuilding efforts from the Asian tsunami. The stock market's losses were recorded at 2.1% by close of trading on Monday, with construction and property companies among those who saw significant gains despite the fall. The government had initially estimated rebuiiling costs for Banda Aceh province at 20 trillion rupiah ($2.2 billion), twice what they previously estimated. However, it has been announced that the Paris Club group of creditors is expected to freeze payments due in 2005 and 2006. The minister responsible for finance, Aburiza Bakrie, indicated that resuming repayments by next year could be a possibility based on the Paris Club's agreement.", "tinydolphin:1.1b": " The Indonesian stock market has been rocked by the massive tsunami that hit the country in December, causing shares to plummet and debt payments to be frozen due to a government prediction that rebuilding costs could be over £1bn (around $1.7bn) higher than previously estimated. The tsunami cost Jakarta its biggest slide in a month, with the market down 2.1% at the close on Monday. Construction and property companies have seen a particularly significant drop in value while banks have suffered the worst losses. Despite this decline, some stocks managed to recover slightly over the course of the week but remain significantly below their levels before the disaster. The tsunami has caused widespread devastation across Indonesia, with 100,000 people believed to have been killed. The government's estimate for rebuilding costs in Banda Aceh province is over £2bn ($2.2bn) and could be defrayed by temporary debt relief. The Paris Club group of creditor countries is expected to freeze around £1bn ($1.7bn) in payments due in 2005 and 2006. French finance minister Herve Gaymard stated that debt repayments for tsunami-hit nations will continue to be suspended until the Paris Club meets on 12 January.", "phi:2.7b": " The stock market in Jakarta has experienced a significant drop after the country doubled the expected cost of rebuilding from the Asian tsunami. In response, Indonesia announced it would freeze debt repayments by up to 30 trillion rupiah (about $3.2 billion). Construction and property companies have seen an increase in their stocks while banks have fallen. As of now, more than 100,000 people are believed to have lost their lives in the disaster. On Friday, the government estimated the cost of rebuilding Banda Aceh province at 20 trillion rupiah (about $2.2 billion) and hopes to receive temporary debt relief from the Paris Club group of creditor countries. The French finance minister has already agreed to a moratorium on repayments for tsunami-hit countries.\n", "orca-mini:3b": " Jakarta's stock market saw its biggest dip in a month after Indonesia announced it would need to freeze debt repayments worth up to 30 trillion rupiah to help rebuild from the Asian tsunami. The fall came as the country said it expected construction and property companies to gain ground, while banks were among the main fallers on Monday. At least 100,000 people were believed to have been killed in Indonesia, with many more homes destroyed or damaged by the quake and tsunami.", "hermes3:3b": "Jakarta stock market falls after Indonesia doubling potential tsunami rebuilding cost, affecting construction & property companies while banks fall.", "stablelm-zephyr:3b": "Indonesia's stock market in Jakarta experienced a 2.1% drop due to doubled rebuilding costs from the Asian tsunami, which is expected to cost up to 30 trillion rupiah ($3.2bn). The Indonesian government plans to freeze debt repayments to help pay for the recovery, with the Paris Club group of creditor countries agreeing to a moratorium on repayments for tsunami-hit countries. Over 100,000 people are believed to have died in Indonesia from the earthquake and tsunami.", "chatgpt-4o-latest": "Jakarta's stock market saw its biggest decline in a month after Indonesia doubled its estimated tsunami rebuilding costs to 20 trillion rupiah ($2.2bn). The Jakarta Stock Exchange fell 2.1% as the government announced plans to freeze up to 30 trillion rupiah in debt repayments to aid recovery. While construction and property firms gained, banks were among the main losers. More than 100,000 people were killed in Indonesia, the worst-hit country. The Paris Club of creditor nations is expected to freeze debt payments for 2005-2006, with repayments resuming in 2007. France confirmed a moratorium ahead of a 12 January meeting.", "stablelm2:1.6b": "Jakarta shares experienced their biggest decline in a month due to Indonesia doubling the likely cost of rebuilding from the Asian tsunami. This follows a freeze on debt repayments by the Paris Club group of creditor countries until further notice. Approximately 2,0..\n(Note: No additional information is provided and this summary assumes readers will have some understanding of finance, economics, or Indonesian context.)", "granite3.1-dense:2b": "Jakarta's stock market experienced its largest decline in a month, following Indonesia's increased estimate of the Asian tsunami's rebuilding costs. The new figure stands at 20 trillion rupiah ($2.2bn; £1.1bn), double the previous estimate. This increase is expected to be financed through temporary debt relief from creditor countries, including a potential freeze of up to 30 trillion rupiah in payments due by 2006. The Jakarta Stock Exchange closed down 2.1% on Monday, following a steady rise of 4.7% since the tsunami on December 26, with construction and property companies showing growth but banks among the main fallers. Over 100,000 people are believed to have perished in Indonesia due to the disaster.", "reference": "On Friday, the government said its five-year estimate of rebuilding costs for Banda Aceh province - much of which was flattened by the quake and the tsunami - was 20 trillion rupiah ($2.2bn; £1.1bn), twice what it had previously estimated.On Monday, Indonesian economy minister Aburizal Bakrie told reporters that the Paris Club group of creditor countries was expected to freeze 20-30bn rupiah in payments due in 2005 and 2006.The fall came as Indonesia said it expected debt repayments of up to 30 trillion rupiah ($3.2bn; £1.7bn) to be frozen to help pay for the recovery.The stock market in Jakarta has seen its biggest slide in a month, after the country doubled the likely cost of rebuilding from the Asian tsunami.French finance minister Herve Gaymard said on Sunday that the Paris Club had already agreed to a moratorium on repayments for tsunami-hit countries ahead of its meeting on 12 January."}