{"raw_text": "Iran budget seeks state sell-offs\n \n Iran's president, Mohammad Khatami, has unveiled a budget designed to expand public spending by 30% but loosen the Islamic republic's dependence on oil.\n \n The budget for the fiscal year starting on 21 March calls for the sell-off of 20% of the state's corporate holdings. Mr Khatami's second term as president ends on 1 August, making this his last budget. But opposition from members of parliament who have attacked previous privatisations could block his plans. Elections in May 2004 ousted many of Mr Khatami's supporters in parliament in favour of more hard-line religious conservatives. Late last year, they backed a law which would give parliament a veto over foreign investment. The ruling was a response to the involvement in telecoms and airport projects by Turkish companies, which hardliners accused of doing business with Israel. It came not long after the Expediency Council - Iran's ultimate decision-maker - blessed Mr Khatami's policy of selling stakes in sectors protected by the constitution such as energy, transport, telecoms and banking. Continued obstruction of foreign investment could get in the way not only of privatisation plans, but also of Mr Khatami's hope of modestly reducing the government's reliance on oil revenues.\n \n In an address to the Majlis, Mr Khatami predicted economic growth of 7.1% in 2005-6, up from 6.7% in the current year. He said he wanted to increase the 2005-6 budget to 1,546 trillion rials ($175.6bn; £93.6bn) from the previous year's 1,070 trillion. Within that figure, taxation would rise to $14.3bn, a rise of over 40% from what is expected from the current year. In contrast, oil revenues were expected to fall to $14.1bn from $16bn in the year to March 2005. \"Current government expenditure should come from tax revenues,\" Mr Khatami said. \"Oil revenues should be used for productive investment.\" Mr Khatami has already been blocked by parliament from reducing the subsidies on many products including bread and petrol, reducing his room to manoeuvre.\n", "llama3.2:1b": "Iran's president, Mohammad Khatami, is unveiling a budget that includes sell-offs of 20% of state corporate holdings and increases in taxation to fund public spending. The move aims to reduce Iran's dependence on oil revenues and boost economic growth. The budget also includes increased subsidies for bread and petrol.", "llama3.2:3b": "Iran's president unveils a budget that aims to expand public spending and loosen dependence on oil through the sell-off of 20% of state corporate holdings. However, opposition from hard-line parliamentarians may block the plans due to their previous vetoes over foreign investment. The budget predicts economic growth of 7.1% in 2005-6, with taxation rising by over 40%, while oil revenues are expected to fall.", "gemma2:2b": "Iran's president wants to sell state assets, increase public spending, and reduce reliance on oil revenues. However, opposition in parliament could hinder these plans.  The budget includes increasing taxes and reducing reliance on oil revenue. \n", "qwen2.5:0.5b": "Key points:\n\n- Iran's President Mohammad Khatami unveiled a budget seeking state selling off 20% of company holdings.\n- Previous privatisation plans were backed by the Expediency Council in 2004 but faced opposition from parliament members.\n- Mr Khatami predicts growth of 7.1% for 2005-6, up from current year's 6.7%, with a 40% increase in taxation and an expected rise in oil revenues to $14. 3 billion from $14. 1 billion.\n- Mr Khatami has been blocked from reducing subsidies on bread and petrol but faces opposition from parliament members who oppose his privatisation plans.", "qwen2.5:1.5b": "Iran's president Khatami unveiled a budget aimed at increasing public spending by 30% while loosening dependence on oil revenues, with plans to sell 20% of state corporate holdings. However, opposition from parliament could hinder privatizations and reduce the government's reliance on oil revenue. Khatami expects 7.1% economic growth in 2005-6 and aims to increase taxation and cut subsidies to boost budget revenues.", "qwen2.5:3b": "Iran's president, Mohammad Khatami, unveiled a budget aiming to expand public spending by 30% while loosening dependence on oil through state sell-offs of 20% corporate holdings. The fiscal year starts on March 21st and is due for his last budget before August when his term ends. However, resistance from parliament members could impede these plans. Khatami's supporters were ousted in May elections, leaving hard-line conservatives who oppose foreign investment. Despite this hurdle, the government aims to reduce oil reliance by selling stakes in constitutionally protected sectors like energy, transport, telecoms, and banking. Khatami predicted 7.1% economic growth for 2005-6, increasing budget projections from previous year. Oil revenues are expected to decline while tax revenues are forecasted to rise significantly. Despite this revised plan, subsidies on essential goods remain under parliament's control.", "opencoder:1.5b": "Iran's budget seeks state sell-offs.\n\nMohammad Khatamis second term as president ends on 1 August. But opposition from members of parliament who have attacked previous privatisations could block his plans. Elected in May 2004, they backed a law which would give parliament a veto over foreign investment. Late last year, they backed a law which would give parliament a veto over foreign investment. The ruling was a response to the involvement in telecoms and airport projects by Turkish companies, which hardliners accused of doing business with Israel.\n\nThe budget for the fiscal year starting on 21 March calls for the sell-off of 20% of the state's corporate holdings. Continued obstruction of foreign investment could get in the way not only of privatisation plans, but also of Khatamis hope of modestly reducing the government's reliance on oil revenues.\n\nIn an address to the Majlis, Mr Khatami predicted economic growth of 7.1% in 2005-6, up from 6.7% in the current year. He said he wanted to increase the 2005-6 budget to 1,546 trillion rials ($175.6bn; £93.6bn) from the previous year's 1,070 trillion. Within that figure, taxation would rise to $14.3bn, a rise of over 40% from what is expected from the current year. In contrast, oil revenues were expected to fall to $14.1bn from $16bn in the year to March 2005. \"Current government expenditure should come from tax revenues,\" Mr Khatami said. \"Oil revenues should be used for productive investment.\" Mr Khatamis has already been blocked by parliament from reducing the subsidies on many products including bread and petrol, reducing his room to manoeuvre.\n", "smollm:1.7b": "The summary is concise and objective, preserving key ideas and details while omitting unnecessary information. The main points are:\n\n1. Iran's budget seeks state sell-offs: The budget for the fiscal year starting on 21 March calls for the sale of 20% of the state's corporate holdings.\n2. Mr Khatami's second term as president ends: This is his last budget.\n3. Opposition from parliament could block privatisation plans: Late last year, they backed a law which would give parliament a veto over foreign investment.\n4. The ruling was a response to the involvement in telecoms and airport projects by Turkish companies: This is not mentioned in the original text.\n5. Continued obstruction of foreign investment could get in the way not only of privatisation plans, but also of Mr Khatami's hope of modestly reducing the government's reliance on oil revenues: This is not mentioned in the original text.", "deepseek-r1:1.5b": "<think>\nAlright, so I need to summarize this text about Iran's budget. Let me read through it carefully.\n\nThe main idea seems to be that Iran is trying to sell off their government-owned assets but still keep some private ownership. The president, Mohammad Khatami, has a plan where he sells 20% of the state's corporate holdings by year-end (31 March). He ends his second term on August 1, so his last budget before the elections in May 2004 is up for grabs.\n\nOpposition from parliament is pushing back against this, especially because they're against selling stakes. The ruling has been slow to act, mainly responding to Turkish companies investing in Iran that seem to have business interests with Israel. There was a law passed to block foreign investment by parliament last year, but it's not effective yet.\n\nContinuing opposition might slow down the sale of assets, which could make the budget harder to push through. Also, if foreign investments are blocked, this might delay economic growth projections for Iran. The government wants modest oil revenues despite lower levels than expected, and some products like bread and petrol have had their subsidies cut, affecting their economy.\n\nSo, key points: planned asset sales, opposition, past blockers, impact on growth, tax increases, budget specifics, oil revenue changes, and the role of the Expediency Council. I need to condense all this into a concise summary.\n</think>\n\nIran's president, Mohammad Khatami, has unveiled a budget aimed at expanding public spending by 30% but loosening Islamic republic dependence on oil, aiming to sell 20% of corporate holdings. The budget ends his second term in May 2004 and faces opposition from parliament, especially regarding selling assets. Past blockers include tax increases and subsidies on products like bread and petrol. Continued opposition could hinder the sale plan and potentially delay growth projections due to oil revenue changes. The Expediency Council's support for asset sales is ongoing but affected by opposition.", "tinyllama:1.1b": "Iran's President Mohammad Khatami has unveiled a budget designed to increase public spending by 30% while selling off 20% of the state's corporate holdings. The budget for the fiscal year starting on 21 March calls for the privatisation of 20% of state companies. Khatami's second term as president ends on 1 August, but opposition from parliamentary members opposed to privatisations could block his plans. Elections in May 2004 ousted many supporters in parliment in favour of more hardline religious conservatives. The budget law passed late last year would give parliment a veto over foreign investment. The ruling, Expediency Council's blessing of Khatami's policy of selling assets protected by the constitution such as energy, transportation, telecoms and banking, could get in the way of his aim of reducing the government's reliance on oil revenues, while increasing taxation by 40%. The budget for the current year is expected to be $175.6bn (£93.6bn), but taxes are projected to fall by over $14.3bn from last year's level of $16bn. Despite being blocked by parliment, Khatami has already been met with opposition from his backers, who want to reduce the budget.", "tinydolphin:1.1b": " In summary, the text states that Iran's President Mohammad Khatami has presented a budget for the fiscal year starting in March 2004, which seeks the privatization of 20% of state corporate holdings and loosening the government's oil dependency by selling off 20% of these assets. This will help increase state revenue while reducing dependence on oil revenues.", "phi:2.7b": " The text summarises Iran's budget plan to sell 20% of state-owned companies while increasing public spending by 30%. However, opposition from members of parliament may block this plan. Iran's president predicts economic growth of 7.1% in the coming year and wants to use oil revenues for productive investment rather than as a source of government expenditure. The text also mentions that Mr Khatami's policy of selling state-owned companies was approved by the Expediency Council, but foreign investment is still facing obstacles due to opposition from parliamentarians who have backed a law that gives parliament veto power over foreign investment.\n", "orca-mini:3b": " The Iranian government is proposing to sell a 20% stake in state-owned companies, despite opposition from members of parliament who have criticized previous privatisations. President Mohammad Khatami's budget for the upcoming fiscal year aims to increase public spending by 30%, with an emphasis on investing in infrastructure and other sectors protected by the constitution, such as energy, transport, telecommunications, and banking. However, opposition from parliament could limit the scope of the privatization plans. Despite previous calls for the government to reduce its dependence on oil revenues, tax revenues are expected to increase, while oil revenues are expected to decrease.", "hermes3:3b": "Iran budget aims to sell 20% of state holdings, reduce oil dependence.", "stablelm-zephyr:3b": "Iran's president, Mohammad Khatami, unveiled a budget plan for the fiscal year starting on 21 March that aims to increase public spending by 30% and reduce the country's dependence on oil revenues. The budget includes selling 20% of Iran's corporate holdings. However, previous privatization attempts have faced opposition from parliament, leading to a potential blockage of these plans. Khatami predicted economic growth of 7.1% in 2005-6, with increased taxation and reduced oil revenues. He wants current government expenditure to be funded by tax revenues and oil revenues used for productive investment.", "chatgpt-4o-latest": "Iranian President Mohammad Khatami's final budget proposes a 30% increase in public spending while reducing reliance on oil revenues. It includes selling 20% of state corporate holdings, but opposition from hard-line conservatives in parliament may obstruct these plans. Parliament has previously blocked foreign investment and privatisation efforts, despite the Expediency Council's support for selling stakes in key sectors. Khatami forecasts 7.1% economic growth in 2005-6 and aims to increase the budget to 1,546 trillion rials, with taxation rising over 40% to $14.3bn while oil revenues decline. He advocates using tax revenues for government expenses and oil revenues for investment but faces parliamentary resistance to subsidy reductions.", "stablelm2:1.6b": "Iran's budget calls for the sell-off of 25% of state corporate holdings with a goal of expanding public spending and reducing oil dependence. However, opposition may block the plans from being implemented. The budget aims to increase fiscal year starting on March by 1%, resulting in an increased public spending. Some members of parliament have previously opposed previous privatisations. Iran's ultimate decision-maker, the Expediency Council, supported Khatami's policy of selling stakes in sectors such..\nAs per the prediction made by Mr Khatami, Iran is expected to experience 7.1% economic growth for 2013-14, up from 6.7% in the current year. The budget aims to increase spending to 1 quadrillion rials ($5 billion; £5 billion), an increase of around 5%, and within that figure, taxation would rise to $378 million (over 5%) compared to the current year's expected taxation. Oil revenues are expected to fall to $162 million ($500 million) from $450 million in the year to March.", "granite3.1-dense:2b": "Iran's President Mohammad Khatami has proposed a budget for the fiscal year starting March 21, aiming for a 30% increase in public spending while reducing dependence on oil. The plan includes selling 20% of state corporate assets. However, this initiative faces opposition from parliament, where hardline conservatives now hold sway following May 2004 elections. These lawmakers have supported a veto over foreign investments, citing concerns about ties with Israel. Previously, the Expediency Council endorsed Khatami's policy of selling state stakes in sectors like energy, transport, telecommunications, and banking. If successful, this budget would boost the 2005-6 fiscal year budget to 1,546 trillion rials ($175.6bn; £93.6bn), with tax revenues projected to surge by over 40%. Oil revenues are expected to decrease to $14.1bn from the current $16bn. Khatami intends for government expenditure to primarily come from tax revenues and productive investments, rather than oil revenues. Previous attempts to cut subsidies have been blocked by parliament, limiting his room for maneuver.", "reference": "Continued obstruction of foreign investment could get in the way not only of privatisation plans, but also of Mr Khatami's hope of modestly reducing the government's reliance on oil revenues.In contrast, oil revenues were expected to fall to $14.1bn from $16bn in the year to March 2005.In an address to the Majlis, Mr Khatami predicted economic growth of 7.1% in 2005-6, up from 6.7% in the current year.Mr Khatami's second term as president ends on 1 August, making this his last budget.\"Current government expenditure should come from tax revenues,\" Mr Khatami said.Late last year, they backed a law which would give parliament a veto over foreign investment.Mr Khatami has already been blocked by parliament from reducing the subsidies on many products including bread and petrol, reducing his room to manoeuvre."}