{"raw_text": "News Corp makes $5.4bn Fox offer\n \n News Corporation is seeking to buy out minority investors in Fox Entertainment Group, its broadcasting subsidiary, for about $5.4bn (£3.7bn).\n \n The media giant, run by Rupert Murdoch, owns 82% of the shares in the company, home to the Fox television network and the 20th Century Fox film studio. The move follows News Corp's decision to register its business in the US. 20th Century Fox's recent film releases include I Heart Huckabees and I, Robot, while Fox puts out hit TV series 24.\n \n Under the terms of the offer, minority Fox shareholders will receive 1.90 News Corp shares in return for each Fox share they hold. Analysts said the decision to list News Corp in the US - which will result in the firm's shares trading in New York rather than Sydney- nullified the need to retain a separate stock market listing for Fox Entertainment shares. News Corp investors voted in October to approve the transfer of the company's corporate domicile from Australia to the US state of Delaware. The move is designed to help News Corp attract more investment from the largest US financial institutions, and make it easier to raise capital. Fox Entertainment Group generated revenues of $12bn last year. News Corp shares fell 25 cents to $17.65 after the share offer was announced while Fox shares were up 19 cents at $31.22.\n", "llama3.2:1b": "News Corp makes $5.4 billion offer for Fox Entertainment Group, seeking to buy out minority investors for about $5.4 billion. The move follows News Corp's decision to register its US business. The deal would result in News Corp owning 82% of the shares and listing its New York-based subsidiary, Fox, in the US stock market instead of Australia.", "llama3.2:3b": "News Corporation offers $5.4 billion to buy out minority investors in Fox Entertainment Group, receiving 1.90 of its shares for each held. The move follows registration in the US, which will simplify capital raising and attract investment from major financial institutions.", "gemma2:2b": "News Corporation is buying out minority investors in Fox Entertainment Group for $5.4 billion. The move follows their decision to register as a US company, which eliminates the need for a separate stock market listing.  News Corp will issue 1.90 of its shares for each Fox share held. This change aims to attract more investment from US financial institutions and raise capital more easily. \n", "qwen2.5:0.5b": "News Corporation makes a $5.4 billion offer for minority investors in Fox Entertainment Group, the majority of which are owned by Rupert Murdoch's News Corp. The move follows the media giant's decision to list its business in the US. Despite this change, News Corp will retain separate stock markets for Fox shares and will have to address an issue of liquidity.", "qwen2.5:1.5b": "News Corporation, owning 82% of Fox Entertainment Group, offers minority shareholders approximately $5.4 billion for their shares in return, shifting ownership to a US stock market listing.", "qwen2.5:3b": "News Corp is offering $5.4bn to buy out minority investors in Fox Entertainment Group, its broadcasting subsidiary. Owned by Rupert Murdoch and comprising 82% of shares in companies like Fox TV and 20th Century Fox (which produced films like I Heart Huckabbes and I, Robot), News Corp will now list the entity in the US for easier access to capital from major US financial institutions. The move is part of a strategy to unify its corporate domicile from Australia to Delaware. Analysts suggest this could dilute Fox's share value as minority shareholders are offered 1.90 News Corp shares per each Fox share, leading to a rise in Fox's stock price but fall in News Corp's.", "opencoder:1.5b": "The news corporation is seeking to buy out minority investors in fox entertainment group, which owns 82% of the shares. The move is designed to attract investment from the largest US financial institutions and raise capital for fox entertainment group's revenues.\n", "smollm:1.7b": "News Corp is seeking to buy out minority investors in Fox Entertainment Group for about $5.4bn (£3.7bn). The media giant, run by Rupert Murdoch, owns 82% of the shares in the company, home to the Fox television network and the 20th Century Fox film studio. The move follows News Corp's decision to register its business in the US. 20th Century Fox's recent film releases include I Heart Huckabees and I, Robot, while Fox puts out hit TV series 24.\n\nUnder the terms of the offer, minority Fox shareholders will receive 1.90 News Corp shares in return for each Fox share they hold. Analysts said the decision to list News Corp in the US - which will result in the firm's shares trading in New York rather than Sydney- nullified the need to retain a separate stock market listing for Fox Entertainment shares. News Corp investors voted in October to approve the transfer of the company's corporate domicile from Australia to the US state of Delaware. The move is designed to help News Corp attract more investment from the largest US financial institutions, and make it easier to raise capital.\n\nFox Entertainment Group generated revenues of $12bn last year. News Corp shares fell 25 cents to $17.65 after the share offer was announced while Fox shares were up 19 cents at $31.22.", "deepseek-r1:1.5b": "<think>\nAlright, let's tackle this query step by step. The user has provided a news text and wants a summary that preserves key ideas and details, outputting only the plain text without any explanations or formatting.\n\nFirst, I need to read through the entire text carefully to identify the main points. The article is about News Corp buying out Fox Entertainment Group in the US.\n\nI notice that News Corp owns 82% of the shares. The total consideration is $5.4 billion for Fox's $12 billion. That's an important figure to include since it sets up the transaction's scale.\n\nThe transfer happens because Fox's stock has already been listed in the US, so they no longer need a separate listing. This makes sense as New York would be easier for investors. News Corp is setting up a US-based subsidiary, which might attract more capital sources, which aligns with their previous goal of building a presence there.\n\nThe share price adjustment is also crucial— News Corp shares go down by 25 cents because they're being sold to Fox. I should note that Fox's shares go up by 19 cents due to the transaction.\n\nI need to make sure all these details are included concisely, without adding any extra information or explanations. The output should be a straightforward summary reflecting the main points: News Corp buying Fox entertainment group for $5.4b, Fox has been listed in the US, News Corp's ownership and share adjustment details, and the impact on their stock markets.\n\nI'll start by summarizing that News Corp is seeking to buy out 82% of Fox shares worth about $5.4 billion from its parent company, which was previously home to major media companies. Then mention the transfer decision due to Fox's US listing, the share price changes for both companies, and how it benefits New York-based investors.\n\nDouble-checking the key points: ownership percentages, total consideration, transfer details, impact on market listings, stock adjustments, and benefit of being in a different jurisdiction. Ensuring all these are included without any extra fluff is essential.\n</think>\n\nNews Corp is seeking to buy out 82% of Fox Entertainment Group's shares for approximately $5.4 billion. The move follows News Corp registering its business in the US and will involve Fox shareholders receiving about 1.90 News Corp shares for each Fox share they hold. The transaction aims to help News Corp attract investment from financial institutions, and it will benefit New York-based investors while boosting Fox Entertainment's stock performance.", "tinyllama:1.1b": "News Corporation has made a $5.4bn bid for Fox Entertainment Group, hoping to gain control over a major US media company and bolster its operations in the entertainment industry. The offer includes purchasing minority shares owned by News Corp in exchange for each Fox share held. Analysts said the decision was a strategic move to list News Corp in the US market, removing the need for a separate stock exchange for Fox Entertainment shares. Fox Entertainment Group generates revenues of $12bn and is home to major networks such as Fox TV and 20th Century Fox film studio. The offer values the company at about $5.4bn.", "tinydolphin:1.1b": " The US-based media conglomerate News Corporation has reached an agreement with minority investors in its broadcasting subsidiary Fox Entertainment Group for a stock exchange offer, valued at approximately $5.4 billion (£3.7 billion). In this deal, News Corporation intends to acquire the majority of shares held by minority investors and integrate these companies into its existing business structure. This move follows News Corporation's decision to register its business operations in the United States, making it easier for them to raise capital from larger financial institutions. The proposed offer would see minority Fox shareholders receive 1.90 shares of News Corp in return for each Fox share held, effectively nullifying the need to retain a separate stock market listing for Fox Entertainment Group shares.", "phi:2.7b": " News Corporation is making a $5.4 billion offer to buy out minority investors in Fox Entertainment Group, its broadcasting subsidiary. The move comes following the company's decision to register as a US-based business and will allow for greater access to investment capital from major financial institutions. Fox Entertainment Group generated revenues of $12bn last year, with popular TV shows like 24 and films such as I Heart Huckabees and I, Robot.\n", "orca-mini:3b": " News Corp seeks to buy out minority shareholders in Fox Entertainment Group for about $5.4bn.", "hermes3:3b": "News Corp offers $5.4bn to buy Fox Entertainment Group shares.", "stablelm-zephyr:3b": "News Corp, owned by Rupert Murdoch, plans to acquire Fox Entertainment Group's minority investors for $5.4bn. The media company already owns 82% of the shares in Fox and is home to the Fox television network and 20th Century Fox film studio. This move follows News Corp's decision to register its business in the US and listed its shares in New York, eliminating the need for a separate stock market listing for Fox Entertainment shares. Fox Entertainment Group generated $12bn in revenue last year. Following the announcement of the offer, News Corp shares fell while Fox shares increased.", "chatgpt-4o-latest": "News Corporation, led by Rupert Murdoch, is offering $5.4 billion to buy out minority shareholders in its subsidiary, Fox Entertainment Group. News Corp already owns 82% of Fox, which includes the Fox TV network and 20th Century Fox film studio. The move follows News Corp's decision to register in the US, shifting its stock listing from Sydney to New York. Minority shareholders will receive 1.90 News Corp shares for each Fox share. The relocation aims to attract more US investment and facilitate capital raising. Fox Entertainment generated $12 billion in revenue last year. Following the announcement, News Corp shares fell 25 cents to $17.65, while Fox shares rose 19 cents to $31.22.", "stablelm2:1.6b": "News Corporation offers $5.4 billion for minority investors in Fox Entertainment, making this acquisition as part of their strategy to register their business in the US and easier access to investment from US financial institutions. The move follows News Corp's decision to list its shares in New York rather than Sydney. This transaction nullifies the need for a separate stock market listing for Fox Entertainment shares since minority Fox shareholders will receive 1 News Corp share for each Fox share they hold. The acquisition is expected to be completed following shareholder approval. Last year, Fox Entertainment Group generated approximately $5 billion in revenue.", "granite3.1-dense:2b": "News Corporation, headed by Rupert Murdoch, intends to acquire minority investors' stakes in Fox Entertainment Group for approximately $5.4bn (£3.7bn). This acquisition follows News Corp's registration of its business in the US, eliminating the necessity for a separate stock market listing for Fox shares. The company owns 82% of Fox Entertainment Group, which includes the Fox television network and 20th Century Fox film studio. In return, minority shareholders will receive 1.90 News Corp shares per Fox share held. The move aims to enhance News Corp's attractiveness to US financial institutions for investment and capital raising. Fox Entertainment Group generated $12bn in revenue last year. Upon the announcement, News Corp shares dropped by 25 cents to $17.65, while Fox shares rose by 19 cents to $31.22.", "reference": "Under the terms of the offer, minority Fox shareholders will receive 1.90 News Corp shares in return for each Fox share they hold.News Corp shares fell 25 cents to $17.65 after the share offer was announced while Fox shares were up 19 cents at $31.22.Analysts said the decision to list News Corp in the US - which will result in the firm's shares trading in New York rather than Sydney- nullified the need to retain a separate stock market listing for Fox Entertainment shares.News Corporation is seeking to buy out minority investors in Fox Entertainment Group, its broadcasting subsidiary, for about $5.4bn (£3.7bn)."}