{"raw_text": "EU-US seeking deal on air dispute\n \n The EU and US have agreed to begin talks on ending subsidies given to aircraft makers, EU Trade Commissioner Peter Mandelson has announced.\n \n Both sides hope to reach a negotiated deal over state aid received by European aircraft maker Airbus and its US rival Boeing, Mr Mandelson said. Airbus and Boeing accuse each other of benefiting from illegal subsidies. Mr Mandelson said the EU and US hoped to avoid having to resolve the dispute at the World Trade Organisation (WTO).\n \n \"With this agreement the EU and US have confirmed their willingness to resolve the dispute which has arisen between them,\" Mr Mandelson said. \"I hope our negotiations in the next three months will lead to an agreement ending subsidies to development and production of large civil aircraft.\" Last year, the US terminated an agreement with the EU, reached in 1992, which limits the subsidies countries can hand over to civil aircraft makers. The US filed a complaint against Brussels with the WTO over state aid to Airbus, prompting a retaliatory EU complaint over US support for Boeing. However, both sides agreed to suspend their requests for WTO arbitration at the beginning of December, to allow bilateral talks to continue. EADS and BAE Systems, the European defence and aerospace firms which own Airbus, welcomed Mr Mandelson's announcement. \"It has always been preferable that any differences between the US and Europe on this matter be overcome through constructive discussion rather than through legal recourse,\" the companies said in a joint statement.\n \n Separately, the world's largest package delivery company, UPS, said it had placed an order for 10 Airbus A380 superjumbo freight-carrying jets, with an option to buy 10 more of the triple-decker aircraft. The US company said it needed to expand its air freight capacity following strong international growth, and would begin receiving deliveries of the A380s from 2009. However, UPS said it was cutting a previous order for smaller Airbus A300s from 90 planes to 53. So far, Airbus has delivered 40 A300s to UPS. Airbus overtook Boeing as the world's largest manufacturer of commercial airliners in 2003.\n", "llama3.2:1b": "The EU and US have agreed to start talks on ending state aid given to aircraft makers Airbus and Boeing through the World Trade Organisation (WTO). The two sides aim to resolve the dispute without arbitration, with a goal of avoiding further WTO involvement. Talks will begin within three months, focusing on subsidies for large civil aircraft production.", "llama3.2:3b": "The EU and US agreed to begin talks on ending subsidies given to aircraft makers Airbus and Boeing, aiming to avoid a WTO dispute. The US terminated an agreement with the EU in 1992, prompting retaliatory complaints over state aid. Both sides suspended requests for WTO arbitration to allow bilateral talks.", "gemma2:2b": "The EU and US have agreed to start negotiations on ending subsidies given to aircraft manufacturers Airbus and Boeing, both sides hoping to avoid a WTO dispute resolution process. The deal aims to end state aid in large civil aircraft development and production.  This agreement follows the suspension of requests for WTO arbitration by both sides earlier this year. UPS has placed an order for 10 A380 superjumbo freight-carrying jets from Airbus, expanding its air freight capacity. They will receive these jets starting in 2009 but have reduced their order for smaller A300s.  Airbus surpassed Boeing as the world's largest commercial aircraft manufacturer in 2003.\n", "qwen2.5:0.5b": "The European Union and United States have agreed to begin talks on ending subsidies given to European aircraft makers, including Airbus and Boeing. The EU and US hope to reach a negotiated deal that will end state aid received by European aircraft maker Airbus and its US rival Boeing, which allegedly benefits from illegal subsidies. Both sides are also committed to resolving the dispute through bilateral talks rather than through WTO arbitration. EADS and BAE Systems, a joint venture between European defense and aerospace firms, expressed their support for the agreement in a statement.", "qwen2.5:1.5b": "The European Union and United States have begun negotiations on ending state subsidies given to Airbus and Boeing aircraft makers. They hope to resolve disputes related to illegal government support for both companies at the World Trade Organization (WTO).", "qwen2.5:3b": "EU and US have agreed to begin talks on ending subsidies for aircraft makers after accusing each other of illegal subsidies. Both sides hope to avoid resolving the dispute through World Trade Organisation (WTO). EU-US confirmed willingness to resolve Airbus and Boeing disputes. Last year, US terminated an agreement with EU limiting civil aircraft maker subsidies. EADS and BAE Systems welcomed the announcement. UPS ordered 10 Airbus A380 freight jets for expansion of air cargo capacity in 2009, reducing previous order from 90 to 53 planes. Airbus became world's largest commercial airliner manufacturer in 2003.", "opencoder:1.5b": "The EU-US seeking deal on air dispute is a summary of the provided text which preserves key ideas and details while preserving the main points of the original text.\n", "smollm:1.7b": "The EU and US have agreed to begin talks on ending subsidies given to aircraft makers. Both sides hope to reach a negotiated deal over state aid received by European aircraft maker Airbus and its US rival Boeing, Mr Mandelson said. The EU and US have already reached an agreement on the dispute at the World Trade Organisation (WTO), which aims to resolve trade disputes between countries. With this agreement, the EU and US are willing to suspend their requests for WTO arbitration at the beginning of December, allowing bilateral talks to continue. Both sides agreed to place an order for 10 Airbus A380 superjumbo freight-carrying jets with UPS, a leading international parcel delivery company. The US company said it needed to expand its air freight capacity following strong international growth and would begin receiving deliveries of the A380s from 2009. However, UPS said it was cutting a previous order for smaller Airbus A300s from 90 planes to 53. So far, Airbus has delivered 40 A300s to UPS. Airbus overtook Boeing as the world's largest manufacturer of commercial airliners in 2003.", "deepseek-r1:1.5b": "<think>\nOkay, so I've got this query where a user wants me to summarize a given text into a concise summary, preserving key ideas and details. The output should be plain text only. Hmm, let me read through the provided text carefully.\n\nThe text is about an EU-US meeting on ending subsidies for aircraft makers. It mentions Peter Mandelson from the EU Trade Commissioner announcing the agreement. Both sides are hoping to resolve the dispute between Airbus and Boeing over state aid they received. They cited each other as benefits of these subsidies, which were limited by 1992. The US filed a complaint with the WTO about state aid to Airbus, but both sides agreed to wait until December for WTO arbitration before starting talks.\n\nAlso, EADS and BAE Systems welcomed Mandelson's announcement, saying the issue should be discussed constructively rather than through legal means. Then there's UPS ordering more A380 planes after expanding their air freight capacity, cutting down on previous orders of smaller planes (90 to 53). They've already delivered 40 A300s.\n\nI need to make sure the summary captures all these points without extra details. Let me structure it: start with EU-US meeting announcement, then Mandelson's role, their hopes for a trade deal, the subsidies they accused of, the US's complaint, and the companies' reactions. I'll mention the subsidies limit from 1992, the timeline for WTO arbitration, UPS orders, and deliveries so far.\n\nI should keep it concise, using bold text as per instructions. Make sure to avoid any explanations or formatting. Just a straightforward summary.\n</think>\n\nEU-US have agreed to begin talks on ending subsidies given to aircraft makers. EU Trade Commissioner Peter Mandelson announced the meeting, stating both sides hope to reach a negotiated deal over state aid received by Airbus and Boeing. Airbus and Boeing accuse each other of benefiting from illegal subsidies limited to 1992 by the US. The EU and US aim to avoid resolving the dispute at the WTO and have suspended their requests for arbitration until December. EADS and BAE Systems welcomed Mandelson's announcement, stating constructive discussion over differences is preferable. UPS ordered more A380 planes after expanding air freight capacity, cutting from 90 to 53 planes, while delivering 40 A300s so far. Airbus has overtaken Boeing as the largest airline manufacturer in the world.", "tinyllama:1.1b": "The European Union and United States have agreed to begin talks on ending subsidies given to aircraft makers, EU Trade Commissioner Peter Mandelson announced. Both sides aim to resolve the dispute over state aid received by Airbus and Boeing. With the agreement, the EU and US hope to avoid having to resolve the dispute at the World Trade Organization (WTO). The European Union and Airbus have placed an order for 10 A380 superjumbo jetliners, with an option to buy 10 more of the triple-deckers. So far, Airbus has delivered 40 A300s to the US company.", "tinydolphin:1.1b": " The EU and US are set to begin negotiations on ending state subsidies given to aircraft makers. This follows a dispute between the two countries, where Airbus accused Boeing of using unfair subsidies. Both parties aim to reach an agreement before the World Trade Organisation (WTO). If successful, this could prevent further legal actions being taken against each other by both European and American companies.", "phi:2.7b": " The EU and US have agreed to start talks on ending subsidies given to aircraft makers, specifically Airbus and Boeing. Both sides hope to reach a negotiated deal over state aid received by both companies. They also want to avoid resolving this dispute at the World Trade Organization (WTO). The WTO ruled that the US terminated an agreement with the EU in 1999 which limited the subsidies countries could provide to civil aircraft makers. The EU filed a complaint against the US for their support of Boeing, prompting a retaliatory complaint from the EU over the US's support of Airbus. However, both sides agreed to suspend their requests for WTO arbitration at the beginning of December to allow for bilateral talks to continue. EADS and BAE Systems, which own Airbus, welcomed this announcement. In other news, UPS has ordered 10 Airbus A380 freight-carrying planes with an option to buy more, while cutting a previous order for smaller Airbus A300s. This shows that both companies rely on each other's business in the airline industry.\n", "orca-mini:3b": " The EU and US have agreed to negotiate a deal on ending subsidies given to aircraft makers, seeking to reach a negotiated agreement without having to resolve the dispute at the World Trade Organization (WTO). Both sides hope to avoid resolving the issue through state aid provided by Airbus and Boeing to each other. The EU and US agreed to suspend WTO arbitration in December to allow bilateral talks to continue. UPS, the world's largest package delivery company, has placed an order for 10 Airbus A380 superjumbo freight-carrying jets, with an option to buy 10 more of the triple-decker aircraft.", "hermes3:3b": "EU and US begin talks on ending aircraft subsidies dispute", "stablelm-zephyr:3b": "The EU and US have agreed to start talks aimed at ending subsidies given to aircraft makers, specifically Airbus and Boeing, which accuse each other of receiving illegal support. The EU Trade Commissioner, Peter Mandelson, hopes the negotiations will avoid a World Trade Organisation (WTO) dispute. Last year, the US terminated an agreement with the EU that limited subsidies for civil aircraft makers. Both sides suspended their requests for WTO arbitration in December to allow bilateral talks to continue. Additionally, the world's largest package delivery company, UPS, ordered 10 Airbus A380 superjumbo freight-carrying jets and has the option to buy more.", "chatgpt-4o-latest": "The EU and US have agreed to negotiate an end to subsidies for aircraft makers Airbus and Boeing, aiming to avoid WTO arbitration. Both companies accuse each other of benefiting from illegal state aid. The US had previously withdrawn from a 1992 agreement limiting such subsidies and filed a WTO complaint against the EU, prompting a retaliatory complaint. Talks were initiated in December, and EU Trade Commissioner Peter Mandelson expressed hope for a resolution within three months. Airbus owners EADS and BAE Systems welcomed the negotiations. Meanwhile, UPS ordered 10 Airbus A380 freighters with an option for 10 more but reduced a previous order for smaller A300s. Airbus surpassed Boeing as the leading commercial aircraft manufacturer in 2003.", "stablelm2:1.6b": "EU-US agrees to negotiate ending air subsidies for Airbus and Boeing; hope to avoid WTO involvement. EU Trade Commissioner Peter Mandelson announces agreement, hoping to reach a deal without resorting to WTO arbitration. Both sides aim to reach an agreement without having to resolve dispute at WTO. Last year, US terminated 3-year agreement limiting subsidies with EU, leading to complaints over state aid received by Airbus and Boeing. Bilateral talks continue as suspensions of requests for WTO arbitration end in December. UPS places order for larger Airbus A³ jets, marking first deliveries from company.", "granite3.1-dense:2b": "The EU and US have initiated talks to resolve their dispute over state aid given to aircraft manufacturers, specifically between European company Airbus and its American counterpart, Boeing. Both parties aim to negotiate an agreement terminating such subsidies. This move avoids the need for resolution via the World Trade Organisation (WTO). EU Trade Commissioner Peter Mandelson confirmed this agreement, expressing hope for a constructive outcome within three months. The US previously terminated a 1992 agreement with the EU that limited state aid to civil aircraft makers and filed an WTO complaint against Airbus. In response, the EU also submitted a similar complaint regarding Boeing's support. Both sides suspended their WTO arbitration requests at the start of December to facilitate bilateral negotiations. European defence and aerospace firms EADS and BAE Systems expressed preference for resolving differences through dialogue over legal recourse. Meanwhile, UPS, a leading package delivery company, announced an order for 10 Airbus A380 superjumbo freighters with the option to purchase additional units, citing growth in international demand and plans to start receiving deliveries from 2009. The company also reduced its previous order for smaller A300s from 90 to 53 planes. In 2003, Airbus surpassed Boeing as the world's top commercial airliner producer.", "reference": "Both sides hope to reach a negotiated deal over state aid received by European aircraft maker Airbus and its US rival Boeing, Mr Mandelson said.\"With this agreement the EU and US have confirmed their willingness to resolve the dispute which has arisen between them,\" Mr Mandelson said.The US filed a complaint against Brussels with the WTO over state aid to Airbus, prompting a retaliatory EU complaint over US support for Boeing.The EU and US have agreed to begin talks on ending subsidies given to aircraft makers, EU Trade Commissioner Peter Mandelson has announced.Mr Mandelson said the EU and US hoped to avoid having to resolve the dispute at the World Trade Organisation (WTO).Separately, the world's largest package delivery company, UPS, said it had placed an order for 10 Airbus A380 superjumbo freight-carrying jets, with an option to buy 10 more of the triple-decker aircraft.However, UPS said it was cutting a previous order for smaller Airbus A300s from 90 planes to 53."}