{"raw_text": "Fosters buys stake in winemaker\n \n Australian brewer Fosters has bought a large stake in Australian winemaker Southcorp, sparking rumours of a possible takeover.\n \n Fosters bought 18.8% of Southcorp, the global winemaker behind the Penfolds, Lindemans and Rosemount brands, for 4.17 Australian dollars per share. A bid at that price would value the company at A$3.1bn ($2.4bn; £1.25bn ). Fosters said it was currently in discussions \"which may lead to a major corporate announcement\".\n \n In a separate statement, Southcorp confirmed the brewer had asked for talks. Both firms asked the Sydney stock market to suspend trading in their shares until Monday. Southcorp's shares were suspended at A$4.25.\n \n Fosters bought the 18.8% stake from Reline Investments, the family investment firm for the Oatleys, who founded the Rosemount Estates label and sold it to Southcorp in 2001. Robert Oatley and his son Sandy Oatley have both resigned from Southcorp's board following the share deal. Southcorp employs 2,700 people and is the largest single investor in rural Australia, according to its website. The prospect of Fosters launching a major acquisition startled investors, as the brewer said last summer that it was not looking to expand through a big buy in the near future. It has cash available, after getting A$846m from selling property business Lensworth, but it has been widely expected to return cash to shareholders.\n \n \"People will scratching their heads over this one. Fosters has done a back-flip\", said Shawn Burns, a fund manger at Deutsche Asset Management. Southcorp's shares have risen in recent months on speculation that it could become a takeover target. It spent two years in the red, returning to profit in 2004. Consolidation in the wine industry is being driven by Constellation, the world's biggest winemaker. It seized the top spot when it bought Australian firm BRL Hardy for just over $1bn in 2003. Since then, it has paid $1bn for US wine maker Robert Mondavi, bought last month. Fosters' main wine business is Beringer Blass Wine Estate. Its best known brand is Fosters lager, though it makes a clutch of beer brands, and spirits. Analysts were divided on Thursday about whether Fosters was more likely to go for a takeover or merely wanted to take a big enough chunk of Southcorp to prevent it falling to a rival. \"Currently, I think the strategic position is more sensible rather than an outright takeover,\" said one analyst quoted by the Agence France Presse news agency. However, Matt Williams, a fund manager at Perpetual Trustees said taking the stake \"is definitely a precursor to a takeover\".\n", "llama3.2:1b": "Fosters has bought 18.8% of Southcorp, a global winemaker behind brands like Penfolds and Rosemount, for $2.4bn. The deal comes after Fosters' Oatley family sold their share in the company to Reline Investments last year. The buyout sparked speculation about a potential takeover by Fosters, which has cash available but said it's not looking to expand through a large purchase at present.", "llama3.2:3b": "Fosters buys 18.8% of Southcorp, global winemaker behind Penfolds and Rosemount brands, for $4.17 per share, sparking rumors of possible takeover. Fosters is in talks with Southcorp, which has suspended trading in its shares. The move values the company at $3.1bn.", "gemma2:2b": "Fosters purchased 18.8% of Southcorp, a major Australian winemaker, for $3.1 billion. This move comes after Fosters previously stated they were not pursuing large acquisitions and may lead to a major announcement. The deal has sparked speculation about a potential takeover, with investors now wondering how this purchase fits into Fosters' plans. \n", "qwen2.5:0.5b": "A Chinese brewer, Fosters, bought 18.8% of Southcorp, which owns Penfolds, Lindemans and Rosemount brands in Australia. They agreed on a deal where Fosters would pay $4.17 per share for the stake. However, Fosters' previous discussions with Reline Investments, who own the family investment firm for Oatleys, have caused some investors to be nervous about this potential takeover.", "qwen2.5:1.5b": "Australian brewer Fosters has acquired a 18.8% stake in Australian winemaker Southcorp, sparking speculation of a potential takeover. The acquisition was made for A$4.17 per share and is valued at approximately $2.4 billion. This follows a period where Southcorp had been speculated as a takeover target due to consolidation within the wine industry driven by Constellation and others.", "qwen2.5:3b": "Australian brewer Fosters has acquired a 18.8% stake in Southcorp, Australia's largest single investor in rural Australia and home of brands like Penfolds, Lindemans, and Rosemount, for A$4.17 per share, valuing the company at around A$3.1bn. This deal sparked speculation about a potential takeover as Fosters currently discusses this possibility with Southcorp management, which includes the Oatley family's resignation from the board following the stake acquisition. Analysts debate whether Fosters is preparing for a full takeover or merely to secure control against competitors amid consolidation in the wine industry driven by Constellation.", "opencoder:1.5b": "Fosters bought a large stake in Australian winemaker Southcorp, sparking rumours of a possible takeover. The company sold shares for approximately $4.17 per share, valued at an estimated $3.1bn ($2.4bn; £1.25bn ). It has announced the possibility of further discussions on a potential major corporate announcement by \"which may lead to a major corporate announcement\". During a separate statement, Southcorp confirmed that the brewer had asked for talks with Reline Investments and Oatleys who founded the Rosemount Estates label. The prospect of launching a major acquisition was intensified as investors began to question the company's future direction. Fosters received a significant amount of cash from selling property business Lensworth, but it has been widely expected to return cash to shareholders.\n", "smollm:1.7b": "Fosters bought 18.8% of Southcorp for $4.25 per share on Tuesday morning, sparking rumours of a possible takeover. The Australian brewer has been in talks with Southcorp since last summer when it sold its property business Lensworth to Deutsche Asset Management. Fosters' main wine business is Beringer Blass Wine Estate and it makes a clutch of beer brands, including Fosters lager. Analysts were divided on Thursday about whether Fosters was more likely to go for a takeover or merely wanted to take a big enough chunk of Southcorp to prevent it falling to a rival.\n\nCurrently, I think the strategic position is more sensible rather than an outright takeover. However, Matt Williams, a fund manager at Perpetual Trustees said taking the stake \"is definitely a precursor to a takeover\".", "deepseek-r1:1.5b": "<think>\nOkay, so the user has given me this query where they want me to summarize a text about Fosters buying a 18% stake in Southcorp and other details. They specified that I should only output the summary without any explanations or formatting. Hmm, let's break it down.\n\nFirst, I need to identify the key points from the provided text. The main events are Fosters purchasing a significant stake, the reasons behind it (like being part of the Rosemount family), and the potential implications on investors in Southcorp. There are also mentions of other factors, like the financials of South Corp and analyst opinions.\n\nI should make sure to include all these elements concisely. I need to preserve details about the percentage, the bid price, and the timing of the share suspensions. Also, noting that Fosters is looking at expansion versus acquiring a major stake is important for context.\n\nWait, the user also mentioned preserving details like who the Oatley family resigned from or specific numbers. But in the summary, I don't want to go into too much depth; just the main points. So I'll focus on the purchase details and the broader implications, keeping it clear and straightforward.\n</think>\n\nFosters purchased a 18.8% stake in global winemaker South Corp for A$4.17 per share, valued at $3.1 billion, citing concerns about potential takeover developments. The buy was part of an ongoing strategic move by Fosters, which includes the Rosemount Estates label and sold it to South Corp in 2001. Fosters aims to explore this acquisition, which could lead to a major announcement.", "tinyllama:1.1b": "A large stake in Australian wine maker Southcorp has been acquired by Fosters, a major brewer and owner of Beringer Blaß Winery Estate, sparking rumors of a possible takeover. Fosters' stake was valued at A$3.1bn ($2.4bn) and the move could lead to a major corporate announcement as Southcorp, currently in discussions, is expected to offer its shares for sale in the coming days. Foster's main wine business is Beringer Blaß Winery Estate while it also produces beer and spirits brands under its own brand Fosters lagers. Analysts were divided on whether Fosters was simply looking for a big enough chunk of Southcorp to prevent it falling to a rival or wanted to launch a major acquisition, but the prospect of Fosters taking control has been widely expected in recent months.", "tinydolphin:1.1b": " Fosters has acquired a 18.8% stake in Southcorp for $4.17 per share. This stake would be worth approximately A$3.1bn ($2.4bn; £1.25bn). Fosters is the current largest shareholder in Southcorp and has been negotiating with the company for some time. This acquisition suggests that there may be discussions of a major corporate announcement concerning both companies, potentially leading to a merger or other significant transaction.", "phi:2.7b": " Fosters has bought 18.8% of Southcorp, Australia's largest wine producer, sparking speculation of a possible takeover. The move is surprising since Fosters had previously ruled out expanding through a big acquisition. Southcorp' s shares have risen in recent months on the same news and analysts are divided about whether Fosters intends to buy it or not.\n", "orca-mini:3b": " Australian brewer Fosters has bought a large stake in Australian winemaker Southcorp, sparking rumors of a possible takeover. Fosters bought 18.8% of Southcorp for $4.17 per share, valuing the company at around $2.4 billion. The deal led to the resignation of prominent shareholders including the Oatleys, who founded the Rosemount Estates label and sold it to Southcorp in 2001. Analysts were divided on whether Fosters was more likely to go for a takeover or merely wanted to take a big enough chunk of Southcorp to prevent it falling to a rival.", "hermes3:3b": "Foster's buys 18.8% stake in Australian winemaker Southcorp for A$3.1bn.", "stablelm-zephyr:3b": "Australian brewer Fosters buys 18.8% stake in Southcorp, the global winemaker behind popular brands like Penfolds and Lindemans. The move sparks rumors of a potential takeover. Fosters acquires this stake from Reline Investments for A$4.17 per share, which values the company at A$3.1bn ($2.4bn; £1.25bn). Southcorp is the largest single investor in rural Australia and employs 2,700 people. The speculation of a takeover comes as consolidation in the wine industry is driven by companies like Constellation, the world's biggest winemaker.", "chatgpt-4o-latest": "Fosters, the Australian brewer, has acquired an 18.8% stake in winemaker Southcorp, fueling speculation of a takeover. The stake was purchased for A$4.17 per share, valuing Southcorp at A$3.1bn. Both companies confirmed discussions and suspended trading of their shares. The stake was bought from Reline Investments, the Oatley family's firm, leading to the resignation of Robert and Sandy Oatley from Southcorp's board. Investors were surprised by Fosters' move, as it had previously indicated no plans for major acquisitions. Southcorp, which recently returned to profitability, has been seen as a takeover target amid industry consolidation. Analysts are divided on whether Fosters will proceed with a full takeover or simply block a rival bid.", "stablelm2:1.6b": "Australian brewer Fosters has acquired a 8% stake in winemaker Southcorp for $4 Australian dollars per share, making it the largest single investor in rural Australia. This comes as a surprise to investors, as Fosters had previously stated that they were not looking to expand through a major buy-in near future. The acquisition could potentially spur interest from rivals, as Southcorp's shares rose on speculation of takeover interest.", "granite3.1-dense:2b": "Australian brewer Fosters purchased an 18.8% stake in Southcorp, a prominent global winemaker, for A$4.17 per share, valuing the company at approximately A$3.1 billion ($2.4 billion; £1.25 billion). The deal was executed by Fosters acquiring shares from Reline Investments, owned by the Oatley family who founded Rosemount Estates and sold it to Southcorp in 2001. Robert Oatley and his son Sandy resigned from Southcorp's board following this transaction. Southcorp employs 2,700 people and is the largest rural investor in Australia. The move has surprised investors, as Fosters previously stated it wouldn't expand through major acquisitions soon. Fosters gained cash from selling its property business, Lensworth, for A$846 million. Southcorp shares had been rising due to takeover speculation; the company had recently returned to profit after two years of losses in 2004. This deal coincides with consolidation trends in the wine industry, driven by Constellation, which has expanded its portfolio through acquisitions worth billions of dollars. Fosters' primary wine business is Beringer Blass Wine Estate, while Southcorp's well-known brands include Penfolds, Lindemans, and Rosemount. Analysts are divided on whether this stake indicates a takeover or merely aims to prevent Southcorp from being acquired by competitors. Some analysts suggest the strategic position is more valuable than an outright acquisition, while others view it as a precursor to a takeover.", "reference": "Australian brewer Fosters has bought a large stake in Australian winemaker Southcorp, sparking rumours of a possible takeover.Fosters bought 18.8% of Southcorp, the global winemaker behind the Penfolds, Lindemans and Rosemount brands, for 4.17 Australian dollars per share.Fosters bought the 18.8% stake from Reline Investments, the family investment firm for the Oatleys, who founded the Rosemount Estates label and sold it to Southcorp in 2001.Since then, it has paid $1bn for US wine maker Robert Mondavi, bought last month.Fosters has done a back-flip\", said Shawn Burns, a fund manger at Deutsche Asset Management.Fosters said it was currently in discussions \"which may lead to a major corporate announcement\".Analysts were divided on Thursday about whether Fosters was more likely to go for a takeover or merely wanted to take a big enough chunk of Southcorp to prevent it falling to a rival.The prospect of Fosters launching a major acquisition startled investors, as the brewer said last summer that it was not looking to expand through a big buy in the near future.Fosters' main wine business is Beringer Blass Wine Estate.Southcorp's shares have risen in recent months on speculation that it could become a takeover target."}