{"raw_text": "China bans new tobacco factories\n \n The world's biggest tobacco consumer, China, has said it will not allow any new tobacco factories to be built.\n \n China already has more than enough cigarette-making capacity, according to a spokesman for the tobacco industry regulator quoted in China Daily. The ban threatens to reignite tensions between the regulator and British American Tobacco, which plans to become China's first foreign cigarette maker. A spokeswoman for Bat declined to comment on the report.\n \n \"China won't allow any new tobacco factories to be built, including joint ventures\", said Xing Wangli, a spokesman for the State Tobacco Administration Monopoly quoted in China Daily. He also said that the state would retain its monopoly on cigarette distribution. China has 350 million smokers who consumer 1.7 trillion cigarettes a year. Smoking is fashionable in China, where it is seen as an essential - and manly - sociable touch for some jobs, such as salesmen. More young, urban woman are taking up smoking too. In July 2004, Bat announced it had won approval for to build a $1.5bn (£800m) joint venture factory in China which would make it the first foreign cigarette maker to manufacture there.\n \n The State Tobacco Monopoly Administration said a week later that it had not approved the deal, leading to an embarrassing public row. Bat told the BBC at that time that it had not negotiated with the STMC, and secured approval from \"the highest levels of government\". Since then, the row has flared occasionally, most recently at a forum in November. Bat consistently declines to comment. \"Xing's statement comes as especially bad news for British American Tobacco\", the China Daily newspaper said of the latest development. The Bat spokeswoman said: \"There is nothing for us to add...since our announcement in July last year. The central government of China is the authority that approved our strategic investment.\" The decision to ban further tobacco factories does not apply to deals made before 2005, according to the French news agency AFP. The joint venture factory was expected to take till 2006 to build. The Bat spokeswoman would not comment on its progress. However, if the STMA continues to take a tough stance, expansion opportunities could be limited.\n \n China's tobacco market is increasingly valuable as anti-smoking campaigners target public smoking in the West. China Daily said the market was currently enjoying steady growth, making more than 210bn yuan ($25.4bn) in pre-tax profits last year, almost double the figure in 2000. The paper made no mention of health concerns. The STMA is trying to restructure the domestic tobacco industry, closing some factories, though such moves can be unpopular with local governments.\n", "llama3.2:1b": "China has banned new tobacco factories due to concerns over its \"monopoly\" on cigarette distribution and potential anti-foreign investment sentiment. The ban affects companies like British American Tobacco that plan to establish joint ventures in the country. China has 350 million smokers who consume 1.7 trillion cigarettes a year, with smoking seen as an essential aspect of Chinese culture, particularly among salesmen.", "llama3.2:3b": "China bans new tobacco factories and will retain its monopoly on cigarette distribution, effectively blocking British American Tobacco's plans to become China's first foreign cigarette maker.", "gemma2:2b": "China bans new tobacco factories. This ban will impact British American Tobacco's plans to become China's first foreign cigarette maker and could lead to increased tensions between the regulator and Bat. \n", "qwen2.5:0.5b": "China has banned new factory construction for cigarettes.", "qwen2.5:1.5b": "China bans new tobacco factories, threatening to disrupt relations between the regulator and foreign cigarette maker British American Tobacco (BAT). BAT announced a $1.5 billion joint venture factory in China in 2004 but its approval was revoked due to a ban on new factories, leading to an ongoing public dispute. China has 350 million smokers consuming over one trillion cigarettes annually, making it the world's largest market for cigarettes. The decision affects deals made before 2005.", "qwen2.5:3b": "China has banned new tobacco factories, including joint ventures, and maintains its monopoly on cigarette distribution. This decision threatens British American Tobacco's plans to establish a factory in China after it won approval for a $1.5bn joint venture. The ban does not apply to existing deals made before 2005. Despite the ban, the Chinese tobacco market is valued at over 210 billion yuan with steady growth and pre-tax profits double that of 2000. China Daily reported on the growth but did not mention health concerns related to smoking. The State Tobacco Monopoly Administration continues to implement restructuring measures within the industry, which can be unpopular locally.", "opencoder:1.5b": "China has banned new tobacco factories and announced a decision for anti-smoking campaigns.\n\nIn a statement from an executive director, China has allowed only a small number of additional tobacco factories due to concerns over increasing obesity and dependence on smoking for health reasons. The announcement comes as part of efforts aimed at raising public awareness about the dangers of smoking and encouraging consumers to make healthier choices.\n\nThe decision was announced by a spokesman for the national tobacco industry regulator and made in part because of fears that smoking could become an expensive commodity. The ban threatens to reshape the global relationship between China, British American Tobacco (BAFT) and the state's tobacco monopoly. The executive director also notes that the announcement did not provide specific details on what those banned factories would be, which is a key detail to preserve.\n", "smollm:1.7b": "China has banned new tobacco factories from being built.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about China banning new tobacco factories. Let me read through it carefully.\n\nThe first sentence says China has banned new tobacco factories. They mentioned that China is a world leader in cigarette consumption and has more than enough capacity. A spokesman from the tobacco industry regulator said they will retain their monopoly on distribution, with 350 million smokers consuming 17 trillion cigarettes annually. Smoking is seen as essential and manly for some jobs like salesmen.\n\nThen there's an article about British American Tobacco ( Bat ) getting approval for a $1.5 billion joint venture factory in China in July 2004. But later, it was mentioned that the STMA refused to approve this deal until certain conditions were met, which led to a public controversy. It seems like a tough stance might limit expansion opportunities.\n\nI should make sure I include all key points: China's ban, their capacity, the regulator's statements, Bat's approval details, the controversy, and the broader implications on China's tobacco market and public perception of smoking.\n\nWait, the user mentioned that they want only the summary in plain text without any explanations or formatting. So I need to make sure it's concise and captures all important aspects accurately.\n</think>\n\nChina has banned further construction of tobacco factories, marking a significant shift in its cigarette industry. The state's tobacco regulator said China already had sufficient capacity for cigarette production, though they retain their monopoly on distribution. Smokers across the country consume over 17 trillion cigarettes annually, with smoking seen as an essential and manly talent for jobs like sales work. A joint venture factory from Bat was approved in July 2004 but later faced controversy regarding approval, leading to a public dispute between China's tobacco regulator and Bat. The ban may limit expansion opportunities and could impact the market's value, especially with anti-smoking movements targeting public smoking globally.", "tinyllama:1.1b": "The Chinese government has banned the construction of new cigarette-making factories as part of its efforts to reduce smoking rates among its adult population. The ban threatens to reignite tensions between the State Tobacco Monopoly Administration (STMA), which regulates the industry, and British American Tobacco (BAT), one of the world's largest cigarette-makers, regarding joint venture partnerships. The STMA has not approved BAT's proposed tobacco factory in China but continues to negotiate approval for its own $1.5bn joint venture, which was originally intended for manufacturing. Despite the ban on new factories, China's tobacco market remains enjoyable due to steady growth and high profits of over 200bn yuan ($25.4bn) in pre-tax profits in 2010. However, efforts to restructure the industry can be unpopular with local government officials who may fear losing jobs or revenues.", "tinydolphin:1.1b": " China has recently decided not to allow new tobacco factories to be built in order to maintain its monopoly on cigarette manufacturing. This decision is likely due to concerns about public health and environmental issues related to the production of cigarettes. The ban threatens to increase tensions between the Chinese government and the British American Tobacco Company (BAT), which plans to become China's first foreign-owned cigarette maker. The Chinese regulator, the State Tobacco Monopoly Administration (STMA), has already blocked a number of joint ventures with BAT, while other foreign companies are also facing similar challenges in securing approval for their own projects.", "phi:2.7b": " China has banned new tobacco factory construction, including joint ventures, as it already has an abundant capacity for cigarette-making. This decision poses a threat to foreign companies like British American Tobacco that are interested in entering the Chinese market, and may reignite tensions between the tobacco industry regulator and the company. Currently, China's tobacco market is growing steadily with steady profits, but anti-smoking campaigns in the West could also impact it in the future.\n", "orca-mini:3b": " China has banned the construction of new tobacco factories, according to a statement by the State Tobacco Monopoly Administration. The ban threatens to reignite tensions between the regulator and British American Tobacco, which plans to become China's first foreign cigarette maker. A spokeswoman for Bat declined to comment on the report.", "hermes3:3b": "China bans new tobacco factories; already has sufficient capacity.", "stablelm-zephyr:3b": "China has banned new tobacco factories, including joint ventures, effectively ending British American Tobacco's (BAT) plans to become the first foreign cigarette maker in the country. The State Tobacco Administration Monopoly retains China's monopoly on cigarette distribution. BAT had announced a $1.5bn joint venture factory in 2004, which would have taken until 2006 to build. Despite China's growing tobacco market, with over 350 million smokers consuming 1.7 trillion cigarettes annually, smoking remains popular in the country, often seen as an essential and manly social gesture for certain professions. The Chinese government's decision does not apply to deals made before 2005.", "chatgpt-4o-latest": "China has announced a ban on new tobacco factories, including joint ventures, citing sufficient cigarette-making capacity. This decision may escalate tensions with British American Tobacco (BAT), which had previously secured approval for a $1.5 billion joint venture factory. However, the State Tobacco Monopoly Administration later denied approving the deal, leading to a public dispute. The ban does not affect agreements made before 2005, but it could limit future expansion opportunities. China's tobacco market remains highly profitable, generating over 210 billion yuan in pre-tax profits in 2004. Despite restructuring efforts to close some factories, smoking remains popular, particularly among men and an increasing number of young urban women. The government retains its monopoly on cigarette distribution, and health concerns were not mentioned in the official reports.", "stablelm2:1.6b": "China has banned new tobacco factories, leaving existing cigarette-making capacity sufficient for current demand. This move threatens tensions between the State Tobacco Administration and British American Tobacco, as BAT plans to become China's first foreign cigarette maker. In response to public smoking concerns in the West, China's tobacco market is increasingly valuable and experiencing steady growth, generating over $1.5 billion pre-tax profits last year. However, the ban on new factories may limit expansion opportunities for tobacco companies like BAT.", "granite3.1-dense:2b": "China has decided not to permit any new tobacco factories, maintaining its monopoly on cigarette production. This decision, announced by Xing Wangli of the State Tobacco Administration Monopoly, aims to address the existing overcapacity in China's already saturated cigarette market with 350 million smokers consuming 1.7 trillion cigarettes yearly. The ban impacts British American Tobacco (BAT), which had planned a $1.5bn joint venture factory for manufacturing in China, but the deal was never officially approved due to a dispute with the STMA. Despite BAT's claims of government approval, the STMA asserts its authority over such strategic investments. The ban does not affect deals made before 2005, and while expansion opportunities may be limited, China's tobacco market continues to grow significantly, generating nearly $25.4bn in pre-tax profits last year. Health concerns related to smoking are not addressed in this summary.", "reference": "\"China won't allow any new tobacco factories to be built, including joint ventures\", said Xing Wangli, a spokesman for the State Tobacco Administration Monopoly quoted in China Daily.The world's biggest tobacco consumer, China, has said it will not allow any new tobacco factories to be built.In July 2004, Bat announced it had won approval for to build a $1.5bn (£800m) joint venture factory in China which would make it the first foreign cigarette maker to manufacture there.China already has more than enough cigarette-making capacity, according to a spokesman for the tobacco industry regulator quoted in China Daily.\"Xing's statement comes as especially bad news for British American Tobacco\", the China Daily newspaper said of the latest development.The State Tobacco Monopoly Administration said a week later that it had not approved the deal, leading to an embarrassing public row.The Bat spokeswoman would not comment on its progress.China has 350 million smokers who consumer 1.7 trillion cigarettes a year.The Bat spokeswoman said: \"There is nothing for us to add...since our announcement in July last year.The decision to ban further tobacco factories does not apply to deals made before 2005, according to the French news agency AFP."}