{"raw_text": "Kraft cuts snack ads for children\n \n Kraft plans to cut back on advertising of products like Oreo cookies and sugary Kool-Aid drinks as part of an effort to promote healthy eating.\n \n The largest US food maker will also add a label to its more nutritional and low-fat brands to promote the benefits. Kraft rival PepsiCo began a similar labelling initiative last year. The moves come as the firms face criticism from consumer groups concerned at rising levels of obesity in US children. Major food manufacturers have recently been reformulating the content of some calorie-heavy products.\n \n Kraft's new advertising policy, which covers advertising on TV, radio and in print publications, is aimed at children between the ages of six and 11. It means commercials for some of its most famous snacks and cereals shown during early morning cartoon shows on TV will now be replaced by food and drink qualifying for Kraft's new \"Sensible Solution\" label. But the firm said it would continue to advertise all its products in media seen by parents and \"all family\" audiences. \"We're working on ways to encourage both adults and children to eat wisely by selecting more nutritionally balanced diets,\" said Lance Friedmann, Kraft senior vice president.\n", "llama3.2:1b": "Kraft plans to reduce advertising of sugary snacks and drinks for children as part of promoting healthy eating, and will add a label to its more nutritional brands. The company also aims to improve labeling for its calorie-heavy products and replace commercials on TV with food and drink options qualifying for the \"Sensible Solution\" label.", "llama3.2:3b": "Kraft plans to cut back on advertising of unhealthy snack foods to children aged 6-11 as part of a campaign to promote healthy eating, adding labels to its more nutritious brands. The move comes amid criticism over rising child obesity rates and follows PepsiCo's similar labelling initiative.", "gemma2:2b": "Kraft is reducing advertising of sugary snacks targeted towards children under 12.  Instead, they will replace these ads with commercials for more nutritional products that earn their \"Sensible Solution\" label. This move comes in response to criticism about rising childhood obesity rates and follows a similar initiative by PepsiCo.  Despite the change, Kraft will continue to advertise some products aimed at parents and families. \n", "qwen2.5:0.5b": "Kraft plans to cut advertising for sugary drinks like Kool-Aid and Oreos as part of a strategy to promote healthier eating habits. The company has also released a new label on its brands that are low in fat and calories. This is aimed at children aged 6-11, with commercials from Kraft being replaced by healthier options during TV shows before they wake up.", "qwen2.5:1.5b": "Kraft plans to cut back on advertising of unhealthy snack foods aimed at children aged 6-11, adding a label for nutritious products instead.", "qwen2.5:3b": "Kraft plans to reduce advertising for snacks like Oreo cookies and sugary drinks aimed at kids aged 6-11, replacing them with ads for healthier brands labeled as \"Sensible Solution.\" The move follows similar initiatives by rival PepsiCo. Kraft aims to address criticism from consumer groups over rising childhood obesity, while continuing to advertise less healthy products in media watched by adults.", "opencoder:1.5b": "Kraft plans to cut back on advertising of products like Oreo cookies and sugary Kool-Aid drinks as part of an effort to promote healthy eating. The largest US food maker will also add a label to its more nutritional and low-fat brands to promote the benefits.\nMajor food manufacturers have recently been reformulating the content of some calorie-heavy products. Kraft's new advertising policy aims at children between the ages of six and 11. The firm said it would continue to advertise all its products in media seen by parents and \"all family\" audiences, encouraging both adults and children to eat wisely.\n", "smollm:1.7b": "The summary is concise and clear, preserving the key ideas and details of the original text. The main points are:\n\n1. Kraft plans to cut back on advertising of products like Oreo cookies and sugary Kool-Aid drinks as part of an effort to promote healthy eating.\n2. Kraft will add a label to its more nutritional and low-fat brands to promote the benefits, similar to PepsiCo's labeling initiative last year.\n3. The largest US food maker will also add a label to its more calorie-heavy products to promote the benefits.\n4. Kraft's new advertising policy covers advertising on TV, radio, and in print publications for children between the ages of six and 11.\n5. Advertisements for some of Kraft's most famous snacks and cereals will be replaced by food and drink qualifying for Kraft's \"Sensible Solution\" label.\n6. Kraft is working on ways to encourage both adults and children to eat wisely by selecting more nutritionally balanced diets, similar to PepsiCo's labeling initiative last year.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize the given text into a concise summary. Let me read through it first.\n\nThe text is about Kraft, a major food manufacturer, focusing on cutting back on their advertising for certain products. They want to promote healthy eating by changing their labels and ads targeting children under 11. \n\nThey're taking Oreo cookies and sugary drinks like Kool-Aid off their ads. The plan includes adding nutritionally labeled products to Kraft's label as well, similar to PepsiCo who did something last year.\n\nThere are concerns about the rise in obesity among US children, which might be making this effort challenging. Also, recent food manufacturers have been rebranding calorie-heavy products.\n\nKraft's new ad policy targets 6-11-year-olds with a new label \"Sensible Solution.\" They'll replace ads of famous snacks like Oreo and Kool-Aid in early cartoons on TV with healthier options now. But they'll still show all products to parents, including family audiences.\n\nThey mention encouraging healthy eating by promoting better diets. Lance Friedmann is their senior vice president making this effort.\n\nNow, I need to condense this into a summary without any extra info. I'll keep the key points: Kraft and PepsiCo are cutting back on ads for sugary or high-nutrition foods, adding healthier labels, targeting children 6-11, changing TV ads, and being cautious due to rising obesity.\n\nI should make sure it's clear and includes all these main ideas without getting too detailed. Also, no explanations, just plain text as per the instructions.\n</think>\n\nKraft cuts back on sugary and calorie-heavy product advertising for children under 11, promoting healthy eating by adding nutritionally labeled products to its labels. They're also replacing TV ads of famous snacks like Oreo with healthier alternatives. Like PepsiCo, Kraft began this initiative last year. Concerns about rising obesity in children are a factor. Kraft aims to show healthier foods to both parents and family members while encouraging balanced eating.", "tinyllama:1.1b": "Kraft plans to eliminate ads for high-calorie snacks and sugary drinks in order to promote healthy eating habits among children. The giant food manufacturer is beginning a labeling initiative for its low-calorie brands, including the removal of calorie labels from some of its products targeted at children between the ages of six and 11. Kraft's new advertising policy will cover TV, radio, and print publications aimed specifically at young consumers and aiming to encourage them to eat wisely. Despite facing criticism over obesity in American children, major food manufacturers have been reformulating calorie-heavy products with a focus on healthier options for the younger demographic.", "tinydolphin:1.1b": " Kraft is planning to reduce the promotion of snacks like Oreos, sugary Kool-Aid drinks, and other high-calorie items in its ads for children aged six to ten years. In an effort to promote healthy eating habits among families, the company will introduce a new label to help consumers identify products with lower levels of fat and calories. This initiative comes after PepsiCo began implementing similar changes last year, leading to criticism from some groups concerned about rising obesity rates in the US children. Kraft's new advertising policy includes a focus on targeting children aged six to ten years.", "phi:2.7b": " Kraft plans to reduce advertising of unhealthy snack products targeted at children aged 6-11, while adding labels to promote healthier options in their more nutritional and low-fat brands. This comes as major food manufacturers reformulate their calorie-heavy products due to rising levels of obesity among US children. Kraft will replace some early morning cartoon shows with food and drink qualifying for its new \"Sensible Solution\" label, but will still advertise all its products to both adults and families.\n", "orca-mini:3b": " Kraft will stop advertising some of their products like Oreo cookies and sugary Kool-Aid drinks as part of an effort to promote healthier eating. They will also add a label to their more nutritional and low-fat brands to promote the benefits. This comes after criticism from consumer groups concerned at rising levels of obesity in US children. Kraft's new advertising policy covers advertising on TV, radio, and in print publications and is aimed at children between the ages of six and 11.", "hermes3:3b": "Kraft reduces kids snack ads, promotes healthy eating with label changes.", "stablelm-zephyr:3b": "Kraft Foods is reducing advertising for children's snacks such as Oreo cookies and sugary drinks like Kool-Aid as part of a move towards promoting healthier eating. The company will add a label to its more nutritious and low-fat ranges to highlight the benefits. This initiative follows similar moves by PepsiCo last year, amid growing concerns from consumer groups about obesity levels among US children. Commercials for some well-known snacks and cereals during early morning cartoon shows on TV will be replaced by food and drink qualifying for Kraft's new \"Sensible Solution\" label. However, the company said it would continue to advertise all its products in media viewed by parents and \"all family\" audiences.", "chatgpt-4o-latest": "Kraft is reducing advertising for products like Oreo cookies and Kool-Aid to promote healthier eating. The company will introduce a \"Sensible Solution\" label for its more nutritious products, following a similar move by PepsiCo. This decision comes amid concerns over rising childhood obesity. Kraft's new policy targets children aged six to 11, replacing ads for high-calorie snacks during kids' TV shows with promotions for healthier options. However, the company will continue advertising all products in media aimed at parents and families. Kraft aims to encourage balanced diets for both adults and children.", "stablelm2:1.6b": "Kraft is reducing snack ad targeting for children as part of promoting healthier eating habits. They will add a label to their nutritious brands to inform consumers about benefits. This follows similar initiatives from PepsiCo. Obese US children face criticism from consumer groups. Major food manufacturers are altering calorie-heavy products' content. Kraft's new advertising policy, covering TV, radio, and print publications, aims to replace snack ads with healthier options approved by the \"Sensible Solution\" label. They will still advertise all products in family-oriented media.", "granite3.1-dense:2b": "Kraft, the largest US food producer, announces a new advertising strategy targeting children aged six to eleven, reducing commercials for high-calorie snacks like Oreos and sugary Kool-Aid on TV during cartoons. These ads will be replaced with those promoting Kraft's \"Sensible Solution\" brands, which are lower in fat and calories. The move aligns with industry efforts to combat childhood obesity and follows similar initiatives by competitor PepsiCo. Despite this, Kraft will still advertise all products to parents and family audiences. Lance Friedmann, a senior vice president at Kraft, emphasizes the company's commitment to encouraging both children and adults to adopt healthier diets through more nutritionally balanced choices.", "reference": "Kraft plans to cut back on advertising of products like Oreo cookies and sugary Kool-Aid drinks as part of an effort to promote healthy eating.It means commercials for some of its most famous snacks and cereals shown during early morning cartoon shows on TV will now be replaced by food and drink qualifying for Kraft's new \"Sensible Solution\" label.The largest US food maker will also add a label to its more nutritional and low-fat brands to promote the benefits.Kraft's new advertising policy, which covers advertising on TV, radio and in print publications, is aimed at children between the ages of six and 11."}