{"raw_text": "Executive trio leave Aer Lingus\n \n Three senior executives of Ireland's state-owned airline, Aer Lingus, are set to leave early on 28 January after accusations of a conflict of interest.\n \n The trio are chief executive Willie Walsh, chief financial officer Brian Dunne and chief operations officer Seamus Kearney. The three have refused to confirm reports they plan to launch a private airline in competition with Aer Lingus. They announced in November they would quit in May, but did not give a reason. That decision had followed an announcement by Irish Prime Minister Bertie Ahern - who is still considering the future of the airline - which ruled out a proposed management buy-out of Aer Lingus. Mr Walsh denied they had been forced out early because of the reports claiming they were set to launch a competitor airline.\n \n \"What I do after I leave Aer Lingus is still too early to say,\" Mr Walsh told AP news agency on Wednesday. \"I have opportunities open to me. Brian and Seamus are in the equally fortunate position.\" He said he had received more than 40 business proposals, mostly aviation-related, since the trio announced their resignations two months ago. Mr Walsh said there was no conflict of interest, and, if he was to launch a rival airline or join an existing competitor, \"this thing happens in every business\". \"There's absolutely no question of a conflict of interest. I've been completely focused on my responsibilities at Aer Lingus,\" he told AP.\n \n This week opposition politicians had called on the Irish government to make an urgent decision on the future of the airline. On Wednesday Irish Transport Minister Martin Cullen said in a statement: \"A conflict of interest cannot, should not and will not be allowed to arise between their current roles at Aer Lingus and their future career intentions.\" Last Friday the minister had announced he was to advertise for three senior executives for Aer Lingus. Mr Walsh, who took charge in 2000, and his team have earned praise for turning Aer Lingus around, by cutting air fares and staff, and re-positioning it as a low-fare airline to rival Ryanair. The company is 85% owned by the government and 15% by its staff.\n", "llama3.2:1b": "Three senior executives of Ireland's state-owned airline Aer Lingus - CEO Willie Walsh, CFO Brian Dunne, and COO Seamus Kearney - are leaving early on January 28 after accusations of a conflict of interest. They refused to confirm plans to launch a private airline in competition with Aer Lingus.", "llama3.2:3b": "Three senior executives of Aer Lingus, Willie Walsh, Brian Dunne, and Seamus Kearney, are leaving early due to accusations of conflict of interest. They had announced their resignations in November but refused to confirm reports of launching a private airline. Minister Martin Cullen said there could not be a conflict of interest between current roles and future career intentions. The trio has received business proposals since announcing their resignation.", "gemma2:2b": "Three executives from Aer Lingus are leaving on January 28th.  They have been accused of potential conflict of interest regarding their future plans, including launching a competing airline. The trio deny any wrongdoing and say they received numerous business proposals since announcing their departure in May. \nIrish Transport Minister has pledged to appoint three senior executives for Aer Lingus, despite the conflict of interest allegations.  The Irish government is also considering the future of the airline. \n", "qwen2.5:0.5b": "The executive trio of chief executives Willie Walsh, Brian Dunne, and Seamus Kearney at Aer Lingus have left their positions early due to allegations of a conflict of interest. They announced in November that they would quit in May but declined to give an official reason for the change. The three are considering launching a private airline competition with Ryanair, which has already ruled out management buyouts and threatened to terminate their contracts.", "qwen2.5:1.5b": "Three Aer Lingus executives will leave early due to accusations of a conflict of interest. They announced their intention to quit in May but haven't given a reason. The decision was made following an announcement by Irish Prime Minister Bertie Ahern, who is considering the airline's future. Walsh denies being forced out; he received over 40 business proposals since his resignation announcement two months ago.", "qwen2.5:3b": "Three senior executives of Ireland's state-owned airline, Aer Lingus—Willie Walsh, Brian Dunne, and Seamus Kearney—are set to leave early on January 28th after facing accusations of a conflict of interest in planning a competitor airline. Initially scheduled to quit in May, they announced their resignation two months ago following Bertie Ahern's ruling against a management buyout. Despite denying forced early departure due to potential rival plans, Walsh indicated he has received over forty business proposals, including aviation-related opportunities. He insists there is no conflict of interest and maintains his focus on Aer Lingus responsibilities despite future career intentions. Last Friday, Irish Transport Minister Martin Cullen announced plans to advertise for three senior executives at Aer Lingus amid growing calls for an urgent government decision on the airline's future. The trio has been praised for turning Aer Lingus around through cost-cutting and repositioning as a low-cost carrier to compete with Ryanair.", "opencoder:1.5b": "Executive trio leave Aer Lingus\n\nThree senior executives of Ireland's state-owned airline, Aer Lingus, are set to leave early on 28 January after accusations of a conflict of interest.\n\nThe three have refused to confirm reports they plan to launch a private airline in competition with Aer Lingus. They announced in November they would quit in May, but did not give a reason. That decision had followed an announcement by Irish Prime Minister Bertie Ahern - who is still considering the future of the airline - which ruled out a proposed management buy-out of Aer Lingus.\n\nMr Walsh denied they had been forced out early because of the reports claiming they were set to launch a competitor airline. \"What I do after I leave Aer Lingus is still too early to say,\" Mr Walsh told AP news agency on Wednesday. I have opportunities open to me. Brian and Seamus are in the equally fortunate position. Mr Wal has received more than 40 business proposals, mostly aviation-related, since the trio announced their resignations two months ago. They said there was no conflict of interest, and, if he was to launch a rival airline or join an existing competitor, \"this thing happens in every business\". There's absolutely no question of a conflict of interests.\n\nThis week opposition politicians had called on the Irish government to make an urgent decision on the future of the airline. On Wednesday, Irish Transport Minister Martin Cullen said in a statement: \"A conflict of interest cannot, should not and will not be allowed to arise between their current roles at Aer Lingus and their future career intentions.\" Last Friday, the minister had announced he was to advertise for three senior executives for Aer Lingus. Mr Walsh, who took charge in 2,000, and his team have earned praise for turning Aer Lingus around, by cutting air fares and staff, and re-positioning it as a low-fare airline to rival Ryanair. The company is 85% owned by the government and 15% by its staff.\n", "smollm:1.7b": "The summary should be:\nThree senior executives of Ireland's state-owned airline, Aer Lingus, are set to leave early on 28 January after accusations of a conflict of interest. The trio are chief executive Willie Walsh, chief financial officer Brian Dunne and chief operations officer Seamus Kearney. They announced in November they would launch a private airline in competition with Aer Lingus but did not give a reason. That decision had followed an announcement by Irish Prime Minister Bertie Ahern - who is still considering the future of the airline - which ruled out a proposed management buy-out of Aer Lingus. Mr Walsh denied he was forced out early because of the reports claiming they were set to launch a competitor airline. What I do after I leave Aer Lingus is still too early to say, but I have received more than 40 business proposals, mostly aviation-related, since the trio announced their resignations two months ago. There is no conflict of interest, and if I was to launch a rival airline or join an existing competitor, this thing happens in every business. There's absolutely no question of a conflict of interest. I've been completely focused on my responsibilities at Aer Lingus. The Irish government has called for urgent action on the future of the airline. On Wednesday, Martin Cullen announced he was to advertise for three senior executives for Aer Lingus. Mr Walsh, who took charge in 2000, and his team have earned praise for turning Aer Lingus around, by cutting air fares and staff, and re-positioning it as a low-fare airline to rival Ryanair. The company is 85% owned by the government and 15% by its staff.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about Aer Lingus's CEO leaving. Let me read through it carefully.\n\nFirst, there are three senior executives: Willie Walsh as Chief Executive, Brian Dunne as CFO, and Seamus Kearney as COO. They left on January 28 after accusations of conflict of interest. They confirmed their decision in November but didn't specify the reason.\n\nMr. Walsh said he had more than 40 business proposals since they resigned two months ago. He mentioned no conflict of interest and that competition is common in business, so he plans to stay with Aer Lingus or start a rival airline.\n\nThe opposition called for immediate action from the government regarding the airline's future. They're concerned about conflicts, even if it's just between their current roles. Mr. Walsh is known for turning Aer Lingus around by cutting fares and repositioning it as Ryanair.\n\nSo, I need to capture the key points: three executives leave on Jan 28 due to conflict, confirmed in November, no immediate reason except a proposed buy-out ruled out. They've had enough business proposals since their departure. The government is against conflicts of interest but wants an action plan. No conflict of interest because of past actions.\n</think>\n\nThe executive trio of Aer Lingus, comprising Chief Executive Willie Walsh, Chief Financial Officer Brian Dunne, and Chief Operations Officer Seamus Kearney, have announced their resignation as soon as January 28 after accusations of a conflict of interest. They confirmed their decision in November but did not specify the reason for their early departure. Since their leaving two months ago, Mr. Walsh has received over 40 business proposals related to his role at Aer Lingus. He emphasized that there is no conflict of interest and expressed confidence in managing the company. The government's actions on Aer Lingus are seen as necessary given the context of a potential buy-out proposal.", "tinyllama:1.1b": "Executive trio of Ireland's state-owned airline Aer Lingus have announced plans to leave early after accusations of a conflict of interest. Chief executive Willie Walsh, chief financial officer Brian Dunne and chief operations officer Seamus Kearney are set to launch a private airline in competition with the company, despite refusals from three senior executives to confirm reports of their planned buy-out by the Irish Prime Minister Bertie Ahern. Despite initial statements of \"not wanting to leave\" the trio has stated that they will still work for Aer Lingus after leaving their current positions, and have received more than 40 business proposals since their announcement resignations two months ago. Despite a potential conflict of interest, opposition politician's urged for an urgent decision on Aer Lingus' future by the Irish government. The trio was praised for turning Aer Lingus around and reducing air fares and staff to compete with Ryanair, but the company has been 85% owned by the government and 15% by its staff since its founding in 2000.", "tinydolphin:1.1b": " The executive trio of Aer Lingus, who are set to leave the Irish state-owned airline amid allegations of conflict of interest, have not confirmed they will be launching a private airline or joining an existing competitor. However, opposition politicians are calling for an urgent decision on the future of Aer Lingus and have expressed concerns about potential conflicts of interest between their current roles and potential future career plans. The minister in charge of Aer Lingus, Martin Cullen, has announced that he will be advertising for three senior executives to replace the trio.", "phi:2.7b": " Three senior executives of Ireland's state-owned airline, Aer Lingus - chief executive Willie Walsh, chief financial officer Brian Dunne, and chief operations officer Seamus Kearney - are leaving early on 28 January after accusations of a conflict of interest. The trio refused to confirm reports they plan to launch a private airline in competition with Aer Lingus. They announced their resignations in November but did not give a reason. Mr Walsh denied the claims that they were forced out early and said he had received more than 40 business proposals since announcing his resignation. Irish Transport Minister Martin Cullen has called for an urgent decision on the future of the airline, as opposition politicians have accused the government of allowing this conflict of interest to arise between their roles at Aer Lingus and their future career intentions. Mr Walsh has earned praise for turning Aer Lingus around by cutting air fares and staff, and re-positioning it as a low-fare airline to rival Ryanair.\n", "orca-mini:3b": " Three senior executives of Ireland's state-owned airline, Aer Lingus, are set to leave early on 28 January after accusations of a conflict of interest. Willie Walsh, Brian Dunne, and Seamus Kearney announced in November they would quit in May, but did not give a reason. The trio have refused to confirm reports they plan to launch a private airline in competition with Aer Lingus. They announced in November they would quit in May, but did not give a reason. Irish Prime Minister Bertie Ahern is considering the future of the airline and ruled out a proposed management buy-out of Aer Lingus. Mr Walsh denied they had been forced out early because of the reports claiming they were set to launch a competitor airline.", "hermes3:3b": "Aer Lingus executives leaving:\n- Chief Executive Willie Walsh\n- CFO Brian Dunne\n- COO Seamus Kearney\nLeaving on Jan 28 after conflict of interest accusations, despite denying plans to start rival airline.", "stablelm-zephyr:3b": "Three top executives of Ireland's state-owned airline, Aer Lingus, are leaving the company early due to accusations of a conflict of interest. Chief executive Willie Walsh, chief financial officer Brian Dunne, and chief operations officer Seamus Kearney have not confirmed if they plan to start a private airline competing with Aer Lingus. They announced their resignations in November but did not specify the reason. Despite calls for an urgent decision on the future of the airline by opposition politicians, Walsh has denied being forced out early or having a conflict of interest.", "chatgpt-4o-latest": "Three senior executives of Aer Lingus—CEO Willie Walsh, CFO Brian Dunne, and COO Seamus Kearney—are leaving early on 28 January amid conflict of interest accusations. They had announced their resignations for May without explanation, following the Irish government's rejection of a management buyout. Reports suggest they may start a rival airline, but Walsh denies any conflict of interest, stating he has multiple business opportunities. Irish Transport Minister Martin Cullen emphasized that conflicts of interest would not be tolerated. Walsh and his team have been credited with transforming Aer Lingus into a low-fare competitor to Ryanair. The airline is 85% government-owned and 15% staff-owned.", "stablelm2:1.6b": "Three senior executives from Aer Lingus, Willie Walsh, Brian Dunne, and Seamus Kearney, are set to leave on January 1st due to allegations of a conflict of interest. They have refused to confirm reports that they plan to launch a private airline in competition with the company. The trio announced their resignations in November but did not give a reason. Irish Prime Minister Bertie Ahern ruled out a proposed management buy-out of Aer Lingus, and Mr. Walsh denied being forced out due to these rumors. Mr. Walsh received more than 10 business proposals, mostly aviation-related, since his resignation announcement two months ago. There is no evidence of a conflict of interest, and Mr. Walsh remains focused on his responsibilities at Aer Lingus. Opposition politicians have called for an urgent decision regarding the airline's future, while Irish Transport Minister Martin Cullen has stated that any conflict of interest will not occur between their current roles and future career intentions.", "granite3.1-dense:2b": "Three key executives of Ireland's state-owned airline, Aer Lingus—Willie Walsh (CEO), Brian Dunne (CFO), and Seamus Kearney (COO)—are scheduled to depart early on January 28. They have not confirmed reports suggesting they aim to launch a private rival airline. Initially planning to retire in May, their resignations were accelerated due to these allegations, following Irish Prime Minister Bertie Ahern's decision against a proposed management buy-out of Aer Lingus.\n\nWalsh denied any conflict of interest and stated he has received numerous business proposals since announcing his departure. He emphasized that their current roles at Aer Lingus do not preclude future career choices, similar to any other professional. Irish Transport Minister Martin Cullen reiterated the government's stance against allowing a conflict of interest between their current and potential future positions.\n\nWalsh led Aer Lingus since 2000, transforming it into a low-fare airline to compete with Ryanair. The company is majority-owned by the Irish government (85%) and its staff (15%). Opposition politicians have urged swift government action regarding Aer Lingus' future.", "reference": "Three senior executives of Ireland's state-owned airline, Aer Lingus, are set to leave early on 28 January after accusations of a conflict of interest.Last Friday the minister had announced he was to advertise for three senior executives for Aer Lingus.\"What I do after I leave Aer Lingus is still too early to say,\" Mr Walsh told AP news agency on Wednesday.The three have refused to confirm reports they plan to launch a private airline in competition with Aer Lingus.Mr Walsh said there was no conflict of interest, and, if he was to launch a rival airline or join an existing competitor, \"this thing happens in every business\".Mr Walsh, who took charge in 2000, and his team have earned praise for turning Aer Lingus around, by cutting air fares and staff, and re-positioning it as a low-fare airline to rival Ryanair.On Wednesday Irish Transport Minister Martin Cullen said in a statement: \"A conflict of interest cannot, should not and will not be allowed to arise between their current roles at Aer Lingus and their future career intentions.\"That decision had followed an announcement by Irish Prime Minister Bertie Ahern - who is still considering the future of the airline - which ruled out a proposed management buy-out of Aer Lingus."}