{"raw_text": "US in EU tariff chaos trade row\n \n The US has asked the World Trade Organisation to investigate European Union customs tariffs, which it says are inconsistent and hamper trade.\n \n The EU's own institutions have noted the uneven way EU customs rules are applied but failed to act, the US Trade Representative's Office said. Small and mid-sized US firms were worst-hit, it added. The EU expanded from 15 to 25 member states in May. The US said it filed the complaint after talks failed to find a solution.\n \n The move came in the same week that the US and EU stepped back from confrontation in a tense dispute over aircraft subsidies to European manufacturer Airbus and US firm Boeing. New EU trade commissioner Peter Mandelson said on Tuesday that the two sides had agreed to reopen talks in the aircraft subsidies row, which led to tit-for-tat WTO filings in last autumn.\n \n Explaining why it has asked the WTO to set up a dispute settlement panel on customs barriers, the US Trade Representative's Office said that it wants to tackle the issue \"early in the EU's process of dealing with the problems of enlargement\". Ten countries, mostly in Eastern Europe, joined the EU in May. The US said its trade with the 25 EU member countries was worth $155.2bn (£82.8bn) in 2003. \"Although the EU is a customs union, there is no single EU customs administration,\" a statement issued on behalf of Robert Zoellick, US Trade Representative, said. Lack of uniformity, coupled with lack of procedures for prompt EU-wide review can hinder US exports, especially for small to mid-sized businesses\", An EU spokesman in Washington dismissed the US complaint. \"We think the US case is very weak. They haven't come up with any evidence that US companies are being harmed,\" said Anthony Gooch. It could take several months for the WTO's dispute settlement panel to report its findings.\n", "llama3.2:1b": "The US has asked the World Trade Organisation (WTO) to investigate EU customs tariffs, citing inconsistencies and harming trade. The US claims small and mid-sized firms have been worst-hit, while the EU disputes this, saying there is no single EU customs administration. The US Trade Representative's Office filed the complaint after talks failed to find a solution. Meanwhile, the US and EU have agreed to reopen talks on aircraft subsidies following their previous confrontation over the issue.", "llama3.2:3b": "The US has asked the World Trade Organisation to investigate European Union customs tariffs, which it says are inconsistent and hinder trade, particularly affecting small and mid-sized US firms. The move comes after talks failed to find a solution and as the EU expands with new member states.", "gemma2:2b": "The US filed a complaint with the World Trade Organisation against EU customs tariffs, alleging inconsistency and harm to trade. The complaint cites uneven application of EU rules and their impact on small businesses. This follows stalled negotiations on aircraft subsidies between the US and EU. \n", "qwen2.5:0.5b": "US and EU tariffs have caused trade row. The US complained to the World Trade Organisation, which set up a dispute settlement panel to resolve the issue early in the EU's process of dealing with customs union problems.", "qwen2.5:1.5b": "The US has asked the World Trade Organization (WTO) to investigate EU customs tariffs, citing inconsistency and hindering trade. The EU is expanding from 15 to 25 member states since May, with small and mid-sized US firms being particularly affected. The US claims this issue emerged after negotiations over Airbus subsidies failed last autumn, prompting WTO filings in October. The EU dismisses the complaint, arguing that evidence shows no harm to US businesses. This marks a change of tone from earlier confrontations between the two nations regarding aircraft subsidies disputes.", "qwen2.5:3b": "US has asked WTO to investigate EU customs tariffs, claiming they hinder trade and apply unevenly. Small and mid-sized US firms were impacted. The EU expanded in May from 15 to 25 members; talks with US over Airbus/Boeing subsidies stalled earlier this year. US seeks early resolution as ten new Eastern European countries joined the EU in May. US-25 EU trade valued at $155.2bn in 2003. WTO dispute panel may take months to report findings, citing lack of uniformity and EU-wide review procedures hindering US exports. EU spokesman disputes US complaint, stating no evidence of harm to US companies.", "opencoder:1.5b": "The US in EU tariff chaos trade row involves examining EU customs rules and their application inconsistencies, which may impact trade operations. The main issue is that while the EU has agreed to step back from discussions over aircraft subsidies, it hasn't fully resolved them yet. US Trade Representative's Office asked World Trade Organisation (WTO) to set up a dispute settlement panel on customs barriers. It also wants to tackle the issue \"early in the EU's process of dealing with the problems of enlargement\". The US has reported a high stake in exporting goods, especially for small and mid-sized businesses, but it could face several months delay in finding full evidence.\n", "smollm:1.7b": "The summary should be: The US has asked the World Trade Organisation to investigate European Union customs tariffs, which it says are inconsistent and hamper trade. The EU's own institutions have noted the uneven way EU customs rules are applied but failed to act, the US Trade Representative's Office said. Small and mid-sized US firms were worst-hit, it added. The EU expanded from 15 to 25 member states in May. The US said it filed the complaint after talks failed to find a solution. The move came in the same week that the US and EU stepped back from confrontation in a tense dispute over aircraft subsidies to European manufacturer Airbus and US firm Boeing. New EU trade commissioner Peter Mandelson said on Tuesday that the two sides had agreed to reopen talks in the aircraft subsidies row, which led to tit-for-tat WTO filings in last autumn.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text as per the user's instructions. Let me read through it carefully.\n\nThe main points seem to be about a trade dispute between the US and the EU regarding tariffs on customs in their joint markets. The US is asking the WTO to investigate these tariffs. They claim they're inconsistent and hamper trade.\n\nI notice that the EU expanded from 15 to 25 member states in May, which might affect their ability to enforce their customs rules uniformly. Small and mid-sized firms are hit more by this. The US Trade Representative's Office said this was the first time they've filed a complaint against the WTO on customs barriers.\n\nThere's also mention of a recent dispute over aircraft subsidies between the EU and the US, which led them back into a tension. They agreed to reopen talks in that area as part of their efforts to resolve it.\n\nThe US is hoping to address this early in EU integration by tackling enlargement issues. Their trade figures are mentioned too; they've been trading $155 billion worth with the EU's 25 member countries.\n\nI should keep everything concise, focusing on key points without extra details. Make sure to mention the WTO inquiry and the EU's expansion impact.\n</think>\n\nThe US has formally asked the World Trade Organisation (WTO) to investigate customs tariffs imposed by the European Union in their joint markets, calling them inconsistent and hampering trade. The EU expanded from 15 to 25 member states in May, which could hinder uniform enforcement of customs rules. Small and mid-sized US firms face greater damage due to uneven EU customs rule applications. The US Trade Representative's Office noted this as the first complaint filed against the WTO on customs barriers. In a tense dispute over aircraft subsidies, the US and EU agreed to reopen talks in the subsidies row, leading to tit-for-tat WTO filings. The US trade with the 25 EU member countries was valued at $155.2 billion in 2003. The EU has established that the US case is weak, citing no evidence of harm. The US hopes this early intervention helps address enlargement-related issues as EU and US tensions deepen.", "tinyllama:1.1b": "The US has asked the World Trade Organization (WTO) to investigate European Union (EU) customs tariffs, which it says are inconsistent and hamper trade. Small and mid-size US firms have been worst-hit in a dispute over aircraft subsidiaries to European manufacturer Airbus and US firm Boeing. The EU expanded its membership to 25 member states in May, but talks failed to find a solution, leading to tit-for-tat WTO filings between the sides. A new EU trade commissioner, Peter Mandelson, said that the two sides had agreed to reopen talks on customs barriers, which led to the US filing a dispute settlement panel request with the WTO. The US Trade Representacive's Office explained that it wanted to tackle the issue \"early in the EU's process of dealing with problems caused by enlargement\". Ten countries, mostly Eastern Europe, joined the EU in May. The US trade with the 25 EU member countries was worth $155.2bn in 2003, and there is no single EU customs administration. Despite lacking uniformity, the EU's shortcomings can harm smaller US firms. The EU spokeman dismissed the US complaint as weak. It could take several months for the WTO panel to report its finding.", "tinydolphin:1.1b": " The US has filed a complaint with the World Trade Organisation (WTO) to investigate how the European Union's customs tariffs are applied, which it claims is inconsistent and hampers trade between the two organizations. Small and mid-sized US firms have been worst-hit, according to the US Trade Representative's Office. This dispute has taken place against the backdrop of ongoing negotiations concerning aircraft subsidies to European manufacturer Airbus and US firm Boeing. The move by the US comes amidst a series of tense trade disputes between the two nations.", "phi:2.7b": " The United States (US) has asked the World Trade Organization (WTO) to investigate European Union customs tariffs, which they believe are inconsistent and hinder trade. The US's request came after talks failed to find a solution, affecting small and mid-sized US firms more than others. The EU had expanded from 15 to 25 member states in May, but their own institutions failed to address the issue of uneven application of EU customs rules. However, the US and EU have recently stepped back from confrontation over aircraft subsidies for European manufacturer Airbus and US firm Boeing. The US has filed a complaint because they want to tackle this issue early in the EU's process of dealing with the problems of enlargement. Ten countries, mostly in Eastern Europe, joined the EU in May, and the US is concerned that their trade with the \n25 member countries was worth $155.2bn (£82.8bn) in 2003. The European Union spokesperson in Washington has dismissed the US complaint, calling it weak, as there is no evidence that US companies are being harmed by the EU's customs tariffs. However, if the WTO does find that the EU's customs tariffs are inconsistent and hampering trade, this could take several months for the WTO's dispute settlement panel to report its findings.\n", "orca-mini:3b": " The US filed a complaint with the World Trade Organization (WTO) over EU customs tariffs, saying they were inconsistent and hampered trade. The US claims that small and mid-sized US firms were worst-hit by the EU's customs rules. The US cited the uneven way EU customs rules are applied, especially in Eastern Europe, where ten countries joined the EU in May. The EU disputes the US claims, saying that it is a customs union with no single EU customs administration. The US Trade Representative's Office noted that lack of uniformity and lack of procedures for prompt EU-wide review can hinder US exports, especially for small to mid-sized businesses.", "hermes3:3b": "US requests WTO investigation into EU customs tariffs, claiming they hinder trade for small to mid-sized US firms, despite uneven application within EU.", "stablelm-zephyr:3b": "The US has asked the World Trade Organisation (WTO) to investigate European Union customs tariffs, claiming they are inconsistent and harm trade. The US Trade Representative's Office stated that small and mid-sized American firms were most affected, with no uniformity in EU customs rules and lack of procedures for prompt review hindering exports. Despite the complaint, an EU spokesman dismissed the issue as weak, emphasizing that there was no evidence of harm to US companies.", "chatgpt-4o-latest": "The US has requested the WTO to investigate EU customs tariffs, claiming they are inconsistent and hinder trade, particularly for small and mid-sized US firms. The EU has acknowledged uneven customs rule enforcement but has not acted. The complaint follows failed negotiations and coincides with efforts to ease tensions over aircraft subsidies between the US and EU. The US argues that the EU's lack of a unified customs administration and review procedures obstructs trade, especially after the EU's expansion to 25 members. The EU dismissed the complaint as weak, and the WTO panel's findings may take months.", "stablelm2:1.6b": "The US has requested the World Trade Organisation (WTO) investigate European Union (EU) customs tariffs, claiming they're inconsistent and hinder trade. The US argues that small and mid-sized US firms are most affected by these tariffs. This follows talks that failed to find a solution for similar issues. Meanwhile, during a tense trade dispute over aircraft subsidies between the US and EU, the two sides agreed to reopen their talks. The US has submitted a complaint to WTO about uneven application of customs rules after enlargement of the EU. However, an EU spokesman claims there is no single EU-wide customs administration which could hinder US exports, particularly for small to mid-sized businesses. It will likely take several months for the WTO's dispute settlement panel to report their findings.", "granite3.1-dense:2b": "The US has formally requested the World Trade Organisation (WTO) to investigate EU customs tariffs, arguing they are inconsistent and impede trade. This request follows unsuccessful efforts to resolve the issue through direct talks between the two parties. The US claims that small and mid-sized US firms have been most affected by these tariffs, which the EU expands under its 25 member states, including those from Eastern Europe that joined in May 2004. The US Trade Representative's Office asserts this action aims to address customs barriers early during the EU's process of managing enlargement, as trade between the US and 25-member EU was valued at $155.2 billion in 2003.\n\nThe EU dismisses the US complaint, stating it lacks evidence that US companies are harmed by these tariffs. The EU points out that, despite being a customs union, there is no single EU customs administration, and existing procedures for prompt review on a pan-EU level have not been effective in preventing export hindrances, particularly for small and mid-sized businesses. The WTO's dispute settlement panel will likely take several months to render its findings on this matter.\n\nThis development comes shortly after the US and EU temporarily de-escalated tensions over aircraft subsidies involving Airbus and Boeing, with both sides agreeing to reinitiate discussions on the issue.", "reference": "\"Although the EU is a customs union, there is no single EU customs administration,\" a statement issued on behalf of Robert Zoellick, US Trade Representative, said.The EU's own institutions have noted the uneven way EU customs rules are applied but failed to act, the US Trade Representative's Office said.The US said its trade with the 25 EU member countries was worth $155.2bn (£82.8bn) in 2003.The move came in the same week that the US and EU stepped back from confrontation in a tense dispute over aircraft subsidies to European manufacturer Airbus and US firm Boeing.Explaining why it has asked the WTO to set up a dispute settlement panel on customs barriers, the US Trade Representative's Office said that it wants to tackle the issue \"early in the EU's process of dealing with the problems of enlargement\".Lack of uniformity, coupled with lack of procedures for prompt EU-wide review can hinder US exports, especially for small to mid-sized businesses\", An EU spokesman in Washington dismissed the US complaint."}