{"raw_text": "Wal-Mart fights back at accusers\n \n Two big US names have launched advertising campaigns to \"set the record straight\" about their products and corporate behaviour.\n \n The world's biggest retailer Wal-Mart took out more than 100 full page adverts in national newspapers. The group is trying to see off criticism over it pay deals, benefits package and promotion strategy. Meanwhile, drugs group Eli Lilly is planning a campaign against \"false\" claims about its product Prozac. Wal-Mart kicked off the battle with adverts in newspapers like the Wall Street Journal, using an open letter from company president Lee Scott saying it was time for the public to hear the \"unfiltered truth\".\n \n \"There are lots of 'urban legends' going around these days about Wal-Mart, but facts are facts. Wal-Mart is good for consumers, good for communities and good for the US economy,\" Mr Scott said in a separate statement.\n \n Its adverts - and a new website - outlined the group's plans to create more than 10,000 US jobs in 2005. Wal-Mart's average pay is almost twice the national minimum wage of $5.15 (£3.90) an hour, while employees are offered health and life insurance, company stock and a retirement plan, the adverts say. Unions accuse Wal-Mart of paying staff less than its rivals do, with fewer benefits. In California, the company is fighting opposition to new stores amid allegations it forces local competitors out of business. Lawmakers in the state are also examining allegations that the firm burdens the state with an unfair proportion of employee health care costs. \"I think they are going to have a tough time suddenly overcoming the perceptions of some people,\" said Larry Bevington, chairman of Save Our Community - a group fighting to prevent Wal-Mart opening a store in Rosemead, California. Wal-Mart is also fighting two lawsuits - one accusing it of discriminating against women and another alleging it discriminates against black employees.\n \n Meanwhile Eli Lilly is launching a series of adverts in a dozen major newspapers, to present what is says are the true facts about its anti-depressant drug Prozac.\n \n The move is in response to a British Medical Journal article that claimed \"missing\" Lilly documents linked Prozac to suicide and violent behaviour. In the averts, entitled An Open Letter from chief executive Sidney Taurel, the company says the article continues to \"needlessly spread fear among patients who take Prozac\". \"It was simply wrong to suggest that information on Prozac was missing, or that important research data on the benefits and possible side effects of the drug were not available to doctors and regulators,\" the letter added. Eli Lilly's chief medical officer Alan Breier said that the article was \"false and misleading\" as the documents it referred to were actually created by officials at the US Food and Drug Administration (FDA) and presented to an FDA meeting in 1991. Later, FDA medical advisors agreed the claims were based on faulty data and there was no increased risk of suicide.\n", "llama3.2:1b": "Wal-Mart has launched advertising campaigns to \"set the record straight\" about its products and corporate behavior, following criticism from accusers. The company's adverts include open letters from president Lee Scott in national newspapers. Eli Lilly is also launching a campaign against claims that Prozac is linked to suicide and violent behavior, which it says are false and misleading.", "llama3.2:3b": "Wal-Mart launched a full-page advertising campaign in national newspapers to counter criticism over its pay deals, benefits package, and promotion strategy. Eli Lilly is launching a similar campaign against \"false\" claims about its product Prozac, including allegations that it causes suicide and violent behavior, which the company disputes as based on faulty data.", "gemma2:2b": "Wal-Mart is launching ad campaigns to address accusations about its pay practices, benefits, promotion strategy, and potential impact on local businesses. They are emphasizing their commitment to creating jobs, offering competitive wages, and providing employees with health insurance, stock options, and retirement plans. Meanwhile, Eli Lilly is launching a counter-campaign to refute claims made in a British Medical Journal article that suggested the drug Prozac was linked to suicide and violent behavior. The company states the article is misleading and relies on faulty data from the FDA. \n", "qwen2.5:0.5b": "Wal-Mart launched adverts to set the record straight about its corporate behaviour and products, while Eli Lilly planned a campaign against \"false\" claims about its Prozac medication. Both companies accused each other of making misleading statements about their respective medications. Wal-Mart is attempting to create more jobs in California by launching an ad campaign, while Eli Lilly plans a new ads series targeting patients who take the Prozac medication.", "qwen2.5:1.5b": "Wal-Mart launched advertising campaigns to address criticism regarding pay deals, benefits packages, promotion strategies, and employment practices. In contrast, Eli Lilly aimed to dispel false claims about its drug Prozac. The efforts come as companies compete for public perception and market share in the retail and pharmaceutical industries.", "qwen2.5:3b": "Two big US companies, Wal-Mart and Eli Lilly, have launched advertising campaigns to combat criticisms about their pay deals, benefits package, promotion strategy, and product safety respectively. Wal-Mart's ads in national newspapers aim to counter accusations regarding its low wages, limited benefits, and unfair labor practices. The retailer emphasizes job creation plans, better employee benefits compared to rivals, and economic contributions. In contrast, Eli Lilly launched a campaign to address concerns about the antidepressant drug Prozac, highlighting their stance against unfounded claims linking it to suicide risks. Both companies are facing legal challenges including discrimination lawsuits and allegations of unfair healthcare costs in California.", "opencoder:1.5b": "Wal-Mart is fighting back against accusations about its products and corporate behaviour.\n\nThe world's biggest retailer is trying to see off criticism over it pay deals, benefits package and promotion strategy.\n\nFacts are facts, Wal-Mart is good for consumers, good for communities and good for the US economy. Its adverts outlined the group's plans to create more than 10,000 US jobs in 2005. The average pay is almost twice the national minimum wage of $5.15 (£3.90) an hour.\n\nThe state is fighting opposition to new stores amid accusations it forces local competitors out of business. Lenders are examining allegations that the firm burdens the state with an unfair proportion of employee health care costs. They're also investigating potential violations by black employees and women in the drug industry.\n\nMeanwhile, the article alleges \"missing\" Lilly documents linked Prozac to suicide and violent behaviour. The company says the article continues to \"needlessly spread fear among patients who take Prozac\". It was simply wrong to suggest that information on Prozac was missing or that important research data on the benefits and possible side effects of the drug were not available to doctors and regulators.\n", "smollm:1.7b": "Wal-Mart fights back at accusers", "deepseek-r1:1.5b": "<think>\nOkay, I need to help summarize this text about Wal-Mart and Eli Lilly's advertising campaigns against their corporate behavior. The user has given a detailed excerpt with several key points: Wal-Mart's advertising efforts aimed at addressing criticism over pay deals, benefits, and promotion strategy; Eli Lilly is promoting Prozac as the true medication despite some controversial claims; both companies have opposing ads to counter each other.\n\nFirst, I'll identify the main ideas. Wal-Mart is launching big advertisements in newspapers to correct their corporate practices, which they think others are criticizing. They're also aiming for a big job increase by 2005 and better benefits like health insurance and retirement plans. There's opposition from unions that feel they're being paid less than competitors.\n\nOn the other side, Eli Lilly is trying to get people to believe Prozac isn't dangerous or harmful. Their ads are meant to counter claims that they're missing important data linked to suicide or violence. The FDA said the documents were fake because they came from the FDA in 1991, and the FDA later agreed that the data wasn't up-to-date.\n\nI need to make sure I capture all these points concisely without adding any extra details. So, the summary should include Wal-Mart's advertising to correct corporate practices, their job increase plan, health benefits they're offering, unions' concerns about pay, Eli Lilly's opposing ads on Prozac, their claim documents being fake, and FDA stance.\n\nI should also note that both companies are fighting against each other in these campaigns. Maybe mention the specific locations where stores are opening? But the user didn't specify, so perhaps it's enough to refer to Rosemead for Save Our Community and other states.\n\nPutting it all together, I'll start with Wal-Mart, their ads, job increase, benefits, union concerns. Then move to Eli Lilly, their ads against Prozac, FDA claims being fake, and the FDA's response. Finally, mention both companies opposing each other.\n\nI should ensure that each summary is accurate and captures the key points without unnecessary details. Also, make sure there are no explanations or additional info, just plain text as requested.\n</think>\n\nWal-Mart has launched large advertising campaigns to correct its corporate practices, aiming to counter criticism from others over issues like pay deals, benefits, and promotion strategies. These ads, including an open letter from company president Lee Scott, highlight the good aspects of Wal-Mart's business model for consumers, communities, and the economy—more jobs created in 2005 and various benefits such as health insurance and retirement plans. Unions are concerned about lower pay compared to competitors.  \n\nMeanwhile, Eli Lilly is promoting Prozac, the official anti-depressant drug, in ads aimed at addressing claims linking it to missing medical research and potential negative effects. Their claims, based on fake documents from the FDA, suggest Prozac is ineffective or unsafe. The FDA later confirmed that these documents were created in 1991 by officials of the FDA and have since been widely criticized for containing faulty data.", "tinyllama:1.1b": "The world's biggest retailer Wal-Mart has launched advertisements in national newspapers to address criticism about its products and corporate behavior. In response, drug company Eli Lilly is launching a series of adverts in a dozen major newspapers to present the true facts about their anti-depressant Prozac. The move comes after a British Medical Journal article claimed \"missing\" Lilly documents linked Prozac to suicide and violent behaviour. Wal-Mart, in turn, claims that the article was simply \"wrong\" in referring to information on Prozac that was actually present in official documents. Eli Lilly's chief medical officer, Alan Breier, responded by stating that the article was \"false and misleading\" as it referred to documents created by officials at the US Food and Drug Administration and presented to an FDA meeting in 1991. Later, FDA medical advisors agreed that the claims based on faulty data were unsupported and there was no increased risk of suicide.", "tinydolphin:1.1b": " Wal-Mart is fighting back against accusations that it pays lower wages than its rivals while forcing local businesses to close. The company has put out full page adverts in newspapers across the US, highlighting the benefits of their products and the pay deals they offer. In addition to these public relations efforts, Wal-Mart is also launching a series of targeted advertisements in newspapers like the Wall Street Journal, aimed at countering false claims made by competitors. The company has also created a website to present the true facts about their products and employment practices. \n\nIn response to these accusations, Eli Lilly is launching similar adverts in a dozen major newspapers across the UK. The drug manufacturer claims that a British Medical Journal article contains false information about Prozac, suggesting that it causes suicide and violent behavior among its users. In a statement, Eli Lilly's chief executive officer, Sidney Taurel, said that the article needs to be \"re-examined\" to clear up any misunderstandings or misconceptions it may have caused. \n", "phi:2.7b": " The world's largest retailer Wal-Mart launched advertising campaigns in national newspapers to address criticisms about its pay deals, benefits package, and promotion strategy. They claimed their average pay is almost twice the national minimum wage and offer health insurance, company stock, and a retirement plan. Eli Lilly has also launched adverts in major newspapers to present the true facts about its anti-depressant drug Prozac after it was accused of being linked to suicide and violent behavior.\n", "orca-mini:3b": " Wal-Mart defends itself against accusations and launches advertising campaigns to set the record straight about its products and corporate behavior. The world's biggest retailer launched more than 100 full-page adverts in national newspapers, while drugs group Eli Lilly is planning a campaign against \"false\" claims about its product Prozac. Wal-Mart kicked off the battle with adverts in newspapers like the Wall Street Journal using an open letter from company president Lee Scott saying it was time for the public to hear the \"unfiltered truth\". The company plans to create more than 10,000 US jobs in 2005 and offers employees health and life insurance, company stock and a retirement plan. However, unions accuse Wal-Mart of paying staff less than its rivals do, with fewer benefits. In California, Wal-Mart is fighting opposition to new stores amidst allegations it forces local competitors out of business. The company is also fighting two lawsuits - one accusing it of discriminating against women and another alleging it discriminates against black employees. Eli Lilly is launching a series of adverts in a dozen major newspapers, to present what it says are the true facts about its anti-depressant drug Prozac. The article continues to \"missing\" Lilly documents linked Prozac to suicide and violent behavior.", "hermes3:3b": "Wal-Mart & Eli Lilly advertise to counter criticisms over pay deals, benefits, and product allegations.", "stablelm-zephyr:3b": "Wal-Mart and Eli Lilly have both launched advertising campaigns to counter criticism about their products and corporate behavior. Wal-Mart took out over 100 full page ads in national newspapers to address allegations surrounding its pay deals, benefits packages, and promotion strategy. The company's president, Lee Scott, said that \"facts are facts\" and highlighted the positives of Wal-Mart for consumers, communities, and the US economy. In response to a British Medical Journal article claiming Prozac was linked to suicide and violent behavior, Eli Lilly is launching a series of ads in major newspapers to present the true facts about its anti-depressant drug.", "chatgpt-4o-latest": "Wal-Mart and Eli Lilly have launched advertising campaigns to counter criticism. Wal-Mart placed over 100 full-page ads defending its wages, benefits, and job creation plans, arguing it is beneficial to consumers and the economy. Critics, including unions and lawmakers, accuse it of underpaying employees, offering fewer benefits, and burdening state healthcare systems. The company also faces lawsuits alleging discrimination. Meanwhile, Eli Lilly is responding to claims in the British Medical Journal that missing documents link Prozac to suicide and violence. The company insists the claims are false, stating the documents were FDA-created and that regulators found no increased suicide risk.", "stablelm2:1.6b": "Wal-Mart fights back against criticism with advertising campaigns defending its products, pay deals, benefits package, and promotion strategy. The company's ads also highlight job creation plans and its average wage policy. Meanwhile, Eli Lilly responds to false claims about its Prozac drug by launching a series of adverts in major newspapers, presenting the true facts about its product. This response follows a British Medical Journal article that suggested missing research data related to suicide and aggressive behavior with regards to Prozac.", "granite3.1-dense:2b": "Wal-Mart and Eli Lilly have launched advertising campaigns in major US newspapers to counter negative perceptions about their products and business practices. Wal-Mart, the world's largest retailer, aims to dispel myths regarding its compensation packages, benefits, and promotion strategies. The company claims it creates over 10,000 US jobs annually, pays employees nearly twice the minimum wage, offers comprehensive health insurance, stock options, and retirement plans. Unions argue Wal-Mart underpays and provides fewer benefits. Wal-Mart is also defending itself against lawsuits for alleged gender and racial discrimination in California.\n\nEli Lilly, the drug company behind Prozac, is responding to a British Medical Journal article that suggested missing documents linked Prozac to suicide and violence. In their advertisements, Eli Lilly's chief executive, Sidney Taurel, denies the claims as false and misleading. The company clarifies that the disputed data were actually from US FDA officials presented at an 1991 meeting. Later, FDA medical advisors agreed the article was based on flawed data, finding no increased risk of suicide with Prozac use.", "reference": "Meanwhile, drugs group Eli Lilly is planning a campaign against \"false\" claims about its product Prozac.Meanwhile Eli Lilly is launching a series of adverts in a dozen major newspapers, to present what is says are the true facts about its anti-depressant drug Prozac.Wal-Mart kicked off the battle with adverts in newspapers like the Wall Street Journal, using an open letter from company president Lee Scott saying it was time for the public to hear the \"unfiltered truth\".Eli Lilly's chief medical officer Alan Breier said that the article was \"false and misleading\" as the documents it referred to were actually created by officials at the US Food and Drug Administration (FDA) and presented to an FDA meeting in 1991.\"I think they are going to have a tough time suddenly overcoming the perceptions of some people,\" said Larry Bevington, chairman of Save Our Community - a group fighting to prevent Wal-Mart opening a store in Rosemead, California.The world's biggest retailer Wal-Mart took out more than 100 full page adverts in national newspapers.Wal-Mart's average pay is almost twice the national minimum wage of $5.15 (£3.90) an hour, while employees are offered health and life insurance, company stock and a retirement plan, the adverts say.\"It was simply wrong to suggest that information on Prozac was missing, or that important research data on the benefits and possible side effects of the drug were not available to doctors and regulators,\" the letter added."}