{"raw_text": "Jobs go at Oracle after takeover\n \n Oracle has announced it is cutting about 5,000 jobs following the completion of its $10.3bn takeover of its smaller rival Peoplesoft last week.\n \n The company said it would retain more than 90% of Peoplesoft product development and product support staff. The cuts will affect about 9% of the 55,000 staff of the combined companies. Oracle's 18-month fight to acquire Peoplesoft was one of the most drawn-out and hard-fought US takeover battles of recent times. The merged companies are set to be a major force in the enterprise software market, second only in size to Germany's SAP.\n \n In a statement, Oracle said it began notifying staff of redundancies on Friday and the process would continue over the next 10 days. \"By retaining the vast majority of Peoplesoft technical staff, Oracle will have the resources to deliver on the development and support commitments we have made to Peoplesoft customers over the last 18 months,\" Oracle's chief executive Larry Ellison said in a statement.\n \n Correspondents say 6,000 job losses had been expected - and some suggest more cuts may be announced in future. They say Mr Ellison may be trying to placate Peoplesoft customers riled by Oracle's determined takeover strategy. Hours before Friday's announcement, there was a funereal air at Peoplesoft's headquarters, reported AP news agency. A Peoplesoft sign had been turned into shrine to the company, with flowers, candles and company memorabilia. \"We're mourning the passing of a great company,\" the agency quoted Peoplesoft worker David Ogden as saying. Other employees said they would rather be sacked than work for Oracle. \"The new company is going to be totally different,\" said Anil Aggarwal, Peoplesoft's director of database markets. \"Peoplesoft had an easygoing, relaxed atmosphere. Oracle has an edgy, aggressive atmosphere that's not conducive to innovative production.\" On the news, Oracle shares rose 15 cents - 1.1% - on Nasdaq. In after-hours trading the shares did not move.\n", "llama3.2:1b": "Oracle announces approximately 5,000 job cuts following $10.3bn takeover of Peoplesoft, resulting in a 9% reduction in staff. The company will retain over 90% of product development and support staff. Oracle's CEO Larry Ellison attributes the cuts to retaining technical staff for customer commitments. Some employees express concerns that the change may affect innovation at Peoplesoft.", "llama3.2:3b": "Oracle is cutting around 5,000 jobs following its $10.3bn takeover of Peoplesoft, retaining over 90% of product development and support staff.", "gemma2:2b": "Oracle is cutting 5,000 jobs following its acquisition of Peoplesoft. The cuts affect approximately 9% of the combined company's staff and will retain a large portion of Peoplesoft's technical staff. Oracle aims to continue fulfilling commitments made to customers and positions this as a strategic move to compete with SAP in the enterprise software market.   \n", "qwen2.5:0.5b": "Oracle announced it will cut 5,000 jobs following Peoplesoft's takeover and is set to be a major force in the enterprise software market with 28,000 employees.", "qwen2.5:1.5b": "Oracle is cutting about 5,000 jobs following its $10.3bn acquisition of PeopleSoft, affecting roughly 9% of combined employees and contributing to Peoplesoft's closure. The merger with SAP-sized Oracle could be a significant force in enterprise software. Ellison says the move secures development support for Oracle clients. Job cuts have been expected at around 6,000, but other analysts suggest more layoffs might follow. PeopleSoft mourned its \"passing\" and employees strongly prefer staying over Oracle's corporate culture.", "qwen2.5:3b": "Oracle has announced cutting about 5,000 jobs following its $10.3bn takeover of Peoplesoft last week. The company retains more than 90% of Peoplesoft's product development and support staff, affecting about 9% of combined companies' 55,000 employees. This merger will make Oracle a major player in the enterprise software market, second only to Germany's SAP. Although initially expected layoffs could reach up to 6,000, some anticipate more cuts later. Oracle CEO Larry Ellison claimed retaining most Peoplesoft technical staff would allow them to honor previous commitments. At Peoplesoft HQ, employees mourned the company’s passing, with some preferring job loss over working for Oracle. Oracle shares rose slightly on Nasdaq after-hours trading.", "opencoder:1.5b": "The company announced it would cut down about 500 jobs following the takeover of Peoplesoft. The merged companies will affect 9% of the overall staff of the combined companies. Oracle's fight to acquire Peoplesoft was one of the most intense battles in recent times, and it is set to be a major force in the market. On Friday, Oracle announced that there would be redundancies on staff and the process would continue over the next 10 days. Peoplesoft customers are being notified about this and the process will continue for 10 more days. The company will retain about 90% of its technical staff to deliver on the development and support tasks made to its customers. Additionally, there were expected six thousand job losses in recent times, with some suggesting more cuts may be announced in future.\n", "smollm:1.7b": "The summary is concise and clear, preserving key ideas and details from the original text. The main points are:\n\n1. Jobs go at Oracle after takeover\n2. Oracle has announced it is cutting about 5,000 jobs following the completion of its $10.3bn takeover of Peoplesoft last week\n3. The company said it would retain more than 90% of Peoplesoft product development and product support staff\n4. The cuts will affect about 9% of the 55,000 staff of the combined companies\n5. Oracle's 18-month fight to acquire Peoplesoft was one of the most drawn-out and hard-fought US takeover battles of recent times\n6. Oracle said it began notifying staff of redundancies on Friday and the process would continue over the next 10 days\n7. Mr Ellison may be trying to placate Peoplesoft customers riled by Oracle's determined takeover strategy\n8. There is speculation that more cuts may be announced in future\n9. The funereal atmosphere at Peoplesoft was reported hours before Friday's announcement, with employees saying they would rather be sacked than work for Oracle\n10. Oracle has an edgy, aggressive atmosphere that is not conducive to innovative production\n\nThe summary captures the main points of the original text and conveys them in a concise and clear manner.", "deepseek-r1:1.5b": "<think>\nOkay, so I have this query where the user wants a summary of a given text. Let me first read through the text carefully to understand what's going on.\n\nThe main event here is Oracle taking a $10.3 billion takeover of Peoplesoft. The key points are that Oracle is cutting about 5,000 jobs and retains more than 90% of their workforce. There are mentions of some 6,000 job losses expected but also hints of possible further cuts. The combined company is seen as a major force in enterprise software, closely competing with SAP which has a larger market.\n\nI need to make sure the summary captures these main ideas without getting bogged down by details that aren't essential. Also, I should be concise and only include the key points as plain text as the user specified.\n\nLet me check for any specific terms or names— Oracle, Peoplesoft, $10.3 billion, 5,000 jobs, 90%, 6,000 losses. Those are all important to highlight. I need to ensure that these are included in the summary so they stand out and give a clear picture of what happened.\n\nI also notice that Oracle's CEO mentioned retaining most of Peoplesoft staff which would provide them with resources for their commitments. That's another key point to include.\n\nThe context mentions some fluctuations in news about job cuts, but since the user asked for only the summary, I should focus on the main events without getting too deep into other details.\n\nI think that covers everything. Now, putting it all together in a concise manner.\n</think>\n\nJobs go at Oracle after takeover  \nOracle has announced it is cutting about 5,000 jobs following the completion of its $10.3 billion takeover of its smaller rival Peoplesoft last week. The company said it would retain more than 90% of Peoplesoft product development and product support staff. The cuts will affect about 9% of the 55,000 staff of the combined companies. Oracle's chief executive Larry Ellison noted that by retaining the vast majority of Peoplesoft technical staff, Oracle will have the resources to deliver on its commitments. A statement was provided, mentioning redundancies and a process expected to continue over the next 10 days. A press conference was held at Peoplesoft headquarters, where a sign turning into a shrine was reported, with some employees opting out if they were fired rather than working for Oracle.", "tinyllama:1.1b": "After completing its $10.3bn takeover of Peoplesoft, Oracle announced that it would retain approximately 9% of its combined workforce, or about 5,000 employees. The company began notifying staff of job cuts on Friday and plans to continue the process over the next 10 days. The announcement follows months of tense negotiations between Oracle and Peoplesoft CEO Robert Scott following their acquisition by Oracle in August 2020. As a result of the takeover, Oracle expects further cuts in the coming months as it moves to streamline its workforce. Despite the announced job losses, employees remain cautious about future developments within the company. In the immediate aftermath of the announcement, shares in Oracle rose by 15 centst - 1.1% on Nasdaq.", "tinydolphin:1.1b": " Oracle is cutting about 5,000 jobs following its $10.3bn acquisition of Peoplesoft. The cuts will affect more than 9% of the combined companies' 55,000 staff and will be the second-largest after Germany's SAP. Oracle plans to retain more than 90% of Peoplesoft product development and support staff. This move is seen as a way for Oracle to gain traction in the enterprise software market, where it has been struggling with SAP and other larger rivals. The company plans to redeploy resources to deliver on its commitments to Peoplesoft customers over the next 10 days.", "phi:2.7b": " Oracle announced it will cut about 5,000 jobs following its $10.3 billion takeover of Peoplesoft. The combined companies are expected to be a major force in the enterprise software market, with over 90% of Peoplesoft's product development and support staff being retained by Oracle. However, some suggest more job cuts may be made in the future. The news was met with a somber mood at Peoplesoft'S headquarters, where there were reports of workers mourning the company's passing.\n", "orca-mini:3b": " Following its $10.3 billion acquisition of Peoplesoft, Oracle has announced that it is cutting about 5,000 jobs. The company will retain more than 90% of Peoplesoft product development and product support staff, but about 9% of the 55,000 staff of the combined companies will be affected by job losses. Larry Ellison, Oracle's chief executive, said the company began notifying staff of redundancies on Friday and the process will continue for 10 days. The merged companies are set to be a major force in the enterprise software market, but some analysts suggest that Oracle may be trying to placate Peoplesoft customers by making more cuts in future. Hours before Friday's announcement, there was a funereal air at Peoplesoft's headquarters, and some employees said they would rather be sacked than work for Oracle.", "hermes3:3b": "Oracle cuts 5,000 jobs after acquiring Peoplesoft.", "stablelm-zephyr:3b": "Oracle announced 5,000 job cuts following the completion of its $10.3bn takeover of Peoplesoft. The merged companies are set to be a major force in the enterprise software market, second only to Germany's SAP. Oracle retained 90% of Peoplesoft product development and support staff, affecting 9% of the combined 55,000 employees. The cuts were expected, and some suggested more may be announced in future.", "chatgpt-4o-latest": "Oracle is cutting 5,000 jobs following its $10.3 billion takeover of Peoplesoft, affecting about 9% of the combined 55,000 staff. The company will retain over 90% of Peoplesoft's product development and support staff to fulfill commitments to customers. The takeover battle lasted 18 months, making Oracle the second-largest enterprise software firm after SAP. While 6,000 job losses had been expected, more cuts may follow. Some Peoplesoft employees expressed disappointment, with some preferring to leave rather than work under Oracle's more aggressive culture. Oracle shares rose slightly following the announcement.", "stablelm2:1.6b": "Oracle reduces about 5,0:00 staff following takeover of smaller rival Peoplesoft, retaining more than half of product development and support staff. The deal is expected to become a major force in the enterprise software market, second only to Germany's SAP. Staff will be notified of redundancies over the next few days, with some suggesting possible future job cuts.", "granite3.1-dense:2b": "Oracle has announced plans to eliminate approximately 5,000 jobs following its acquisition of Peoplesoft for $10.3 billion last week. Despite affecting about 9% (approximately 4,950 staff) of the combined companies' 55,000 employees, Oracle intends to retain over 90% of Peoplesoft's product development and support personnel. This process began on Friday and is expected to last a decade. The merger will create a significant player in the enterprise software market, second only to SAP globally.\n\nChief Executive Larry Ellison stated that these job cuts enable Oracle to fulfill its commitments to Peoplesoft clients over the past 18 months. However, some analysts anticipate up to 6,000 job losses and speculate further cuts might be announced. These departures could be an attempt by Ellison to assuage dissatisfied Peoplesoft customers due to Oracle's aggressive acquisition strategy.\n\nThe aftermath of the news at Peoplesoft headquarters was described as somber, with employees mourning the end of their company and expressing concern about the change in culture. Notable concerns include a shift from an easygoing environment to a more competitive and potentially less conducive setting for innovation.\n\nOracle's shares saw a 15-cent increase (1.1%) on Nasdaq before trading hours, but did not move during after-hours trading.", "reference": "\"By retaining the vast majority of Peoplesoft technical staff, Oracle will have the resources to deliver on the development and support commitments we have made to Peoplesoft customers over the last 18 months,\" Oracle's chief executive Larry Ellison said in a statement.The company said it would retain more than 90% of Peoplesoft product development and product support staff.Oracle has announced it is cutting about 5,000 jobs following the completion of its $10.3bn takeover of its smaller rival Peoplesoft last week.A Peoplesoft sign had been turned into shrine to the company, with flowers, candles and company memorabilia.In a statement, Oracle said it began notifying staff of redundancies on Friday and the process would continue over the next 10 days.\"We're mourning the passing of a great company,\" the agency quoted Peoplesoft worker David Ogden as saying.They say Mr Ellison may be trying to placate Peoplesoft customers riled by Oracle's determined takeover strategy.\"Peoplesoft had an easygoing, relaxed atmosphere."}