{"raw_text": "Wall Street cool to eBay's profit\n \n Shares in online auction house eBay fell 9.8% in after-hours trade on Wednesday, after its quarterly profits failed to meet market expectations.\n \n Despite seeing net profits rise by 44% to $205.4m (£110m) during October to December, from $142m a year earlier, Wall Street had expected more. EBay stock fell to $92.9 in after-hours trade, from a $103.05 end on Nasdaq. EBay's net revenue for the quarter rose to $935.8m from $648.4m, boosted by growth at its PayPal payment service.\n \n Excluding special items, eBay's profit was 33 cents a share, but analysts had expected 34 cents.\n \n \"I think Wall Street has gotten a bit ahead of eBay this quarter and for the 2005 year.\" said Janco Partners analyst Martin Pyykkonen. For 2004 as a whole, eBay earned $778.2m on sales of $3.27bn. EBay president and chief executive Meg Whitman called 2004 an \"outstanding success\" that generated \"tremendous momentum\" for 2005. \"I'm more confident than ever that the decisions and investments we're making today will ensure a bright future for the company and our community of users around the world,\" she said. EBay now forecasts 2005 revenue of $4.2bn to $4.35bn and earnings excluding items of $1.48 to $1.52 per share. Analysts had previously estimated that eBay would achieve 2005 revenues of $4.37bn and earnings of $1.62 per share, excluding items.\n", "llama3.2:1b": "Ebay shares fell 9.8% in after-hours trade on Wednesday after its quarterly profits failed to meet market expectations. Despite an increase in net profits to $205.4m (£110m) from $142m a year earlier, analysts had expected more. EBay's net revenue rose to $935.8m from $648.4m and growth at its PayPal payment service was also mentioned as a factor.", "llama3.2:3b": "eBay's shares fell 9.8% after quarterly profits missed market expectations. Net profits rose 44% to $205.4m but analysts had expected 34 cents a share. Growth at PayPal boosted revenue to $935.8m. eBay forecasts 2005 revenue of $4.2-4.35bn and earnings of $1.48-1.52 per share.", "gemma2:2b": "eBay's shares fell after quarterly profits missed market expectations, despite rising revenue.  Analysts were expecting higher profit per share than the actual reported number. eBay CEO believes these investments will benefit future growth.  EBay has now projected 2005 revenues of $4.2 billion to $4.35 billion and earnings excluding items of $1.48 to $1.52 per share, less optimistic than analysts' estimations for 2005 revenue and earnings.   \n", "qwen2.5:0.5b": "Wall Street was slow to react to the net profits of online auction house eBay, falling by 9.8% in its third quarter after expectations were not met. Despite this, the company's stock has fallen from a high of $93.80 on the Nasdaq to $103.05 on the floor at the end of the day, with a net revenue of $935. 8 million for the quarter exceeding analysts' expectations.", "qwen2.5:1.5b": "Ebay's quarterly profits failed to meet Wall Street expectations, leading to a 9.8% drop in shares after Wednesday's market close. Despite an increase in net profit to $205.4m ($110m) from $142m, analysts expected more. EBay reported a 33 cent per share profit excluding special items but was expecting 34 cents. Analyst Martin Pyykkonen suggested Wall Street had \"gotten ahead of eBay this quarter\" with the overall net profits for 2004 at $778.2m on sales of $3.27bn, while eBay's president and chief executive Meg Whitman emphasized a bright future for the company in 2005. EBay now forecasts 2005 revenues between $4.2bn to $4.35bn and earnings excluding items between $1.48 to $1.52 per share, higher than previous expectations.", "qwen2.5:3b": "Shares in online auction house eBay fell 9.8% after-hours on Wednesday due to its quarterly profits not meeting market expectations despite a 44% rise to $205.4m net profits from $142m the year before. Earnings per share, excluding special items, were at 33 cents compared to analyst expectations of 34 cents. Analyst Martin Pyykkonen stated that Wall Street had anticipated more profit. eBay's net revenue increased to $935.8m from $648.4m. Despite this, CEO Meg Whitman remained confident about the company's future, forecasting 2005 revenue of $4.2bn to $4.35bn and earnings excluding items at $1.48 to $1.52 per share, higher than analyst estimates.", "opencoder:1.5b": "Wall Street Cool to eBay’s profit\n\nShares in online auction house eBay fell 9.8% after-hours trade on Wednesday, while its quarterly profits failed to meet market expectations.\n\nDespite seeing net profits rising by 44% during October to December from $142m, Wall Street had expected more. eBay stock fell to $92.9 in after-hours trade; it increased from a $103.05 end on Nasdaq.\n\nEBay's profit for the quarter rose to $935.8m from $648.4m boosted by growth at its PayPal payment service. Excluding special items, eBay's profit was 33 cents per share, but analysts had expected 34 cents.\n\n\"The Wall Street has been ahead of eBay this quarter and for the entire year,\" said Janco Partners analyst Martin Pyykkonen. For 2004 as a whole, eBay earned $778.2m in sales of $3.27bn. EBay president and chief executive Meg Whitman called it an \"outstanding success\" that generated \"tremendous momentum\" for the next year. The company plans to expect a bright future for 2005 which has been reflected in its forecasts. EBay’s expected revenues for the next five years are projected to reach $4.2bn and earnings excluding special items per share, ranging from $1.48 to $1.52.\n", "smollm:1.7b": "The summary is concise and focuses on the main points:\n\n1. Wall Street cool to eBay's profit: Shares in online auction house eBay fell 9.8% in after-hours trade on Wednesday, after its quarterly profits failed to meet market expectations.\n2. Despite seeing net profits rise by 44% to $205.4m (£110m) during October to December, from $142m a year earlier, Wall Street had expected more. EBay stock fell to $92.9 in after-hours trade, from a $103.05 end on Nasdaq.\n3. Excluding special items: eBay's profit was 33 cents a share, but analysts had expected 34 cents.\n4. I think Wall Street has gotten a bit ahead of eBay this quarter and for the 2005 year: Martin Pyykkonen said that eBay earned $778.2m on sales of $3.27bn in 2004, but analysts had previously estimated that eBay would achieve 2005 revenues of $4.3bn to $4.35bn and earnings excluding items of $1.48 to $1.52 per share.\n5. Excluding items: eBay's profit was 33 cents a share, but analysts had expected 34 cents.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about eBay's stock dropping and their financial performance. Let me read through it carefully.\n\nThe first sentence says that eBay shares fell 9.8% on Wednesday after profits didn't meet expectations. They made $205.4 million in October-December compared to the previous year's $142 million, so they're ahead of what investors were expecting, but still not exactly where they should be.\n\nThen there's more about their revenue growth. Excluding special items, their profit was 33 cents a share, which is just under the 34 cents analysts expected. So close, but still below expectations.\n\nEbay also had an impressive payment service profit of $935 million compared to last year's $648 million, growing by 40%—which is a solid growth number.\n\nMeg Whitman, eBay's CEO and president, highlighted the success of 2004 as momentum for 2005. She said they're confident in their current decisions leading to a bright future.\n\nNow, their 2005 forecasts are $4.2 billion to $4.35 billion in revenue and earnings excluding items between $1.48 and $1.52 per share. That's significantly higher than their previous estimates of $4.37 billion revenue and $1.62 earnings.\n\nSo the key points are: eBay fell due to underperformance, had solid payment service profits, strong growth in other areas, outperforming 2004 as a foundation for future success, with clear long-term expectations.\n\nI need to condense this into one concise summary without explanations or formatting. I'll focus on the main facts: the stock drop, their profit metrics, especially payment services and revenue growth, and their confidence in future performance.\n</think>\n\nWall Street noted that eBay's stock fell 9.8% after its quarterly profits missed expectations. Despite growing revenue at PayPal, eBay made $205.4 million compared to last year's $142 million, with a profit of $33 cents per share below analysts' expected $34. They exceeded $648 million in sales growth and had solid payment service profit. EBay also outperformed 2004 as a foundation for future success, projecting 2005 revenue between $4.2 billion to $4.35 billion and earnings of $1.48 to $1.52 per share.", "tinyllama:1.1b": "Wall Street anticipated eBay's quarterly profit to fall short by 9.8% despite seeing net profit increase from $142m a year earlier to $205.4m during October-December. Despite the positive growth in revenues, eBay's net revenues were expected to reach $4.2bn to $4.35bn and earnings expectations of $1.48 to $1.52 per share, with analysts having estimated earnings for 2005 of $4.37bn to $4.62bn, excluding special items. However, eBay's profits fell short by 44% on the year, despite an increase in net revenues. Despite this, eBay CEO Meg Whitman expressed confidence that the company would experience \"tremendous momentum\" for 2005 and called it an \"outsstancing success,\" with eBay forecasting $4.37bn to $4.62bn in revenues and $1.62 per share in earnings, excluiding items.", "tinydolphin:1.1b": " Wall Street appears cool to eBay's profit this quarter as they had expected more, despite the company's net profits rising by 44% from $142m a year earlier. EBay stock fell to $92.9 in after-hours trade on Wednesday from a previous $103.05 end price, marking a drop of over 10%. However, the shares are expected to rebound by the end of the day at least as high as $103.05, providing a slight boost to the company's reputation for growth and innovation. For the quarter, eBay reported net revenue of $935.8m, an increase of 27% over the previous year, although analysts had expected 34 cents in profit per share. Overall, analysts had predicted earnings per share of $1.48 to $1.52 for the 2005 financial year. However, the sharp drop in stock prices this week has led many analysts to question the company's performance and growth potential.", "phi:2.7b": " EBay's profits for the last quarter exceeded market expectations, but Wall Street was not impressed with its stock performance as it fell after-hours by 9.8%. The company's net revenue increased by 44% from the previous year to $935.8m, boosted by PayPal payments. However, analysts had expected a profit of 34 cents per share, and EBay's estimated earnings for 2005 are between $1.48 and $1.52 per share. CEO Meg Whitman expressed confidence in the company's future success despite the stock price drop.\n", "orca-mini:3b": " Wall Street was cool towards eBay's profit during the quarter, despite the company's rise in net profits by 44%. EBay stock fell to $92.9 in after-hours trade, compared to a $103.05 end on Nasdaq, and analysts had expected more. The net revenue for the quarter rose to $935.8m from $648.4m, boosted by growth at its PayPal payment service. eBay's profit excluding items was 33 cents per share, but Wall Street had expected more. Excluding special items, eBay earned $1.48 to $1.52 per share in 2004, and the company forecast 2005 revenue of $4.2bn to $4.35bn and earnings excluding items of $1.48 to $1.52 per share.", "hermes3:3b": " Ebay shares fall after missing profit expectations.", "stablelm-zephyr:3b": "eBay's shares fell 9.8% after-hours due to missing market expectations with a 44% increase in net profits to $205.4m but Wall Street expected more. eBay's stock dropped to $92.9 from $103.05 on Nasdaq. The company's net revenue grew to $935.8m from $648.4m, driven by PayPal payment service growth. Analysts had predicted 33 cents a share profit, but eBay only reported 33 cents excluding special items. For 2005, eBay forecasts revenue of $4.2bn to $4.35bn and earnings per share excluding items at $1.48 to $1.52.", "chatgpt-4o-latest": "EBay's shares fell 9.8% in after-hours trading after its quarterly profits failed to meet Wall Street expectations. Despite a 44% rise in net profits to $205.4 million and increased revenue driven by PayPal, earnings per share excluding special items were 33 cents, below analysts' expectations of 34 cents. Analysts suggested Wall Street's expectations were too high. For 2004, eBay earned $778.2 million on $3.27 billion in sales. CEO Meg Whitman called 2004 a success and expressed confidence in future growth. EBay forecasted 2005 revenue of $4.2-$4.35 billion and earnings of $1.48-$1.52 per share, below analysts' estimates of $4.37 billion and $1.62 per share.", "stablelm2:1.6b": "EBay's stock fell by 9.8% due to its underwhelming quarterly profits, which failed to meet market expectations. Despite increasing net profits by 9.2% to $4.4 million (£4.0 million) during the October to December quarter from $3.5 million a year earlier, Wall Street had anticipated more growth. eBay's net revenue for the quarter rose to $8.4 million from $4.4 million, driven by its PayPal payment service. Excluding special items, eBay's profit was $12 cents a share, but analysts expected $16 cents. Analysts now predict eBay will generate revenues of $4.2 billion to $4.5 billion and earnings excluding items at $1 billion to $1.2 billion.", "granite3.1-dense:2b": "eBay's Q1 2005 profits fell short of expectations, with a net profit of $205.4 million, up 44% from the prior year but less than the anticipated $218.9 million. Despite this, eBay's net revenue grew to $935.8 million, driven by PayPal's expansion. Excluding special items, eBay reported a profit of 33 cents per share, which fell short of the projected 34 cents. Analyst Martin Pyykkonen suggested Wall Street might have high expectations for eBay's Q1 performance. For the entire year 2004, eBay earned $778.2 million on sales of $3.27 billion, which CEO Meg Whitman labeled an \"outstanding success\" generating strong momentum for 2005. eBay forecasts 2005 revenue between $4.2 billion and $4.35 billion, with earnings excluding items expected to range from $1.48 to $1.52 per share. Analysts had previously estimated 2005 revenues at $4.37 billion and earnings of $1.62 per share.", "reference": "EBay now forecasts 2005 revenue of $4.2bn to $4.35bn and earnings excluding items of $1.48 to $1.52 per share.Analysts had previously estimated that eBay would achieve 2005 revenues of $4.37bn and earnings of $1.62 per share, excluding items.For 2004 as a whole, eBay earned $778.2m on sales of $3.27bn.Excluding special items, eBay's profit was 33 cents a share, but analysts had expected 34 cents.\"I think Wall Street has gotten a bit ahead of eBay this quarter and for the 2005 year.\""}