{"raw_text": "WorldCom trial starts in New York\n \n The trial of Bernie Ebbers, former chief executive of bankrupt US phone company WorldCom, has started in New York with the selection of the jury.\n \n Mr Ebbers, 63, is accused of being the mastermind behind an $11bn (£6bn) accounting fraud that eventually saw the firm collapse in July 2002. His indictment includes charges of securities fraud, conspiracy and filing false reports with regulators. If found guilty, Mr Ebbers could face a substantial jail sentence. He has firmly declared his innocence.\n \n Under Mr Ebbers' leadership, WorldCom emerged from Mississippi obscurity to become a $160bn telecoms giant and the darling of late 1990s investors. Yet as competition intensified and the telecoms boom petered out, WorldCom found itself under growing financial stress. When WorldCom finally collapsed, shareholders lost about $180bn and 20,000 workers lost their jobs. Mr Ebbers' trial, which is expected to last two months, is the latest in a series of attempts by US prosecutors to pursue senior executives for fraud. It will coincide with the retrial of former Tyco International chief Dennis Kozlowski and his top lieutenant, accused of looting the industrial conglomerate to the tune of $600m. Trail preparations are also preparing for former executives of shamed US energy firm Enron.\n", "llama3.2:1b": "The WorldCom trial started in New York with the selection of a jury.\n\nBernie Ebbers is being tried on charges of securities fraud, conspiracy, and filing false reports with regulators.\nHe faces up to 20 years in prison if found guilty.\nEbbers denies being involved in the $11bn accounting fraud that led to WorldCom's collapse.", "llama3.2:3b": "The trial of Bernie Ebbers, former WorldCom CEO, has started in New York with charges including securities fraud, conspiracy and filing false reports. Ebbers, 63, denies the allegations and could face a substantial jail sentence if found guilty. The trial is part of a series of attempts by US prosecutors to pursue senior executives for fraud.", "gemma2:2b": "Bernie Ebbers' trial for accounting fraud at WorldCom has begun in New York. He faces charges of securities fraud and conspiracy stemming from an alleged $11 billion fraud that led to the company's collapse in 2002. If convicted, he could face jail time.  This trial is part of a broader effort by US prosecutors to hold executives accountable for fraud, including the upcoming retrial of Dennis Kozlowski and other former executives of Enron. \n", "qwen2.5:0.5b": "The WorldCom trial in New York is starting with a jury selection. The main suspects are Bernie Ebbers, who is accused of fraud and securities manipulation at WorldCom. If convicted, he could face significant jail time. His company was once the darling of late 1990s investors but eventually declined due to financial strain and competition. Former executives like Dennis Kozlowski and former Enron executives are also under investigation.", "qwen2.5:1.5b": "The trial of Bernie Ebbers, former CEO of bankrupt WorldCom, has begun in New York with a jury selection. Ebbers faces charges including securities fraud and conspiracy related to an $11 billion accounting scandal. If convicted, he could face substantial jail time. WorldCom collapsed due to financial stress from intensified competition and declining telecoms boom, leading to shareholder losses and 20,000 job cuts.", "qwen2.5:3b": "WorldCom's former CEO Bernie Ebbers begins trial in New York with jury selection; charged with orchestrating $11bn accounting fraud leading to company collapse in 2002. If convicted, could face lengthy jail time despite his declared innocence. His leadership transformed WorldCom from a Mississippi-based firm into a $160bn telecom giant before its bankruptcy and subsequent economic fallout affected thousands of workers. Ebbers' trial will follow similar efforts by US prosecutors to hold executives accountable for fraud, including the retrial of Tyco International's Dennis Kozlowski and Enron's former executives.", "opencoder:1.5b": "The trial of Mr. Bernie Ebbers, a former chairman of WorldCom's bankrupt phone company, has started in New York with the selection of the jury. Mr. Ebbers is accused of an accounting fraud that resulted in the firm collapsing in July 2002. Under his leadership, WorldCom emerged as a telecom giant and became a market leader in late 1980s. Yet as competition grew and the boom petered out, financial stress also increased, leading to loss of shareholders and workers.\n", "smollm:1.7b": "The trial of Bernie Ebbers, former chief executive of bankrupt US phone company WorldCom, has started in New York with the selection of the jury. Mr Ebbers, 63, is accused of being the mastermind behind an $11bn (£6bn) accounting fraud that eventually saw the firm collapse in July 2002. His indictment includes charges of securities fraud, conspiracy and filing false reports with regulators. If found guilty, Mr Ebbers could face a substantial jail sentence. He has firmly declared his innocence.\nThe trial is expected to last two months and will coincide with the retrial of former Tyco International chief Dennis Kozlowski and his top lieutenant, accused of looting the industrial conglomerate to the tune of $600m. Trail preparations are also preparing for former executives of shamed US energy firm Enron.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text about the WorldCom trial in New York. Let me read through it again to make sure I understand what's being said.\n\nThe text starts by talking about the trial beginning in New York with the selection of the jury. Mr. Ebbers is 63 and a former CEO of WorldCom, which was a major phone company that eventually went bankrupt in July 2002. He's accused of fraud, specifically securities fraud, conspiracy, and false reporting.\n\nIf he gets convicted, he could face a significant prison sentence. I also see that there are other trials planned for the same time, like with Dennis Kozlowski and the Enron case. The WorldCom collapse led to massive shareholders losing money and many workers losing jobs. Similarly, Enron's collapse would be another major event.\n\nSo the key points are: the trial is starting in New York; Mr Ebbers, 63, tried to escape obscurity by becoming a big firm; he was convicted of fraud charges. The text also mentions more trials for other companies and the impact of WorldCom's collapse on shareholders and workers.\n\nI need to make sure I capture all these points concisely without adding any extra information or explanations.\n</think>\n\nWorldCom trial starts in New York, where Mr. Bernie Ebbers, a former CEO accused of fraud charges. If convicted, Ebbers faces prison time. The trial coincides with other cases for Kozlowski and Enron's collapse, leading to massive financial losses.", "tinyllama:1.1b": "United States judge has selected the jury in the trial of Bernie Ebber, former CEO of bankrupt US telecommunication company WorldCom. The trial is set to start next week and will involve charges of accounting fraud, securities violations, and filing false reports with regulators. If found guilty, Mr Ebber could face a significant sentence. Under his leadership, WorldCom became a $160bn telecoms giant and the darling of late 90s investors. However, as competition intensified and the telecommunications boom petered out, WorldCom found itself under financial stress. The trial, which is expected to last two months, coincides with the retrieval of former Tyco International CEO Dennis Kozylowski and his top lieutenant, accused of looting the company to the tune of $600m. Other key individuals on trial are former executives of energy firm Enron.", "tinydolphin:1.1b": " The world's biggest telecom company, WorldCom, is set to go to court in New York. \n\nBernie Ebbers, its ex-chief executive, will stand in the dock facing allegations of accounting fraud and conspiracy. \n\nHe denies the charges but has said that he was not involved in the wrongdoing. The trial is expected to take place for two months.", "phi:2.7b": " The trial of Bernie Ebbers, former CEO of bankrupt US phone company WorldCom, has begun in New York. He is being charged with securities fraud, conspiracy, and false reports with the potential for a substantial prison sentence if found guilty. Ebbers was accused of leading an $11 billion accounting scam that led to the company's collapse in July 2002. Under his leadership, WorldCom grew from obscurity into a $160bn telecoms giant but faced financial stress as competition increased and the telecoms boom petered out. The trial is part of a series of attempts by US prosecutors to pursue senior executives for fraud, along with other high-profile cases such as Tyco International's retrial and former Enron executives' trials.\n", "orca-mini:3b": " The WorldCom trial has started in New York, with Bernie Ebbers accused of being the mastermind behind an $11 billion accounting fraud that eventually saw the company collapse in 2002. He is charged with securities fraud, conspiracy, and filing false reports with regulators. If found guilty, he could face a substantial jail sentence. Mr. Ebbers has declared his innocence, but he is facing trial along with Dennis Kozlowski and other Tyco executives accused of looting the company to the tune of $600 million. The trial coincides with the retrial of Tyco's Dennis Kozlowski and his top lieutenant, who are accused of looting the company to the tune of $600 million. Legal preparations are also underway for former executives of bankrupt energy firm Enron, who are accused of embezzlement and fraud.", "hermes3:3b": "WorldCom trial begins in NY, Bernie Ebbers indicted for $11b accounting fraud as ex-CEO; coinciding with Dennis Kozlowski's retrial & Enron execs' preparations.", "stablelm-zephyr:3b": "Bernie Ebbers, former CEO of WorldCom, faces an $11bn accounting fraud trial in New York. Charged with securities fraud, conspiracy, and filing false reports, Ebbers could face a substantial jail sentence if found guilty. Under his leadership, WorldCom became a $160bn telecoms giant but eventually collapsed in 2002, resulting in significant losses for shareholders and 20,000 job losses. This trial follows several attempts by US prosecutors to pursue senior executives for fraud, including the retrial of former Tyco International chief Dennis Kozlowski and preparations for the former Enron executives.", "chatgpt-4o-latest": "The trial of former WorldCom CEO Bernie Ebbers has begun in New York, with jury selection underway. Ebbers, 63, is accused of orchestrating an $11 billion accounting fraud that led to WorldCom's collapse in 2002. He faces charges of securities fraud, conspiracy, and filing false reports, and could receive a lengthy prison sentence if convicted. Under his leadership, WorldCom grew into a $160 billion telecom giant before financial struggles led to its downfall, costing shareholders $180 billion and 20,000 jobs. His trial is part of broader efforts by US prosecutors to hold executives accountable for corporate fraud, coinciding with the retrial of former Tyco CEO Dennis Kozlowski and preparations for cases against former Enron executives.", "stablelm2:1.6b": "The trial of Bernie Ebbers, former CEO of bankrupt US phone company WorldCom, began in New York with jury selection, as he faces charges of securities fraud, conspiracy, and filing false reports related to an $8 billion accounting fraud. If found guilty, Mr. Ebbers could face substantial jail time; however, he maintains his innocence. Under his leadership, WorldCom became a $1 billion telecoms giant but collapsed due to financial stress as competition intensified and the telecoms boom petered out. Shareholders lost around $2 billion, while workers lost their jobs.", "granite3.1-dense:2b": "Bernie Ebbers, 63, former CEO of defunct US telecom giant WorldCom, is on trial in New York for an $11bn accounting fraud that led to the company's collapse in July 2002. Charges include securities fraud, conspiracy, and filing false reports with regulators. If convicted, he could receive a severe prison term. WorldCom, once valued at $160bn, was plagued by financial strain due to intensified competition and the telecoms market's decline. Shareholders lost approximately $180bn, and 20,000 employees were jobless when it collapsed. This trial is part of a series by US prosecutors targeting senior executives for fraud, alongside the retrial of former Tyco International executives accused of embezzling $600m, and preparations for Enron's former top executives' trials. The proceedings are anticipated to last two months.", "reference": "The trial of Bernie Ebbers, former chief executive of bankrupt US phone company WorldCom, has started in New York with the selection of the jury.Mr Ebbers, 63, is accused of being the mastermind behind an $11bn (£6bn) accounting fraud that eventually saw the firm collapse in July 2002.Under Mr Ebbers' leadership, WorldCom emerged from Mississippi obscurity to become a $160bn telecoms giant and the darling of late 1990s investors.Mr Ebbers' trial, which is expected to last two months, is the latest in a series of attempts by US prosecutors to pursue senior executives for fraud.If found guilty, Mr Ebbers could face a substantial jail sentence."}