{"raw_text": "High fuel costs hit US airlines\n \n Two of the largest airlines in the US - American and Southwest - have blamed record fuel prices for their disappointing quarterly results.\n \n American Airlines' parent AMR reported a loss of $387m (£206m) for the fourth quarter of 2004, against a $111m loss for the same period a year earlier. Meanwhile, Southwest Airlines saw its fourth-quarter 2004 profits fall 15% to $56m, against $66m a year earlier. Both said high fuel bills would continue to pressure revenues in 2005. American, the world's biggest airline by some measures, said it expected to report a loss for the first quarter of 2005. Southwest, which has the highest market value of any US carrier, said it would remain profitable despite high fuel prices.\n \n AMR's shares were flat in Wednesday morning trading on the New York Stock Exchange, as the results were slightly better than analysts had anticipated. AMR's chief executive Gerard Arpey said the airline's difficulties reflected the situation within the industry. \"AMR's results for the fourth quarter of 2004 reflect the economic woes that plagued the airline industry throughout 2004 - in particular, high fuel prices and a tough revenue environment,\" he said. For the full year, AMR posted a loss of $761m, lower than 2003's $1.2bn loss and an indication that the airline has successfully cut costs. AMR added that as part of its cost cutting measures, it is postponing the delivery of 54 Boeing jets. Shares in Southwest fell 65 cents to $14.35 as analysts voiced their disappointment. \"The results came in below our already conservative estimate for the quarter,\" said Ray Neidl, an analyst at Calyon Securities. Both American and Southwest have been squeezed by cut-throat competition in the US airline industry, as a glut of available seats has led to fierce price reductions.\n", "llama3.2:1b": "US airlines report disappointing quarterly results due to high fuel prices. \n\nAmerican Airlines' parent company reported a loss of $387m (approximately £206m) for the fourth quarter of 2004 and an estimated loss for the first quarter of 2005. Southwest Airlines saw its fourth-quarter profits fall 15% to $56m, against $66m a year earlier.\n\nBoth airlines are expected to continue pressuring revenues in 2005 due to high fuel costs.", "llama3.2:3b": "American Airlines reported a $387m loss in Q4 2004 due to high fuel costs. Southwest's profits fell 15% to $56m. Both airlines expect high fuel prices to pressure revenues in 2005. AMR's shares were flat, while Southwest's fell 65 cents.", "gemma2:2b": "American Airlines and Southwest Airlines reported disappointing quarterly results due to high fuel prices.  Their losses were attributed to increased fuel costs, which pressured revenue despite cost-cutting measures for both airlines. American expects a loss in the first quarter of 2005. Southwest will remain profitable but saw disappointed expectations from analysts after their profits fell. Both airlines are facing stiff competition, leading to price wars and lower revenues.  \n", "qwen2.5:0.5b": "American Airlines' parent AMR reported lower profits than analysts had anticipated, while Southwest Airlines posted better results despite high fuel costs. Both airlines are struggling with economic hardships and rising competition in their respective industries. American's problems reflect the overall industry conditions during 2004, including high fuel prices and a tough revenue environment, while Southwest has postponed delivering new aircraft to save money.", "qwen2.5:1.5b": "Two major U.S. airlines, American Airlines and Southwest Airlines, reported losses due to soaring fuel prices, with both expecting continued revenue pressure in 2005. AMR's parent company, reporting a $387m loss for Q4 2004 compared to a $111m loss the previous year, noted high fuel costs as a factor. American Airlines, despite some improvements, still anticipated a quarter-end loss and delays on jet deliveries. Southwest Airlines' performance was more positive, posting profits down by only 15% from last year but remaining profitable in the face of high fuel prices. Both airlines have faced intense competition due to oversupply of seats leading to price reductions.", "qwen2.5:3b": "High fuel costs hit US airlines: American Airlines reported a $387m loss for Q4 2004 (vs $111m loss yr-ago), with losses expected in 2005. Southwest Airlines saw its profits fall 15% to $56m (vs $66m yr-ago). AMR's shares were flat, while Southwest fell due to analysts' disappointment. Both companies attribute their struggles to high fuel prices and intense competition.\tAMR posted a loss of $761m for the full year 2004, down from $1.2bn in 2003. Southwest's market value remains highest among US carriers despite continued losses due to high fuel costs.", "opencoder:1.5b": "High fuel costs hit US airlines, two of the largest airlines in the US - American and Southwest - have blamed record fuel prices for their disappointing quarterly results.\nBoth American and Southwest saw profits fall 15% to $56m against $66m a year earlier. Both said high fuel bills would continue to pressure revenues in 2005.\nAmerican's expected loss for the first quarter of 2005, while Southwest's market value remained profitable despite high fuel prices, reported a loss of $387m (£206m) for the fourth quarter of 2004. AMR’s shares were flat in Wednesday morning trading on the New York Stock Exchange, as the results were slightly better than analysts had anticipated. AMR's chief executive Gerard Arpey said it had difficulty reflecting the situation within the industry. AMR posted a loss of $761m, lower than 2003's $1.2bn loss and an indication that American has successfully cut costs. The company added that as part of its cost cutting measures, it is postponing the delivery of 54 Boeing jets. Shares in Southwest fell 65 cents to $14.35 as analysts expressed disappointment.\n", "smollm:1.7b": "High fuel costs hit US airlines", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about high fuel costs affecting U.S. airlines. Let me read through it again.\n\nThe main points are that both American Airlines and Southwest Airlines are blaming record fuel prices for their bad quarterly results. AMR (American Airlines) had a big loss of $387 million compared to the year before, and Southwest saw a decrease in profits by 15%. They all expect continued pressure from fuel costs in 2005.\n\nI need to make sure I include that both companies said high fuel bills would continue to affect revenues. AMR expects a first-quarter loss for 2005, while Southwest remains profitable despite fuel prices.\n\nThe summary should be concise and only contain the key ideas without any extra info or explanations.\n</think>\n\nHigh fuel costs have pushed U.S. airlines into trouble. American Airlines (AMR) reported a $387 million loss compared to a $111 million loss for the previous year, while Southwest Airlines saw a 15% decline in profits from $66 million to $56 million. Both companies expect continued pressure from fuel costs in 2005. AMR is projected to have a first-quarter loss in 2005, while Southwest remains profitable despite fuel prices.", "tinyllama:1.1b": "American Airlines and Southwest Airlines reported loss figures for their fourth quarter results in 2004, against a $111m loss for the same period in 2003. The airlines blamed high fuel prices for their struggles, as analysts predict that this trend will continue into 2005, with fuel costs expected to remain high. While American Airlines has been able to post a profit for the fourth quarter of 2004, Southwest Airlines' results were below expectations and analysts were disappointed by the airline's decision to delay delivery of Boeing jetliners.", "tinydolphin:1.1b": " Two major U.S. airlines, American Airlines and Southwest Airlines, have reported disappointing quarterly results due to high fuel prices. This has affected their bottom lines, resulting in losses of $387 million for American Airlines and $56 million for Southwest Airlines. Both companies blamed the rise in fuel prices for their decline. \n\nAmerican Airlines' CEO Gerard Arpey commented that it had been \"a tough year\" for the airline industry, with high fuel costs contributing to losses. He stated that AMR's fourth-quarter results were better than analysts expected but fell short of expectations in comparison to its predecessor American Airlines, which reported a loss of $111 million. \n\nSouthwest Airlines, in contrast, saw its profits decrease by 15% for the first quarter of 2005 compared to the same period a year earlier. This has put pressure on revenues as the airline continues to grapple with high fuel prices. \n\nAnalysts have been anticipating AMR's poor results, and they voiced disappointment in their latest report. Ray Neidl from Calyon Securities pointed out that American Airlines' fourth-quarter results were below his estimate and blamed the situation on high fuel prices. He stated that \"the results came in below our already conservative estimate for the quarter,\" implying that AMR had underestimated their challenges. \n\nSouthwest Airlines, however, has been able to post positive earnings growth despite these challenging economic conditions. In contrast, American Airlines' share price declined by $7.60 on Wednesday morning in New York Stock Exchange trading. Analysts have expressed disappointment in AMR's performance and continue to expect it will remain profitable despite high fuel prices.", "phi:2.7b": " American Airlines and Southwest Airlines blamed record fuel prices for their disappointing quarterly results. AMR reported a loss of $387m, while Southwest saw its fourth-quarter profits fall 15%. Both airlines expect high fuel costs will continue to pressure revenues in the future. American expects to report a loss for Q1'05, but Southwest plans to remain profitable despite high fuel prices. The airline industry is suffering from intense competition and significant price drops due to an oversupply of seats.\n", "orca-mini:3b": " The two largest airlines in the US, American Airlines and Southwest Airlines, blamed high fuel prices for their disappointing quarterly results. Both airlines reported lower profits compared to previous years due to intense competition in the industry. American's parent company, AMR, estimated a loss of $387 million for the fourth quarter of 2004, while Southwest saw a 15% drop in profits for the same period, with shares falling after the results were announced. Both airlines have postponed the delivery of Boeing jets due to cost-cutting measures.", "hermes3:3b": "US airlines American (AMR) and Southwest reporting higher losses due to record fuel prices for quarters. AMR blamed industry economic woes, high fuel costs and tough revenue environment; Southwest expected to remain profitable despite high fuel prices.", "stablelm-zephyr:3b": "US airlines American Airlines and Southwest Airlines suffered disappointing quarterly results due to record fuel prices. American Airlines reported a $387m loss compared to a $111m loss in 2004Q4, while Southwest's profits fell 15% to $56m from $66m a year earlier. The high fuel costs are expected to continue Pressing revenues in 2005. Both airlines have been struggling with cut-throat competition and high levels of available seats leading to fierce price reductions. American Airlines' CEO Gerard Arpey admitted the airline industry faced economic woes, particularly high fuel prices and tough revenue environments in 2004.", "chatgpt-4o-latest": "High fuel costs have negatively impacted US airlines, with American Airlines' parent AMR reporting a $387 million loss for Q4 2004, compared to $111 million a year earlier. Southwest Airlines' Q4 profits fell 15% to $56 million. Both airlines warned that high fuel prices would continue to pressure revenues in 2005. AMR expected further losses in Q1 2005, while Southwest anticipated remaining profitable. AMR's full-year loss of $761 million was an improvement from 2003's $1.2 billion loss, reflecting cost-cutting efforts, including postponing 54 Boeing jet deliveries. AMR's shares remained flat, while Southwest's shares fell as analysts expressed disappointment. Both airlines faced intense competition due to an oversupply of seats, leading to aggressive price cuts.", "stablelm2:1.6b": "High fuel costs negatively impact US airlines' quarterly results with American and Southwest blaming record prices for their disappointing financial performance. American Airlines saw a loss of £/€m compared to a year earlier while Southwest's profits fell by 10%. Both reported continued pressure from high fuel bills in the future. AMR parent airline, American, expects a loss for Q1 2005 and expects to cut costs. Despite this, its shares were flat. Southwest remained profitable despite high fuel prices. For the year, AMR posted a lower loss than previous losses and successfully cut costs with deliveries of Boeing jets postponed. Southwest's shares fell following disappointing results. The competition in the US airline industry has been intense due to an oversupply of available seats leading to fierce price reductions.", "granite3.1-dense:2b": "US airlines American Airlines (AMR) and Southwest experienced significant financial strain due to record high fuel costs during Q4 2004. AMR reported a $387m loss, an increase from the previous year's $111m loss, while Southwest's profits dropped by 15% to $56m, compared to $66m in the same period last year. Both companies anticipate ongoing fuel expense pressure impacting their revenues in 2005. American Airlines expects a loss for Q1 2005, whereas Southwest remains confident in maintaining profitability amid high fuel prices.\n\nAMR's CEO, Gerard Arpey, linked the airline's struggles to broader industry issues, including escalating fuel costs and a challenging revenue environment. Despite these challenges, AMR reported a lower full-year loss of $761m, indicating progress in cost reduction. As part of its cost-cutting efforts, AMR delayed the delivery of 54 Boeing jets. Southwest's shares decreased following the quarterly results, as analysts expressed disappointment with the figures. The competition within the US airline industry, characterized by abundant seats and intense price competition, further exacerbated both companies' financial difficulties.", "reference": "\"AMR's results for the fourth quarter of 2004 reflect the economic woes that plagued the airline industry throughout 2004 - in particular, high fuel prices and a tough revenue environment,\" he said.American, the world's biggest airline by some measures, said it expected to report a loss for the first quarter of 2005.American Airlines' parent AMR reported a loss of $387m (£206m) for the fourth quarter of 2004, against a $111m loss for the same period a year earlier.Southwest, which has the highest market value of any US carrier, said it would remain profitable despite high fuel prices.Two of the largest airlines in the US - American and Southwest - have blamed record fuel prices for their disappointing quarterly results.Both American and Southwest have been squeezed by cut-throat competition in the US airline industry, as a glut of available seats has led to fierce price reductions."}