{"raw_text": "European losses hit GM's profits\n \n General Motors (GM) saw its net profits fall 37% in the last quarter of 2004, as it continued to be hit by losses at its European operations.\n \n The US giant earned $630m (£481.5m) in the October-to-December period, down from $1bn in the fourth quarter of 2003. GM's revenues rose 4.7% to $51.2bn from $48.8bn a year earlier. The fourth-quarter losses at General Motors Europe totalled $345m, up from $66m during the same period in 2003. GM's main European brands are Opel and Vauxhall.\n \n Excluding special items, GM's global income from continuing operations totalled $569m during the quarter, down from $838m a year earlier. The results were in line with Wall Street expectations and shares in GM rose by about 1% in pre-market trade. For the whole of 2004, GM earned $3.7bn, down from $3.8bn in 2003, while its annual revenue rose 4.5% to $193bn. GM said its profits were also hit by higher healthcare costs in the US. \"GM reported solid overall results in 2004, despite challenging competitive conditions in many markets around the globe,\" GM chairman and chief executive Rick Wagoner said in a statement. The company recently announced that it expected profits in 2005 to be lower than in 2004.\n", "llama3.2:1b": "European losses hurt GM's net profits by 37%. Revenues rose 4.7% from $48.8bn a year earlier, but fourth-quarter European losses totalled $345m. Global income excluding special items dropped to $569m, down 3.5%. The company reported solid overall results despite competitive challenges in various markets around the world.", "llama3.2:3b": "General Motors' net profits fell 37% in Q4 2004 due to losses at its European operations, totaling $345m. Revenue rose 4.7% to $51.2bn. Annual revenue and earnings also decreased, with a global income from continuing operations of $569m, down from $838m last year.", "gemma2:2b": "General Motors' net profits fell 37% in the last quarter of 2004 due to losses at its European operations, particularly Opel and Vauxhall. These losses totaled $345 million and were up from $66 million a year earlier. Despite higher healthcare costs in the US, GM reported solid overall results for the year with revenue increasing 4.5% to $193 billion. The company's projected profits for 2005 are expected to be lower than 2004.  \n", "qwen2.5:0.5b": "GM's net profit fell in the last quarter of 2004, mainly due to losses at its European operations. The company reported $3.7 billion in total earnings during the quarter, down from $3.8 billion a year earlier. The results were in line with Wall Street expectations and shares in GM increased by about 1% in pre-market trading. In the whole of 2004, GM earned $193 billion, compared to $3.8 billion in 2003.", "qwen2.5:1.5b": "General Motors' profit fell 37% due to losses at European operations, while revenues increased by 4.7%. Fourth-quarter net loss was $345m compared to $66m in the previous year. The company reported solid overall results but expects lower profits for 2005.", "qwen2.5:3b": "European operations continued to negatively impact General Motors' profits, leading to a 37% decline in net profits for the last quarter of 2004 compared to the same period in 2003. GM's revenues increased by 4.7%, reaching $51.2bn from $48.8bn, but losses at its European division (Opel and Vauxhall) reached $345m, up from $66m a year prior. Excluding special items, GM's global income fell to $569m in the quarter from $838m in 2003. Despite these challenges, GM reported solid results for the full year of 2004 and expected lower profits for 2005.", "opencoder:1.5b": "European losses hit GM's profits\n\nGeneral Motors (GM) saw its net profits fall 37% in the last quarter of 2004, as it continued to be hit by losses at its European operations.\n\nThe US giant earned $630m (£481.5m) in the October-to-December period, down from $1bn in the fourth quarter of 2003. GM's revenues rose 4.7% to $51.2bn from $48.8bn a year earlier. The fourth-quarter losses at General Motors Europe totalled $345m, up from $66m during the same period in 2003. GM’s main European brands are Opel and Vauxhall.\n\nExcluding special items, GM's global income from continuing operations totalled $569m during the quarter, down from $838m a year earlier. The results were in line with Wall Street expectations and shares in GM rose by about 1% in pre-market trade. For the whole of 2004, GM earned $3.7bn, down from $3.8bn in 2003, while its annual revenue rose 4.5% to $193bn. GM said its profits were also hit by higher healthcare costs in the US.\n\nGM reported solid overall results in 2004, despite challenging competitive conditions in many markets around the globe.\n", "smollm:1.7b": "The European losses at General Motors (GM) saw its net profits fall by 37% in the last quarter of 2004, as it continued to be hit by losses at its European operations. The US giant earned $630m (£481.5m) in the October-to-December period, down from $1bn in the fourth quarter of 2003. GM's revenues rose 4.7% to $51.2bn from $48.8bn a year earlier. The fourth-quarter losses at General Motors Europe totalled $345m, up from $66m during the same period in 2003. GM's main European brands are Opel and Vauxhall.\n\nExcluding special items, GM's global income from continuing operations totalled $569m during the quarter, down from $838m a year earlier. The results were in line with Wall Street expectations and shares in GM rose by about 1% in pre-market trade. For the whole of 2004, GM earned $3.7bn, down from $3.8bn in 2003, while its annual revenue rose 4.5% to $193bn. GM said its profits were also hit by higher healthcare costs in the US. \"GM reported solid overall results in 2004, despite challenging competitive conditions in many markets around the globe,\" GM chairman and chief executive Rick Wagoner said in a statement. The company recently announced that it expected profits in 2005 to be lower than in 2004.", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about General Motors' European losses in 2004. First, the main points are: GM's profits dropped by 37% in Q3 2004 due to European losses. They earned $630 million in October-December, down from $1 billion in Q4 2003. Revenues increased by 4.7%, and fourth-quarter losses were $345 million compared to $66 million the previous year. GM's main European brands are Opel and Vauxhall. Their global income fell by 28% when excluding special items, down from $838 million a year ago. They maintained solid results but saw higher healthcare costs in the U.S., which they attributed to rising prices of medical services. GM chairman Rick Wagoner said profits were hit by those conditions and expects lower profits next year.\n</think>\n\nGM reported significant European losses in Q3 2004, dropping net profits by 37% despite strong sales growth. They earned $630 million in the October-December period, down from $1 billion in Q4 2003. GM's revenues rose 4.7%, with fourth-quarter European losses at $345 million up from $66 million a year ago. The company had solid results globally, with income falling by 28% when excluding special items, down from $838 million. Despite rising healthcare costs in the U.S., GM's profits were maintained, but expects lower performance next year.", "tinyllama:1.1b": "European losses hit General Motor's profits during the last quarter of 2004, as GM continued to be affected by losses at its European operations. The US automaker earned $630m ($1bn) in total revenue for the period, down from $1bn during the fourth quarter of 2003. Revenues rose 4.7% to $51.2bn from the year-earlier figure. GM's main European brand, Opel and Vauxhall, posted a loss of $345m ($66m) in the fourth quarter, up from the $66m reported during the same period last year. Excluding special items, GM earned $569m ($569m) for the whole of 2004, down from $838m reported in 2003, and shares in the company rose by about 1% in pre-market trade. For the year, GM earned $3.7bn ($3.7bn), down from $3.8bn reported last year. Despite this, GM reported a solid overall profit for 2004, with its healthcare costs rising higher than in 2003 due to tough competitive conditions around the globe.", "tinydolphin:1.1b": " General Motors (GM) reported solid overall results in 2004 despite challenging competitive conditions in many markets around the globe. Its operating income fell 37% in the last quarter of 2004, while its net profit plummeted by 37%. The company's losses at European operations increased by $345m during the fourth quarter of 2004, compared to $66m recorded a year earlier. GM's revenues rose 4.7% to $51.2bn from $48.8bn a year ago. The fourth-quarter losses at General Motors Europe totalled $345m, up from $66m during the same period in 2003. GM's main European brands, Opel and Vauxhall, suffered severe revenue declines of $345m, down from $66m recorded in the same quarter of 2003. Excluding special items, GM's global income from continuing operations totalled $569m during the quarter, which was down from $838m a year earlier. The results were in line with Wall Street expectations and shares in General Motors rose by about 1% in pre-market trade. For the whole of 2004, GM generated $3.7bn, down from $3.8bn recorded in 2003. Its annual revenue rose 4.5% to $193bn. GM attributed its profits being hit by higher healthcare costs in the US. However, the company is expected to lower its profits for 2005 to be below the previous year's level.", "phi:2.7b": " General Motors (GM) saw its net profits fall 37% in Q4 2004 due to losses at European operations. Excluding special items, GM earned $572m during the quarter, down from $838m a year earlier. The company reported solid overall results despite challenging competitive conditions around the globe, but expects lower profits in 2005.\n", "orca-mini:3b": " General Motors' net profits fell by 37% in the last quarter of 2004 due to continued losses at its European operations. Losses amounted to $345 million, up from $66 million during the same period in 2003. The US company's revenues rose 4.7% to $51.2 billion from $48.8 billion a year earlier, but excluding special items, global income from continuing operations totalled $569 million during the quarter, down from $838 million a year earlier.", "hermes3:3b": "GM reduces Q4 net profits 37% to $630m, mainly due to increased European losses at Opel and Vauxhall brands.", "stablelm-zephyr:3b": "General Motors (GM) reported a 37% decline in net profits for the last quarter of 2004, due to ongoing losses in its European operations. GM earned $630m during the period, compared to $1bn in Q4 2003. Fourth-quarter losses at General Motors Europe amounted to $345m, up from $66m in the same period in 2003. The company's main European brands are Opel and Vauxhall. Excluding special items, GM's global income from continuing operations totaled $569m during the quarter, down from $838m a year earlier. Despite challenging competitive conditions globally, GM chairman and CEO Rick Wagoner stated that overall results for 2004 were solid. The company expects profits in 2005 to be lower than in 2004.", "chatgpt-4o-latest": "GM's net profits fell 37% in the last quarter of 2004 due to significant losses in its European operations. The company earned $630 million, down from $1 billion a year earlier, despite a 4.7% rise in revenue to $51.2 billion. Losses at General Motors Europe rose to $345 million from $66 million in 2003, affecting its Opel and Vauxhall brands. Excluding special items, global income from continuing operations dropped to $569 million from $838 million. For the full year, GM's profit declined slightly to $3.7 billion, while revenue increased 4.5% to $193 billion. Higher healthcare costs in the US also impacted earnings. Despite these challenges, GM's results met Wall Street expectations, and its shares rose 1% in pre-market trade. The company warned that 2005 profits would likely be lower than in 2004.", "stablelm2:1.6b": "European losses at General Motors (GM) reduced its net profits by 10% during Q4 2003 compared to the previous year, mainly due to losses in Europe. GM earned $1.5 million in October-December, down from $1 billion in Q3 2003, while its global income fell 9%. The decline was primarily attributed to higher healthcare costs in the US and challenges in many markets globally. GM's main European brands are Opel and Vauxhall.", "granite3.1-dense:2b": "In Q4 2004, General Motors (GM) experienced a 37% drop in net profits to $630m due to significant losses at its European operations, primarily from Opel and Vauxhall brands. Despite a 4.7% revenue increase to $51.2bn, these losses amounted to $345m, up from $66m in Q4 2003. Excluding special items, global income from continuing operations was $569m, down from $838m in the previous year. GM's total annual earnings for 2004 were $3.7bn, a decrease from $3.8bn in 2003, while revenues rose to $193bn, up 4.5% from the prior year. The company anticipated lower profits for 2005 due to competitive challenges globally and increased US healthcare costs.", "reference": "For the whole of 2004, GM earned $3.7bn, down from $3.8bn in 2003, while its annual revenue rose 4.5% to $193bn.GM's revenues rose 4.7% to $51.2bn from $48.8bn a year earlier.General Motors (GM) saw its net profits fall 37% in the last quarter of 2004, as it continued to be hit by losses at its European operations.The US giant earned $630m (£481.5m) in the October-to-December period, down from $1bn in the fourth quarter of 2003.GM said its profits were also hit by higher healthcare costs in the US."}