{"raw_text": "Tsunami slows Sri Lanka's growth\n \n Sri Lanka's president has launched a reconstruction drive worth $3.5bn (£1.8bn) by appealing for peace and national unity.\n \n President Kumaratunga said it was now important to find a peaceful solution to years of internal conflict. Meanwhile, the International Monetary Fund (IMF) said damage from the tsunami would cut one percentage point from Sri Lanka's economic growth this year. It estimated the wave left physical damage equal to 6.5% of the economy.\n \n Separately, the International Labour Organisation (ILO) said that at least one million people have lost their livelihoods in Sri Lanka and Indonesia alone. It called for action to create jobs. President Kumaratunga attended a ceremony in the southern town of Hambantota. She was joined by government and opposition politicians, together with Buddhist, Hindu, Muslim and Christian clergy.\n \n Prime Minister Mahinda Rajapakse laid the foundation stone on a new housing project intended to provide 6,000 homes for survivors of the tsunami. Mrs Kumaratunga called for the tragedy to be \"the start of a new beginning to rebuild our nation\". \"We are a country blessed with so many natural resources and we have not made use of them fully. Instead we have been squabbling, fighting,\" she added. Norway's peace negotiator Erik Solheim is due to arrive on Wednesday to try to revive peace talks in the decades-long conflict between government forces and the Tamil Tigers, who want a separate state in the north east of the country. Reconstruction efforts in eastern Sri Lanka have been hampered by tensions between the two sides.\n \n The IMF said that the Sri Lankan authorities' initial estimates have put the physical damage at $1.3 to $1.5bn, but added that the implications for the economy were much wider than this. \"The broader macroeconomic impact will clearly be substantial but the details are difficult to assess at this early stage,\" the IMF said. Growth, inflation, the balance of payments and foreign exchange reserves are all expected to show the effects of lost businesses and reconstruction costs. \"The fishing industry has been devastated, agricultural production may be affected and tourism will suffer, especially in the short term,\" the report said. The ILO estimated that 400,000 Sri Lankans have lost their jobs, mostly in these three industries. Earnings from tourism this year are expected to be 15% lower than last year. Economic growth this year is expected to be 4%, which is about 1% less than previously forecast. Inflation could climb to 14% compared to a previous estimate of 12%. Although major exports have not suffered, the IMF expects the reconstruction effort will require higher imports which could damage the balance of payments. Foreign exchange reserves may become strained as \"Sri Lanka will be hard pressed to keep international reserves at the pre-tsunami level\" which totalled more than two months worth of imports. Last week, the IMF approved Sri Lanka's request for a freeze on loan repayments.\n", "llama3.2:1b": "Sri Lanka has launched a reconstruction drive after a tsunami damaged its economy. The country is appealing for peace and unity in the midst of years of internal conflict. International institutions estimate that damage from the tsunami will cut one percentage point from Sri Lanka's economic growth this year, with an estimated 6.5% of the economy damaged.\n\nThe International Monetary Fund (IMF) has warned that the reconstruction effort could require higher imports, damaging the balance of payments and straining foreign exchange reserves. The ILO estimates that at least one million people have lost their livelihoods in Sri Lanka and Indonesia alone due to the tsunami and ongoing conflict.", "llama3.2:3b": "Sri Lankan president appeals for peace and national unity as part of $3.5 billion reconstruction drive damaged by tsunami. Economic growth expected to be cut one percentage point due to physical damage estimated at 6.5% of the economy. At least one million people lost livelihoods, with 400,000 job losses in fishing, agriculture and tourism industries. Inflation may rise to 14%, foreign exchange reserves strained as reconstruction requires higher imports.", "gemma2:2b": "Sri Lanka's reconstruction efforts are underway after the tsunami, with a $3.5 billion fund launched to rebuild. The IMF estimates that the tsunami will cut one percentage point from Sri Lanka's economic growth this year due to damage and lost businesses.  At least 1 million people have lost their livelihoods in Sri Lanka alone. Reconstruction projects like housing are being undertaken. President Kumaratunga called for national unity and the start of a new beginning for the country. The IMF forecasts impacts on inflation, balance of payments, and foreign exchange reserves due to lost businesses and reconstruction costs.  The tourism industry is expected to suffer, especially in the short term. \n", "qwen2.5:0.5b": "Key points:\n\n- President Kumaratunga launched a reconstruction drive worth $3.5bn (£1.8bn) to address internal conflict and economic growth in Sri Lanka.\n- The IMF estimated that the tsunami damage would reduce Sri Lanka's GDP by 1% this year, estimating physical damage equal to 6.5% of the economy.\n- The International Labour Organization (ILO) reported 6,000 homes for survivors, with losses of livelihoods from infrastructure and job losses in tourism.\n- Norway's peace negotiator Erik Solheim is expected to join Prime Minister Rajapakse's reconstruction efforts.\n- Sri Lanka's reconstruction effort has been hampered by tensions between government forces and the Tamil Tigers.\n- Economic growth projections show a 4% year-over-year increase, but inflation could rise 14%, as Sri Lanka will face higher imports compared to the pre-tsunami period.", "qwen2.5:1.5b": "The President has launched a $3.5bn reconstruction drive in Sri Lanka after the tsunami, appealing for peace and unity; it will cut one percentage point from economic growth this year. The International Labour Organization estimates that 1 million people lost their livelihoods, calling for job creation measures. The IMF says physical damage is between 6.5% to $1.3bn. Growth is expected to be down by about 1%, inflation could rise to 14%.", "qwen2.5:3b": "Tsunami damages have cut Sri Lanka’s economic growth by 1 percentage point this year, with $1.3 to $1.5 billion in physical damage assessed. President Kumaratunga launched a $3.5 billion reconstruction drive seeking peace and unity amid ongoing internal conflict. The International Labour Organization estimates one million livelihoods lost across Sri Lanka and Indonesia. Prime Minister Rajapakse announced a housing project, while the IMF highlights broader economic impacts including devastated fishing industry, affected agriculture, and tourism suffering especially in short term. Economic growth is forecast at 4% for this year, down from previous projections, with inflation expected to rise. Reconstruction efforts face challenges due to ongoing conflicts between government forces and Tamil Tigers. The IMF has approved Sri Lanka’s request to suspend loan repayments.", "opencoder:1.5b": "The tsunami has led to an unprecedented restructuring that has brought about a new peace and security for Sri Lanka, its people, and the world at large.\n \nAs Sri Lanka's prime minister launched a reconstruction drive worth $3.5bn (£1.8bn) by appealing for peace and national unity, President Kumaratunga said it was now important to find a peaceful solution to years of internal conflict.\n\nMeanwhile, the International Monetary Fund (IMF) saw the damage from the tsunami as one percentage point less from the economic growth this year, estimating that the wave left physical damage equal to 6.5% of the economy.\n\nSeparately, the International Labour Organisation (ILO) called for the closure of a number of businesses and reduced crime in Sri Lanka and Indonesia alone, suggesting an all-out recovery of lifebloods lost during the tsunami conflict.\n\nPrime Minister Mahinda Rajapakse laid the foundation stone on a new housing project intended to provide 6,000 homes for survivors of the tsunami. Mrs Kumaratunga called for the tragedy to be \"the start of a new beginning to rebuild our nation\", urging peace and prosperity in this tumultuous conflict.\n\nNorway's peace negotiator Erik Solheim is due to arrive on Wednesday to try to revive peace talks in the decades-long conflict between government forces and the Tamil Tigers, who want a separate state in the north east of the country. The tsunami has hampered reconstruction efforts in eastern Sri Lanka, impacting agriculture, tourism, and fishing industries.\n\nThe IMF's estimates were substantial but the broader macroeconomic impact was much wider than this. Economic growth this year is expected to be 4%, which is about 1% less than previously forecast. Inflation could climb to 14% compared to a previous estimate of 12%.\n\nAlthough major exports have not suffered, the reconstruction effort will require higher imports, which could damage the balance of payments and the balance of payments, according to the report.\n\nThe ILO estimated that 400,000 Sri Lankans have lost their jobs in these three industries, making tourism this year less effective compared to last year. Earnings from tourism this year are expected to be 15% lower than last year. Economic growth this year is predicted to be 4%, which is about 1% less than previously forecast.\n\nForeign exchange reserves may become strained as Sri Lanka's economic strength has been hard pressed to keep international reserves at the pre-tsunami level, which totalled more than two months worth of imports. Last week, the IMF approved Sri Lanka's request for a freeze on loan repayments. This means that all outstanding loans in Sri Lanka will be paid back and, most of all, any short-term loan that may interest you or your business could be repaid.\n", "smollm:1.7b": "The summary should preserve key ideas and details:\n\n1. The President has launched a reconstruction drive worth $3.5bn (£1.8bn) by appealing for peace and national unity.\n2. Sri Lanka's president has launched a reconstruction drive to rebuild the country, which was severely damaged by the tsunami.\n3. The President has appealed for peace and national unity in order to find a peaceful solution to years of internal conflict.\n4. The International Monetary Fund (IMF) estimated that damage from the tsunami would cut one percentage point from Sri Lanka's economic growth this year. It estimated the wave left physical damage equal to 6.5% of the economy.\n5. Separately, the International Labour Organisation (ILO) said that at least one million people have lost their livelihoods in Sri Lanka and Indonesia alone. The ILO called for action to create jobs. President Kumaratunga called for the tragedy to be \"the start of a new beginning to rebuild our nation\".\n6. Norway's peace negotiator Erik Solheim is due to arrive on Wednesday to try to revive peace talks in the decades-long conflict between government forces and the Tamil Tigers, who want a separate state in the north east of the country.\n7. Reconstruction efforts in eastern Sri Lanka have been hampered by tensions between the two sides. The IMF estimated that 400,000 Sri Lankans have lost their jobs, mostly in these three industries. Earnings from tourism this year are expected to be 15% lower than last year. Economic growth this year is expected to be 4%, which is about 1% less than previously forecast. Inflation could climb to 14% compared to a previous estimate of 12%. Although major exports have not suffered, the IMF expects the reconstruction effort will require higher imports which could damage the balance of payments. Foreign exchange reserves may become strained as \"Sri Lanka will be hard pressed to keep international reserves at the pre-tsunami level\" which totalled more than two months worth of imports.", "deepseek-r1:1.5b": "<think>\nOkay, so I have this query where the user wants me to summarize a given text concisely. The key points are about Sri Lanka's reconstruction efforts after a tsunami and some international organizations' reports. Let me start by reading through the entire text carefully.\n\nFirst, the president of Sri Lanka is starting a big reconstruction drive worth $3.5 billion. He's appealing for peace and national unity. Then it mentions the IMF saying that the physical damage from the tsunami will reduce growth by one percentage point this year, cutting economic growth by about 0.1%. They estimated the damage was 6.5% of the economy.\n\nNext, the ILO reports at least a million people lost their jobs in two countries and called for action to create jobs. The president attended a ceremony in Hambantota where she was joined by various politicians from different religious groups. Prime Minister Mahinda Rajapakse is working on a new housing project for 6000 people.\n\nThen, there's some tension between the government forces and the Tamil Tigers, who want a separate state. The IMF says initial estimates put damage at $1.3 to $1.5 billion, but this might have wider effects than that. They expect losses in fishing, agriculture, and tourism. Economic growth is expected to be 4%, down from previous forecasts of 5%. Inflation could go up to 14% instead of the previous estimate of 12%.\n\nImportantly, the economy is still stronger, with exports not suffering much, but imports are rising as they need more international reserves after the disaster. The IMF approved a freeze on loan repayments for $3.5 billion.\n\nI should make sure I include all these points without getting too detailed. The user wants just the summary in plain text, so I'll combine the main ideas from each paragraph.\n\nLet me structure it: mention the president's reconstruction drive, the IMF's economic impact, the ILO's job losses, the ongoing conflict between government and Tamil Tigers, the economic growth numbers, inflation, imports, and the IMF's financial decision.\n\nI should also note that there are still people alive, though numbers are mentioned as approximate. Make sure to include all details like 400,000 jobs lost in specific industries and export/进口 statistics.\n\nPutting it all together into a concise summary without any extra information or explanations.\n</think>\n\nSri Lanka's president is starting a large reconstruction drive worth $3.5 billion to rebuild its nation, appealing for peace and national unity after the devastating tsunami. The International Monetary Fund (IMF) has estimated that the physical damage from the disaster will reduce economic growth by 0.1%, equivalent to about 6.5% of the economy. However, the broader macroeconomic impact could be more severe than this early stage.  \n\nThe International Labour Organisation (ILO) reports that at least one million people have lost their livelihoods in Sri Lanka and Indonesia. They call for action to create jobs. President Kumaratunga attended a ceremony in Hambantota where she was joined by politicians from Buddhist, Hindu, Muslim, and Christian groups. Prime Minister Mahinda Rajapakse is working on a new housing project for 6000 families intended to provide relief to the survivors.  \n\nTensions between government forces and the Tamil Tigers (a opposition group) continue in areas north of Sri Lanka. The ILO estimates that around 400,000 people have lost their jobs, mainly in fishing, agriculture, and tourism. Tourism is expected to suffer in the short term, with earnings from this industry dropping by 15%. Economic growth is projected to be 4% for this year, down from previous forecasts of 5%, while inflation could reach 14% instead of 12%.  \n\nThe IMF approved a freeze on loan repayments for $3.5 billion due to the disaster.", "tinyllama:1.1b": "In the aftermath of the tsunami that struck Sri Lanka in 2004, President Kujaratunga launched a reconstruction drive worth $3.5bn. The government and opposition leaders attended a ceremony in Hambantom to commemorate the disaster's impact on the country. Prime Minister Mahinda Rajapakswe laid the foundation stone for new housing projects intended to provide 6,000 homes for survivors of the tsunami. Norway's peace negotiator Erik Solheim is expected to arrive in Sri Lanka on Wednesday to try to revive peace talks between government forces and the Tamil Tigers. The country's initial estimates for physical damage put it at $1.3-1.5bn, but the IMF estimates that the economic impact will be substantial but details are difficult to assess in the short term. Fishing industries have been devastated, agricultural production may be affected, and tourism will suffer. The International Labour Organisation (ILO) also noted that over 400,000 Sri Lankaans have lost their jobs, mostly in these three industries, while earnings from tourism this year are expected to be around 15% lower than last year. Inflation could climb to 14%, while the balance of payments is expected to suffer, with imports also straining foreign excanghe reserves which totalled more than two months worth of imports.", "tinydolphin:1.1b": " The Tsunami slowed Sri Lanka's growth, and President Kumaratunga declared a reconstruction drive worth $3.5bn by appealing for peace and national unity. The International Monetary Fund (IMF) estimated damage from the tsunami would cut one percentage point from the country's economic growth this year. It estimated the wave left physical damage equal to 6.5% of the economy. Meanwhile, the International Labour Organisation (ILO) called for action to create jobs and restore livelihoods in affected areas. President Kumaratunga attended a ceremony in Hambantota, where she was joined by government and opposition politicians, Buddhist, Hindu, Muslim and Christian clergy.", "phi:2.7b": " President Kumaratunga launched a reconstruction drive worth $3.5bn (£1.8bn) due to the tsunami in Sri Lanka. The International Monetary Fund and the International Labour Organization have estimated that physical damage from the disaster would cut one percentage point from Sri Lanka's economic growth this year, while at least one million people have lost their livelihoods. Norway' peace negotiator Erik Solheim is expected to arrive on Wednesday to try to revive peace talks in the decades-long conflict between government forces and the Tamil Tigers, who want a separate state. The rebuilding efforts will be hampered by tensions between the two sides.\n", "orca-mini:3b": " The tsunami has slowed down Sri Lanka's economic growth by 1% point due to physical damage and loss of livelihoods. The government and opposition politicians attended a ceremony in Hambantota to appeal for peace and national unity, while the ILO called for action to create jobs. The IMF estimated that 400,000 Sri Lankans have lost their jobs, mostly in the fishing, agricultural, and tourism industries. The government has launched a reconstruction drive worth $3.5bn, and the ILO projected that earnings from tourism this year would be 15% lower than last year due to the rebuilding effort. Inflation could climb to 14%, and foreign exchange reserves may become strained. Sri Lanka requested a freeze on loan repayments from the IMF, but the details of this were not mentioned in the text.", "hermes3:3b": "Sri Lanka's tsunami damage reduces growth by 1pct, president launches $3.5bn reconstruction drive, seeking peace and national unity.", "stablelm-zephyr:3b": "Sri Lanka's president launched a $3.5bn reconstruction drive following a tsunami that is expected to cut one percentage point from the country's economic growth this year. The International Monetary Fund (IMF) warned that damage from the disaster would leave physical impact equal to 6.5% of the economy, while the International Labour Organisation estimated that at least one million people in Sri Lanka and Indonesia had lost their livelihoods. Reconstruction efforts have been hampered by conflict between government forces and the Tamil Tigers, leading the IMF to predict higher imports required for the rebuilding effort could strain the balance of payments.", "chatgpt-4o-latest": "Sri Lanka's president launched a $3.5 billion reconstruction effort, urging peace and unity after the tsunami. The IMF estimated the disaster reduced economic growth by 1% and caused damage equal to 6.5% of the economy. The ILO reported at least one million job losses in Sri Lanka and Indonesia, with 400,000 Sri Lankans affected, mainly in fishing, agriculture, and tourism. Inflation could rise to 14%, and tourism earnings may drop by 15%. Reconstruction efforts face challenges due to ongoing conflict with the Tamil Tigers. The IMF warned of broader economic impacts, including strained foreign exchange reserves and a worsened balance of payments. Sri Lanka secured an IMF loan repayment freeze to aid recovery.", "stablelm2:1.6b": "Sri Lanka's president launched a $3.5 billion reconstruction drive amidst calls for peace and national unity after a devastating tsunami. The International Monetary Fund (IMF) estimates that physical damage from the wave reduced economic growth by one percentage point, with 6.5% of the economy suffering physical damage. At least one million people in Sri Lanka and Indonesia have lost their livelihoods due to the conflict. Reconstruction efforts in eastern Sri Lanka face tensions between government forces and the Tamil Tigers. The IMF said that reconstruction costs could affect growth, inflation, and foreign exchange reserves.", "granite3.1-dense:2b": "Sri Lanka's president, Kumaratunga, has initiated a $3.5bn (£1.8bn) reconstruction drive to address internal conflict and tsunami damage. The IMF predicts the disaster will reduce Sri Lanka's economic growth by one percentage point this year, equivalent to 6.5% of the country's GDP due to physical damage valued at $1.3-$1.5bn. At least one million people have lost their livelihoods in Sri Lanka and Indonesia, with the ILO estimating 400,000 job losses in fishing, agriculture, and tourism. The reconstruction project aims to build 6,000 homes for tsunami survivors. Kumaratunga emphasizes the need to utilize Sri Lanka's natural resources more effectively. Norway's peace negotiator is arriving to boost talks with the Tamil Tigers, whose territorial conflict has hindered reconstruction in eastern Sri Lanka. The IMF expects reduced tourism earnings by 15%, lower growth to 4%, increased inflation to 14%, and potential strain on foreign exchange reserves as the country prioritizes rebuilding efforts.", "reference": "Meanwhile, the International Monetary Fund (IMF) said damage from the tsunami would cut one percentage point from Sri Lanka's economic growth this year.The IMF said that the Sri Lankan authorities' initial estimates have put the physical damage at $1.3 to $1.5bn, but added that the implications for the economy were much wider than this.President Kumaratunga said it was now important to find a peaceful solution to years of internal conflict.Sri Lanka's president has launched a reconstruction drive worth $3.5bn (£1.8bn) by appealing for peace and national unity.Separately, the International Labour Organisation (ILO) said that at least one million people have lost their livelihoods in Sri Lanka and Indonesia alone.The ILO estimated that 400,000 Sri Lankans have lost their jobs, mostly in these three industries.Reconstruction efforts in eastern Sri Lanka have been hampered by tensions between the two sides.Last week, the IMF approved Sri Lanka's request for a freeze on loan repayments.Growth, inflation, the balance of payments and foreign exchange reserves are all expected to show the effects of lost businesses and reconstruction costs.Earnings from tourism this year are expected to be 15% lower than last year."}