{"raw_text": "Two Nigerian banks set to merge\n \n Nigerian banks United Bank of Africa and Standard Trust Bank have agreed plans to merge and create the biggest bank in West Africa.\n \n The deal is also in line with a 2004 directive from the Nigerian central bank that called for more consolidation in the nation's crowded banking sector. The merger was announced in a statement on Standard Trust's website on Tuesday, but no financial details were revealed. United Bank is the third biggest in Nigeria in terms of number of branches. Standard Trust is smaller but more profitable. \"The boards of United Bank and Standard Trust, at separate meetings yesterday, approved arrangements to merge both institutions,\" Standard Trust said. Standard Trust is 100% Nigerian-owned, but United Bank has some foreign investors, including New York-based Global Depository Receipts (32.8%), and Banca Nazionale del Lavoro and Monte del Paschi di Siena, both from Italy, who each have a 2.4% stake.\n", "llama3.2:1b": "United Bank of Africa and Standard Trust Bank are to merge in West Africa, becoming the biggest bank in Nigeria. The merger is part of a 2004 directive calling for consolidation in the country's banking sector. The merged institution will be headquartered in Nigeria, with United Bank being the largest and Standard Trust being smaller but more profitable.", "llama3.2:3b": "Nigerian banks United Bank of Africa and Standard Trust Bank agreed to merge, creating the biggest bank in West Africa, as part of a 2004 directive on banking sector consolidation. The merger was approved by the boards of both institutions, with no financial details released.", "gemma2:2b": "United Bank of Africa and Standard Trust Bank are merging to create the largest bank in West Africa, following a directive by the Nigerian central bank for consolidation. Financial details were not released but the merger was approved by both boards.  \n", "qwen2.5:0.5b": "Two Nigerian banks, Standard Trust Bank and United Bank of Africa, are planning to merge and become the largest bank in West Africa. This comes after the Nigerian central bank issued a directive requiring more consolidation in the nation's crowded banking sector. The two banks are owned by 100% Nigerian-owned but have foreign investors like Banca Nazionale del Lavoro (Italy) and Monte del Paschi di Siena (Italy).", "qwen2.5:1.5b": "Nigeria's two largest banks plan to merge, creating the country's biggest bank; deal follows central bank directive for consolidation in the sector.", "qwen2.5:3b": "Two Nigerian banks, United Bank of Africa and Standard Trust Bank, have agreed to merge, creating the largest bank in West Africa. This merger aligns with a 2004 directive from Nigeria's central bank for sector consolidation. The deal was announced on Tuesday but no financial details were revealed. United Bank is the third largest by branch count, while Standard Trust is smaller but more profitable. Both banks are Nigerian-owned; United Bank has foreign investors including Global Depository Receipts (32.8%) and Italian banks Banca Nazionale del Lavoro and Monte del Paschi di Siena (2.4% each).", "opencoder:1.5b": "\"Two Nigerian banks set to merge, the deal is also in line with a 2004 directive from the Nigeria central bank that called for more consolidation in the nation's crowded banking sector. The merger was announced in a statement on Standard Trust's website on Tuesday, but no financial details were revealed. United Bank is the third biggest in Nigeria in terms of number of branches. Standard Trust is smaller but more profitable. The boards of United Bank and Standard Trust, at separate meetings yesterday, approved arrangements to merge both institutions.\".\n", "smollm:1.7b": "The two Nigerian banks United Bank of Africa and Standard Trust Bank have agreed plans to merge and create the biggest bank in West Africa. The deal is also in line with a 2004 directive from the Nigerian central bank that called for more consolidation in the nation's crowded banking sector. The merger was announced in a statement on Standard Trust's website on Tuesday, but no financial details were revealed. United Bank is the third biggest in Nigeria in terms of number of branches. Standard Trust is smaller but more profitable. \"The boards of United Bank and Standard Trust, at separate meetings yesterday, approved arrangements to merge both institutions,\" Standard Trust said. Standard Trust is 100% Nigerian-owned, but United Bank has some foreign investors, including New York-based Global Depository Receipts (32.8%), and Banca Nazionale del Lavoro and Monte del Paschi di Siena, both from Italy, who each have a 2.4% stake.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize the given text concisely while preserving key ideas and details. Let me start by reading through the original text carefully.\n\nThe main points are that two Nigerian banks, United Bank of Africa and Standard Trust Bank, are planning to merge to create the biggest bank in West Africa. The merger aligns with a 2004 directive from the Nigerian central bank for banking consolidation. The deal was announced on Standard Trust's website, but no specific financial details were provided. United Bank has more branches than Standard Trust, and they have different ownership structures.\n\nI should focus on the key elements: the merger plan, the size of the resulting bank, the banks involved, their branch counts, ownership, and the context from the directive.\n\nFirst, I'll note the two banks merging into a larger one. Then mention the total size as the biggest in West Africa. Next, state that the merger is based on a 2004 directive, which emphasizes consolidation. The statement was released by Standard Trust but details weren't given. United Bank has more branches and is mostly owned by NPs, while Standard Trust has some foreign investors.\n\nI need to make sure all these points are included without getting too detailed. So the summary should succinctly capture each of these aspects.\n</think>\n\nThe two Nigerian banks, United Bank of Africa and Standard Trust Bank, have agreed to merge plans, resulting in the creation of the largest bank in West Africa. The deal aligns with a 2004 directive from the Nigerian central bank for banking consolidation. The merger was announced by Standard Trust on its website but no financial specifics were disclosed. United Bank has more branches than Standard Trust and is mostly owned by NPs, while Standard Trust holds some foreign investors, including New York-based Global Depository Receipts (32.8%) and Italian institutions, each with a 2.4% stake.", "tinyllama:1.1b": "Nigerian banks United Bank of Africa and Standard Trust Bank have agreed to merge and create the biggest bank in West Africa, following a directive from the Nigerian central bank in 2004. The deal is also aligned with the 2004 directive calling for more consolidation in the sector, and Standard Trust's third-largest bank, Standard Trust, will be profitably merged into United Bank. The merger was announced on a United Bank website on February 3rd, but financial details were not revealed. Both Standard Trust and United Bank are 100% Nigerian-owned, with some foreign investors including Global Depositor Receipts (32.8%) and Banca Nazionale del Lavoro from Italy, each with a 2.4% stake.", "tinydolphin:1.1b": " The two Nigerian banks, United Bank of Africa (UBA) and Standard Trust Bank, are reportedly set to merge, according to a statement on their respective websites. This move is in line with the 2004 directive from the Nigerian Central Bank that called for more consolidation in the nation's crowded banking sector. As part of the merger plan, UBA will be absorbing Standard Trust and Standard Trust will subsequently join United Bank in becoming the biggest bank in West Africa.\n\nThe deal is also expected to strengthen both banks' financial positions, as they can pool their resources and capital. With the addition of Standard Trust's branches, the combined entity will have a total of approximately 400 branches across Nigeria, further solidifying its position as the third largest bank in terms of number of branches. United Bank is currently the third biggest bank with around 300 branches, while Standard Trust has around 150 branches.\n\nThe merger announcement comes a few weeks after the Nigerian central bank issued a directive in January that urged banks to consolidate their operations. The objective of this directive was to reduce competition and improve the efficiency of the financial sector in Nigeria, which is overwhelmed with numerous small banks. This move has also been seen as a step towards addressing the concerns of consumers and investors regarding banking stability, as well as the need for greater consolidation to reduce the risks associated with multiple smaller institutions.\n\nIn summary, the two Nigerian banks are in the process of merging, which is expected to lead to an increase in the number of branches of the merged entity and strengthen their financial positions.", "phi:2.7b": " Two Nigerian banks, United Bank of Africa and Standard Trust Bank, are merging to create the largest bank in West Africa. The merger is aligned with a 2004 directive by the Nigerian central bank for more consolidation in the crowded banking sector. Financial details were not released, but United Bank has foreign investors and Standard Trust is 100% Nigerian-owned.\n", "orca-mini:3b": " Two Nigerian banks, United Bank of Africa and Standard Trust Bank, plan to merge into the largest bank in West Africa according to a statement on Standard Trust's website. The deal is in line with a central bank directive from 2004 calling for more consolidation in the banking sector. No financial details were revealed. United Bank is the third-largest bank in Nigeria, while Standard Trust is smaller but more profitable. The boards of both banks approved the merger at separate meetings.", "hermes3:3b": "Nigerian banks United Bank of Africa and Standard Trust Bank merge, creating biggest bank in West Africa per Nigerian central bank's directive for sector consolidation.", "stablelm-zephyr:3b": "Nigerian banks United Bank of Africa and Standard Trust are merging to create the largest bank in West Africa. The merger aligns with a 2004 Nigerian Central Bank directive promoting consolidation within the country's crowded banking sector. United Bank is third in terms of branches, while Standard Trust is smaller but more profitable. Both institutions have approved the merger, but no financial details were disclosed. Standard Trust is 100% Nigerian-owned, while United Bank has foreign investors including Global Depository Receipts from New York and Banca Nazionale del Lavoro and Monte del Paschi di Siena from Italy.", "chatgpt-4o-latest": "United Bank of Africa and Standard Trust Bank have agreed to merge, forming the largest bank in West Africa. The merger aligns with a 2004 directive from Nigeria's central bank promoting consolidation in the banking sector. While financial details were not disclosed, the merger was confirmed in a statement by Standard Trust. United Bank, Nigeria's third-largest by branches, has foreign investors, while Standard Trust is smaller but more profitable and fully Nigerian-owned.", "stablelm2:1.6b": "Two Nigerian banks, United Bank of Africa and Standard Trust Bank, are set to merge, creating the largest bank in West Africa. The deal aligns with Nigeria's banking sector consolidation directive from the central bank. No financial details were disclosed; United Bank is the third-largest in Nigeria based on branches, while Standard Trust is smaller but more profitable. Both institutions have Nigerian ownership and international investors like New York-based Global Depository Receipts (2.4%) and Banca Nazionale del Lavoro and Monte del Paschi di Siena, both from Italy.", "granite3.1-dense:2b": "Nigerian banks United Bank of Africa and Standard Trust Bank have agreed to merge, creating the largest bank in West Africa. This move aligns with a 2004 Nigerian central bank directive promoting industry consolidation due to the sector's overcrowding. The merger, announced by Standard Trust on their website, does not disclose financial specifics. United Bank is the third-largest in Nigeria regarding branch count, while Standard Trust, though smaller and less profitable, is 100% Nigerian-owned. Conversely, United Bank has foreign investors: Global Depository Receipts (32.8%), Banca Nazionale del Lavoro (2.4%), and Monte del Paschi di Siena (2.4%).", "reference": "Nigerian banks United Bank of Africa and Standard Trust Bank have agreed plans to merge and create the biggest bank in West Africa.\"The boards of United Bank and Standard Trust, at separate meetings yesterday, approved arrangements to merge both institutions,\" Standard Trust said.Standard Trust is smaller but more profitable."}