{"raw_text": "Ford gains from finance not cars\n \n Ford, the US car company, reported higher fourth quarter and full-year profits on Thursday boosted by a buoyant period for its car loans unit.\n \n Net income for 2004 was $3.5bn (£1.87bn) - up nearly $3bn from 2003 - while turnover rose $7.2bn to $170.8bn. In the fourth quarter alone Ford reported net income of $104m, compared with a loss of $793m a year ago. But its auto unit made a loss. Fourth quarter turnover was $44.7bn, compared to $45.9bn a year ago.\n \n Though car and truck loan profits saved the day, Ford's auto unit made a pre-tax loss of $470m in the fourth quarter (compared to a profit of £13m in the year-ago period) and its US sales dipped 3.8%.\n \n Yesterday General Motor's results also showed its finance unit was a strong contributor to profits. However, Ford is working hard to revitalise its product portfolio, unveiling the Fusion and Zephyr models at the International Motor Show in Detroit. It also brought out a number of new models in the second half of 2004. \"In 2004, our company gained momentum, delivering...more new products, and more innovative breakthroughs, such as the Escape Hybrid, the industry's first full-hybrid sport utility vehicle,\" said chairman and chief executive officer Bill Ford.\"\n \n \"We also confronted operating challenges with our Jaguar brand and high industry marketing costs,\" he added. But Ford declined to provide guidance for first quarter 2005. It will do so at a presentation in New York on 26 January. In addition, the company said 2004 net income was affected by a fourth-quarter pre-tax charge taken to reduce the value of a receivable owed to Ford by Visteon, a former subsidiary. Recent new models introduced by Ford include the Ford Five Hundred and Mercury Montego sedans, the Ford Freestyle crossover, the Ford Mustang, the Land Rover LR3/Discovery, and Volvo S40 and V50 in North America and Europe. Total company vehicle unit sales in 2004 were 6,798,000, an increase of 62,000 units from 2003. Fourth-quarter vehicle unit sales totalled 1,751,000, a decline of 133,000 units. For the full year, Ford's worldwide automotive division earned a pre-tax profit of $850m, a $697m improvement from $153m a year ago.\n", "llama3.2:1b": "Ford reported higher fourth quarter and full-year profits in 2004, with net income increasing to $3.5 billion compared to $1.87 billion the previous year. The company's car loans unit generated more revenue than expected, but its auto unit made a pre-tax loss of $470 million compared to a profit of £13 million. Ford also reported a decline in US sales and introduced new models such as the Fusion and Zephyr at the International Motor Show.", "llama3.2:3b": "Ford reported higher profits in 2004 due to its car loan unit, despite its auto unit making a loss and US sales dipping 3.8%. The company unveiled new models such as the Fusion and Zephyr at the International Motor Show in Detroit. Ford's finance unit contributed significantly to profits, but the company declined to provide guidance for Q1 2005.", "gemma2:2b": "Ford's profits increased in 2004 driven by its car loan unit, despite a loss in the auto division.  The company reported net income of $3.5 billion and saw revenue increase to $170.8 billion. Ford is focusing on revitalizing its product portfolio with new models like the Fusion and Escape Hybrid. The company also faced challenges with its Jaguar brand and high marketing costs. \n", "qwen2.5:0.5b": "Ford has achieved higher profits in the fourth quarter and full-year compared to its car loans unit. However, it still made a loss for the auto unit in the fourth quarter. The company is working on revitalizing its product portfolio and introducing new models at the International Motor Show in Detroit, including the Fusion and Zephyr sedans.", "qwen2.5:1.5b": "Ford reports strong fourth quarter and full-year profits boosted by finance unit, with auto sales down 3. 8%. CEO notes product revitalization efforts, unveiling new models including the Fusion and Zephyr at International Motor Show. Declines in Jaguar brand and high marketing costs acknowledged.", "qwen2.5:3b": "Ford reported higher profits in 2004, buoyed by its car loans unit. Net income rose to $3.5bn (£1.87bn) up nearly $3bn from 2003. In the fourth quarter alone, net income reached $104m (compared to a loss of $793m in 2003). Ford's auto unit, however, made a pre-tax loss of $470m (vs profit of £13m previously), and US sales dipped 3.8%. Despite this, the company introduced new models including the Fusion and Zephyr at the International Motor Show in Detroit. Ford also declined to provide guidance for first quarter 2005, citing a fourth-quarter pre-tax charge due to receivables owed by Visteon. Total vehicle unit sales increased by 62,000 units from 2003. In 2004, worldwide automotive division earnings reached $850m, up from $153m the previous year.", "opencoder:1.5b": "Ford gains from finance not cars\n\nFord reported higher fourth quarter and full-year profits on Thursday boosted by a buoyant period for its car loans unit. The company's net income for 2004 was up nearly $3bn (£1.87bn) - up from $3bn to $170.8bn while turnover rose $7.2bn to $170.8bn. The auto unit made a pre-tax loss of $470m in the fourth quarter (compared to £13m in the year-ago period). However, its US sales dipped 3.8% and General Motor's finance unit was also a strong contributor to profits yesterday. Ford is working hard to revitalise its product portfolio, unveiling the Fusion and Zephyr models at the International Motor Show in Detroit. The company brought out numerous new models in the second half of 2004. \"In 2004, our company gained momentum, delivering more new products, and more innovative breakthroughs, such as the Escape Hybrid, the industry's first full-hybrid sport utility vehicle,\" said chairman and chief executive officer Bill Ford.\n", "smollm:1.7b": "Ford gains from finance not cars", "deepseek-r1:1.5b": "<think>\nAlright, I need to summarize this text about Ford gaining profits from finance not cars and provide a concise summary. Let me read through the content carefully.\n\nFirst, the article mentions that Ford reported higher fourth quarter and full-year profits due to an buoyant period in its car loans unit. The net income was $3.5 billion for 2004, up nearly $3 billion from 2003. But they had a loss of $793 million in the previous year.\n\nIn the fourth quarter alone, Ford made a profit of $104 million, while sales were down by 3.8%. Their auto unit had a pre-tax loss of $470 million compared to £13 million the year before. General Motors also showed strong results from their finance unit. However, Ford is working on revitalizing its product portfolio, especially with models like the Fusion and Zephyr at the Detroit Motor Show. They introduced new models in the second half of 2004.\n\nFord's chairman stated that in 2004, they delivered more products and breakthroughs, citing the Escape Hybrid as an example. Despite some operating challenges with their Jaguar brand and high marketing costs, Ford hasn't provided guidance for the first quarter of 2005. They'll present at New York on January 26. Their vehicle unit sales increased by 62,000 units in 2004, down from 1751,000 in the previous year.\n\nThe global automotive division's profit improved from $153 million to $850 million last year. I should include all this information concisely without adding explanations or formatting.\n</think>\n\nFord reported higher fourth quarter and full-year profits for 2004 due to a strong performance in its car loans unit, with net income rising nearly $3 billion from 2003. The auto unit had a pre-tax loss of £13 million the previous year but saw a loss of $793 million in 2004. Sales declined by 3.8% despite making a profit of $104 million in the fourth quarter. General Motors also showed strong results from their finance unit, and Ford is working to revitalize its product portfolio with models like the Fusion and Zephyr at the Detroit Motor Show. They introduced new models in Q2 2004. Ford maintained momentum, increasing vehicle unit sales by 62,000 units and improving profit margins. The global automotive division reported a $697 million improvement from $153 million last year.", "tinyllama:1.1b": "In summary, Ford gained momentum in 2004 with the launch of new products and innovative breakthroughs such as the Escape Hybrid sport utility vehicle, leading to an overall net income growth of $3.5bn and a higher fourth-quarter profit of nearly $3bn. The company's financiance unit also delivered pre-tax profits of $104m, compared with losses of $793m in 2003, thanks to the buoyant period for its car loan units. However, the auto segment saw a dip in vehicle sales due to an unprecedented US sales slump caused by supply chain issues and other factors. The company reported a pre-tax profit of $470m in the fourth quarter, but its automobile unit faced new challenges with the launch of Jaguar brand cars and higher industry marketing costs. Ford's global automotive division earned pre-tax profits of $850m on 6.8m units sold in 2004, a decline of 133,000 units.", "tinydolphin:1.1b": " Ford reported higher fourth quarter profits on Thursday, boosted by its car loans unit. The company's net income for 2004 was $3.5bn, up nearly $3bn from 2003. In the fourth quarter alone, Ford reported net income of $104m, compared with a loss of $793m a year ago. But its auto unit made a loss. Fourth quarter turnover was $44.7bn, compared to $45.9bn a year ago.\n \nYet car and truck loan profits saved the day for Ford's auto unit. Its pre-tax profit in the fourth quarter was $470m, a decrease of $470m from the year before. The company also reported a dip in US sales of 3.8%. This decline is attributed to its competitors releasing new models and Ford's inability to match their offerings effectively.", "phi:2.7b": " Ford reported higher profits in 2004 due to its car loan unit, but its auto unit made a loss. The company is working on revitalizing its product portfolio with new models such as the Fusion and Zephyr. However, it faced challenges with its Jaguar brand and high marketing costs. Ford declined to provide guidance for 2005. Its vehicle unit sales increased in 2004 but decreased in the fourth quarter of \n", "orca-mini:3b": " Ford gained from finance not cars. Its car loans unit made higher profits and boosted its net income by nearly $4bn compared to 2003. However, its auto unit made a pre-tax loss of $470m in the fourth quarter, compared to a profit of $13m in the year-ago period. Ford also brought out new models during the year and unveiled the Fusion and Zephyr models at the International Motor Show in Detroit. Although its US sales dipped 3.8%, the company remains focused on revitalizing its product portfolio. However, it declined to provide guidance for the first quarter of 2005.", "hermes3:3b": " Ford reports higher profits due to finance (loans) over car sales, while auto unit incurs loss.", "stablelm-zephyr:3b": "Ford reported higher profits in 2004 thanks to its car loans unit, which saved $3bn compared to the previous year. The company's auto unit made a pre-tax loss of $470m in Q4 2004, despite gaining momentum in product development with the launch of Fusion and Zephyr models. Ford focused on unveiling new models during the International Motor Show in Detroit and addressing operating challenges with brands like Jaguar. Total company vehicle unit sales increased by 62,000 units from 2003 to 2004, earning a pre-tax profit of $850m for the worldwide automotive division.", "chatgpt-4o-latest": "Ford reported higher profits for 2004, driven by strong performance in its car loans unit rather than its auto sales. Net income rose to $3.5 billion, up nearly $3 billion from 2003, while revenue increased to $170.8 billion. In the fourth quarter, Ford posted a net income of $104 million, reversing a $793 million loss from the previous year, despite its auto unit suffering a pre-tax loss of $470 million. U.S. vehicle sales declined by 3.8%. Ford is focusing on revitalizing its product lineup, introducing new models like the Fusion and Zephyr, as well as the Escape Hybrid. Chairman Bill Ford acknowledged challenges with the Jaguar brand and high marketing costs. The company also took a pre-tax charge related to a receivable from former subsidiary Visteon. Total vehicle sales for 2004 reached 6.8 million units, a slight increase from 2003, though fourth-quarter sales declined. Ford's worldwide automotive division posted a pre-tax profit of $850 million for the year, a significant improvement from the previous year.", "stablelm2:1.6b": "US car company Ford reported higher profits for Q4 and FY20 due to strong car loans unit performance, with net income up nearly $3bn compared to the previous year and turnover increasing by $7.2bn. Auto unit made a loss in 4Q but overall sales declined 3%. Ford's finance unit contributed to profits; however, auto unit faced challenges such..\nas operating losses for Jaguar brand and high marketing costs. The company has not provided Q1 guidance, but the net income was affected by a pre- tax charge related to the value of a receivable owed to Visteon, a former subsidiary. Recent new models include Escape Hybrid, Five Hundred, Montego, Freestyle, Mustang, LR3/Discovery, and Volvo S&C V in NA & Europe. Total vehicle unit sales increased 27% in Q4 and FY.", "granite3.1-dense:2b": "In Q4 and full-year 2004, Ford reported significant profits, primarily due to its car loans unit, which contributed $3.5bn (£1.87bn) to net income, up nearly $3bn from 2003. Despite a loss in the auto unit for Q4 ($470m vs. £13m in the year-ago period), Ford's total turnover increased to $170.8bn (Q4: $44.7bn) and vehicle sales rose to 6,798,000 units (up 62,000 from 2003). The company introduced several new models in 2004, such as the Fusion, Zephyr, Five Hundred, Mercury Montego, Freestyle, Mustang, Land Rover LR3/Discovery, and Volvo S40/V50. However, Ford's US auto sales dipped 3.8%, and its Jaguar brand faced challenges along with high marketing costs. The company declined to provide guidance for Q1 2005 but stated it would do so in a New York presentation on 26 January. The 2004 net income was impacted by a $697m reduction in the value of a receivable from Visteon, a former subsidiary.", "reference": "In the fourth quarter alone Ford reported net income of $104m, compared with a loss of $793m a year ago.Ford, the US car company, reported higher fourth quarter and full-year profits on Thursday boosted by a buoyant period for its car loans unit.Though car and truck loan profits saved the day, Ford's auto unit made a pre-tax loss of $470m in the fourth quarter (compared to a profit of £13m in the year-ago period) and its US sales dipped 3.8%.Fourth quarter turnover was $44.7bn, compared to $45.9bn a year ago.Total company vehicle unit sales in 2004 were 6,798,000, an increase of 62,000 units from 2003.Recent new models introduced by Ford include the Ford Five Hundred and Mercury Montego sedans, the Ford Freestyle crossover, the Ford Mustang, the Land Rover LR3/Discovery, and Volvo S40 and V50 in North America and Europe.In addition, the company said 2004 net income was affected by a fourth-quarter pre-tax charge taken to reduce the value of a receivable owed to Ford by Visteon, a former subsidiary.But Ford declined to provide guidance for first quarter 2005."}