{"raw_text": "India's Reliance family feud heats up\n \n The ongoing public spat between the two heirs of India's biggest conglomerate, Reliance Group, has spilled over to the board meeting of a leading company within the group.\n \n Anil Ambani, vice-chairman of India Petrochemicals Limited (IPCL), stayed away from a gathering of senior managers on Thursday. The move follows a decision earlier this month by Anil - the younger brother of Reliance Group president Mukesh Ambani - to resign from his post. His resignation was not accepted by his brother, who is also the boss of IPCL. The IPCL board met in Mumbai to discuss the company's results for the October-to-December quarter.\n \n It is understood that the board also considered Anil's resignation and asked him to reconsider his decision. However, Anil's demand that Anand Jain - another IPCL board member accused by Anil of creating a rift in the Ambani family - be thrown out, was not met. Anil has accused Anand Jain, a confidant of his brother Mukesh, of playing a negative role in the Ambani family, and being responsible for the trouble between the brothers. On Wednesday, the board of Reliance Energy, another Reliance Group company, reaffirmed its faith in Anil, who is the company's chief. Reliance Group acquired the government's 26% stake in IPCL - India's second-largest petrochemicals company - in 2002, as part of the privatisation drive. Meanwhile, the group's flagship company, Reliance Industries, has its board meeting on Friday to consider its financial results. Mukesh is the company's chairman and Anil its deputy, and it is expected that both brothers will come face to face in the meeting. The Ambani family controls 48% of the group, which is worth $17bn (£9.1bn; 745bn Indian rupees). It was founded by their father, Dhiru Bhai Ambani, who died two years ago.\n", "llama3.2:1b": "India's Reliance Group family feud continues, with Anil Ambani staying away from a meeting of IPCL's senior managers following his resignation as vice-chairman in October. The board considered his decision but also asked him to reconsider, citing the negative impact on the company and the rift it had caused within the family.", "llama3.2:3b": "The Ambani brothers Anil and Mukesh continue to feud over control of Reliance Group, with Anil refusing to reconsider his resignation from IPCL board due to a disagreement over board member Anand Jain. The situation escalated as the IPCL board met without Anil, but Reliance Energy reaffirmed its support for him. The brothers will meet at the Reliance Industries' board meeting on Friday to discuss their financial results.", "gemma2:2b": "Anil Ambani, younger brother of Reliance Industries' chairman Mukesh Ambani, resigned from his post at India Petrochemicals Limited (IPCL) and has been absent from related board meetings. The IPCL board discussed Anil's resignation but did not accept it.  The conflict stems from accusations made by Anil against another board member, Anand Jain, regarding family issues and a rift between the brothers. Reliance Energy, another company in the group, reaffirmed its support for Anil. Both brothers are expected to face each other during the Reliance Industries' board meeting on Friday. \n", "qwen2.5:0.5b": "India's Reliance Group faces a split over its CEO Anil Ambani, the younger brother of Mukesh Ambani's former boss, who is accused of playing a negative role in the family feud and creating rifts within it.", "qwen2.5:1.5b": "Anil Ambani, vice-chairman of Reliance Group subsidiary India Petrochemicals Limited, skipped a board meeting over his resignation from the company and demanded that IPCL board member Anand Jain be removed, leading to further tension within the family. The Ambani brothers' group has control over $17bn in assets and includes Reliance Industries with its own financial results due on Friday.", "qwen2.5:3b": "India's Reliance family feud intensifies as Anil Ambani, vice-chairman of India Petrochemicals Limited (IPCL), stays away from a board meeting in Mumbai. Anil resigned from his position earlier this month but was rejected by Mukesh Ambani, IPCL's chairman and also the president of Reliance Group. The board met to discuss IPCL's results for the October-to-December quarter. Both brothers are expected to face each other at the upcoming board meeting of Reliance Industries, where Anil is deputy chairman. The feud has led to accusations and tensions within the Ambani family, with Anil alleging that his brother Mukesh's confidant Anand Jain played a negative role. The group, founded by Dhiru Bhai Ambani, controls 48% of Reliance Group worth $17bn (£9.1bn; 745bn Indian rupees).", "opencoder:1.5b": "India's Reliance family feud has turned up heated public disputes. Anil Ambani was taken away from a gathering of senior managers on Thursday as he resigned from his post in April 2018. The IPCL board met in Mumbai to discuss the company's results for the October-to-December quarter. Mukesh, now an Indian entrepreneur with 26% stake in India's Petrochemicals Limited (IPCL), made a decision earlier this month that was not accepted by Anil's brother. Anand Jain, another IPCL board member accused by Anil of creating a rift in the Ambani family, and Anil’s demand to reconsider his decision was not met. The group's flagship company, Reliance Energy, reaffirmed its faith in Anil who is the company's chief. The group’s ambassadors also reaffirmed their faith in Anil and made him a key figure in the company's mission - developing high-quality high-stress machinery for growth and innovation.\n", "smollm:1.7b": "", "deepseek-r1:1.5b": "<think>\nAlright, let's tackle this query step by step. The user has provided a text about a conflict between the Reliance family and some senior management at an IPCL company. They want me to summarize it concisely while preserving key ideas and details.\n\nFirst, I need to parse the main points. The text mentions that Anil Ambani's younger brother Mukesh left his position at Reliance Group, which led to a meeting with Anil staying away from IPCL's board. The decision was made by Anil but rejected by his brother, who took him out of office.\n\nThe key details include the timing of the decision (earlier this month), Anil's action, the board's response, and Anil's accusations against another board member, Anand Jain. It also provides background on how Reliance Group acquired IPCL, which is part of the group. The meeting schedule for different companies and the upcoming financial results are included.\n\nI should ensure that the summary captures all these points: the feud between Ambani brothers, Anil's absence from the meeting, his resignation decision being rejected, Anand Jain's role, Anil's accusations, and the subsequent board response from Reliance Energy reaffirming support for him. I also need to mention the 48% control, the 17 billion rupees value, and who founded the company.\n\nI'll structure this into a clear summary, making sure it's concise yet comprehensive. Avoid adding any explanations or context, just stick to summarizing directly from the text.\n</think>\n\nThe ongoing feud between the Reliance family members has heated up as Anil Ambani, the younger brother of Mukesh Ambani president of Reliance Group, stayed away from a board meeting at IPCL. The decision was made earlier this month but was rejected by his brother, who also serves as vice chairman of IPCL. Anil has accused another board member, Anand Jain, of creating a rift in the family and accused him of playing a negative role. Reliance Energy, a Reliance Group company, reaffirmed its faith in Anil during its meeting, while Mukesh Ambani and Anil are set to meet at their board meeting on Friday regarding financial results.", "tinyllama:1.1b": "India's Reliance family feud has escalated after Anil Ambani of the Reliance Group abstained from attending a board meeting at IPCL, the second-largest petrochemical company in India. Anil also demanded Anaand Jain's ouster, accusing him of playing a negative role in the family and being responsible for the feud between Anil and Mukesh Ambani. Meanwhile, Reliance Group acquired the government's 26% stake in IPCL in 2002 as part of the privatisations drive, but relations have deteriorated since then. The group's flagship company Reliance Industries is set to hold its board meeting on Friday, where Mukesh Ambani will be facing his younger brother Anil in a face-to-face encounter. Despite reports of tension between the two siblings, it was expected that the Ambani family would come face to face in the meeting. The Reliance group's total value is estimated at $17bn (£9.1bn; 745bn Indian rupees).", "tinydolphin:1.1b": " The Reliance Family Feud escalates with the ongoing disagreement between Anil Ambani and his brother Mukesh over control of India's second-largest petrochemical company, IPCL. Anil is the vice-chairman of the group and has decided to step away from the board meeting, attended by senior managers, while Mukesh remains unavailable for the gathering in Mumbai. The Ambani brothers also have a heated disagreement over who will lead Reliance Industries (RI), which has a market value of $17 billion and is valued at 48% of the group's total value, worth an estimated $9.1bn. The feud between these two brothers was sparked by their father's death in 2013, who founded Reliance Industries.", "phi:2.7b": " India's Reliance Group is in a dispute between two heirs, Anil Ambani and his brother Mukesh Ambani. The feud has spilled over to an IPCL board meeting, where Anand Jain, accused by Anil of creating rifts in the family, was not removed from the company. \n\nAnil Ambani resigned from his post at India Petrochemicals Limited after he disagreed with his brother's decision to keep him as a board member. The dispute between the two brothers is seen as a threat to Reliance Industries' financial results on Friday.\n", "orca-mini:3b": " India's Reliance Group feud between its two heirs has escalated with Anil Ambani resigning from his position and the board of IPCL meeting to discuss the results for the October-to-December quarter. Mukesh Ambani, the group chairman, is expected to face off against Anil at the board meeting of Reliance Energy on Wednesday. The group's flagship company, Reliance Industries, will also hold a board meeting on Friday to consider its financial results.", "hermes3:3b": "Reliance Group heirs Anil & Mukesh Ambani family feud impacts company board meetings. Anil refuses to accept resignation denial, demands another IPCL board member's removal.", "stablelm-zephyr:3b": "The sibling rivalry between Anil and Mukesh Ambani, heirs to India's Reliance Group, has escalated, causing a rift within the company. Anil, vice-chairman of India Petrochemicals Limited (IPCL), resigned earlier this month and his resignation was not accepted by his brother Mukesh, who is also the boss of IPCL. The IPCL board met to discuss the company's results but considered Anil's resignation as well. While the board asked Anil to reconsider his decision, his demand to remove another board member, Anand Jain, was denied. Reliance Energy reaffirmed its faith in Anil, and both brothers are expected to attend the upcoming board meeting of their flagship company, Reliance Industries, where they will discuss the financial results. The ongoing conflict within the Ambani family has significant impact on India's conglomerate with a value of $17 billion.", "chatgpt-4o-latest": "The feud between Mukesh and Anil Ambani, heirs to India's Reliance Group, has intensified, affecting board meetings of key companies within the conglomerate. Anil, vice-chairman of India Petrochemicals Limited (IPCL), skipped a board meeting after his resignation was rejected by Mukesh, who also leads IPCL. The board urged Anil to reconsider but did not meet his demand to remove Anand Jain, whom Anil accuses of causing the family rift. Meanwhile, Reliance Energy's board reaffirmed support for Anil. The dispute is set to continue as both brothers are expected to confront each other at Reliance Industries' board meeting. The $17 billion group, founded by their late father Dhiru Bhai Ambani, remains under family control.", "stablelm2:1.6b": "The text discusses a family feud between the heirs of India's largest conglomerate, Reliance Group, as it spills over into a company within the group and an IPCL board meeting. Anil Ambani, the younger brother of Mukesh Ambani (Reliance Group president), resigned from his post at India Petrochemicals Limited (IPCL) earlier this month due to family disputes. The IPCL board considered his resignation but asked him to reconsider; however, Anil maintained that another IPCL board member, Anand Jain, was behind the rift and played a negative role in the Ambani family. Reliance Energy, another company within the group, reaffirmed faith in Anil as its chief. The text also mentions that the Ambani family controls 49% of the group, which is worth $10 billion (Indian rupees), and was founded by their father, Dhiru Bhai Ambani.", "granite3.1-dense:2b": "The ongoing dispute between Anil and Mukesh Ambani, co-founders of India's Reliance Group, intensified when Anil resigned as IPCL's vice-chairman and accused Anand Jain of causing family strife. Despite Anil's demand for Jain's dismissal, the IPCL board did not comply. Anil remains defiant, while Mukesh retains his position at Reliance Energy, where Anil is chief. The families control a $17bn conglomerate. Reliance Industries' board will convene on Friday to review financials, with the brothers expected to meet and discuss the family's dynamic.", "reference": "However, Anil's demand that Anand Jain - another IPCL board member accused by Anil of creating a rift in the Ambani family - be thrown out, was not met.On Wednesday, the board of Reliance Energy, another Reliance Group company, reaffirmed its faith in Anil, who is the company's chief.The move follows a decision earlier this month by Anil - the younger brother of Reliance Group president Mukesh Ambani - to resign from his post.The ongoing public spat between the two heirs of India's biggest conglomerate, Reliance Group, has spilled over to the board meeting of a leading company within the group.Anil has accused Anand Jain, a confidant of his brother Mukesh, of playing a negative role in the Ambani family, and being responsible for the trouble between the brothers.Reliance Group acquired the government's 26% stake in IPCL - India's second-largest petrochemicals company - in 2002, as part of the privatisation drive."}