{"raw_text": "Criminal probe on Citigroup deals\n \n Traders at US banking giant Citigroup are facing a criminal investigation in Germany over a controversial bond deal.\n \n The deal saw the sale of 11bn euros ($14.4bn; £7.6bn) of government bonds in a few minutes on 2 August, with 4bn euros-worth then bought back later. The move was widely criticised at the time, and now the German regulator has said it has found evidence of possible market manipulation. Citigroup said it would continue to co-operate fully with the authorities. \"We are disappointed that the BaFin has referred to the prosecutor the question of whether action should be brought against individuals involved,\" Citigroup said. If the traders are found guilty, they could face a five-year jail term or a fine, Reuters reported BaFin as saying. However, under German criminal law, prosecutors cannot pursue Citigroup itself.\n \n Germany's financial watchdog BaFin told BBC News it had now transferred the investigation to the public prosecutor. \"I can confirm that BaFin has passed through the case to the public prosecutor,\" a BaFin spokeswoman said. \"It is now a criminal investigation.\" \"We found clues of possible market manipulation,\" the spokeswoman said, which included signs of linked bond trading ahead of the main trades on 2 August. \"Germany's Securities Trading Act says that if BaFin finds such clues, it has to put the case in the hands of the prosecutor.\" Regulatory investigations are still going on in France, the UK and elsewhere. Some Citigroup operations elsewhere in the world came under regulatory criticism in 2004. Its private banking operation in Japan was closed down by regulators in Tokyo after an \"aggressive sales culture\" led the bank to flout anti-money laundering rules.\n", "llama3.2:1b": "Traders at US banking giant Citigroup are facing a criminal investigation in Germany over a bond deal that involved selling 11bn euros ($14.4bn; £7.6bn) of government bonds in just a few minutes, with some worth then being bought back later. The German regulator has found evidence of possible market manipulation and is now transferring the case to the public prosecutor, who can pursue individuals involved or Citigroup itself for a five-year jail term or fine if convicted.", "llama3.2:3b": "Traders at US banking giant Citigroup are facing a criminal investigation in Germany over a controversial bond deal that saw 11bn euros sold and bought back in minutes, sparking market manipulation allegations. The German regulator BaFin has passed the case to the public prosecutor, who could impose jail terms or fines on individuals involved.", "gemma2:2b": "Citigroup traders in Germany are facing a criminal investigation for alleged market manipulation in a bond deal. The regulator, BaFin, has referred the case to prosecutors who could impose penalties on individuals involved if found guilty.  This follows a controversial bond sale that took place over several minutes and was met with criticism at the time. \n", "qwen2.5:0.5b": "A German financial regulator has initiated a criminal probe into Citigroup over a deal for 11 billion euros worth of government bonds in a few minutes on August 2, with Citigroup claiming it would continue to cooperate fully with authorities. The deal was controversial and sparked widespread criticism at the time, leading to potential fines or jail sentences. German regulators have now transferred the investigation to the public prosecutor, which is now a criminal case. The regulator found clues of possible market manipulation in Citigroup's operations, including linked bond trading.", "qwen2.5:1.5b": "Citigroup faces a criminal investigation in Germany over a controversial bond deal involving market manipulation, with potential fines and jail terms for traders. The case has been transferred from BaFin to the public prosecutor. Regulatory investigations are ongoing globally.", "qwen2.5:3b": "Criminal probe on Citigroup deals:\nTraders at US bank Citigroup are facing a criminal investigation in Germany over a controversial bond deal involving 11bn euros ($14.4bn; £7.6bn) of government bonds sold and then bought back shortly after, criticized widely at the time. German regulator BaFin found evidence suggesting possible market manipulation. If traders are found guilty, they could face up to five years in prison or a fine under German law, which prevents Citigroup itself from being pursued. Regulatory investigations also continue in France, UK, and other places. Previous Citigroup operations have faced criticism for aggressive sales culture leading to anti-money laundering violations.", "opencoder:1.5b": "Criminal probe on Citigroup deals with a criminal investigation in Germany, involving the sale of government bonds and a potential market manipulation case. The deal shows significant gain for traders at Citigroup due to the sale of 11bn euros worth $14.4bn (£7.6bn). The move was widely criticized at the time, but now the German regulator has revealed evidence that may indicate market manipulation. Traders are currently continuing to co-operate fully with the authorities.\n\nCitigroup said it had made a case against the criminal probe in BaFin's court earlier this year. If found guilty, they could face up to five years in prison or a fine. However, under German law, the prosecutor has no power to pursue decisions taken by the Citigroup family.\n\nGermany's watchdog BaFin has now transferred the investigation to the public prosecutor who has rights beyond legal jurisdiction and is able to search for any evidence of possible market manipulation. BaFin has also reported that it has passed through the case to a public prosecutor.\n\nUnder French law, there are ongoing investigations in France, Japan, and elsewhere. Citigroup operations outside these regions were also subject to regulatory scrutiny by regulators in 2004 after being shut down due to an \"aggressive sales culture\" leading the bank into illicit activities against money laundering laws.\n", "smollm:1.7b": "The summary is concise and objective, capturing the main points of the original text without adding any analysis or interpretation. It includes key information such as:\n\n1. The criminal investigation into Citigroup deals in Germany\n2. Traders at US banking giant Citigroup are facing a criminal investigation in Germany over a controversial bond deal\n3. The deal saw the sale of 11bn euros ($14.4bn; £7.6bn) of government bonds in a few minutes on 2 August, with 4bn euros-worth then bought back later\n4. The German regulator has found evidence of possible market manipulation\n5. Citigroup said it would continue to co-operate fully with the authorities\n6. If the traders are found guilty, they could face a five-year jail term or a fine\n7. Germany's financial watchdog BaFin told BBC News it had now transferred the investigation to the public prosecutor\n8. The prosecutors found clues of possible market manipulation\n9. The German watchdog said it has put the case in the hands of the public prosecutor\n10. Regulatory investigations are still going on in France, the UK and elsewhere\n\nThe summary is free from bias and does not include any opinions or explanations about the text's meaning or significance.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text about a criminal probe on Citigroup's bond deals in Germany. The user wants only the summary without any explanations or formatting. So, let me go through each paragraph step by step.\n\nFirst paragraph introduces the probe and mentions the deal details. They sold 11 billion euros of government bonds quickly and bought them back later. That part is about the events leading up to the investigation.\n\nThe next paragraph says that the regulator in Germany has found evidence suggesting market manipulation. Citigroup is being criticized, but now they're responding, saying cooperation is full.\n\nThere's a quote fromCitigroup where they express disappointment with a referred question and mention possible jail time. They also note German law doesn't allow prosecution of the company itself but can handle probes to the public prosecutor.\n\nAnother part talks about BaFin transferring the case to the public prosecutor on BBC News and mentions other countries' investigations ongoing. There's an example from 2004 where a Japanese bank was closed down for selling too much, which is linked to regulatory criticism.\n\nI need to capture all these points concisely without getting into details. I'll focus on the key events: the bond deal happening in Germany, the regulator finding evidence of market manipulation, Citigroup's response about cooperation and possible penalties, and examples from other countries regarding regulatory actions.\n</think>\n\nCriminal probe on Citigroup deals  \nTraders at US banking giant Citigroup are facing a criminal investigation in Germany over a controversial bond deal. The deal saw the sale of 11 billion euros (approx $14.4 billion; £7.6 billion) of government bonds and later purchase of them back. This move was widely criticized, and now German regulator BaFin has reported evidence suggesting possible market manipulation. Citigroup is being questioned by authorities about potential penalties if the involved traders are found guilty. If charged, they could face five-year jail terms or fines. Under German law, prosecutors cannot pursue Citigroup itself but can handle probes to public officials. BaFin's decision to transfer the case to the public prosecutor also reflects broader regulatory oversight in France, the UK, and elsewhere. In 2004, a Japanese bank was closed down for selling too much money, highlighting regulatory criticism in different regions.", "tinyllama:1.1b": "A German financial watchdog has referred a possible market manipulation case involving Citigroup's bond trading operations to public prosecutors, triggering a criminal investigation. In Germany, the Securieties Tradings Act says that if BaFin finds evidence of such a crime, it must hand over the case to the public prosecutor. The German regulatory authority also transferred the case to a public prosecutor in Frankfurt to continue the investigation and assess any potential consequences for Citigroup and its traders at the banking giant. The alleged manipulation occurred on August 2, 2017, when Citigroup sold $14.4bn worth of government bond sales in a few minutes before returning them later at a loss. However, Citigroup said it would continue to cooperate with authorities following the referral by BaFin and vowed to fully comply if investigated. The move was widely criticized at the time, and now the German watchdog has referred the matter to public prosecutors. If convicted, Citigroup traders could face a five-year jail term or a fine.", "tinydolphin:1.1b": " A German financial regulator has started a criminal investigation into the Citi Group bond deal, with traders facing possible jail time if they are found guilty. This comes following allegations of market manipulation over the fast-sale and later buyback of 11 billion euros worth of government bonds in just minutes on August 2. The deal was heavily criticized at the time due to concerns about potential price manipulation, with Citigroup denying any wrongdoing. The decision by BaFin comes amidst a broader investigation into global banking practices. If traders are found guilty, they may face a five-year jail term or a fine of up to 5 million euros, but this could be overturned if they cooperate fully with the prosecutor.", "phi:2.7b": " A criminal investigation is underway against traders at US banking giant Citigroup over a controversial bond deal that sold and repurchased government bonds in just a few minutes, sparking criticism. Germany's financial watchdog has found evidence of possible market manipulation, and it was passed on to the public prosecutor for further action. This is not the first time Citigroup has faced regulatory scrutiny, with similar criticisms in 2004 and a subsequent private banking operation closure in Japan.\n", "orca-mini:3b": " German authorities have launched a criminal probe on Citigroup deals involving a controversial bond deal that saw the sale of 11 billion euros ($14.4 billion; £7.6 billion) of government bonds in a few minutes and the purchase of 4 billion euros worth later. The traders are facing a five-year jail term or a fine for possible market manipulation. BaFin, Germany's financial watchdog, transferred the investigation to the public prosecutor and found clues of market manipulation, which led to the referral of the case to the prosecutor. Regulatory investigations are still going on in France, the UK, and elsewhere.", "hermes3:3b": "Citigroup traders under criminal investigation for possible market manipulation over controversial bond deal in Germany.", "stablelm-zephyr:3b": "Citigroup traders are facing a criminal investigation in Germany over a controversial bond deal that involved selling $14.4bn worth of government bonds and then buying them back later. German regulator BaFin found evidence of possible market manipulation and transferred the case to the public prosecutor. If the traders are found guilty, they could face a five-year jail term or a fine. Regulatory investigations are ongoing in France, UK, and other locations regarding Citigroup's operations.", "chatgpt-4o-latest": "Citigroup traders are under criminal investigation in Germany for possible market manipulation related to a controversial €11bn bond deal on 2 August. The German financial regulator BaFin found evidence of linked bond trading and referred the case to prosecutors. If found guilty, the traders could face up to five years in jail or fines, though Citigroup itself cannot be prosecuted under German law. Citigroup expressed disappointment but pledged full cooperation. Regulatory probes are also ongoing in France, the UK, and other countries. In 2004, Citigroup faced regulatory scrutiny elsewhere, including the closure of its private banking unit in Japan for violating anti-money laundering rules.", "stablelm2:1.6b": "US traders at Citigroup face a criminal investigation in Germany over a bond deal that raised eyebrows for its swift sale and fast buying back of government bonds. The German regulator, BaFin, found evidence of possible market manipulation after discovering signs of linked bond trading ahead of the main trades on August 2nd. If convicted, the traders could face up to five-year jail terms or fines. However, under German law, prosecutors cannot pursue Citigroup itself.", "granite3.1-dense:2b": "Citigroup traders are under criminal investigation in Germany for alleged market manipulation in a controversial 11 billion euro government bond deal on August 2, 2023. The German financial watchdog, BaFin, discovered signs of pre-arranged trading ahead of the main transaction, leading to possible charges against individuals involved. If convicted, traders could face up to five years in jail or fines. Citigroup will cooperate fully with authorities, and BaFin has transferred the case to Germany's public prosecutor. Meanwhile, regulatory investigations continue in France, the UK, and other locations, following past criticisms of Citigroup's operations, such as its Japanese private banking unit's closure due to aggressive sales and anti-money laundering violations in 2004.", "reference": "\"I can confirm that BaFin has passed through the case to the public prosecutor,\" a BaFin spokeswoman said.\"We are disappointed that the BaFin has referred to the prosecutor the question of whether action should be brought against individuals involved,\" Citigroup said.Traders at US banking giant Citigroup are facing a criminal investigation in Germany over a controversial bond deal.Germany's financial watchdog BaFin told BBC News it had now transferred the investigation to the public prosecutor.However, under German criminal law, prosecutors cannot pursue Citigroup itself.The move was widely criticised at the time, and now the German regulator has said it has found evidence of possible market manipulation."}