{"raw_text": "SEC to rethink post-Enron rules\n \n The US stock market watchdog's chairman has said he is willing to soften tough new US corporate governance rules to ease the burden on foreign firms.\n \n In a speech at the London School of Economics, William Donaldson promised \"several initiatives\". European firms have protested that US laws introduced after the Enron scandal make Wall Street listings too costly. The US regulator said foreign firms may get extra time to comply with a key clause in the Sarbanes-Oxley Act.\n \n The Act comes into force in mid-2005. It obliges all firms with US stock market listings to make declarations, which, critics say, will add substantially to the cost of preparing their annual accounts.\n \n Firms that break the new law could face huge fines, while senior executives risk jail terms of up to 20 years. Mr Donaldson said that although the Act does not provide exemptions for foreign firms, the Securities and Exchange Commission (SEC) would \"continue to be sensitive to the need to accomodate foreign structures and requirements\". There are few, if any, who disagree with the intentions of the Act, which obliges chief executives to sign a statement taking responsibility for the accuracy of the accounts. But European firms with secondary listings in New York have objected - arguing that the compliance costs outweigh the benefits of a dual listing. The Act also applies to firms with more than 300 US shareholders, a situation many firms without US listings could find themselves in.\n \n The 300-shareholder threshold has drawn anger as it effectively blocks the most obvious remedy, a delisting. Mr Donaldson said the SEC would \"consider whether there should be a new approach to the deregistration process\" for foreign firms unwilling to meet US requirements.\n \n \"We should seek a solution that will preserve investor protections\" without turning the US market into \"one with no exit\", he said. He revealed that his staff were already weighing up the merits of delaying the implementation of the Act's least popular measure - Section 404 - for foreign firms. Seen as particularly costly to implement, Section 404 obliges chief executives to take responsibility for the firm's internal controls by signing a compliance statement in the annual accounts. The SEC has already delayed implementation of this clause for smaller firms - including US ones - with market capitalisations below $700m (£374m).\n \n A delegation of European firms visited the SEC in December to press for change, the Financial Times reported.\n \n It was led by Digby Jones, director general of the UK's Confederation of British Industry (CBI) and included representatives of BASF, Siemens and Cadbury Schweppes. Compliance costs are already believed to be making firms wary of US listings. Air China picked the London Stock Exchange for its secondary listing in its $1.07bn (£558m) stock market debut last month. There are also rumours that two Chinese state-run banks - China Construction Bank and Bank of China - have abandoned plans for multi-billion dollar listings in New York later this year. Instead, the cost of Sarbanes-Oxley has persuaded them to stick to a single listing in Hong Kong, according to press reports in China.\n", "llama3.2:1b": "The US Securities and Exchange Commission (SEC) is considering softening its new corporate governance rules for foreign firms listed on US stock exchanges. The rules, introduced after the Enron scandal, require firms with over 300 US shareholders to sign a statement taking responsibility for their financial accuracy. However, European firms have protested that these requirements make it too costly and burdensome. The SEC has already delayed implementing Section 404, which requires chief executives to take responsibility for internal controls in annual accounts. The agency is seeking to find a solution that preserves investor protections without stifling foreign firms' ability to list on US exchanges.", "llama3.2:3b": "US stock market watchdog chairman William Donaldson is willing to soften corporate governance rules introduced after Enron scandal to ease burden on foreign firms. He promises \"several initiatives\" to accommodate European firms protesting the high compliance costs of US listings. The SEC may delay implementation of key clause, Section 404, for foreign firms.", "gemma2:2b": "SEC chairman William Donaldson is willing to soften new US corporate governance rules due to concerns about high compliance costs for foreign firms, particularly those with secondary listings on Wall Street.  The SEC will consider delaying the implementation of certain regulations, such as Section 404, and might offer more flexibility to foreign firms regarding compliance timeframes. This action aims to balance investor protection with ease of doing business in the US market. The cost of complying with Sarbanes-Oxley has deterred some companies from listing on the US stock exchange, including Air China and Chinese state banks that have opted for single listings in Hong Kong instead.  \n", "qwen2.5:0.5b": "Key points:\n\n  * William Donaldson, chairman of the US Securities and Exchange Commission (SEC), said he would soften tough new corporate governance rules to ease burden on foreign firms.\n  * The US regulator warned that foreign companies may get extra time to comply with a key clause in the Sarbanes-Oxley Act.\n  * European firms have protested that US laws make Wall Street listings too costly, leading to increased compliance costs for foreign companies.\n  * There are concerns about potential fines and imprisonment for firms not meeting the new rules.", "qwen2.5:1.5b": "The US SEC's chairman proposes loosening corporate governance rules due to foreign firms' concerns about compliance costs following the Enron scandal. The proposed initiatives aim to make it easier for European firms with dual listings on the New York Stock Exchange to comply with Sarbanes-Oxley Act regulations.", "qwen2.5:3b": "The US stock market watchdog's chairman, William Donaldson, is considering relaxing tough corporate governance rules to ease foreign firms' burden. He promised several initiatives including extending compliance time for key clauses in the Sarbanes-Oxley Act. The Act introduces stringent regulations requiring all US-listed firms to declare their financial statements annually and holds executives accountable for their accuracy. However, European firms argue these laws increase listing costs and pose a barrier to exit from the US market. Donaldson suggested considering delaying or modifying the least popular part of the Act - Section 404, which mandates CEO responsibility for internal controls. A delegation of European firms met with the SEC in December to press for changes.", "opencoder:1.5b": "The US stock market watchdog's chairman has said he is willing to soften tough new US corporate governance rules to ease the burden on foreign firms.\n \nIn a speech at the London School of Economics, William Donaldson promised several initiatives. European firms have protested that US laws introduced after the Enron scandal make Wall Street listings too costly. The US regulator issued a key clause in the Sarbanes-Oxley Act, obliging all firms with US stock market listings to make declarations, which will add substantially to the cost of preparing annual accounts.\n \nFirms that break the new law could face huge fines and severe jail terms, while senior executives risk up to 20 years of imprisonment. Mr Donaldson said that although the Act does not provide exemptions for foreign firms, it also has provisions against a firm breaking the law without meeting US requirements. The Securities and Exchange Commission (SEC) has already taken steps to address any concerns.\n \nThe Act applies to firms with more than 300 US shareholders, which can present challenges for smaller firms. A delay in implementing this clause could cause serious financial implications. Mr Donaldson revealed that his staff had already begun to weigh up the merits of a new approach to the deregistration process for foreign firms without meeting US requirements.\n \nThe SEC has also delayed implementation of Section 404 for smaller companies, as well as companies with market capitalisations below $700m (£374m). The former is seen as costly because it obliges executives to take internal controls. It's likely that other countries may face similar challenges.\n", "smollm:1.7b": "", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text concisely while preserving the key ideas and details. Let me read through it carefully.\n\nThe text starts by talking about the US stock market watchdog's chairman who wants to soften post-Enron rules to ease foreign firm costs. There's a speech by William Donaldson promising several initiatives. European firms are upset because new US laws make Wall Street listings too costly.\n\nUS stock exchanges went into morrow listing, and the act goes into effect mid-2005. The Act makes firms declare things, which is expensive. Firms breaking it could face fines or jail time up to 20 years. The SEC is sensitive but might continue looking for ways to accommodate foreign structures.\n\nThe US regulator has faced criticism about not giving exemptions to foreign firms, while European big names are opposed because their costs outweigh benefits. The threshold of 300 shareholders blocks delisting as a simple solution. Some concerns about Section 404 being too costly and requiring executives to sign compliance statements in accounts. There's opposition from some US banks considering listing elsewhere.\n\nThe chairman wants a solution that protects investors but avoids shutting down the market. He's weighing delays for section 404 implementation, which is expensive for small firms with $700m below market caps. European firms are pushing for changes, including switching to London or Hong Kong listings.\n\nI should condense this into a clear summary without mentioning all details. Make sure key points like the chairman's intent, European opposition, US act specifics, costs, and reactions from other banks are included.\n</think>\n\nThe US stock market watchdog's chairman seeks to soften post-Enron rules to ease foreign firm costs. He promised several initiatives but faces criticism from European firms arguing costs outweigh benefits of dual listings. The US Act, effective mid-2005, obliges companies with US listings to declare matters, adding significant compliance costs. Firms breaching the law could face fines or jail time up to 20 years. The SEC is sensitive to accommodating foreign structures but may continue refining the process. European firms oppose Section 404 due to high costs for smaller companies. Some US banks list elsewhere, while others opt for Hong Kong listings. The chairman aims to preserve investor protections by seeking a solution that avoids market collapse without shutting it down.", "tinyllama:1.1b": "The U.S. Securities and Exchange Commission (SEC) is expected to soften new US corporate governance rules following complaints from foreign firms, as Chairman William Donaldson promised \"severa l initiatives\" to ease the burden of the Sarbanes-Oxlley Act. In a speech at the London School of Economics, Donaldson emphasized that his staff is weighing up the merits of delaying the implementation of Section 404 for foreign firm signatories while also considering whether there should be a new approach to the deregistraion process for non-US firms unwilling to meet US requirements. In response, European representative BASF and other firms have called on the SEC to consider delaying implementation of Section 404 for smaller firm market capitalizations below $700 million. However, the Securities and Exchange Commission has already postponed implementation of this clause for smaller firm with market capitalization below $374 million in the United States.", "tinydolphin:1.1b": " The Securities and Exchange Commission (SEC) is set to reconsider its tough new corporate governance rules, which include a provision requiring foreign firms to disclose whether they have a US-style internal control system in place. This would make it more difficult for smaller US companies to list on the stock exchanges of their foreign counterparts, prompting some European firms to argue that this could lead to unfair treatment by the American regulators. The SEC has already delayed implementation of this clause for smaller firms with market capitalizations below $700m (£374m). In response, a delegation of European firms led by Digby Jones, director general of the UK's Confederation of British Industry (CBI), visited the SEC in December to press for change.", "phi:2.7b": " The US market watchdog chairman is willing to soften new corporate governance rules introduced after the Enron scandal to ease the burden on foreign firms. Foreign firms have protested that these laws add substantially to the cost of preparing annual accounts and may get extra time to comply with a key clause in the Sarbanes-Oxley Act. The Act requires all firms with US stock market listings to make declarations, which critics say will add significantly to the cost of preparing their annual accounts. Firms that break the new law could face huge fines, while senior executives risk jail terms of up to 20 years. Mr Donaldson said he would consider a new approach to the deregistration process for foreign firms unwilling to meet US requirements. The Act's least popular measure - Section \n", "orca-mini:3b": " The US stock market regulator, the Securities and Exchange Commission (SEC), is considering softening tough new corporate governance rules for foreign firms listed on US stock exchanges. The Sarbanes-Oxley Act came into force in mid-2005 and requires all companies with US stock market listings to make declarations, which critics say will add significantly to the cost of preparing their annual accounts. However, the SEC chairman has said that the Act does not provide exemptions for foreign firms, but the regulator would continue to be sensitive to the need to accommodate foreign structures and requirements. The SEC is considering delaying the implementation of Section 404, which obliges chief executives to take responsibility for the firm's internal controls by signing a compliance statement in the annual accounts, for foreign firms with market capitalisations below $700m. Several European firms have protested that the Act makes US listings too costly and are seeking a solution that will preserve investor protections without turning the US market into one with no exit. The SEC has already delayed implementation of this clause for smaller firms, including US ones, with market capitalisations below $700m.", "hermes3:3b": "US stock market watchdog considering softer rules on post-Enron corporate governance to ease costs for foreign firms. Could provide extra time for complying with Sarbanes-Oxley Act's key clause.", "stablelm-zephyr:3b": "SEC Chairman William Donaldson announces plans to soften US corporate governance rules, particularly for foreign firms affected by the Sarbanes-Oxley Act. The act requires all firms with US stock market listings to make declarations that many argue add substantially to the cost of preparing annual accounts. European firms with secondary listings in New York have objected, as compliance costs outweigh the benefits of a dual listing. Donaldson suggests foreign firms may get extra time to comply and that the SEC will consider a new approach to deregistration processes for those unwilling to meet US requirements.", "chatgpt-4o-latest": "SEC Chairman William Donaldson indicated a willingness to ease US corporate governance rules to reduce the burden on foreign firms. Speaking at the London School of Economics, he acknowledged concerns that the Sarbanes-Oxley Act, introduced after the Enron scandal, makes Wall Street listings too costly. The SEC may grant foreign firms extra time to comply with Section 404, which requires executives to certify internal controls. European firms with secondary US listings argue that compliance costs outweigh the benefits, and the 300-shareholder rule complicates delisting. The SEC is considering changes to the deregistration process and delaying Section 404 for foreign firms. Compliance costs have already deterred firms from US listings, with Air China and Chinese state-run banks opting for other markets.", "stablelm2:1.6b": "US stock market watchdog William Donaldson announced intentions to soften new corporate governance rules after the Enron scandal, particularly for foreign firms. The Securities and Exchange Commission (SEC) may provide extra time for compliance with key clauses of the Sarbanes-Oxley Act while remaining sensitive to accommodating foreign structures' requirements. This includes considering a new approach for the deregistration process if foreign firms are unwilling to meet US requirements. Some European firms have objected to high compliance costs, especially regarding secondary listings in New York. The Act applies to all firms with US stock market listings and may result in substantial fines or jail terms for non-compliance by senior executives.", "granite3.1-dense:2b": "The US Securities and Exchange Commission (SEC) chairman, William Donaldson, expressed willingness to modify post-Enron corporate governance rules to alleviate the burden on foreign firms. European companies argue that the Sarbanes-Oxley Act's requirements for US stock market listings are too expensive. Donaldson pledged potential initiatives, including extending compliance deadlines and reconsidering the deregistration process for foreign firms unwilling to meet these standards. The Act, set to take effect in mid-2005, mandates CEOs' responsibility statements for financial accuracy, with penalties for noncompliance. European firms with secondary listings in New York have expressed concern over the high compliance costs, which may outweigh dual listing benefits. Donaldson's staff are evaluating delaying Section 404, a particularly costly requirement, for foreign firms. This move aims to maintain investor protections while preventing US listings from becoming inaccessible to foreign companies.", "reference": "The Act also applies to firms with more than 300 US shareholders, a situation many firms without US listings could find themselves in.It obliges all firms with US stock market listings to make declarations, which, critics say, will add substantially to the cost of preparing their annual accounts.The US stock market watchdog's chairman has said he is willing to soften tough new US corporate governance rules to ease the burden on foreign firms.The SEC has already delayed implementation of this clause for smaller firms - including US ones - with market capitalisations below $700m (£374m).Mr Donaldson said the SEC would \"consider whether there should be a new approach to the deregistration process\" for foreign firms unwilling to meet US requirements.The US regulator said foreign firms may get extra time to comply with a key clause in the Sarbanes-Oxley Act.But European firms with secondary listings in New York have objected - arguing that the compliance costs outweigh the benefits of a dual listing.European firms have protested that US laws introduced after the Enron scandal make Wall Street listings too costly.Compliance costs are already believed to be making firms wary of US listings.Mr Donaldson said that although the Act does not provide exemptions for foreign firms, the Securities and Exchange Commission (SEC) would \"continue to be sensitive to the need to accomodate foreign structures and requirements\"."}