{"raw_text": "HealthSouth ex-boss goes on trial\n \n The former head of US medical services firm HealthSouth overstated earnings and assets to boost the company's share price, it was claimed in court.\n \n Richard Scrushy, 52, is accused of \"directing\" a $2.7bn (£1.4bn) accounting fraud at the company he co-founded in Alabama in 1984. Prosecutors said he was motivated by wealth - spending about $200m between 1996 and 2002 while earning much less. Defence lawyers said Mr Scrushy had been deceived by other executives. Several former HealthSouth employees have already pleaded guilty to fraud and are expected to give evidence against Mr Scrushy.\n \n \"We will present evidence that Richard Scrushy knew about the conspiracy, that he participated in the conspiracy and that he profited,\" prosecutor Alice Martin told the court. Mr Scrushy is the first chief executive to be tried for breaching the Sarbanes Oxley Act - a law introduced in the wake of the Enron and WorldCom frauds which obliges corporate bosses to vouch for the accuracy of their companies' results. Among the charges he faces are conspiracy to commit fraud, filing false statements and money laundering. After federal agents raided HealthSouth's offices in March 2003, the company said none of its past financial statements could be relied on. The firm has since reorganised its board and management team and currently operates about 1,400 health clinics.\n", "llama3.2:1b": "Richard Scrushy, former head of HealthSouth, is accused of overstating earnings and assets to boost the company's share price, allegedly motivated by wealth. Prosecutors say he participated in a $2.7 billion accounting fraud, while defense lawyers claim Mr Scrushy was deceived by other executives.", "llama3.2:3b": "Richard Scrushy, former head of US medical services firm HealthSouth, is on trial for overstating earnings and assets to boost the company's share price, allegedly directing a $2.7bn accounting fraud. Prosecutors claim he was motivated by wealth, while defence lawyers say he was deceived by other executives.", "gemma2:2b": "Richard Scrushy, former CEO of HealthSouth, is facing trial for alleged accounting fraud that inflated the company's share price and cost taxpayers billions.  Prosecutors claim he was motivated by personal wealth while earning relatively little. Several former employees have already pleaded guilty to the crime and are expected to testify against him. The case marks the first time a CEO has been tried under the Sarbanes-Oxley Act, designed after high-profile fraud cases like Enron and WorldCom. \n", "qwen2.5:0.5b": "Former CEO Richard Scrushy was accused of fraud at HealthSouth in Alabama following a court appearance. He is alleged to have overstated earnings to boost the company's share price. Prosecutors say he was motivated by wealth and spent $200 million while earning less than $200,000 per month. Defence lawyers assert Mr Scrushy had been deceived by other executives. Several former employees have pleaded guilty to fraud charges. The case is ongoing.", "qwen2.5:1.5b": "HealthSouth CEO Richard Scrushy faces trial accused of $2.7 billion accounting fraud; he pleaded guilty to aiding and abetting the scheme while prosecutors claim he personally benefited from it.", "qwen2.5:3b": "Former HealthSouth CEO Richard Scrushy goes on trial for allegedly leading an $2.7bn accounting fraud to boost share price. Scrushy faces charges including conspiracy to commit fraud, filing false statements, and money laundering. Prosecutors claim he was motivated by wealth, spending over $200m from 1996-2002 while earning less. He is the first CEO to face prosecution under the Sarbanes-Oxley Act due to Enron and WorldCom frauds. Former employees have pleaded guilty and will testify against him. HealthSouth has since reorganized its board, management team, and operates about 1400 health clinics.", "opencoder:1.5b": "HealthSouth overstated earnings and assets to boost the company's share price was claimed in court.\n\nRichard Scrushy, 52, was accused of \"directing\" a $2.7bn (£1.4bn) accounting fraud at the company he co-founded in Alabama in 1984.\n\nSeveral former HealthSouth employees have already pleaded guilty to fraud and are expected to give evidence against Mr Scrushy.\n", "smollm:1.7b": "The former head of US medical services firm HealthSouth overstated earnings and assets to boost the company's share price, it was claimed in court. Richard Scrushy, 52, is accused of \"directing\" a $2.7bn (£1.4bn) accounting fraud at the company he co-founded in Alabama in 1984. Prosecutors said he was motivated by wealth - spending about $200m between 1996 and 2002 while earning much less.\n\nProsecution witnesses will present evidence that Richard Scrushy knew about the conspiracy, that he participated in the conspiracy and that he profited. Mr Scrushy is the first chief executive to be tried for breaching the Sarbanes Oxley Act - a law introduced in the wake of the Enron and WorldCom frauds which obliges corporate bosses to vouch for the accuracy of their companies' results. Among the charges he faces are conspiracy to commit fraud, filing false statements and money laundering. After federal agents raided HealthSouth's offices in March 2003, the company said none of its past financial statements could be relied on. The firm has since reorganised its board and management team and currently operates about 1,400 health clinics.", "deepseek-r1:1.5b": "<think>\nOkay, so I need to summarize this text concisely. Let's read through it again.\n\nThe text is about a case where Richard Scrushy was tried for fraud at HealthSouth. He overstated earnings in court, claiming higher assets and profits. The company started in Alabama in 1984 but went bankrupt after Enron and WorldCom. Now they're rebuilding with health clinics. They had to reorganize their board because of the financial crisis.\n\nSo I need to capture the key points: Scrushy was tried for fraud, he lied about earnings and assets. The firm faced bankruptcy before. Now HealthSouth is trying to rebuild, and they've taken action against him. Also, there are some legal terms like Sarbanes Oxley Act, which led to big restructuring and financial loss.\n\nI should focus on the main events: Scrushy's trial, his fraud claims, healthSouth restructuring, and the company's history leading up to the crisis.\n</think>\n\nRichardScrushy, 52, was tried for fraud in HealthSouth's stockholders' court over overstating earnings and assets. The firm had started in Alabama in 1984 but faced bankruptcy before. Now, HealthSouth is reorganizing its board due to financial struggles and has taken legal action against him, facing charges including conspiracy to commit fraud and financial misconduct.", "tinyllama:1.1b": "HealthSouth ex-bosse goes on trial for $2.7bn accounting fraud. Prosecutors allege that former head Richard Scrushy caused the company to make $200m of \"false\" claims to inflate earnings. The CEO has pleaded guilty to conspiring with others, but denies any wrongdoing. The trial will reveal if he profited or not. Scruchy is the first chief exec to face breach of law under Sarbanes-Oxley Act (which introduced the corporate accounting disclosure standard).", "tinydolphin:1.1b": " A former head of US medical services company HealthSouth has been ordered to stand trial for allegedly overstating earnings and assets to boost the company's share price. The ex-boss Richard Scrushy is accused of \"directing\" a $2.7bn accounting fraud at the firm, which he co-founded in 1984. His defense team argues he was motivated by wealth, while prosecutors allege his actions were influenced by other executives. It's estimated that Scrushy's former employees have already pleaded guilty to fraud and are expected to give evidence against him. The trial is set for January 2013.", "phi:2.7b": " Richard Scrushy, former head of US medical services firm HealthSouth, is being accused of overstating earnings and assets to boost the company's share price, leading to an accounting fraud that resulted in a $2.7 billion loss for investors. Mr Scrushy is the first CEO to be prosecuted under the Sarbanes-Oxley Act for breach of fiduciary duty related to corporate governance. Several former HealthSouth employees have already pleaded guilty to fraud and are expected to testify against him.\n", "orca-mini:3b": " Richard Scrushy, the former head of US medical services firm HealthSouth, is on trial accused of directing a $2.7bn accounting fraud to boost the company's share price and spending much less while earning more than $200m between 1996 and 2002. He is charged with conspiracy to commit fraud, filing false statements, and money laundering. The Sarbanes Oxley Act requires corporate bosses to vouch for the accuracy of their companies' results, and Mr Scrushy faces charges for breaching this law. HealthSouth had to reorganize its board and management team after federal agents raided its offices in 2003, and currently operates about 1,400 health clinics.", "hermes3:3b": "HealthSouth ex-CEO Scrushy trials for overstating earnings, $2.7b accounting fraud.", "stablelm-zephyr:3b": "Richard Scrushy, former head of HealthSouth, goes on trial for allegedly overstating earnings and assets to boost the company's share price. He faces charges including conspiracy to commit fraud, filing false statements, and money laundering. Scrushy is the first CEO to be tried for breaching the Sarbanes Oxley Act, which requires corporate leaders to vouch for the accuracy of their companies' results. Former HealthSouth employees have already pleaded guilty to fraud, and several are expected to testify against Scrushy. The company has since reorganized its board and management team and continues to operate around 1,400 health clinics.", "chatgpt-4o-latest": "Former HealthSouth CEO Richard Scrushy is on trial for allegedly directing a $2.7 billion accounting fraud to inflate the company's share price. Prosecutors claim he was motivated by wealth, spending $200 million while earning much less. His defense argues he was deceived by other executives. Several former employees have pleaded guilty and will testify against him. Scrushy is the first CEO tried under the Sarbanes-Oxley Act, facing charges including conspiracy, fraud, and money laundering. After a 2003 federal raid, HealthSouth admitted its financial statements were unreliable and has since restructured its leadership. The company now operates about 1,400 health clinics.", "stablelm2:1.6b": "HealthSouth co-founder Richard Scrushy goes on trial for allegedly overstating earnings and assets to boost the company's share price. Prosecutors claim he directed a $2.7bn accounting fraud while defense lawyers argue he was deceived by others. The first CEO to be charged under the Sarbanes Oxley Act faces conspiracy to commit fraud, filing false statements, and money laundering charges. HealthSouth suffered financial losses after federal agents raided its offices in 2003.", "granite3.1-dense:2b": "Richard Scrushy, 52, former CEO of HealthSouth, is on trial for orchestrating a $2.7 billion accounting fraud between 1996 and 2002 to enhance the company's share price. Prosecutors allege he was driven by wealth, spending about $200 million during that period. Scrushy's defense claims he was misled by other executives. Several former HealthSouth employees have admitted to fraud and are expected to testify against him.\n\nKey charges include conspiracy to commit fraud, filing false statements, and money laundering. This trial marks the first of its kind for a corporate chief executive under the Sarbanes Oxley Act, a law enacted post-Enron and WorldCom scandals. In 2003, federal agents raided HealthSouth's offices following allegations that past financial statements were unreliable. Since then, the company has restructured its board and management, currently operating approximately 1,400 health clinics.", "reference": "Several former HealthSouth employees have already pleaded guilty to fraud and are expected to give evidence against Mr Scrushy.Defence lawyers said Mr Scrushy had been deceived by other executives.Richard Scrushy, 52, is accused of \"directing\" a $2.7bn (£1.4bn) accounting fraud at the company he co-founded in Alabama in 1984.\"We will present evidence that Richard Scrushy knew about the conspiracy, that he participated in the conspiracy and that he profited,\" prosecutor Alice Martin told the court."}