{"raw_text": "Lacroix label bought by US firm\n \n Luxury goods group LVMH has sold its loss-making Christian Lacroix clothing label to a US investment group.\n \n The Paris-based firm has been shedding non-core businesses and focusing on its most profitable brands including Moet & Chandon champagne and Louis Vuitton. LVMH said the French designer's haute couture and ready-to-wear labels had been purchased by the Falic Group for an unspecified sum. The Falic Group bought two cosmetics labels from LVMH in 2003. The sale of the Lacroix label comes as many fashion houses are struggling to make money from their expensive haute couture ranges. The Florida-based Falic group, which also runs a chain of 90 duty free stores in the US, said it planned to expand the brand by opening new stores. Mr Lacroix said he planned to stay at the label he founded in 1987 although exact details are still to be confirmed.\n", "llama3.2:1b": "LVMH sells Christian Lacroix clothing label to Falic Group for unspecified sum. The sale is part of the luxury goods group's efforts to shed non-core businesses and focus on profitable brands such as Moet & Chandon and Louis Vuitton.", "llama3.2:3b": "LVMH sells loss-making Christian Lacroix label to US investment group Falic Group for an unspecified sum, as part of its non-core business shedding strategy, with plans to expand the brand through new stores and the designer will remain at the helm.", "gemma2:2b": "LVMH sold its loss-making Christian Lacroix clothing label to the Falic Group for an undisclosed price. The sale follows LVMH's focus on profitable brands like Moet & Chandon and Louis Vuitton, as many fashion houses struggle with expensive haute couture ranges.  The Falic group plans to expand the brand through new stores. \n", "qwen2.5:0.5b": "LVMH has sold its loss-making Christian Lacroix clothing label to Falic Group, which is purchasing two cosmetics labels from LVMH in 2003 for an unspecified sum. The sale of the Lacroix label comes as many fashion houses struggle to make money from their expensive haute couture ranges.", "qwen2.5:1.5b": "LVMH has sold its loss-making Christian Lacroix clothing label to a US investment group for an unspecified sum, with plans to expand the brand through new stores. The sale follows similar moves by other fashion houses struggling in their haute couture divisions.", "qwen2.5:3b": "LVMH sells loss-making Christian Lacroix clothing label to Falic Group for an unspecified sum, focusing on profitable brands like Moët & Chandon and Louis Vuitton. The Falic Group also owns two LVMH cosmetics labels and operates a chain of US duty free stores. This move comes as many fashion houses struggle with haute couture ranges. Mr Lacroix plans to continue working at the label he founded in 1987, though details are still uncertain.", "opencoder:1.5b": "The Luxury goods group LVMH has sold its Christian Lacroix clothing label to a US investment group, focusing on Moet & Chandon champagne and Louis Vuitton brands. The firm's focus is on profitable brands, such as the haute couture labels purchased by the Falic Group for unspecified sums in 2003. The sale of the Lacroix label has led fashion houses to make a living from their expensive ranges, while the Florida-based Falic group plans to expand its brand by opening new stores.\n", "smollm:1.7b": "Luxury goods group LVMH has sold its loss-making Christian Lacroix clothing label to a US firm. The Paris-based firm has been shedding non-core businesses and focusing on its most profitable brands including Moet & Chandon champagne and Louis Vuitton. LVMH said the French designer's haute couture and ready-to-wear labels had been purchased by the Falic Group for an unspecified sum. The Falic Group bought two cosmetics labels from LVMH in 2003. The sale of the Lacroix label comes as many fashion houses are struggling to make money from their expensive haute couture ranges. The Florida-based firm, which also runs a chain of 90 duty free stores in the US, said it planned to expand the brand by opening new stores. Mr Lacroix said he planned to stay at the label he founded in 1987 although exact details are still to be confirmed.", "deepseek-r1:1.5b": "<think>\nOkay, I need to summarize this text into a concise summary. First, I'll read through the entire text to understand the main points.\n\nThe key elements are: LVMH bought Christian Lacroix's luxury goods group from France for $1.6 billion. They sold non-core businesses and focused on Chanson champagne and Louis Vuitton. The purchase happened in 2003 when two cosmetics labels were bought by the Falic Group, which also has US stores. The Falic Group plans to expand and is working with LVMH. Lacroix's founder was Mr. Lacroix, who founded LVMH in 1987.\n\nI need to make sure all important details are included: the purchase amount, what they bought, their focus areas, the timing of the acquisition, the role of Falic Group, and Lacroix's business plan.\n\nNow, I'll structure this into a coherent summary without any extra information. I'll start with the sale details, mention LVMH's focus after the sale, include the purchase from Lacroix, the specific cosmetics labels, and then describe the expansion by the Falic Group.\n</think>\n\nThe US investment group bought Christian Lacroix clothing in France for $1.6 billion. LVMH sold non-core businesses and focused on Chanson champagne and Louis Vuitton. The acquisition was made in 2003 when two cosmetics labels were purchased by the Falic Group, which also runs duty-free stores in the US. Mr. Lacroix, who founded LVMH in 1987, plans to stay at the brand but is expected to remain based on his legacy.", "tinyllama:1.1b": "LVMH has sold its Christian Lacroix luxury clothings label to a US investment group, after selling two of its fashion brands to falic Group in 2003. The sale comes as many fashion houses are struggling to make money from their expensive haute couture ranges. Lacroix plans to expand and open new stores under the Falic Group umbrella.", "tinydolphin:1.1b": " A US investment group has acquired the Christian Lacroix clothing label from Luxury goods group LVMH, for an undisclosed sum. The French designer's haute couture and ready-to-wear labels have been purchased by the Falic Group, a company that has already acquired two cosmetics labels from LVMH in 2003. This acquisition comes as many fashion houses are struggling to make money from their expensive haute couture ranges. The Falic Group plans to expand the brand by opening new stores and also plans to develop the Lacroix label for future growth.", "phi:2.7b": " LVMH has sold its loss-making Christian Lacroix clothing label to a US investment group called Falic Group. The sale comes as many fashion houses struggle to make money from expensive haute couture ranges, and the new owner plans to expand the brand by opening new stores. Mr Lacroix intends to stay at the brand he founded in 1987 although exact details are still to be confirmed.\n", "orca-mini:3b": " LVMH sold its loss-making Christian Lacroix clothing label to a US investment group for an unspecified sum. The sale comes as many fashion houses struggle to make money from their expensive haute couture ranges. The Florida-based Falic group plans to expand the brand by opening new stores. Mr. Lacroix said he plans to stay at the label he founded in 1987, but details are not yet confirmed.", "hermes3:3b": "LVMH sells Christian Lacroix label to US Falic Group.", "stablelm-zephyr:3b": "LVMH sold Christian Lacroix, a loss-making luxury clothing label, to the Falic Group, a US investment group that bought two cosmetics labels from LVMH in 2003. The sale comes as fashion houses struggle to make money from expensive haute couture ranges. The Falic Group plans to expand the brand by opening new stores, and Mr. Lacroix will remain at the label he founded in 1987, although details are still to be confirmed.", "chatgpt-4o-latest": "LVMH has sold its loss-making Christian Lacroix clothing label to the US-based Falic Group as part of its strategy to focus on more profitable brands. The Falic Group, which previously bought two cosmetics labels from LVMH in 2003 and operates 90 duty-free stores in the US, plans to expand the Lacroix brand by opening new stores. The sale comes amid financial struggles for many haute couture fashion houses. Christian Lacroix intends to remain with the label he founded in 1987, though details are yet to be confirmed.", "stablelm2:1.6b": "LVMH sells Christian Lacroix clothing label to US investment group Falic Group. Lacroix's haute couture and ready-to-wear brands are bought for an undisclosed sum by the Falic Group, which plans to expand the brand while Mr. Lacroix stays at the label founded in 1987.", "granite3.1-dense:2b": "LVMH, a Paris-based luxury goods company, has sold its struggling Christian Lacroix clothing line to US investment firm Falic Group for an undisclosed amount. This move aligns with LVMH's strategy of focusing on profitable brands like Moet & Chandon and Louis Vuitton. The sale encompasses both haute couture and ready-to-wear collections. Falic Group, known for its duty-free store chain in the US, intends to expand the brand through additional retail openings. Designer John Galliano will reportedly continue his role at Lacroix despite the sale, with specifics yet to be disclosed. This transaction reflects a broader trend of luxury fashion houses facing challenges in profiting from high-end couture segments.", "reference": "LVMH said the French designer's haute couture and ready-to-wear labels had been purchased by the Falic Group for an unspecified sum.Luxury goods group LVMH has sold its loss-making Christian Lacroix clothing label to a US investment group.The Falic Group bought two cosmetics labels from LVMH in 2003."}