{"raw_text": "Fox attacks Blair's Tory 'lies'\n \n Tony Blair lied when he took the UK to war so has no qualms about lying in the election campaign, say the Tories.\n \n Tory co-chairman Liam Fox was speaking after Mr Blair told Labour members the Tories offered a \"hard right agenda\". Dr Fox told BBC Radio: \"If you are willing to lie about the reasons for going to war, I guess you are going to lie about anything at all.\" He would not discuss reports the party repaid £500,000 to Lord Ashcroft after he predicted an election defeat.\n \n The prime minister ratcheted up Labour's pre-election campaigning at the weekend with a helicopter tour of the country and his speech at the party's spring conference. He insisted he did not know the poll date, but it is widely expected to be 5 May.\n \n In what was seen as a highly personal speech in Gateshead on Sunday, Mr Blair said: \"I have the same passion and hunger as when I first walked through the door of 10 Downing Street.\" He described his relationship with the public as starting euphoric, then struggling to live up to the expectations, and reaching the point of raised voices and \"throwing crockery\". He warned his supporters against complacency, saying: \"It's a fight for the future of our country, it's a fight that for Britain and the people of Britain we have to win.\"\n \n Mr Blair said that whether the public chose Michael Howard or Mr Kennedy, it would result in \"a Tory government not a Labour government and a country that goes back and does not move forward\". Dr Fox accused Mr Blair and other Cabinet ministers of telling lies about their opponents' policies and then attacking the lies. \"What we learned at the weekend is what Labour tactics are going to be and it's going to be fear and smear,\" he told BBC News. The Tory co-chairman attacked Labour's six new pledges as \"vacuous\" and said Mr Blair was very worried voters would take revenge for his failure to deliver. Dr Fox refused to discuss weekend newspaper reports that the party had repaid £500,000 to former Tory Treasurer Lord Ashcroft after he said the party could not win the election. \"We repay loans when they are due but do not comment to individual financial matters,\" he said, insisting he enjoyed a \"warm and constructive\" relationship to Lord Ashcroft.\n \n Meanwhile Lib Dem leader Charles Kennedy is expected to attack Mr Blair's words as he begins a nationwide tour on Monday. Mr Kennedy is accelerating Lib Dem election preparations this week as he visits Manchester, Liverpool, Leicester, Somerset, Basingstoke, Shrewsbury, Dorset and Torbay. He said: \"This is three-party politics. In the northern cities, the contest is between Labour and the Liberal Democrats. \"In southern and rural seats - especially in the South West - the principal contenders are the Liberal Democrats and the Conservatives, who are out of the running in Scotland and Wales.\" The Lib Dems accuse Mr Blair of making a \"touchy-feely\" speech to Labour delegates which will not help him regain public trust.\n", "llama3.2:1b": ["Tony Blair's election campaign is criticized for lying about his party's position after taking the UK to war, with Tory co-chairman Liam Fox saying that if they lied about reasons for going to war, everything would be a lie."], "llama3.2:3b": ["Tony Blair lied when he took the UK to war, and now Tory co-chairman Liam Fox says the party will lie in the election campaign.", "Blair warned of a \"hard right agenda\" from the Tories, while Fox accused Labour of using fear and smear tactics.", "The Liberal Democrats are expected to attack Blair's words as part of their own pre-election campaign."], "gemma2:2b": ["Tory co-chairman Liam Fox accused Tony Blair of lying about his opponents' policies during the election campaign.", "Fox said that if Blair lied about war reasons, he would also lie about other topics.", "He did not comment on reports that the party repaid £500,000 to Lord Ashcroft after a prediction of an election defeat.", "Blair delivered a personal speech at the Labour conference where he highlighted his passion and desire for continued progress.", "He warned against complacency in the face of potential opposition from the Tories, who accuse him of attacking their policies.", "Charles Kennedy is expected to criticize Blair's speech during his national tour this week.", "The Lib Dems also emphasize three-party politics, with a focus on competing with Labour in northern cities and the Conservatives in southern/rural areas."], "qwen2.5:0.5b": ["Tory prime minister Tony Blair told Tories it's acceptable for them to lie about the reasons for going to war, but they're not allowed to lie in the election campaign.", "The leader of the Tory party called Lord Ashcroft a \"touchy-feely\" politician who doesn't have his own opinions on the topic.", "He also said Blair is very worried about voters taking revenge from him for not delivering, and that he won't let them know which promises they're referring to.", "His closest friend Liam Fox attacked Blair and other cabinet members for lying to the public about their opponents' policies."], "qwen2.5:1.5b": ["Tony Blair lied for UK war but also lies during election campaign, says Tory co-chairman Liam Fox.", "Fox accuses Blair of lying about opponents' policies and attacks Labour's six new pledges as \"vacuous\".", "Blair promises victory despite poll date uncertainty.", "Fox refuses to comment on £500k payment to Lord Ashcroft after prediction of defeat.", "Lib Dem leader Charles Kennedy expected to attack Blair during nationwide tour starting Monday."], "qwen2.5:3b": ["Tory co-chairman Liam Fox accused former Prime Minister Tony Blair of lying during election campaigns, citing his support for going to war without adequate justification.", "Fox also criticized the Labour party for reportedly repaying £500,000 to Lord Ashcroft after predicting an electoral defeat.", "Meanwhile, Prime Minister Gordon Brown's personal speech highlighted his passion and struggle in politics, emphasizing that a new Tory government would not benefit Britain's future.", "Fox accused Labour of using fear-mongering tactics against their opponents.", "Lib Dem leader Charles Kennedy is set to challenge Labour’s position by visiting various regions across the country, accusing Blair of making emotionally charged speeches unsuitable for regaining public trust."], "opencoder:1.5b": ["The main point of the summary is that while it's true that Tories have been lying about going to war, they have also made several lies in the election campaign and spoken out against Mr Blair.", "The party repaid £500,000 to Lord Ashcroft after predicting an election defeat.", "Lib Dem leader Charles Kennedy attacks Mr Blair's words in a national tour on Monday."], "smollm:1.7b": ["The summary is concise and objective, preserving key ideas and details from the original text while omitting unnecessary information.", "It provides an overview of the main points made in the text without adding or subtracting any information.", "The tone remains neutral and informative throughout the summary."], "deepseek-r1:1.5b": ["Fox attacks Blair's claims of lie during election campaign.", "Co-chairman Liam Fox discussed financial lies to attract voters.", "Blair's helicopter tour at home and spring conference speech highlighted personal drive and political tactics.", "Blair lied about finances predicting election loss, while Tony Blair lied about his talk to Labour delegates, accusing the British cabinet of lying.", "Lib Dem leader Charles Kennedy starts a tour across England, criticizing Blair for three-party politics in southern cities and accusing Blair of touchingy-feely lies."], "tinyllama:1.1b": ["In the Fox attack on Tony Blair's lies during the election campaign, the Tories are accused of lying in their own party's pre-election campaign by allegedly repaying £500,000 to Lord Ashcroft after he predicted an election defeat.", "This is not a new revelation and was reportedly confirmed in the past weekend's reports about the Labour Party.", "Meanwhile, Lib Dem leader Charles Kennedy plans to attack Mr Blair's words during his nationwide tour of the UK, saying that this is three-party politics between Labour and the Liberal Democrats with the main contenders being Labour, the Liberal Democrats, and the Conservatives in Scotland, Wales, and the South West."], "tinydolphin:1.1b": [" In summary, former Prime Minister Tony Blair has launched an election campaign focused on \"lies,\" stating that his rivals are trying to win by lying about their policies, while he himself is willing to lie about anything.", "He accused the Labour Party of having a \"vacuous\" policy agenda and blamed the Tories for not delivering.", "The Lib Dem leader, Charles Kennedy, is expected to criticize Mr. Blair's speech in a similar manner, accusing him of making confusing and emotional comments about the election campaign."], "phi:2.7b": [" Liam Fox criticized Tony Blair for lying during the war and believes the same is true in the election campaign.", "He also said the Tories are willing to lie about anything at all if they have to.", "The prime minister has been campaigning extensively with a helicopter tour of the country and speech at the Labour conference, where he warned his supporters against complacency.", "Meanwhile, Lib Dem leader Charles Kennedy attacked Mr Blair's words as three-party politics."], "orca-mini:3b": [" Tony Blair lied when he led the UK to war, and his Conservative opponents have no qualms about lying in the upcoming election campaign, according to Liam Fox, the Tories' co-chairman.", "Fox accused Blair and other Cabinet ministers of telling lies about their opponents' policies and then attacking the lies.", "The Tory party repaid £500,000 to Lord Ashcroft after he predicted an election defeat, but Dr Fox refused to discuss the reports.", "Meanwhile, Liberal Democrat leader Charles Kennedy is expected to attack Blair's words as he begins a nationwide tour on Monday."], "hermes3:3b": ["Tony Blair's lies about war justification may be used during election campaign, says Tory Liam Fox."], "stablelm-zephyr:3b": ["Tory co-chairman Liam Fox criticized Tony Blair, saying he lied about the reasons for going to war and would likely lie during the election campaign.", "Fox accused Blair and other Cabinet ministers of telling lies about their opponents' policies and using fear and smear tactics.", "This criticism came after Blair gave a speech at Labour's spring conference, in which he warned of a fight for the future of the country and urged supporters not to be complacent.", "Meanwhile, Lib Dem leader Charles Kennedy also weighed in on the political rhetoric, accusing Blair of making a \"touchy-feely\" speech that would not help him regain public trust."], "stablelm2:1.6b": ["Tory Chairman Liam Fox says Tony Blair lied about reasons for war, so he also lies in election campaign.", "Fox objects to Labour's tactics, accusing them of using fear and smear during their pre-election campaigning.", "Meanwhile, Lib Dem leader Charles Kennedy is expected to attack Mr. Blair's words during a nationwide tour starting on Monday."], "granite3.1-dense:2b": ["Tory co-chairman Liam Fox criticized former Prime Minister Tony Blair for allegedly lying about the reasons for invading Iraq, implying that such dishonesty extends to Labour's election campaign.", "Dr. Fox refused to discuss reports of repaying £500,000 to Lord Ashcroft after predicting an electoral loss.", "In a personal and passionate speech at Labour's spring conference, Blair emphasized his enduring commitment to the country and warned against complacency.", "He outlined six new pledges but faced criticism from Dr. Fox for allegedly telling lies about the opposition's policies and stoking fear.", "Meanwhile, Liberal Democrat leader Charles Kennedy began a nationwide tour to challenge Labour and Conservatives, highlighting regional disparities in the election contest."], "chatgpt-4o-latest": ["The Tories accused Tony Blair of lying about the Iraq war and claimed he would lie during the election campaign.", "Tory co-chairman Liam Fox criticized Blair for labeling the Conservatives as having a \"hard right agenda\" and accused Labour of using \"fear and smear\" tactics.", "Blair, in a speech to Labour members, emphasized his passion for leadership and warned against complacency, arguing that a vote for Michael Howard or Charles Kennedy would result in a Tory government.", "Fox dismissed Labour’s new pledges as meaningless and refused to comment on reports that the party repaid £500,000 to Lord Ashcroft.", "Meanwhile, Lib Dem leader Charles Kennedy began a nationwide tour, positioning his party as the main challenger to Labour in northern cities and to the Conservatives in the South West.", "The Lib Dems criticized Blair’s speech as insincere and ineffective in restoring public trust."]}