{"raw_text": "Campbell: E-mail row 'silly fuss'\n \n Ex-No 10 media chief Alastair Campbell is at the centre of a new political row over an e-mail containing a four-letter outburst aimed at BBC journalists.\n \n Mr Campbell sent the missive by mistake to BBC2's Newsnight after it sought to question his role in Labour's controversial poster campaign. He later contacted the show saying the original e-mail had been sent in error and that it was all a \"silly fuss\". Mr Campbell has recently re-joined Labour's election campaign.\n \n The e-mail was revealed the day after Peter Mandelson, former Labour minister and now a European Commissioner, warned the BBC to steer away from \"demonising\" Mr Campbell. Mr Campbell messaged Newsnight after the programme investigated claims that Labour's advertising agency TBWA was blaming him for controversy over its campaign posters. The images, including one of flying pigs and another of what critics claim depicted Tory leader Michael Howard as Fagin, prompted accusations of anti-Semitism, claims denied by Labour.\n \n Mr Campbell's e-mail, which was apparently intended for a party official, suggested they should get Trevor Beattie, TBWA's boss, to issue a statement. In it, he said: \"Just spoke to trev. think tbwa shd give statement to newsnight saying party and agency work together well and nobody here has spoken to standard. Posters done by by tbwa according to political brief. Now fuck off and cover something important you twats!\" The e-mail was sent by mistake to Newsnight journalist Andrew McFadyen. Realising his error, Mr Campbell then e-mailed Mr McFadyen pointing out the mistake, but suggesting presenter Jeremy Paxman would have seen the funny side.\n \n He said: \"Not very good at this e-mail Blackberry malarkey. Just looked at log of sent messages, have realised e-mail meant for colleagues at TBWA has gone to you. For the record, first three sentences of email spot on. No row between me and trevor. \"Posters done by them according to our brief. I dreamt up flying pigs. Pigs not great but okay in the circs of Tories promising tax cuts and spending rises with the same money. TBWA made production. \"Campbell swears shock. Final sentence of earlier e-mail probably a bit colourful and personal considering we have never actually met but I'm sure you share the same sense of humour as your star presenter Mr P. \"Never known such a silly fuss since the last silly fuss but there we go. Must look forward not back.\"\n \n Later the prime minister's spokesman was asked by journalists about his view on Mr Campbell's use of abusive language. The spokesman said: \"The person you are referring to is capable of speaking for himself and he no longer works in government.\" Foreign Secretary Jack Straw said he had always had \"very good and polite relations\" with Mr Campbell, who he described as \"very talented\". But on the former spin doctor's use of language, Mr Straw said: \"I do know the odd journalist who has occasionally used the odd word that would probably be inappropriate in some circumstances. Maybe I mix with the wrong kind of journalists.\" Liam Fox, Tory co-chairman, said the return of Mr Campbell was a sign of new \"sinister and underhand tactics\" by Labour.\n", "llama3.2:1b": ["Alastair Campbell's e-mail to BBC Newsnight about Trevor Beattie from TBWA containing an outburst aimed at him has sparked a row over his language.", "The email was sent by mistake, but Campbell later attempted to explain it to the journalist who received it.", "He claimed he intended for the message to be directed towards TBWA and their boss, saying they had worked well together on posters for Labour's campaign.", "However, the tone of the message was deemed too personal and abusive by some, including the Prime Minister's spokesman.", "Campbell is now back in government after re-joining it, with Foreign Secretary Jack Straw describing him as \"very talented\"."], "llama3.2:3b": ["Alastair Campbell sent an email to BBC2's Newsnight containing a four-letter outburst aimed at BBC journalists, mistakenly sending it instead of a party official.", "The email was intended to suggest the party agency work together well with the news programme.", "Mr Campbell later contacted the show saying it was all a \"silly fuss\" and apologized for the mistake.", "The email sparked controversy over Labour's poster campaign and accusations of anti-Semitism, prompting former Labour minister Peter Mandelson to warn the BBC to steer clear of \"demonising\" Mr Campbell."], "gemma2:2b": ["Alastair Campbell sent an email containing a four-letter outburst to BBC Newsnight after it investigated allegations about his role in a controversial Labour poster campaign.", "He intended the message for colleagues at TBWA, but mistakenly sent it to journalist Andrew McFadyen.", "Campbell later acknowledged the error and attempted to downplay the incident.", "Political figures reacted with varying degrees of disapproval."], "qwen2.5:0.5b": ["Alastair Campbell sent an e-mail to Newsnight journalist Andrew McFadyen saying he could not believe it had gone wrong.", "He claimed that TBWA was working with him but made up the flying pigs for Labour's advertising campaign, saying they should have said \"yes\".", "Later, he wrote a lengthy e-mail to Jeremy Paxman in which he accused him of using abusive language and said Campbell's use of abuse was a sign of new sinister tactics by Labour."], "qwen2.5:1.5b": ["Former Labour spin doctor Alastair Campbell sent an offensive e-mail to BBC journalist Andrew McFadyen about his job with TBWA agency, sparking a row between Campbell and the media.", "Campbell apologized for the mistake but maintained he was joking and had no ill intent."], "qwen2.5:3b": ["Alastair Campbell sent an offensive e-mail to BBC2's Newsnight mistakenly, apologizing for the error and stating it was all a \"silly fuss.\"", "The email contained a profanity directed at BBC journalists over his role in Labour's poster campaign questioned by Newsnight.", "Campbell has recently rejoined Labour's election campaign.", "He intended the message for colleagues at TBWA but sent it to an NBC journalist, realizing his mistake afterward.", "The e-mail criticized TBWA and suggested they issue a statement.", "MPs discussed Campbell’s language use; the Prime Minister’s spokesman said he no longer worked in government, while Jack Straw praised Campbell as talented despite occasional inappropriate language usage by journalists.", "Liam Fox of the Conservative Party viewed Campbell's return negatively."], "opencoder:1.5b": ["This is a condensed and summarized version of the provided text.", "Here's the main points:\n\n- E-mail row 'silly fuss'\n \n - Ex-No 10 media chief Alastair Campbell is at the centre of a new political row over an e-mail containing a four-letter outburst aimed at BBC journalists.", "- Mr Campbell sent the missive by mistake to BBC2's Newsnight after it sought to question his role in Labour's controversial poster campaign.", "He later contacted the show saying the original e-mail had been sent in error and that it was all a \"silly fuss\".", "- The e-mail was revealed the day after Peter Mandelson, former Labour minister and now a European Commissioner, warned the BBC to steer away from \"demonising\" Mr Campbell.", "- In it, he said: \"Just spoke to trev.", "think tbwa shd give statement to newsnight saying party and agency work together well and nobody here has spoken to standard.", "Posters done by by tbwa according to political brief.", "Now fuck off and cover something important you twats!\"", "- He then e-mailed Mr McFadyen pointing out the mistake, but suggested presenter Jeremy Paxman would have seen the funny side.", "- He said: \"Not very good at this e-mail Blackberry malarkey.", "Just looked at log of sent messages, have realised e-mail meant for colleagues at TBWA has gone to you.", "For the record, first three sentences of email spot on.", "No row between me and trevor.", "\"Posters done by them according to our brief.", "I dreamt up flying pigs.", "Pigs not great but okay in the circs of Tories promising tax cuts and spending rises with the same money.", "TBWA made production.", "\"Campbell swears shock.", "Final sentence of earlier e-mail probably a bit colourful and personal considering we have never actually met but I'm sure you share the same sense of humour as your star presenter Mr P.\"\n\n - Later, the prime minister's spokesman was asked by journalists about his view on Mr Campbell's use of abusive language.", "- The spokesman said: \"The person you are referring to is capable of speaking for himself and he no longer works in government.\"", "Foreign Secretary Jack Straw said he had always had \"very good and polite relations\" with Mr Campbell.", "But on the former spin doctor's use of language, Mr Straw said: \"I do know the odd journalist who has occasionally used the odd word that would probably be inappropriate in some circumstances.", "Maybe I mix with the wrong kind of journalists.\""], "smollm:1.7b": ["The summary is:\n\nCampbell's e-mail to BBC2's Newsnight contained an outburst aimed at journalists, which he later regretted.", "The missive was sent in error after it sought to question his role in Labour's controversial poster campaign.", "Mr Campbell has since re-joined the Labour campaign."], "deepseek-r1:1.5b": ["Campbell sent an email claiming to address his role in a controversial campaign, which was part of a political row at the BBC.", "The e-mail was misdelivered and led to further investigations by the show, which accused him of anti-Semitism.", "Campbell recently joined Labour's election campaign and corrected himself in another email for not pointing out his mistake.", "His message was personal and self-deprecating, while he acknowledged thebbc's reactions to his use of non-polite language."], "tinyllama:1.1b": ["The article discusses a new political row over an e-mail sent by ex-No 10 media chief Alastair Campbell that contained a four-letter outburst aimed at BBC journalists, which was later accidentally sent to Newsnight.", "The message is described as \"silly fus[e]\" and the journalist who originally contacted the show suggested that Mr Campbell should have contacted the show first before sending the e-mail.", "The e-mail caused controversy among some Labour supporters, who accused Mr Campbell of using anti-Semitic language, and was later revealed to have been accidentally sent by mistake by Campbell after realizing his error.", "The Prime Minister's spokesman said that Campbell had \"very good and politely relations\" with his former colleague but referred to the journalist's language as \"underhand tactics\".", "However, Foreign Secretary Jack Straw defended Mr Campbell's use of words, stating that he had always had \"very good and politely relations\" with him."], "tinydolphin:1.1b": [" Ex-No10 media chief Alastair Campbell is embroiled in a new political row after accidentally sending an outburst to BBC Newsnight regarding his role in Labour's controversial poster campaign.", "The missive was then sent by mistake to BBC2's Newsnight, where it was later revealed as having been sent in error and intended for the party's official media spokesperson.", "Campbell has since re-joined the Labour election campaign."], "phi:2.7b": [" Ex-Labour Party media chief Alastair Campbell sent an e-mail containing a four-letter outburst aimed at BBC journalists as he had received it by mistake while speaking to Newsnight about his role in a controversial poster campaign.", "He later apologized for the message, claiming it was all a \"silly fuss\".", "Mr. Campbell's message caused political controversy and drew criticism from Labour's Peter Mandelson, who warned against demonizing him.", "The e-mail also revealed that Mr. Campbell had been trying to blame the controversy on TBWA, but Mr. Campbell claimed that he had never spoken to them before they were accused of anti-Semitism.", "Mr. Campbell apologized for using abusive language in an earlier email sent by mistake and expressed hope that his return to Labour'’s election campaign would help change perceptions about him."], "orca-mini:3b": [" Alastair Campbell sent an e-mail to BBC2's Newsnight containing a four-letter outburst aimed at journalists.", "The mistake was discovered when he contacted the show and apologized for the error.", "The e-mail contained comments about pigs, Trevor Beattie, and Michael Howard, and suggested that the party and TBWA worked together well.", "Campbell claimed to be \"sweating\" over a row which the BBC created.", "He said he never actually met TBWA's boss but was aware of their production.", "The prime minister's spokesman said he had good relations with Campbell, while Straw and Fox both criticized Labour's use of language."], "hermes3:3b": ["Alastair Campbell sent an abusive e-mail to BBC journalists by mistake, accusing them of making a 'silly fuss' over their investigation into Labour's advertising agency TBWA."], "stablelm-zephyr:3b": ["Alastair Campbell, ex-media chief and former spokesperson for Tony Blair, is at the center of a new political row over an accidentally sent email containing a four-letter outburst aimed at BBC journalists.", "The email was mistakenly sent to BBC2's Newsnight after they questioned his role in Labour's controversial poster campaign.", "Campbell later claimed it was a \"silly fuss.\"", "The incident occurred shortly after former Labour minister and European Commissioner, Peter Mandelson, warned the BBC to stop demonizing Campbell."], "stablelm2:1.6b": ["Ex-No staff member Alastair Campbell is involved in a political dispute over an e-mail that mistakenly contained a four-letter outburst aimed at BBC journalists.", "The message was sent to BBC's Newsnight after it asked about his role in the Labour party's poster campaign, and he later apologized for the mistake.", "Labour has been criticized for allegedly blaming Campbell for controversy over its campaign posters, which included images of flying pigs and a Fagin reference.", "The e-mail suggested that a statement from TBWA should address the situation with Newsnight journalist Andrew McFadyen.", "Campbell expressed his humorous view on the situation without any negative undertones.", "Prime Minister's spokesman said they did not condone such language and that former Spin Doctor, Jack Straw, described Campbell as \"very talented.\""], "granite3.1-dense:2b": ["Alastair Campbell, former No 10 media chief and now rejoining Labour's election campaign, inadvertently sent an abusive email to BBC2's Newsnight.", "The missive, intended for TBWA's boss Trevor Beattie, expressed frustration with the programme's investigation into controversial Labour poster images.", "Campbell later realized his mistake and contacted Newsnight journalist Andrew McFadyen, explaining it was a \"silly fuss\" and assuring him he intended no harm.", "The email, which suggested Jeremy Paxman would find the content amusing, included four-letter profanity directed at BBC staff.", "This incident occurred as Peter Mandelson advised the BBC to avoid \"demonizing\" Campbell over the posters' anti-Semitism allegations, denied by Labour.", "Political figures reacted differently: Foreign Secretary Jack Straw acknowledged occasional inappropriate language use among journalists, while Tory co-chairman Liam Fox perceived Campbell's return as evidence of new \"sinister and underhand tactics\" by Labour."], "chatgpt-4o-latest": ["Alastair Campbell, former No 10 media chief, is embroiled in controversy after mistakenly sending an expletive-laden e-mail to BBC2's Newsnight while responding to questions about Labour's poster campaign.", "The e-mail, intended for a party official, dismissed concerns over the campaign and insulted journalists.", "Campbell later acknowledged the mistake, calling the reaction a \"silly fuss.\"", "The incident followed warnings from Peter Mandelson for the BBC to avoid \"demonising\" Campbell.", "Labour's posters, including one allegedly depicting Tory leader Michael Howard as Fagin, faced accusations of anti-Semitism, which the party denied.", "Government officials distanced themselves from Campbell, while Tory co-chairman Liam Fox criticized his return as indicative of Labour's \"sinister and underhand tactics.\""]}