{"raw_text": "Crucial decision on super-casinos\n \n A decision on whether to allow Westminster to legislate on super-casinos is set to be made by the Scottish Parliament.\n \n The government has plans for up to eight Las Vegas style resorts in the UK, one of which is likely to be in Glasgow. Scottish ministers insist they will still have the final say on whether a super-casino will be built in Scotland. But opposition parties say that will not happen in practice. The vote is due to be taken on Wednesday and is expected to be close.\n \n The Scottish Executive believes that the legislation should be handled by Westminster. The new law will control internet gambling for the first time and is aimed at preventing children from becoming involved. A super-casino in Glasgow could be located at Ibrox or the Scottish Exhibition and Conference Centre. The new gambling bill going through Westminster will allow casino complexes to open to the public, have live entertainment and large numbers of fruit machines with unlimited prizes. But the Scottish National Party and the Tories say the issue of super-casinos should be decided in Scotland and believe the executive is shirking its responsibility.\n", "llama3.2:1b": ["A decision on whether to allow Westminster to legislate on super-casinos is set for the Scottish Parliament, with plans for up to eight resorts in Scotland.", "The government's plans include a potential casino at Ibrox or the Scottish Exhibition and Conference Centre, but opposition parties oppose this proposal as it should be handled by Westminster."], "llama3.2:3b": ["The Scottish Parliament is set to decide whether Westminster will legislate on super-casinos, with opposition parties arguing it won't happen in practice.", "The government plans up to eight Las Vegas-style resorts, including one in Glasgow, while Scottish ministers claim they'll have the final say.", "A close vote is expected Wednesday, with a new gambling bill aiming to prevent children from being involved in internet gambling."], "gemma2:2b": ["A vote on whether Westminster or the Scottish Parliament should legislate for super-casinos will take place Wednesday.", "The Scottish government supports legislation passed by Westminster, which would control internet gambling for the first time and allow for casino complexes with live entertainment and unlimited prizes.", "Opposition parties believe the decision should be made in Scotland and that the Scottish executive is shirking its responsibility."], "qwen2.5:0.5b": ["The Scottish Parliament has been considering the proposal for a new law on super-casino gambling to be implemented in Scotland.", "The government has plans for up to eight Las Vegas-style resorts, one of which is likely to be in Glasgow.", "However, opposition parties argue that it will not happen in practice and insist that the legislation should be decided by Westminster.", "The Scottish Executive believes the new law will control internet gambling for the first time and prevent children from becoming involved, but opponents claim that super-casinos should also be decided in Scotland."], "qwen2.5:1.5b": ["Scottish Parliament set to decide whether to allow super-casinos in UK, including one potentially in Glasgow, amid concerns about internet gambling and children's access to gambling venues.", "The new Scottish Executive law aims to prevent youth involvement with online gambling but could still approve a casino complex under the Conservatives' opposition to devolving decision-making authority."], "qwen2.5:3b": ["A decision on whether to allow Westminster to legislate for super-casinos in the UK, one likely to be in Glasgow, is due at Scottish Parliament.", "The government plans up to eight Las Vegas-style resorts with controls against underage gambling.", "However, opposition parties claim this will not happen as ministers still want final say.", "A vote is scheduled for Wednesday and expected to be close.", "The Executive favors Westminster handling the legislation which would allow public casino complexes with live entertainment and unlimited fruit machines.", "But SNP and Tories argue it should remain a Scottish decision."], "opencoder:1.5b": ["A crucial decision on whether to allow legislation regarding supercasinos has been made by the Scottish Parliament.", "The government is set to introduce plans for up to eight Las Vegas-style resorts within the UK, one of which could potentially be in Glasgow.", "The Scottish Executive believes that the decision should be handled at Westminster, under the new gambling bill.", "The proposed law will allow casino complexes to open to the public and will have live entertainment facilities with unlimited fruit machines."], "smollm:1.7b": ["The decision on whether to allow Westminster to legislate on super-casinos is set to be made by the Scottish Parliament, with plans for up to eight Las Vegas style resorts in the UK being considered.", "The government has plans for up to one of these resorts to be located in Glasgow, and this will likely be a significant development given the city's existing casino infrastructure.", "However, opposition parties are skeptical about the final say on whether a super-casino will be built in Scotland, with some arguing that it would not happen in practice.", "The vote is expected to be close and the outcome is still uncertain."], "deepseek-r1:1.5b": ["A decision is set to be made by the Scottish Parliament regarding whether to regulate super-casino resorts in Westminster.", "The government aims to establish up to eight such locations across the UK, including one planned for Glasgow.", "Scottish ministers claim they will make this decision, but oppositions argue it won't happen practically.", "The new law on internet gambling aims to prevent children from engaging and allows casino complexes, live entertainment, and large numbers of fruit machines with unlimited prizes.", "A proposal by the Scottish Executive suggests this regulation should be handled in Westminster.", "While the UK government would likely implement such a law, oppositions suggest it should be decided in Scotland, believing the Scottish Executive is shirking its responsibilities."], "tinyllama:1.1b": ["The Scottish Parliament will vote on whether to allow super-casinos to be legislated by Westminster, following opposition parties' claims that the decision will not be taken in full accordance with their demands.", "The new internet gambling law proposed by the Scottish Executive is aimed at preventing children from accessing these facilities and will include restrictions on where they can be located and what types of games they can play.", "The bill currently being debated in Westminster will also open casinos, have live entertainment, and allow for large numbers of fruit machines with unlimited prize-winning options.", "Scottish National Party and Tory leaders claim the issue should be decided by their respective countries and say the government's plans are a sham.", "The vote is scheduled to take place on Wednesday."], "tinydolphin:1.1b": [" The Scottish Parliament is expected to vote on whether to allow super-casinos by the end of the week.", "It comes as a result of a decision by the UK government to legislate for online gambling for the first time.", "In Glasgow, there are plans for up to eight super-casino resorts, with one likely to be built at Ibrox and another in the Scottish Exhibition and Conference Centre.", "The vote is expected to be close, but some believe that the government's decision will have a significant impact on the local economy by attracting tourists and boosting employment opportunities."], "phi:2.7b": [" The Scottish Parliament is voting on whether Westminster can make a decision on super-casinos, which could lead to multiple Vegas-style resorts in the UK.", "One of these may be built in Glasgow.", "Scottish ministers insist they will still have the final say.", "However, opposition parties believe this won't happen in practice.", "This vote is set for Wednesday and is expected to be close.", "The Scottish Executive believes that the new law should be handled by Westminster because it deals with internet gambling.", "A super-casino in Glasgow could be built at Ibrox or the Scottish Exhibition and Conference Centre, but the new legislation will control internet gambling and prevent children from becoming involved."], "orca-mini:3b": [" A crucial decision on super-casinos is set to be made by the Scottish Parliament.", "The government plans for up to eight Las Vegas-style resorts in the UK, with one likely to be in Glasgow.", "Scottish ministers insist they will still have the final say on whether a super-casino will be built in Scotland, but opposition parties argue that this will not happen in practice.", "The vote is due to be taken on Wednesday and is expected to be close."], "hermes3:3b": ["Decision on Scottishlegislationforsuper-casinos.", "ScottishParliamentto decidewhetherallowWestminstercontrol."], "stablelm-zephyr:3b": ["The Scottish Parliament will decide whether Westminster should legislate on super-casinos, as the UK government plans up to eight Las Vegas-style resorts in the UK, including one in Glasgow.", "The Scottish Executive argues that the issue should be handled by Westminster because the new law would control internet gambling for the first time and prevent children from being involved.", "However, opposition parties believe that the Scottish Parliament should have the final say on whether a super-casino will be built in Scotland.", "The decision is expected to be close."], "stablelm2:1.6b": ["The Scottish Parliament is set to make a decision on whether to allow Westminster legislation for up to eight Las Vegas-style super- casinos in the UK.", "The government has plans for these resorts, with one likely in Glasgow; however, Scottish ministers will still have control over whether such a casino is built.", "Opposing parties claim that decision-making responsibility will not be fulfilled due to the new gambling bill being handled by Westminster.", "If passed by the Parliament, the new legislation would regulate internet gambling and prevent children from involvement.", "The Glasgow super-casino could potentially be located at Ibrox or the Scottish Exhibition and Conference Centre.", "However, the Scottish National Party, Labour, and Conservatives argue that the issue of super- casinos should be resolved in Scotland."], "granite3.1-dense:2b": ["The Scottish Parliament is scheduled to vote on whether Westminster should oversee the development of up to eight Las Vegas-style super-casinos, including a potential one in Glasgow.", "The government advocates for Westminster's control due to proposed legislation that will regulate internet gambling and prevent child involvement.", "However, opposition parties, such as the Scottish National Party and Conservatives, argue this decision should remain within Scotland, accusing the executive of evading its responsibilities.", "The vote is anticipated to be tight."], "chatgpt-4o-latest": ["The Scottish Parliament is set to decide whether Westminster should legislate on super-casinos.", "The UK government plans up to eight Las Vegas-style resorts, with one likely in Glasgow.", "Scottish ministers claim they will have the final say, but opposition parties doubt this.", "The vote is expected to be close.", "The Scottish Executive supports Westminster handling the legislation, which includes internet gambling regulations.", "Potential Glasgow locations include Ibrox and the Scottish Exhibition and Conference Centre.", "The bill allows casino complexes with live entertainment and unlimited-prize fruit machines.", "The SNP and Tories argue Scotland should decide on super-casinos and accuse the executive of avoiding responsibility."]}