{"raw_text": "PM apology over jailings\n \n Tony Blair has apologised to two families who suffered one of the UK's biggest miscarriages of justice.\n \n The prime minister was commenting on the wrongful jailing of 11 people for IRA bomb attacks on pubs in Guildford and Woolwich in 1974. Mr Blair said: \"I am very sorry that they were subject to such an ordeal and injustice.\" He made the apology to members of the Conlon and Maguire families in his private room at Westminster. In a statement recorded for television, Mr Blair said the families deserved \"to be completely and publicly exonerated\".\n \n The families had hoped the apology would be made during Prime Minister's Questions in the House of Commons. However, one of the so-called Guildford Four, Gerry Conlon - who was wrongly convicted of planting the bombs - said the families were delighted with the apology. He said Mr Blair had spoken with \"such sincerity\", adding: \"He went beyond what we thought he would, he took time to listen to everyone. \"You could see he was moved by what people were saying. \"Tony Blair has healed rifts, he is helping to heal wounds. It's a day I never thought would come.\" The move followed a huge campaign in Ireland for a public apology after eleven people were wrongly convicted of making and planting the IRA bombs which killed seven people. Mr Blair's official spokesman said no-one present at the meeting would \"ever forget the strength of feeling of relief that the prime minister's statement brought to them\".\n \n Most of those convicted were either members or friends of the two families. All were arrested because of a family connection to Gerry Conlon. Mr Conlon's father Giuseppe was arrested when travelling to London from Belfast to help his son. He died while serving his sentence. Also arrested were Anne Maguire and members of her family. Mrs Maguire was the relative with whom Giuseppe planned to stay in London, as well as two family friends. She said it was a \"wonderful feeling\" to have had the apology and that a weight had been lifted off her shoulders.\n \n \"The people who were still doubting us should now believe that we were totally innocent,\" she said. They were all jailed for handling explosives, based on scientific evidence which was later entirely discredited. In October 1989 the Court of Appeal quashed the sentences of the Guildford Four, and in June 1991 it overturned the sentences on the Maguire Seven. Mr Conlon's case was highlighted in the Oscar-nominated film In The Name Of The Father, starring Daniel Day-Lewis.\n", "llama3.2:1b": ["Tony Blair has apologized to two families whose sons were wrongly convicted for IRA bomb attacks in 1974: the Conlon and Maguire families.", "He made the apology during a private meeting with members of these families, who had hoped it would be mentioned during Prime Minister's Questions in Parliament.", "The families received the apology as \"completely and publicly exonerated\" by Blair, who described their ordeal as \"an ordeal and injustice.\""], "llama3.2:3b": ["Tony Blair apologized to two families wrongly jailed for IRA bombings in 1974, saying they deserved \"to be completely and publicly exonerated\".", "The apology came after a campaign in Ireland for a public apology, with the Prime Minister speaking with Gerry Conlon and his family in a private meeting.", "Most of those convicted were relatives or friends of the two families, who were arrested due to a false connection to Gerry Conlon."], "gemma2:2b": ["Tony Blair apologized to two families whose members were wrongly convicted of IRA bombings in 1974.", "The apology came after a long campaign for exoneration from victims and their families.", "Blair's apology was met with relief by those affected."], "qwen2.5:0.5b": ["Tony Blair apologized to the families who were jailed for IRA bomb attacks in Guildford and Woolwich in 1974.", "He made a private statement to members of the Conlon and Maguire families, but later said that he had no intention of making an official apology during Prime Minister's Questions in the House of Commons.", "The families appreciated his sincerity in listening to them and taking time to discuss their case."], "qwen2.5:1.5b": ["Tony Blair apologizes to families wrongly convicted for IRA bomb attacks, saying he is \"very sorry\" and \"completely and publicly exonerated.\""], "qwen2.5:3b": ["Tony Blair has apologized to families affected by the wrongful convictions of the Guildford Four and Maguire Seven who were jailed for IRA bomb attacks in 1974.", "The apology came after years of campaigning for a public acknowledgment from UK Prime Minister Tony Blair.", "Blindsided with the news, one of those convicted, Gerry Conlon, expressed his gratitude towards Blair’s sincerity during their private meeting.", "All individuals involved had connections to Giuseppe Conlon, who was arrested due to family ties and were later convicted based on discredited scientific evidence.", "Blair's apology marked a significant step in healing longstanding rifts between the affected families and the British government."], "opencoder:1.5b": ["The PM apology over jailings\n\nTony Blair has apologized to two families who suffered an injustice due to IRA bomb attacks on pubs in Guildford and Woolwich in 1974.", "The prime minister was making a public statement about the wrongful jailing of 11 people.", "He said: \"I am very sorry that they were subject to such an ordeal and injustice.\"", "He made the apology to members of the Conlon and Maguire families.", "The families hoped the apology would be made during Prime Minister's Questions in the House of Commons, however, one of the so-called Guildford Four, Gerry Conlon - who was wrongly convicted - said they were pleased with the apology.", "He expressed sincerity to listen to everyone's feedback.", "It's a day that has always been touched by the strength of feeling the Prime Minister's statement brought to them."], "smollm:1.7b": ["The PM apologized to two families who suffered one of the UK's biggest miscarriages of justice.", "He said: \"I am very sorry that they were subject to such an ordeal and injustice.\"", "He made the apology to members of the Conlon and Maguire families in his private room at Westminster.", "In a statement recorded for television, Mr Blair said the families deserved \"to be completely and publicly exonerated\".", "The families had hoped the apology would be made during Prime Minister's Questions in the House of Commons.", "However, one of the so-called Guildford Four - Gerry Conlon - said the families were delighted with the apology.", "He said Mr Blair had spoken with \"such sincerity\", adding: \"He went beyond what we thought he would, he took time to listen to everyone.", "You could see he was moved by what people were saying.", "Tony Blair has healed rifts, he is helping to heal wounds.", "It's a day I never thought would come.\"", "The move followed a huge campaign in Ireland for a public apology after eleven people were wrongly convicted of making and planting the IRA bombs which killed seven people.", "Mr Blair's official spokesman said no-one present at the meeting would \"ever forget the strength of feeling of relief that the prime minister's statement brought to them\"."], "deepseek-r1:1.5b": ["Tony Blair apologized to the Conlon and Maguire families for their wrongful treatment during the 1974 IRA bombattacks.", "He made the apology in his private room at Westminster, hoping it would be given then but instead, he expressed deep gratitude and moved past expectations of justice.", "The families were relieved, feeling fully and publicly exonerated.", "Blair's move to heal some wounds highlighted a day when justice could finally come."], "tinyllama:1.1b": ["PM apologizes for miscarriage of justice in two cases involving IRAB bomb attacks on pubs in Guildford and Wooldwich.", "Reports have circulated for a while, with the families who suffered one of these tragic events seeking justice.", "In a personal apology to them during Prime Minister's Questions in the House of Commons, Blair stated he is \"very sorry that they were subjected to such an ordinarily and injudicious\" conviction.", "The families were disappointed not to have heard from the Prime Minister earlier, but their spirits were lifted with a gesture of sympathy and an announcement of an upcoming public apology.", "The campaign in Ireland for justice and an official statement by Blair followed, leading to relief and closure for those wrongly convicted."], "tinydolphin:1.1b": [" Tony Blair has expressed his sorrow and regret for one of the UK's largest miscarriages of justice when he apologized to two families who suffered the wrongful imprisonment of 11 individuals for IRA bomb attacks in Guildford and Woolwich, which resulted in 7 people losing their lives.", "In a private meeting with the Conlon and Maguire families at Westminster, Mr. Blair expressed his sincerest apology, emphasizing that he wishes to \"exonerate\" them completely from any responsibility for the bombings.", "The families were particularly delighted with the apology and felt the Prime Minister had spoken with such sincere emotion, adding: \"He went beyond what we thought he would,\" said one of the so-called Guildford Four, Gerry Conlon, who was mistakenly convicted due to a lack of evidence."], "phi:2.7b": [" Tony Blair apologized to two families who were wrongfully jailed for IRA bomb attacks in 1974 and 1975.", "The apology was made during Prime Minister's Questions but one family member said they were delighted with it and that Mr Blair had spoken with sincerity and listened to everyone.", "Most of those convicted were either members or friends of the two families, all arrested because of a connection to Gerry Conlon who was wrongly convicted for planting the bombs.", "The families hoped for an apology during Prime Minister's Questions but were instead greeted by the prime minister's statement which expressed his sincere remorse and willingness to help heal wounds."], "orca-mini:3b": [" PM apologizes over jailed Guildford Four"], "hermes3:3b": ["Tony Blair apologizes to Conlon and Maguire families for wrongful jailing of 11 people related to IRA bomb attacks in 1974 Guildford-Woolwich pub incidents."], "stablelm-zephyr:3b": ["Tony Blair apologizes to families of the Guildford Four and Maguire Seven for their wrongful arrests in a miscarriage of justice involving IRA bomb attacks in 1974.", "He expresses sincere regret and aims to publicly exonerate them during a meeting at Westminster.", "The families, including Gerry Conlon and his relative Giuseppe Conlon, Anne Maguire, and her family friends, felt relief and gratitude towards Mr. Blair for healing rifts and helping to heal wounds caused by the injustice they faced.", "Most of those convicted were connected to these families; some were even friends or relatives.", "The Court of Appeal later quashed their sentences in 1989 and overturned them for good in 1991."], "stablelm2:1.6b": ["Prime Minister Tony Blair has apologized to two families affected by a significant miscarriage of justice involving IRA bomb attacks and jailing of 16 people for wrongful offenses in Guildford and Woolwich in 1986.", "Families Conlon and Maguire deserve complete exoneration, with most of those convicted having no connection to them.", "All arrests were based on a family connection to Gerry Conlon, who was wrongly convicted.", "Most recent court decisions, including quashing sentences by the Court of Appeal and overturning sentences by the Court of Criminal Appeals, confirm the family's innocence."], "granite3.1-dense:2b": ["Tony Blair issued an apology to two families—the Conlons and Maguires—for the wrongful jailing of 11 individuals in connection with IRA bomb attacks on pubs in Guildford and Woolwich in 1974, resulting in seven deaths.", "The prime minister expressed deep regret for their ordeal and injustice during a private meeting at Westminster.", "The families had hoped for this apology during Prime Minister's Questions in the House of Commons.", "Gerry Conlon, one of those wrongly convicted, described Blair's statement as sincere and moving, indicating it brought significant relief to the families.", "The falsely accused individuals were primarily family members or close associates of the Conlon and Maguire families, arrested due to their connections to Gerry Conlon.", "In 1989 and 1991, the Court of Appeal overturned their convictions.", "The apology came after a campaign in Ireland for public recognition of this miscarriage of justice."], "chatgpt-4o-latest": ["Tony Blair apologized to the families of 11 people wrongfully jailed for the 1974 IRA pub bombings in Guildford and Woolwich, calling their ordeal a grave injustice.", "He met with members of the Conlon and Maguire families privately at Westminster and publicly exonerated them in a recorded statement.", "Although the families had hoped for an apology in Parliament, Gerry Conlon, one of the wrongly convicted, expressed gratitude for Blair’s sincerity and efforts to heal past wounds.", "The wrongful convictions, based on discredited scientific evidence, led to a major campaign for justice.", "The Guildford Four were exonerated in 1989, and the Maguire Seven in 1991.", "The case was later depicted in the film *In The Name Of The Father*."]}