{"raw_text": "Talks held on Gibraltar's future\n \n Two days of talks on the future of Gibraltar begin at Jack Straw's country residence later on Wednesday.\n \n Officials at the two-day summit at the foreign secretary's official Kent house, Chevening, will plan a new forum on the Rock's future. In October, Mr Straw and his Spanish counterpart Miguel Moratinos agreed to establish a body that would give Gibraltarians a voice in their future. Most Gibraltarians said in a referendum they wanted to remain British.\n \n Gibraltar's Chief Minister Peter Caruana will represent the British citizens living on the Rock, while Britain's Europe Director Dominick Chilcott will represent the UK. Madrid is being represented by Spain's director general for Europe, Jose Maria Pons. The initiative follows Spain's socialist government's decision to put its long-standing sovereignty ambitions on hold. Gibraltarians rejected plans for the Rock's sovereignty to be shared between Britain and Spain in a referendum organised by Gibraltar government.\n", "llama3.2:1b": [" Talks began at Jack Straw's residence on Wednesday, with officials planning a new forum on Gibraltar's future.", "The summit will include representatives from Britain and Spain, with Gibraltar's Chief Minister Peter Caruana and the UK's Europe Director Dominick Chilcott representing their citizens."], "llama3.2:3b": ["Talks on Gibraltar's future begin at Chevening, with officials planning a new forum.", "A body will give Gibraltarians a voice in their future, following an agreement between Jack Straw and Miguel Moratinos in October.", "Peter Caruana represents British citizens, while Jose Maria Pons represents Spain.", "The initiative follows the decision by Spain's socialist government to put its sovereignty ambitions on hold."], "gemma2:2b": ["Two-day talks will take place at Chevening regarding Gibraltar's future.", "Officials from UK, Spain, and Gibraltar will discuss creating a forum for Gibraltarians to have a voice in their future.", "The meeting follows a previous agreement between Mr.", "Straw and Mr. Moratinos to establish such a forum after a referendum showed Gibraltarians wanting to remain British."], "qwen2.5:0.5b": ["Gibraltar holds an upcoming summit where officials will discuss how to make Gibraltar a more stable and prosperous place.", "The summit is scheduled to take place at Chevening, the UK's official residence for diplomats.", "Gibraltarians are asking for better representation from both sides in negotiations about Gibraltar's future."], "qwen2.5:1.5b": ["Two-day summit on Gibraltar's future begins at Jack Straw's residence; officials plan forum with representatives from both countries, including Gibraltarian Chief Minister Peter Caruana and UK Europe Director Dominick Chilcott.", "Spain's socialist government has temporarily put sovereignty ambitions aside in response to Gibraltar's decision not to share the Rock between Britain and Spain through a referendum organized by the government."], "qwen2.5:3b": ["Two-day talks begin at Jack Straw’s Chevening residence on Gibraltar’s future.", "Officials plan a new forum where Gibraltarians can voice their concerns.", "In October, Straw and Moratinos agreed to establish such a body after agreeing Gibraltarians wanted to remain British.", "Chief Minister Caruana will represent British citizens, Europe Director Chilcott will represent the UK, and Spain’s Pons will represent Madrid.", "The initiative follows Spain temporarily shelving sovereignty claims following its socialist government's decision.", "Gibraltarians rejected a referendum-sharing Rock's sovereignty equally between Britain and Spain in 2013."], "opencoder:1.5b": ["Talks held on Gibraltar's future\n\nTwo days of talks on the future of Gibraltar begin at Jack Straw's country residence later on Wednesday.", "Officials at the two-day summit at the foreign secretary's official Kent house, Chevening, will plan a new forum on the Rock's future.", "In October, Mr Straw and his Spanish counterpart Miguel Moratinos agreed to establish a body that would give Gibraltarians a voice in their future.", "Most Gibraltarians said they wanted to remain British.", "Gibraltar's Chief Minister Peter Caruana will represent the British citizens living on the Rock, while Britain's Europe Director Dominick Chilcott will represent the UK.", "Madrid is being represented by Spain's director general for Europe, Jose Maria Pons.", "The initiative follows Spain's socialist government's decision to put its long-standing sovereignty ambitions on hold.", "Gibraltarians rejected plans for the Rock's sovereignty to be shared between Britain and Spain in a referendum organised by Gibraltar government."], "smollm:1.7b": ["The talks held on Gibraltar's future are two days of discussions about the future of Gibraltar, which is currently under British sovereignty but has been governed by Spain since 1704.", "The talks will focus on establishing a new forum to give Gibraltarians a voice in their future and plan for the Rock's future.", "In October, officials from both countries agreed to establish such a body.", "The talks are expected to be attended by Gibraltar's Chief Minister Peter Caruana and Spain's Director General for Europe, Jose Maria Pons.", "The initiative is likely to be supported by Madrid, which has been pushing for Gibraltar's sovereignty ambitions on hold.", "The talks will also involve representatives from the UK government, which has been supporting Gibraltar's autonomy.", "The talks are expected to focus on establishing a new forum that would give Gibraltarians a voice in their future and plan for the Rock's future.", "In October, officials from both countries agreed to establish such a body.", "The initiative is likely to be supported by Madrid, which has been pushing for Gibraltar's sovereignty ambitions on hold.", "The talks will also involve representatives from the UK government, which has been supporting Gibraltar's autonomy.", "The talks are expected to focus on establishing a new forum that would give Gibraltarians a voice in their future and plan for the Rock's future.", "In October, officials from both countries agreed to establish such a body.", "The talks will also involve representatives from the UK government, which has been supporting Gibraltar's autonomy.", "The talks are likely to be supported by Madrid, which has been pushing for Gibraltar's sovereignty ambitions on hold."], "deepseek-r1:1.5b": ["Two days of talks at the Kent house on Wednesday will discuss the future of Gibraltar.", "Officials from Spain and the UK are involved in a meeting to form a new forum with Gibraltarians having a voice in their decision-making.", "Gibraltarians aimed for British representation, while opposition included Spain wanting to share sovereignty with the UK.", "A referendum organized by Gibraltar's government will decide if Gibraltarians want to remain British."], "tinyllama:1.1b": ["Gibraltar's future is set to be discussed at a two-day summit in the Kent house of Foreign Secretary Jack Straw, where officials plan to create a forum for Gibraltarians to have a voice in their future.", "The decision was made by Chief Minister Peter Caruana and Prime Minister Daniel Suarín on October 10th after an overwhelming majority voted against the proposed changes to Gibraltar's status at a referendum.", "The initiative is being organized by Spain, represented by its European director, Jose Maria Pons, who will be joined by Britain's socialist government representative for Europe, Dominick Chiotett.", "Representatives from both nations are expected to discuss the future of Gibraltar at the forum on Gibraltar, which begins tomorrow (Wednesday) at the foreign secretary's country residence."], "tinydolphin:1.1b": [" Two days of talks on Gibraltar's future take place at Jack Straw's country residence later on Wednesday, where officials will discuss plans for a new forum that would give Gibraltarians a voice in their future.", "In October, British Foreign Secretary Mr.", "Straw and Spanish Deputy Prime Minister Miguel Moratinos agreed to establish a body known as the Gibraltar Advisory Forum (GAF).", "Most Gibraltarians have said they want to remain British after being asked in a referendum whether they wanted to keep their current status or change it to be under Spain's control."], "phi:2.7b": [" Two days of talks will take place at Jack Straw's country residence, Chevening, with officials from both countries planning a new forum on Gibraltar's future.", "The initiative follows Spain's decision to put its long-standing sovereignty ambitions on hold after Gibraltarians rejected plans for the Rock's sovereignty to be shared between Britain and Spain in a referendum.", "The Chief Minister of Gibraltar will represent British citizens living there while Britain' Europe Director Dominick Chilcott will represent UK."], "orca-mini:3b": [" Two days of talks on Gibraltar's future begin at Jack Straw's country residence later on Wednesday.", "British officials plan a new forum on the Rock's future at a summit in Kent house, Chevening, with representatives from Spain and the UK.", "Gibraltar's Chief Minister Peter Caruana and Britain's Europe Director Dominick Chilcott will attend, representing the British citizens living on the Rock and the UK respectively.", "Madrid is represented by Spain's director general for Europe, Jose Maria Pons.", "The initiative comes after Spain's socialist government put its long-standing sovereignty ambitions on hold, but Gibraltar rejected plans for the Rock's sovereignty to be shared between Britain and Spain in a referendum organized by Gibraltar government."], "hermes3:3b": [" Talks begin on Gibraltar's future forum.", "2-day summit at Chevening with officials from Gibraltar, UK, Spain to plan new voice for Gibraltarians."], "stablelm-zephyr:3b": ["Two days of talks focus on Gibraltar's future, with an agreement to establish a forum for Gibraltarians to have a say in their future.", "Key figures represent British and Spanish sides: Chief Minister Peter Caruana represents British citizens, while Dominick Chilcott represents the UK.", "Spain's director general for Europe, Jose Maria Pons, represents Madrid.", "This initiative comes after Spain's socialist government decided to pause sovereignty ambitions.", "Most Gibraltarians wanted to remain British in a previous referendum."], "stablelm2:1.6b": ["Two days of talks were held on Gibraltar's future at Jack Straw's country residence, with officials planning a new forum on the Rock's future.", "Spanish counterpart Miguel Moratinos agreed with British foreign secretary Jack Straw to establish a body that would give Gibraltarians a voice in their future.", "Most Gibraltarians voted to remain British in a recent referendum.", "Gibraltar's Chief Minister Peter Caruana will represent British citizens living on the Rock, while Britain's Europe Director Dominick Chilcott represents the UK.", "Spain is being represented by Jose Maria Pons, following Spain's socialist government putting its sovereignty ambitions on hold.", "Gibraltarians rejected plans to share sovereignty between Britain and Spain in a referendum organized by Gibraltar government."], "granite3.1-dense:2b": ["A two-day summit, hosted by former UK Foreign Secretary Jack Straw at his Kent residence (Chevening), commences on Wednesday for discussions about Gibraltar's future.", "The meeting aims to create a new forum where Gibraltarians can voice their preferences regarding the Rock's status.", "Following an October agreement between Mr.", "Straw and Spanish Foreign Secretary Miguel Moratinos, this body will serve as a platform for Gibraltarians' input on their future, with most expressing desire to remain British in a prior referendum.", "Gibraltar's Chief Minister, Peter Caruana, and the UK's Europe Director, Dominick Chilcott, will represent British interests, while Spain's Jose Maria Pons will be their representative.", "This initiative emerges after Spain's socialist government deferred its long-standing claims to Gibraltar's sovereignty, following a 2016 referendum where Gibraltarians voted against sharing the territory's sovereignty between Britain and Spain."], "chatgpt-4o-latest": ["Talks on Gibraltar's future are being held at UK Foreign Secretary Jack Straw's residence, aiming to establish a forum giving Gibraltarians a voice.", "Gibraltar's Chief Minister Peter Caruana represents its citizens, while UK and Spanish officials also participate.", "The initiative follows Spain's decision to pause its sovereignty ambitions after Gibraltarians overwhelmingly rejected shared sovereignty in a referendum."]}