{"raw_text": "Tsunami debt deal to be announced\n \n Chancellor Gordon Brown has said he hopes to announce a deal to suspend debt interest repayments by tsunami-hit nations later on Friday.\n \n The agreement by the G8 group of wealthy nations would save affected countries £3bn pounds a year, he said. The deal is thought to have been hammered out on Thursday night after Japan, one of the biggest creditor nations, finally signed up to it. Mr Brown first proposed the idea earlier this week.\n \n G8 ministers are also believed to have agreed to instruct the World Bank and the International Monetary Fund to complete a country by country analysis of the reconstruction problems faced by all states hit by the disaster. Mr Brown has been locked in talks with finance ministers of the G8, which Britain now chairs. Germany also proposed a freeze and Canada has begun its own moratorium. The expected deal comes as Foreign Secretary Jack Straw said the number of Britons dead or missing in the disaster have reached 440.\n", "llama3.2:1b": ["Chancellor Gordon Brown is set to announce a debt deal to suspend interest repayments by tsunami-hit nations, which would save affected countries £3bn a year.", "The agreement was hammered out on Thursday night after Japan signed up to it and comes as Foreign Secretary Jack Straw reported the number of Britons dead or missing in the disaster had reached 440."], "llama3.2:3b": ["Chancellor Gordon Brown plans to announce a debt interest repayment suspension agreement for tsunami-hit nations, saving them £3bn pounds per year.", "The G8 group has agreed on the deal, with Japan finally signing up on Thursday night.", "Other measures include instructing the World Bank and IMF to analyze reconstruction problems in affected countries, as Germany and Canada have also proposed similar freezes."], "gemma2:2b": ["A debt relief deal for tsunami-hit countries will be announced later this week, saving these nations £3 billion annually.", "The agreement was reached after Japan agreed to participate and is supported by the G8.", "The World Bank and IMF will conduct a country-by-country assessment of reconstruction needs.", "Britain chairs the G8, with Germany and Canada also implementing debt freezes.", "The death toll of British citizens in the disaster has risen to 440."], "qwen2.5:0.5b": ["The G8 countries are planning to announce a debt relief agreement to save £3 billion per year from affected nations, according to Chancellor Gordon Brown.", "The G8 has already agreed to suspend interest repayments for tsunami-hit nations and will also instruct the World Bank and IMF to complete analysis of reconstruction problems facing all affected states."], "qwen2.5:1.5b": ["Chancellor Gordon Brown plans to announce an agreement allowing tsunami-hit countries to suspend debt interest repayments, saving them £3 billion annually.", "G8 ministers, including Britain's Chancellor and Germany's Finance Minister, are considering a freeze on debt payments for all affected nations, following Japan's approval.", "The deal aims to aid reconstruction efforts post-disaster in countries like Indonesia, Sri Lanka, and Thailand."], "qwen2.5:3b": ["Tsunami debt deal to be announced later on Friday by Chancellor Gordon Brown, involving suspension of interest repayments for affected nations by the G8 group.", "This agreement, expected to save £3bn annually, was finalized after Japan's final approval.", "Along with World Bank and IMF, they will assess reconstruction issues in disaster-hit countries.", "The deal comes as 440 Britons are confirmed dead or missing due to the tsunami.", "Discussions have been ongoing between G8 finance ministers."], "opencoder:1.5b": ["The tsunami debt deal to be announced by the G8 group nations is aimed at saving affected countries from financial and credit risks that could result from a nuclear attack on Japan.", "The proposal is anticipated to yield significant benefits, including a reduction in loan interest rates, lower unemployment rates, and improved international banking infrastructure."], "smollm:1.7b": ["The summary is concise and to the point, capturing the main ideas and key details from the original text.", "It provides a brief overview of the tsunami debt deal, the G8 countries involved, and the relief efforts made by the World Bank and IMF.", "The tone is neutral, without any explanations or justifications for the decisions made."], "deepseek-r1:1.5b": ["Summarized text:\n Chancellor Gordon Brown plans to announce a debt interest suspension agreement with tsunami-hit nations on Friday.", "The deal aims to save £3 billion annually and involves G8 nations, including Japan.", "British finance ministers are instructed by financial institutions to analyze reconstruction problems across all affected nations.", "Britain chairs the process, while Germany and Canada have contributed their insights.", "Foreign Secretary Jack Straw noted 440 people missing or dead in the disaster."], "tinyllama:1.1b": ["British Chancellor Gordon Brown has announced that, after weeks of negotiations, he hopes to announce a suspension of debt interest repayments for affected countries by the G8 group of wealthy nations.", "The agreement is estimated to save the affected countries £3bn per year and would have originally been proposed earlier this week.", "The deal was reached after Japan agreed to join on Thursday, while ministers from all G8 states are now working towards completing a country-by-country analysis for those hit by the disaster.", "Foreign Secretary Jack Straw has also begun his own moratorium, and it is expected that the freeze will be announced as well."], "tinydolphin:1.1b": [" The government announced that they will suspend debt interest payments by tsunami-hit nations, totaling £3 billion a year.", "This decision is believed to be the first major international effort to address the reconstruction needs of these countries.", "Japan has agreed to participate in this initiative, but it's uncertain whether any other G8 nations have yet made similar commitments."], "phi:2.7b": [" Chancellor Gordon Brown hopes to announce an agreement by the G8 group of wealthy nations to suspend debt interest repayments by tsunami-hit countries, which would save affected countries £3bn pounds a year.", "The deal is thought to have been agreed on Thursday night after Japan signed up, and it may also include instructions for the World Bank and IMF to analyze reconstruction problems faced by all states hit by the disaster.", "This comes as Foreign Secretary Jack Straw reported that the number of British nationals affected has reached 440."], "orca-mini:3b": [" Chancellor Gordon Brown announced a deal to suspend debt interest repayments by tsunami-hit nations, with Japan finally signing up to the agreement.", "The G8 group of wealthy nations agreed to save affected countries £3bn pounds a year, and instructed the World Bank and IMF to complete a country by country analysis of reconstruction problems faced by all states hit by the disaster."], "hermes3:3b": ["Tsunami debt interest suspend deal (G8), save £3bn/year, announced by Chancellor Brown."], "stablelm-zephyr:3b": ["Chancellor Brown hopes to announce a deal suspending debt interest repayments for tsunami-hit nations, saving affected countries £3bn annually.", "After Japan's signing, G8 ministers agreed with the World Bank and IMF on a country by country analysis of disaster reconstruction problems.", "This comes as Foreign Secretary Jack Straw stated that 440 Britons were dead or missing in the disaster."], "stablelm2:1.6b": ["Chancellor Brown hopes to announce a debt interest suspension deal for tsunami-hit nations later on Friday, saving £3bn annually.", "Japan's signing makes this G8 proposal successful, and it's believed to instruct World Bank & IMF to analyze reconstruction problems faced by affected states.", "Germany & Canada proposed freezes, while UK initially proposed a suspension; these were eventually combined in the final deal agreed upon during Thursday night talks with finance ministers of Britain now chaired by G8.", "The number of Britons dead or missing reached 2300 according to Foreign Secretary Jack Straw."], "granite3.1-dense:2b": ["Chancellor Gordon Brown anticipates announcing a debt relief agreement for tsunami-stricken nations on Friday, through which these countries will save £3 billion annually by deferring interest payments.", "This proposal was reportedly reached after Japan agreed to the deal, following previous resistance from other G8 members.", "The World Bank and International Monetary Fund will conduct a comprehensive assessment of reconstruction needs for all affected nations.", "British Foreign Secretary Jack Straw confirmed that 440 UK citizens remain unaccounted for in the disaster's aftermath."], "chatgpt-4o-latest": ["Chancellor Gordon Brown announced that the G8 nations have agreed to suspend debt interest repayments for countries affected by the tsunami, saving them £3bn annually.", "The deal was finalized after Japan, a major creditor, joined the agreement.", "G8 ministers also instructed the World Bank and IMF to assess reconstruction challenges in affected nations.", "Germany and Canada have taken similar steps.", "The announcement comes as the number of Britons dead or missing in the disaster reaches 440."]}