{"raw_text": "Concerns at school diploma plan\n \n Final appeals are being made for the government not to ditch the reform plan for England's secondary schools put forward by the Tomlinson report.\n \n The government's response to the plan for a four-tier diploma to replace all existing 14-19 qualifications is expected next week. Some are worried it could be scuppered if, as Tony Blair and Ruth Kelly have suggested, GCSEs and A-levels stay. Sir Mike Tomlinson himself was briefed only this week. He is said to be feeling more comfortable about what the government is likely to say than if he had read only what was in newspapers in the earlier part of the week. But the government was said to be still rewriting its response on Friday. \"It will be a tragedy if the government comes through with a half-hearted response,\" said the chairman of the Commons education select committee, Labour MP Barry Sheerman.\n \n His main concern was the reports that there would be a diploma - but only to replace existing vocational qualifications. \"We must tackle head-on the structural mess that is our secondary education system,\" he wrote in the Times Educational Supplement. \"It is not the case that the academic stream in secondary is fine while the vocational route is desperately weak.\" The Qualifications and Curriculum Authority (QCA) has also told the government not to \"compromise\". The QCA said the potential \"step-change in participation and attainment\" lay in the integrity of the whole diploma. \"Any partial implementation of the proposals would, in our view, compromise that integrity,\" said its chairman, Sir Anthony Greener. It is a sign of the QCA's concern that its advice went to ministers last December but was publicised only recently. But people understand that a White Paper response is government policy and has to command wider ministerial support than if it were coming only from the Department for Education and Skills. They may be content if it does not \"close too many doors\" in writing - whatever spin is put on it.\n \n The chief inspector of schools, David Bell, also said recently that GCSEs and A-levels should go. \"One of the reasons why I'm so strongly in favour of these terms disappearing over time is that it's good for the symbols of change to be seen right across the system,\" he said. \"If we don't say this is a sea-change in education, we will miss a great opportunity.\" Universities and head teachers in both the independent and state sectors have also backed the Tomlinson proposals, which include having higher grades at advanced level to differentiate between the brightest students. A note of concern has been expressed repeatedly by the employers' organisation, the CBI, which complains of a lack of skills. In an attempt to address this, the Tomlinson plan is for tests in \"functional\" maths and literacy - decidedly not GCSEs. It has been suggested the government will take steps of some sort to meet firms' concerns on this score. Another dissenter is Sir Mike Tomlinson's predecessor as chief schools inspector, Professor Chris Woodhead, who has said there is no need for such a \"massive upheaval\". The Conservative Party has put forward plans to revert to a system of having only the brightest percentage of students each year getting the top A-level grade, no matter how well the others have done.\n", "llama3.2:1b": ["Concerns over the government's proposed reform plan for England's secondary schools include:\n\n- The potential introduction of a four-tier diploma replacing existing 14-19 qualifications\n- Fears that GCSEs and A-levels may remain intact if the proposal is partially implemented\n- Concerns about the structural mess in secondary education and the need to tackle it head-on\n- Official statements from the Qualifications and Curriculum Authority, the Chief Inspector of Schools, and universities/heads of institutions opposing the plan\n- Suggestions for alternative solutions, including differentiated tests and measures to address skill gaps"], "llama3.2:3b": ["The government's plan to replace existing 14-19 qualifications with a four-tier diploma for England's secondary schools is facing concerns that it could be watered down or abandoned altogether if GCSEs and A-levels are left intact.", "The chairman of the Commons education select committee, Labour MP Barry Sheerman, has warned that such a half-hearted response would be \"a tragedy.\"", "The Qualifications and Curriculum Authority and other stakeholders have expressed similar concerns, citing the need to maintain the integrity of the diploma plan."], "gemma2:2b": ["Concerns are growing that the government may abandon Sir Michael Tomlinson's reform plan for England's secondary education system, which proposes a four-tier diploma to replace existing qualifications.", "While the government is expected to release its response next week, some parties like teachers and employers feel strongly about keeping the reforms intact.", "They argue that changes are necessary to address issues with vocational education and skills gap concerns while emphasizing the need for a complete system overhaul.", "Some critics, however, propose reverting to traditional systems and suggest there's no necessity for such extensive change."], "qwen2.5:0.5b": ["Concerns about a potential breakaway from the Tomlinson plan for England's secondary schools.", "Tony Blair and Ruth Kelly had suggested GCSEs and A-levels stay, while Sir Mike Tomlinson was briefed only this week.", "He is still rewriting his response, but has said that it will be \"a tragedy if the government comes through with a half-hearted response.\"", "The Qualifications and Curriculum Authority (QCA) has advised not to compromise and says the diploma would benefit the integrity of all qualifications.", "David Bell, chief inspector of schools, also expressed support for having higher grades at advanced level to differentiate between students.", "Universities and head teachers in both sectors have backed the Tomlinson plan, which includes tests in \"functional\" maths and literacy.", "The CBI has expressed concerns about skills gaps.", "The Conservative Party is considering a return to top-performing students each year without additional testing."], "qwen2.5:1.5b": ["Concerns about potential changes to England's secondary school diploma plan are escalating as concerns remain over its structure and whether it will fully replace existing qualifications such as GCSEs and A-levels.", "The government is expected to respond next week, with some suggesting that leaving current vocational routes unchanged could be problematic for overall system reform.", "Key figures, including the chair of the Commons education select committee, advocate for a comprehensive approach to improve secondary education quality, while others remain cautious about potentially closing doors on educational reforms."], "qwen2.5:3b": ["Concerns persist over the government's response to Sir Mike Tomlinson's diploma reform plan for England's secondary schools.", "Despite assurances from MPs and organizations like QCA and CBI, there are worries that a partial implementation could compromise the plan's integrity.", "While some support GCSEs and A-levels' removal to signal system change, others argue for maintaining these qualifications due to their role in vocational education.", "The government is expected to respond with a revised White Paper in the coming week, which will need broader ministerial backing but can take a nuanced stance."], "opencoder:1.5b": ["Concerns at school diploma plan: Final appeals are being made for the government not to ditch the reform plan for England's secondary schools put forward by the Tomlinson report.", "The government's response to the plan for a four-tier diploma to replace all existing 14-19 qualifications is expected next week.", "Some are worried it could be scuppered if, as Tony Blair and Ruth Kelly have suggested, GCSEs and A-levels stay.", "His main concern was the reports that there would be a diploma - but only to replace existing vocational qualifications.", "The report said \"it will be a disaster if the government comes through with a half-hearted response\".", "The chairman of the Commons education select committee, Labour MP Barry Sheerman, expressed concerns about the government's lack of preparation and willingness to listen to what seemed to him as a misunderstanding.", "However, the QCA has also indicated that it is in its best interest to address any concerns.", "The primary concern was regarding the plans by universities and head teachers in both sectors.", "The Tomlinson report, backed by experts, suggests a \"step-change in participation and attainment\", with the aim of introducing higher grades at the advanced level to differentiate between the brightest students.", "This move could provide opportunities for better recognition and retention.", "The chief inspector of schools, David Bell, also mentioned concerns about GCSEs and A-levels disappearing over time due to good for change indicators.", "The university's CBI has expressed concerns that they might miss out on skills and knowledge.", "However, the university's endorsement suggests a willingness to make the move.", "Another point of concern is with Sir Mike Tomlinson's predecessor as chief schools inspector, Professor Chris Woodhead, who has stated no need for such a massive shift in education system.", "The party is planning to revert to the traditional four tiers of qualifications and only award students with top A-level grades.", "The QCA has also indicated they are aware of concerns about the potential \"step-change in participation and attainment\".", "However, the government's support has been appreciated by the wider public, as it indicates a willingness to listen and make any necessary moves.", "The government's commitment towards restructuring the education system is supported by diverse insights from both sides of the fence."], "smollm:1.7b": ["The concerns at school diploma plan are being made for the government not to ditch the reform plan for England's secondary schools put forward by the Tomlinson report.", "The government's response to the plan for a four-tier diploma to replace all existing 14-19 qualifications is expected next week.", "Some are worried it could be scuppered if, as Tony Blair and Ruth Kelly have suggested, GCSEs and A-levels stay.", "Sir Mike Tomlinson himself was briefed only this week.", "He is said to be feeling more comfortable about what the government is likely to say than if he had read only what was in newspapers in the earlier part of the week.", "But the government was said to be still rewriting its response on Friday.", "\"It will be a tragedy if the government comes through with a half-hearted response,\" said the chairman of the Commons education select committee, Labour MP Barry Sheerman.", "The main concern at school diploma plan is that there would be no further GCSEs or A-levels to replace existing qualifications.", "Sir Mike Tomlinson himself was briefed only this week.", "He is said to be feeling more comfortable about what the government is likely to say than if he had read only what was in newspapers in the earlier part of the week.", "But people understand that a White Paper response is government policy and has to command wider ministerial support than if it were coming only from the Department for Education and Skills.", "They may be content if it does not \"close too many doors\" in writing - whatever spin is put on it.", "The chief inspector of schools, David Bell, also said recently that GCSEs and A-levels should go.", "\"One of the reasons why I'm so strongly in favour of these terms disappearing over time is that it's good for the symbols of change to be seen right across the system,\" he said.", "If we don't say this is a sea-change in education, we will miss a great opportunity.", "The chief inspector of schools, David Bell, has been supportive of the Tomlinson plan and its emphasis on functional skills.", "A note of concern has been expressed by the employers' organisation, the CBI, which complains of a lack of skills.", "In an attempt to address this, the Tomlinson plan is for tests in \"functional\" maths and literacy - decidedly not GCSEs or A-levels.", "It has been suggested the government will take steps of some sort to meet firms' concerns on this score.", "Another dissenter is Sir Mike Tomlinson's predecessor as chief schools inspector, Professor Chris Woodward.", "He has said there is no need for such a \"massive upheaval\".", "The Conservative Party has put forward plans to revert to a system of only the brightest percentage of students each year getting the top A-level grade, no matter how well the others have done."], "deepseek-r1:1.5b": ["The government is expected to respond next week to England’s Tomlinson report, which proposes a four-tier diploma plan replacing existing qualifications from 14-19 years old.", "Some are concerned this might face scrutiny if GCSEs and A-levels remain in the system, while Sir Mike Tomlinson, the former chief schools inspector, has been briefly informed about the plan but feels more confident of his response than just reading earlier headlines.", "The government is still rewriting its assessment on Friday, with Chairman Barry Sheerman expressing worry that a half-hearted response could undermine confidence.", "The Qualifications and Curriculum Authority (QCA) has confirmed it will not compromise on integrity and believes any partial implementation risks compromising this.", "The CBI, an employers organization, has criticized the current system for a lack of skills, while employers believe functional maths and literacy tests are needed to address concerns.", "Sir Mike Tomlinson’s predecessor, Chris Woodhead, has also expressed that no massive change is needed, suggesting a shift away from top A-levels.", "The Conservative Party has proposed reverting to a simpler structure, allowing only the top percentage of students to achieve an A-level grade, regardless of others’ performance."], "tinyllama:1.1b": ["The concerns at school diploma plan are that the government's response will be scuppered if it stays as proposed, with some feeling more comfortable about what they read in newspapers than reading newspapers earlier in the week.", "The government is expected to respond on Friday but the main concerns are not to compromise the integrity of the whole diploma, and that A-levels should disappear over time, while the employers' organisation, the CBI, has expressed concerns about skills shortages.", "Despite dissenting opinions, it is seen as a sea-change in education, with higher grades being set to differentiate between brightest students.", "The government will have to meet firm concerns on this score."], "tinydolphin:1.1b": [" Concerns over school diploma plan \n\nThe government's response to the reform plan for England's secondary schools proposed by the Tomlinson report is expected next week.", "Some are worried that this could be scrapped if, as mentioned in a recent newspaper article, GCSEs and A-levels remain.", "Sir Mike Tomlinson, who was briefed only this week, said he feels more comfortable about the government response than if he had read only what was in newspapers earlier this month.", "The government has rewritten its response, however, and there is concern that it might be too compromised to make a headline-grabbing announcement.", "The Conservative Party, on the other hand, has proposed revisions to the system where students need only 12 GCSEs to get A-levels at any level.", "However, critics argue that this would make education more structured and less flexible for individual students' progress."], "phi:2.7b": [" There are concerns about the government's plan to replace all existing 14-19 qualifications in England with a four-tier diploma.", "The Tomlinson report is being appealed for without full details.", "If GCSEs and A-levels are not scrapped, it could scupper the reform plans.", "Sir Mike Tomlinson was only briefed on Friday after reading what was in the newspapers.", "It is important that the government comes through with a strong response to the plan.", "The academic stream in secondary education must be tackled head-on.", "The QCA has advised against partial implementation of the proposals as it would compromise the integrity of the whole diploma system.", "The government's policy is clear and needs support from ministers.", "Some people are content if the White Paper does not \"close too many doors.\"", "The chief inspector of schools, David Bell, supports the idea that GCSEs and A-levels should go to bring about a sea-change in education."], "orca-mini:3b": [" The government is considering scrapping GCSEs and A-levels in favor of a new diploma system for England's secondary schools.", "Some worry that this could be scuppered if the government decides to keep only the top percentage of students receiving the highest grade, which would not differentiate between the brightest students.", "The Qualifications and Curriculum Authority has warned against this approach, saying it would compromise the integrity of the whole diploma.", "However, the chief inspector of schools supports the Tomlinson plan, which includes higher grades at advanced level to distinguish between the brightest students.", "Employers' organizations have also backed the plan, as have some dissenters like Sir Mike Tomlinson and Chris Woodhead.", "The government is expected to make a decision next week on the reform plan for England's secondary schools."], "hermes3:3b": ["Summary of concerns about potential ditching of Tomlinson report's school diploma plan:\n- Government's response on four-tier diploma expected next week\n- Some worry GCSEs and A-levels staying could scuttle reform \n- Sir Mike Tomlinson briefed only this week, but government still rewriting response\n- Chairman of Commons education select committee Barry Sheerman concerned about partial implementation compromising integrity\n- QCA chairman Sir Anthony Greener also warns against compromise\n- Chief inspector of schools David Bell says GCSEs and A-levels should go to signify sea-change in education\n- Universities, head teachers, employers' organisation (CBI) all back Tomlinson proposals\n- CBI complains of lack of skills; some dissenter is former chief schools inspector Chris Woodhead who argues for no massive upheaval."], "stablelm-zephyr:3b": ["The government is finalizing its response regarding the Tomlinson report's plan for a four-tier diploma in England's secondary schools, which could be at risk if GCSEs and A-levels remain unchanged.", "Sir Mike Tomlinson, the author of the report, is feeling comfortable with the government's potential response.", "The Qualifications and Curriculum Authority (QCA) has advised against compromising the integrity of the diploma proposal.", "Other concerns include the possibility of a half-hearted response from the government, with some arguing that GCSEs and A-levels should remain to undermine the new diploma system.", "Universities, head teachers, and employers' organizations have expressed support for the Tomlinson proposals, which aim to differentiate between bright students through higher grades at advanced level.", "The Conservative Party has proposed a different approach, reverting to a system that focuses on the top A-level grade for all students."], "stablelm2:1.6b": ["Concerns remain over England's secondary school reform plan proposed by the Tomlinson report, with final appeals made for the government not to abandon it due to potential compromises with GCSEs and A-Levels.", "The four-tier diploma aims to replace existing qualifications, while Sir Mike Tomlinson feels more comfortable about the government's response after being briefed this week.", "Opponents worry that a half-hearted response could compromise the integrity of the whole diploma, as the QCA advises against compromising.", "The chief inspector of schools and universities endorse the plan, which includes higher grades at advanced level to differentiate between the brightest students, with some employers' organizations suggesting addressing skill concerns through testing functional maths and literacy, not GCSEs.", "A Conservative Party alternative has also been proposed, which involves only the brightest percentage of students each year getting the top A-level grade."], "granite3.1-dense:2b": ["Final appeals are being made to prevent the UK government from abandoning the Tomlinson report's plan for a four-tier diploma in England's secondary schools.", "The government is expected to release its response next week, and concerns arise that GCSEs and A-levels may remain, which could hinder the proposal's implementation.", "Key stakeholders, including the Commons education select committee chairman Barry Sheerman, the QCA, David Bell (chief inspector of schools), universities, independent head teachers, and some employers, support the Tomlinson plan.", "This plan aims to replace existing 14-19 qualifications with a single diploma, emphasizing advanced levels for the brightest students and functional maths and literacy tests to address skill shortages.", "However, skepticism persists due to the CBI's concerns about skills development and the Conservative Party's proposal to maintain an A-level grading system focused on the top academic performers."], "chatgpt-4o-latest": ["Final appeals are being made to the government to fully implement the Tomlinson report's proposed four-tier diploma system for England's secondary schools, replacing GCSEs and A-levels.", "Concerns arise that the government may only apply the diploma to vocational qualifications, undermining the reform's integrity.", "Education leaders, including the QCA and chief inspector of schools David Bell, support the overhaul, arguing it would improve participation and attainment.", "Universities and head teachers also back the plan, which includes higher advanced-level grades to distinguish top students.", "However, the CBI highlights a skills gap, prompting proposals for functional maths and literacy tests.", "Critics, including former chief inspector Chris Woodhead and the Conservative Party, argue against such a major change.", "The government’s final response is still being revised, with concerns that a partial implementation could weaken the reform’s impact."]}