{"raw_text": "Brown visits slum on Africa trip\n \n Chancellor Gordon Brown has visited Kenya's biggest shantytown as he opened a week-long visit to Africa.\n \n Mr Brown's trip is designed to highlight how the UK wants to make Africa's problems a priority of its chairmanship of the G8 this year. He will see an HIV/Aids orphanage in Tanzania and a women's credit union in Mozambique before chairing a meeting of the Commission for Africa in Cape Town. At slums in Narobi on Wednesday, he said education needs had to be tackled.\n \n Speaking outside the Olympic Primary School, Mr Brown said: \"It is simply not acceptable in the modern age for the rest of the world to stand by and have hundreds of millions of children not getting the chance at education.\" He pointed to international plans to invest $10bn for education in Africa over the next decade. The school is on the edge of Kibera, where 800,000 live often in huts made of mud, scrap metal and cardboard. Mr Brown's aides say he wants to find out more about the Kenyan Government's education policies, which included introducing free primary education in early 2003. The chancellor has already unveiled proposals for a G8 aid package which he has likened to the Marshall Plan used by the United States to rebuild Europe after World War Two. The trip follows claims of infighting between Mr Brown and Tony Blair detailed in a new book. Conservative leader Michael Howard is expected to seize on those reports at prime minister's questions at 1200 GMT on Wednesday.\n", "llama3.2:1b": ["Chancellor Gordon Brown visits Kenya's slums as part of his week-long Africa trip, where he aims to highlight the UK's efforts to address African problems during its G8 chairmanship this year.", "He will visit an HIV/AIDS orphanage and a women's credit union in Tanzania and Mozambique, and meet with officials at an education commission in Cape Town."], "llama3.2:3b": ["Chancellor Gordon Brown visited Kenya's biggest shantytown, highlighting the UK's priorities for chairing G8 meetings this year.", "He emphasized education needs must be tackled and announced plans to invest $10bn in Africa over the next decade.", "The trip follows reports of infighting between Brown and Blair, and comes ahead of prime minister's questions where Conservative leader Michael Howard is expected to attack Brown over the claims."], "gemma2:2b": ["Chancellor Gordon Brown visited slums in Nairobi, Kenya during his African trip.", "He highlighted the need for addressing education issues in Africa and will meet with representatives of the Commission for Africa before attending a meeting in Cape Town.", "His visit is part of the UK's efforts to prioritize Africa as a priority for the G8 this year."], "qwen2.5:0.5b": ["Chancellor Gordon Brown visits slums in Africa, including an orphanage in Tanzania and a women's credit union in Mozambique.", "He is visiting Narobi on Wednesday, which is the first of his \"week-long visit to Africa.\"", "Mr. Brown mentions that education needs are being addressed through international plans for investment in Africa over the next decade.", "The school where he visits the slums is located on the edge of Kibera, with 800,000 children living there and often using makeshift materials like mud, metal scraps, and cardboard."], "qwen2.5:1.5b": ["Chancellor Gordon Brown visited Kenya, emphasizing the UK's commitment to Africa as chair of G8 this year.", "Highlights include:\n- Visited Kibera slum in Nairobi\n- Highlighted education needs\n- Announced $10bn plan for African education\n- Chaired a meeting on Commission for Africa in Cape Town"], "qwen2.5:3b": ["Chancellor Gordon Brown visited Kenya's largest slum, Kibera, as part of his Africa trip aimed at highlighting UK's G8 chairmanship focus on African issues.", "He plans to see an HIV/AIDS orphanage in Tanzania and a women’s credit union in Mozambique.", "Brown will meet with the Commission for Africa in Cape Town.", "At Naruko, he emphasized education needs, stating that hundreds of millions of children do not have access to education.", "The school is located at the edge of Kibera where 800,000 people live in makeshift huts.", "Brown wants to learn about Kenya’s education policies, which include free primary education since early 2003.", "His trip follows reports of infighting between him and Tony Blair."], "opencoder:1.5b": ["Brown visits slum on Africa trip.", "Chancellor Gordon Brown has visited Kenya's biggest shantytown, designed to highlight how the UK wants to make Africa's problems a priority of its chairmanship of the G8 this year.", "At slums in Narobi, Mr Brown said education needs had to be tackled.", "He points out international plans to invest $10bn for education in Africa over the next decade.", "The school is on the edge of Kibera where 800,000 live often in huts made of mud, scrap metal and cardboard.", "Mr Brown's aides share some information about the Kenyan Government's education policies.", "They have mentioned a free primary education in early 2003.", "The chancellor has unveiled proposals for a G8 aid package which he has likened to the Marshall Plan used by the United States to rebuild Europe after World War Two."], "smollm:1.7b": ["The summary should be concise, clear, and free from unnecessary information.", "The key ideas and details are preserved as they appear in the original text:\n\n1.", "Brown visits slum on Africa trip\n2.", "Chancellor Gordon Brown has visited Kenya's biggest shantytown as he opened a week-long visit to Africa.", "3.", "Mr Brown's trip is designed to highlight how the UK wants to make Africa's problems a priority of its chairmanship of the G8 this year.", "4.", "He will see an HIV/Aids orphanage in Tanzania and a women's credit union in Mozambique before chairing a meeting of the Commission for Africa in Cape Town.", "At slums in Narobi on Wednesday, he said education needs had to be tackled.", "5.", "Speaking outside the Olympic Primary School, Mr Brown said: \"It is simply not acceptable in the modern age for the rest of the world to stand by and have hundreds of millions of children not getting the chance at education.\"", "He pointed to international plans to invest $10bn for education in Africa over the next decade.", "The school is on the edge of Kibera, where 800,000 live often in huts made of mud, scrap metal and cardboard.", "Mr Brown's aides say he wants to find out more about the Kenyan Government's education policies, which included introducing free primary education in early 2003.", "The chancellor has already unveiled proposals for a G8 aid package which he has likened to the Marshall Plan used by the United States to rebuild Europe after World War Two.", "The trip follows claims of infighting between Mr Brown and Tony Blair detailed in a new book."], "deepseek-r1:1.5b": ["Chancellor Brown visited Kenya's biggest slum during a week-long trip to Africa.", "The visit aims to highlight African challenges as part of the G8 chairmanship this year, focusing on issues like HIV/AIDS and women's education.", "He will meet representatives from Tanzania's HIV/Aids orphanage and Mozambique's women's credit union in Kenyan capital Cape Town.", "Brown will address a group outside the Olympic Primary School about modern standards for education.", "The trip began at Narobi slums in Kenya, with plans to visit areas near Kibera, where children often live in mud and other materials.", "The announcement mentioned $10 billion investment in African education over ten years.", "Brown also compared his aid proposal to the U.S. Marshall Plan's approach to rebuilding neglected regions."], "tinyllama:1.1b": ["Brown visits slum on Africa trip, opening week-long visit to aid UK priorities of chairing G8 this year; touring slums in Kenya with Gordon Brown, highlighting importance of tackling education inadequacies in Africa."], "tinydolphin:1.1b": [" Summary: Chancellor Gordon Brown has embarked on a week-long visit to Africa, which includes visiting slums in Kenya’s largest shantytown and addressing education issues there.", "At an Olympic primary school in Narobi, he praised the rest of the world's lack of investment in education as a reason for not having more children in classrooms.", "Brown hopes that his visit to Africa will emphasize the UK's commitment to improving African issues, including HIV/AIDS and poverty."], "phi:2.7b": [" Chancellor Gordon Brown visited Kenya's biggest slum, Narobi, during his week-long visit to Africa.", "He wants to tackle the problem of education and highlight how the UK will prioritize Africa in its chairmanship of the G8 this year.", "The school he visited is on the edge of Kibera, where 800,000 people live in huts made of mud, scrap metal, and cardboard.", "Mr Brown's aides say he hopes to learn more about the Kenyan Government' s education policies that included introducing free primary education in 2003."], "orca-mini:3b": [" Chancellor Gordon Brown visited Kenya's largest slum, Narobi, where he saw an HIV/Aids orphanage in Tanzania and a women's credit union in Mozambique before chairing a meeting of the Commission for Africa in Cape Town.", "He pledged to invest $10bn for education in Africa over the next decade and spoke out against the lack of education for hundreds of millions of children around the world, especially in Africa."], "hermes3:3b": ["Brown visits slum in Kenya during Africa trip."], "stablelm-zephyr:3b": ["Chancellor Gordon Brown visited Kenya's largest slum, Narobi, as part of his week-long African trip aimed at focusing on Africa's problems during the UK's G8 presidency.", "Brown highlighted the importance of addressing education needs in the continent and mentioned international plans to invest $10 billion in African education over the next decade.", "He also referred to the Kenyan government's introduction of free primary education in 2003, and discussed his proposed G8 aid package, similar to the Marshall Plan used after World War II.", "This trip comes amid reports of infighting between Brown and former Prime Minister Tony Blair."], "stablelm2:1.6b": ["Chancellor Gordon Brown visited Kenya's biggest slum during his week-long visit to Africa, emphasizing the importance of tackling education issues.", "He will attend an orphanage in Tanzania and a women's credit union in Mozambique before meeting with the Commission for Africa in Cape Town.", "Brown emphasized the need for tackling educational disparities, especially considering international plans to invest $50 billion for education in Africa over the next decade.", "In Kibera, Kenya, he observed that free primary education should be introduced by the Kenyan government.", "Brown's visit also follows claims of infighting between him and former UK Prime Minister Tony Blair from a new book."], "granite3.1-dense:2b": ["Chancellor Gordon Brown embarked on an Africa trip, commencing his journey by visiting Kenya's largest slum, Kibera, with an estimated population of 800,000 living in impoverished conditions.", "During this stop, he emphasized the urgent need to address education shortcomings, stating it is unacceptable for the global community to ignore hundreds of millions of children lacking access to education.", "Brown also highlighted international commitments of $10 billion towards African education over the next decade.", "The visit underscores the UK's intention to prioritize Africa's challenges as it chairs the G8 this year, with plans for a significant aid package reminiscent of the Marshall Plan.", "This trip comes after allegations of tension between Brown and former Prime Minister Tony Blair were detailed in a recent publication, potentially influencing discussions at prime minister's questions by Conservative leader Michael Howard."], "chatgpt-4o-latest": ["Chancellor Gordon Brown visited Kenya's largest slum as part of a week-long Africa trip to emphasize the UK's commitment to addressing the continent's issues during its G8 chairmanship.", "He highlighted the need for improved education, citing a $10bn international investment plan.", "Brown also plans to visit an HIV/AIDS orphanage in Tanzania and a women's credit union in Mozambique before chairing a Commission for Africa meeting in Cape Town.", "His trip follows his proposal for a G8 aid package similar to the Marshall Plan and comes amid reports of political tensions with Prime Minister Tony Blair."]}