{"raw_text": "Hunt demo at Labour meeting\n \n Pro-hunt supporters are set to protest at Labour's spring conference.\n \n The Countryside Alliance says it expects up to 4,000 supporters to demonstrate against the hunting ban. They have agreed to keep to a demonstration site on the other side of the River Tyne from the conference venue in Gateshead. A bid to overturn the law banning hunting with dogs in England and Wales has begun in the Court of Appeal. The ban comes into force on 18 February. The Court of Appeal is expected to rule early next week on whether the alliance's challenge has succeeded. Richard Dodd, regional director of the Countryside Alliance, said he expected between 2,000 and 4,000 supporters in Tyneside to make their protest, with hunt horns and placards.\n \n Campaigners have been asked not to bring any animals or alcohol.\n \n Mr Dodd said he did not believe there would be any repeat of the trouble which marred the pro-hunt demonstration outside Parliament in September. \"We are holding a static demonstration, just to remind Labour that we are not going away,\" he said. Northumbria Police said the pedestrian Millennium Bridge, by the demonstration site, will be shut if necessary. But Assistant Chief Constable David Warcup has liaised with several protest groups and said all negotiations had gone well. Fathers 4 Justice, pensioners' rights activists and Stop the War campaigners were also expected to demonstrate during the three-day conference which starts on Friday. Pro-hunt campaigners claims the 1949 Parliament Act - which extends the right of the House of Commons to overrule the House of Lords - was itself invalid because it was never passed by peers. The High Court last month ruled the act was valid and the proposed hunting ban was lawful. Pro-hunt supporters formally launched their second legal challenge to the ban in London's High Court on Thursday. The Countryside Alliance has lodged papers seeking a judicial review on human rights grounds. Animal welfare groups have welcomed the ban, many of whom have campaigned for a ban for decades saying hunting is cruel and unnecessary.\n", "llama3.2:1b": ["Pro-hunt supporters are set to protest at Labour's spring conference in Tyneside with up to 4,000 expected to attend.", "A demonstration site will be near the Gateshead conference venue and campaigners have agreed not to bring animals or alcohol.", "The Countryside Alliance has challenged the hunting ban in England and Wales, arguing it was invalid due to its non-passage by peers."], "llama3.2:3b": ["Pro-hunt supporters plan to protest at Labour's spring conference in Gateshead with up to 4,000 demonstrators.", "The Countryside Alliance has agreed to keep to a demonstration site across the River Tyne from the conference venue.", "The protesters are expected to bring no animals or alcohol.", "A bid to overturn the hunting ban is set to be ruled on by the Court of Appeal early next week."], "gemma2:2b": ["Pro-hunt supporters plan a demonstration at Labour's spring conference in Gateshead, England, protesting against the ban on hunting with dogs.", "The Countryside Alliance expects up to 4,000 people to attend the demonstration, which will take place near a designated site opposite the conference venue.", "The group plans a static demonstration and says it is not expecting similar trouble to previous protests.", "Several other groups are also expected to demonstrate at the conference, including Fathers 4 Justice, pensioners' rights activists, and Stop the War campaigners.", "A legal challenge challenging the ban continues in court, with pro-hunt supporters seeking to overturn the law which will come into effect on February 18th.", "Animal welfare organizations support the ban due to its potential to reduce cruelty and unnecessary suffering."], "qwen2.5:0.5b": ["Countryside Alliance protests at Labour conference amid hunt ban.", "Protesters are expected to protest against the hunting ban by keeping to the other side of the River Tyne from the conference venue in Gateshead.", "A challenge has begun in Court of Appeal, with no ruling until early next week.", "Northumbria Police shut Millennium Bridge if necessary and other groups have also been invited to demonstrate."], "qwen2.5:1.5b": ["Pro-hunt supporters plan to protest against a ban on hunting with dogs at Labour's spring conference in Gateshead, with up to 4,000 expected participants marching near the venue but not crossing it.", "A legal challenge to the ban has begun, and campaigners are being asked not to bring animals or alcohol.", "Northumbria Police is prepared to shut pedestrian Millennium Bridge if necessary during the three-day event."], "qwen2.5:3b": ["Pro-hunt supporters plan to protest at Labour's spring conference with up to 4,000 expected, following their demonstration against the hunting ban.", "The Countryside Alliance will demonstrate near Gateshead, using the other side of the River Tyne from the venue.", "Campaigners have agreed not to bring animals or alcohol.", "Northumbria Police expect negotiations to go well with other protest groups during the three-day conference.", "Pro-hunt supporters challenge the 1949 Parliament Act and are filing a second legal challenge in London's High Court seeking human rights grounds for judicial review.", "Animal welfare groups support the ban, while hunting advocates claim the act is invalid.", "The proposed hunting ban comes into force on February 18."], "opencoder:1.5b": ["The Hunt demo at Labour meeting: At this juncture, supporters are setting to protest at the Spring Conference's Labour's countryside conference.", "A majority of supporters believe that it is an honour to demonstrate against the Hunting Ban.", "The Alliance has agreed to keep supporters on a designated hunting site from the Conference Venue in Gateshead.", "The ban comes into effect on 18 February.", "A petition from a few supporters, ranging between 2,000 and 4,000, will be made to overturn this law as soon as possible.", "The ban is not just about banning hunting but also about the prevention of any repeat or further incidents like that harboring a scandal.", "In response, various protestors have expressed their opinions, with some claiming to have made a protest during the pro-hunt demonstration outside Parliament in September."], "smollm:1.7b": ["The pro-hunt supporters are expected to protest at Labour's spring conference in Tyneside.", "The Countryside Alliance has agreed to keep to a demonstration site on the other side of the River Tyne from the conference venue in Gateshead.", "A bid to overturn the law banning hunting with dogs in England and Wales has begun in the Court of Appeal.", "The pro-hunt supporters are expected to make their protest, but they have not yet decided whether to bring animals or alcohol.", "Mr Dodd said he did not believe there would be any repeat of the trouble which marred the pro-hunt demonstration outside Parliament in September.", "\"We are holding a static demonstration, just to remind Labour that we are not going away,\" he said.", "Northumbria Police said the pedestrian Millennium Bridge, by the demonstration site, will be shut if necessary.", "But Assistant Chief Constable David Warcup has liaised with several protest groups and said all negotiations had gone well.", "Fathers 4 Justice, pensioners' rights activists and Stop the War campaigners were also expected to demonstrate during the three-day conference which starts on Friday.", "Pro-hunt supporters claim the 1949 Parliament Act - which extends the right of the House of Commons to overrule the House of Lords - was itself invalid because it was never passed by peers.", "The High Court last month ruled the act was valid and the proposed hunting ban was lawful.", "Pro-hunt campaigners claims the 1949 Parliament Act - which extends the right of the House of Commons to overrule the House of Lords - was itself invalid because it was never passed by peers.", "The Countryside Alliance has lodged papers seeking a judicial review on human rights grounds.", "Animal welfare groups have welcomed the ban, many of whom have campaigned for a ban for decades saying hunting is cruel and unnecessary."], "deepseek-r1:1.5b": ["Pro-hunt supporters are setting off a pro-clerk demonstration at Labour's spring conference in Gateshead, where they expect between 2000-4000 people to join against the hunting ban in England and Wales.", "The Countryside Alliance has agreed to demonstrate from a site on the other side of the River Tyne from the venue.", "A court challenge is expected against their proposed overturning of the law, which will start affecting hunting in England and Wales on February 18th.", "Groups including Richard Dodd, a regional director of the Countryside Alliance, expect around 2000-4000 supporters from various areas to attend.", "The event aims to remind Labour that they are not leaving the spot.", "Pro-hunt campaigners believe there could be repeats of the past incident and have organized a static demonstration.", "They aim to provide animal protection gear and block roads."], "tinyllama:1.1b": ["The Countryside Alliance has announced that they plan to protest at Labour's spring conference against the ban on hunting with dogs in England and Wales, and will set up a static demonstration at Millennium Bridge outside Gateshead.", "The countrywide support group plans to keep to a site on the other side of River Tyne from the conference venue.", "The Court of Appeal is expected to rule early next week on the allliance's challenge against the ban, with approximately 2,000 and 4,000 supporters in line for the protest.", "The demonstration will include animals and alcohol banned by the ban, with organizers seeking a judicial review on human rights grounds.", "Animal welfare groups welcome the ban but campaigners have called it cruel and unnecessary."], "tinydolphin:1.1b": [" Summary: Hunt supporters plan to protest at Labour's spring conference in Gateshead by demonstrating against the hunting ban.", "The Countryside Alliance has asked for a demonstration site on the other side of the River Tyne, but might also use Tyneside if necessary.", "Campaigners will not bring animals or alcohol and will be met with barriers to prevent trouble.", "Northumbria Police will likely shut down pedestrian Millennium Bridge.", "The demonstrators will be organized by Assistant Chief Constable David Warcup, who has negotiated with several groups throughout the conference.", "This is the second legal challenge by pro-hunt supporters against the hunting ban in England and Wales."], "phi:2.7b": [" Labour's conference will be protested by up to 4,000 pro-hunt supporters from the Countryside Alliance outside the venue due to their opposition to the hunting ban in England and Wales, which comes into force on February 18.", "A court case challenging the ban has been underway since its passage through Parliament.", "The campaigners have been requested not to bring animals or alcohol to prevent any trouble.", "They expect no repeat of the previous protests at the same location last year.", "Other groups such as Fathers 4 Justice, pensioners' rights activists and Stop the War campaigners are also expected to demonstrate during the conference."], "orca-mini:3b": [" Pro-hunt supporters are planning to protest at Labour's spring conference in Gateshead.", "Up to 4,000 supporters are expected to demonstrate against the hunting ban.", "The Countryside Alliance has agreed to keep to a demonstration site on the other side of the River Tyne from the conference venue.", "The ban comes into force on 18 February and the Court of Appeal is expected to rule early next week on whether the alliance's challenge has succeeded.", "There may be some disruption in the area around the conference venue due to the protest, but police have stated that they will take necessary measures to ensure public safety.", "Campaigners have been asked not to bring any animals or alcohol to the demonstration.", "The Countryside Alliance claims that the 1949 Parliament Act, which extends the right of the House of Commons to overrule the House of Lords, is invalid because it was never passed by peers.", "This claim has been dismissed by the High Court and the proposed hunting ban is now law.", "Pro-hunt campaigners have formally launched a second legal challenge to the ban in London's High Court on human rights grounds.", "Animal welfare groups have welcomed the ban, saying that hunting is cruel and unnecessary."], "hermes3:3b": ["Hunt supporters demonstrate at Labour conference against hunting ban."], "stablelm-zephyr:3b": ["Pro-hunt supporters plan to protest at Labour's spring conference, with up to 4,000 expected to demonstrate against the hunting ban in England and Wales.", "The Countryside Alliance will maintain a static demonstration across the River Tyne from the Gateshead conference venue.", "Pro-hunt campaigners argue that the Parliament Act extending the right of the House of Commons to overrule the House of Lords is invalid, while animal welfare groups welcome the ban as cruel and unnecessary.", "Northumbria Police may close the pedestrian Millennium Bridge near the demonstration site."], "stablelm2:1.6b": ["Pro-hunt supporters will protest at Labour's spring conference against a proposed hunting ban in England and Wales, with as many as 4,000 expected to demonstrate.", "The Countryside Alliance has filed a challenge in the Court of Appeal, aiming to overturn the law banning hunting with dogs.", "The protest site is on the other side of the River Tyne from the event venue in Gateshead, with a potential for trouble similar to that at an anti-Parliament demonstration outside Parliament in September.", "A Court of Appeal ruling is expected next week on whether to uphold the challenge."], "granite3.1-dense:2b": ["Pro-hunt supporters are scheduled to protest at Labour's spring conference in Gateshead, with up to 4,000 participants expected from the Countryside Alliance.", "The demonstration will take place on the opposite bank of the River Tyne, near the conference venue.", "The alliance is challenging the hunting ban in the Court of Appeal, as it comes into effect on 18 February.", "Richard Dodd, regional director of the Countryside Alliance, anticipates a peaceful static protest with horns and placards, emphasizing their commitment to Labour's stance on hunting.", "Northumbria Police has ensured necessary precautions are in place, including potential bridge closures, while maintaining positive communication with various protest groups.", "The Countryside Alliance argues that the 1949 Parliament Act, used to bypass the House of Lords and enable the hunting ban, is invalid due to lack of peer approval.", "However, the High Court previously ruled this act valid and the hunting ban lawful.", "Animal welfare groups strongly support the ban, citing its cruelty and irrelevance in modern society."], "chatgpt-4o-latest": ["Pro-hunt supporters plan to protest at Labour's spring conference, with up to 4,000 demonstrators expected.", "The Countryside Alliance has agreed to a designated protest site across the River Tyne from the venue in Gateshead.", "The protest coincides with a legal challenge in the Court of Appeal against the hunting ban, which takes effect on 18 February.", "Protesters have been asked not to bring animals or alcohol, and organizers expect a peaceful demonstration.", "Other activist groups, including Fathers 4 Justice and Stop the War campaigners, are also expected to protest during the three-day event.", "The Countryside Alliance argues that the 1949 Parliament Act, which allowed the ban to pass, is invalid, but the High Court has upheld the law.", "A second legal challenge has been launched on human rights grounds.", "Animal welfare groups support the ban, calling hunting cruel and unnecessary."]}