{"raw_text": "Tories attack burglar 'U-turns'\n \n Tory leader Michael Howard has accused Tony Blair of performing U-turns over rules on using force against burglars.\n \n The government has ruled out amending the present law, which allows \"reasonable force\" in self defence. Mr Howard branded the decision unacceptable, saying: \"It is not householders who should be frightened, it's the burglars.\" Home Secretary Charles Clarke said ministers had kept to their pledge to review the law.\n \n Metropolitan Police Commissioner Sir John Stevens last month backed a Tory attempt to change the law so only householders using \"grossly disproportionate\" force could be prosecuted. The pressure prompted the prime minister to say the police and Crown Prosecution Service would be consulted as part of a review of the law. He told MPs: \"If we get the right response from those people, we will, of course, support a change in the law.\" Instead, the government has decided no change is needed but there will be a publicity campaign so people are clear they are entitled to defend themselves. On Thursday, Mr Howard told BBC Radio 4's Today programme Mr Blair had initially refused the law change, then had come round to the idea and was now backtracking again. He said: \"We've had three policy positions in three months and two U-turns. \"It's not surprising Gordon Brown told him: 'There's nothing you could say to me now that I could ever believe.'\"\n \n Mr Howard said the \"grossly disproportionate\" test matched the hurdle ministers had introduced for civil cases where burglars where claimed compensation from householders. The issue entered the public spotlight when Norfolk farmer Tony Martin was jailed for shooting dead a 16-year-old burglar in 1999 as he ran away from the farm. But the home secretary said Mr Howard was wrong to say the law was biased in favour of burglars. The barrister who had represented Mr Martin had said the rules were \"weighted overwhelmingly\" in favour of the householder, said Mr Clarke. He said: \"The problem is there has not been enough understanding of it - that was the point Sir John Stevens was making and the prime minister was making.\" The new guidance would help ensure clarity on the issue, added Mr Clarke. The director of public prosecutions, Ken Macdonald, says only 11 householders or occupiers of business premises have been prosecuted in the last 15 years. Those cases included a warehouse manager who had waited for a burglar, tied him up, beat him and set him alight, he said. Tory MP Patrick Mercer's private member's bill to change the law received a first reading in Parliament on Wednesday and goes to a full debate next month.\n", "llama3.2:1b": ["Tory leader Michael Howard has accused Tony Blair of performing U-turns over rules on using force against burglars, citing a government decision not to amend the current law.", "The Home Secretary said ministers had reviewed the law and decided there was no need for change, despite pressure from the police and Crown Prosecution Service."], "llama3.2:3b": ["Tory leader Michael Howard accuses Tony Blair of performing U-turns over rules allowing \"reasonable force\" in self-defense against burglars, citing a lack of clarity on what constitutes acceptable defense.", "Home Secretary Charles Clarke disputes this claim, saying the government has kept its pledge to review the law and will introduce new guidance to clarify the issue."], "gemma2:2b": ["Michael Howard accuses Tony Blair of three policy reversals regarding use of force against burglars.", "The government has decided not to amend current law, which allows \"reasonable\" force.", "However, pressure from Tory MP's led to a review of the law with an initial \"grossly disproportionate\" test for prosecution.", "Despite this, the government is launching a public awareness campaign on self-defense."], "qwen2.5:0.5b": ["Tories accuse Blair of U-turning over home burglars' use of force, calling for no changes despite three U-turns in policy positions and two \"grossly disproportionate\" tests."], "qwen2.5:1.5b": ["Tory leader Michael Howard accuses former Prime Minister Tony Blair of performing U-turns regarding legislation allowing \"reasonable force\" against burglars, despite home secretary Charles Clarke saying ministers have kept their pledge to review the law.", "The issue has led to confusion about when households can defend themselves from burglars and concerns over a bias in favor of housekeepers."], "qwen2.5:3b": ["Tory leader Michael Howard criticizes Tony Blair’s U-turns on burglary laws, which allow \"reasonable force\" in self-defense.", "The government decided against amending current law, maintaining that ministers would review it with police and Crown Prosecution Service.", "Home Secretary Charles Clarke argues the existing law balances rights between homeowners and burglars.", "However, critics like Michael Howard see the law as unfairly biased towards homeowners.", "A bill to change the law is expected to be debated in Parliament soon."], "opencoder:1.5b": ["Tories attack burglar 'U-turns'.", "Tory leader Michael Howard has accused Tony Blair of performing U-turns over rules on using force against burglars.", "The government ruled out amending the present law, which allows \"reasonable force\" in self defence.", "Mr Howard branded the decision unacceptable, saying: \"It is not householders who should be frightened, it's the burglars.\"", "The government has decided no change is needed but there will be a publicity campaign so people are clear they are entitled to defend themselves.", "On Thursday, Mr Howard told BBC Radio 4's Today programme Mr Blair had initially refused the law change, then had come round to the idea and was now backtracking again.", "He said: \"We've had three policy positions in three months and two U-turns.\"", "Mr Howard said the \"grossly disproportionate\" test matched the hurdle ministers had introduced for civil cases where burglars where claimed compensation from householders.", "The issue entered the public spotlight when Norfolk farmer Tony Martin was jailed for shooting dead a 16-year-old burglar in 1999 as he ran away from the farm.", "But the home secretary said Mr Howard was wrong to say the law was biased in favour of burglars.", "The barrister who had represented Mr Martin had said the rules were \"weighted overwhelmingly\" in favour of the householder, said Mr Clarke.", "He said: \"The problem is there has not been enough understanding of it - that was the point Sir John Stevens was making and the prime minister was making.\"", "The new guidance would help ensure clarity on the issue, added Mr Clarke.", "The director of public Prosecutions, Ken Macdonald, says only 11 householders or occupiers of business premises have been prosecuted in the last 15 years.", "Those cases included a warehouse manager who had waited for a burglar, tied him up, beat him and set him alight, he said."], "smollm:1.7b": ["The summary is concise and clear, preserving key ideas and details from the original text.", "The main points are:\n\n1.", "The government has ruled out amending the present law, which allows \"reasonable force\" in self-defense.", "2.", "Tory leader Michael Howard has accused Tony Blair of performing U-turns over rules on using force against burglars.", "3.", "The government has kept to its pledge not to review the law.", "4.", "Metropolitan Police Commissioner Sir John Stevens last month backed a Tory attempt to change the law so only householders using \"grossly disproportionate\" force could be prosecuted.", "5.", "Metropolitan Police Commissioner Sir John Stevens told MPs that ministers had kept to their pledge to review the law.", "6.", "The prime minister has decided no change is needed but there will be a publicity campaign to make people clear they are entitled to defend themselves.", "7.", "On Thursday, Mr Howard told BBC Radio 4's Today Programme that Mr Blair had initially refused the law change, then had come back to the idea and was now backtracking again.", "He said: \"We've had three policy positions in three months and two U-turns.\"", "8.", "The prime minister said the \"grossly disproportionate\" test matched the hurdle ministers had introduced for civil cases where burglars were claimed compensation from householders.", "9.", "Mr Howard said the law was biased in favor of burglars.", "10.", "The barrister who had represented Tony Martin had said the rules were \"weighted overwhelmingly\" in favor of the householder, said Mr Clarke.", "He added: \"The problem is there has not been enough understanding of it - that was the point Sir John Stevens was making and the prime minister was making.\"", "11.", "The new guidance would help ensure clarity on the issue, added Mr Clarke.", "The director of public prosecutions says only 11 householders or occupiers of business premises have been prosecuted in the last 15 years.", "Those cases included a warehouse manager who had waited for a burglar, tied him up, beat him and set him alight, he said."], "deepseek-r1:1.5b": ["The Tory leader Michael Howard has accused Tony Blair of performing U-turns on force use against burglars, calling it unacceptable.", "The government opposes amendments to an existing law that allows \"reasonable force.\"", "Home Secretary Clarke said ministers kept their pledge to review the law.", "Sir John Stevens supported a Tory attempt and told MPs they would consult with ministers.", "The government has decided no change is needed but will conduct a public awareness campaign.", "On Thursday, Howard spoke about the issue with BBC Radio 4, repeating that three policy positions had been made and two U-turns occurred."], "tinyllama:1.1b": ["The Prime Minister Tony Blair has come under fire from home secretary Charles Clark for rejecting U-turns on \"reasonable force\" used by burglars in self-defence.", "In response, Michael Howard, the leader of the opposition Conservative Party, accused the government of performing U-turns and performing a review of the law to change it for householders only using \"reasonable force.\"", "Home Secretary John Stevens had previously backed an Attempt to change the law, but the government now claims there has been no change and will continue with a publicity campaign instead.", "The Prime Minister Gordon Brown initially refused the proposed U-turn by ministers but then changed his mind after Norfolk farm owner Tony Martin was jailed for shooting dead a burglar in 1999.", "However, the Director of Public Prosecutions Ken Macdonald stated that only 11 householders or occupiers of business premises had been prosecuted since 15 years, and warned that such cases were not rare.", "The government is also reviewing the law to ensure clarity on whether it favours burglars.", "Home Secretary Charles Clark said MPs will have a full debate next month."], "tinydolphin:1.1b": [" The home secretary, Charles Clarke, has backed an attack by Tories leader Michael Howard on Tony Blair over the use of force against burglars.", "Mr Clarke said ministers had kept their pledge not to amend the current law that allows reasonable force in self-defense.", "Howard claimed that Blair should be allowed to avoid a U-turn, stating that the law is biased in favor of burglars.", "Home Secretary Charles Clarke has insisted that there's nothing wrong with using \"reasonable\" force in self-defense but has backed Tory leader Michael Howard's suggestion for reform.", "The government will consult with the Metropolitan Police Commissioner, Sir John Stevens, and the Crown Prosecution Service before deciding whether to change the law to apply only to householders or occupiers of business premises."], "phi:2.7b": [" The text says that Michael Howard has accused Tony Blair of making \"U-turns\" over using force against burglars.", "The government has ruled out changing the present law, which allows \"reasonable force\" in self defense.", "However, Sir John Stevens, the Metropolitan Police Commissioner, suggested a change to the law would be reasonable.", "In response, the government announced a review and will focus on public education campaigns rather than changing the law."], "orca-mini:3b": [" The text discusses Michael Howard's criticism of Tony Blair's decision not to change the law allowing \"reasonable force\" in self-defense against burglars, and the government's decision not to change it.", "Howard accused Blair of performing U-turns on the issue, and Clarke said the law was weighted in favor of the householder.", "However, the police and CPS will be consulted as part of a review, and the government has decided to launch a publicity campaign to clarify the law.", "The Tory MP Patrick Mercer's private member's bill to change the law is being debated in Parliament."], "hermes3:3b": ["Tory leader attacks Blair over alleged U-turns on rule against using 'unacceptable' force against burglars by householders; govt decides no amendment needed but will promote understanding of self-defence rights."], "stablelm-zephyr:3b": ["Tory leader Michael Howard criticized Tony Blair for performing U-turns over rules allowing \"reasonable force\" in self-defense against burglars.", "Despite initial opposition, the government decided against amending the law and instead planned a publicity campaign.", "Home Secretary Charles Clarke argued that any concerns of bias towards burglars were misconstrued and that only 11 householders or occupiers of business premises have been prosecuted for such incidents in the last 15 years.", "Tory MP Patrick Mercer's private member's bill to change the law will go to a full debate next month."], "stablelm2:1.6b": ["Tory leader Michael Howard accuses Tony Blair of performing U-turns over rules allowing householders to use \"reasonable force\" against burglars, while Home Secretary Charles Clarke says ministers have kept their pledge to review the law without amending it.", "The government has decided no change is needed but plans a publicity campaign for people to be clear they are entitled  to defend themselves.", "Tory MP Patrick Mercer's bill to change the law received its first reading in Parliament and will go to a full debate next month, following a similar bill last year."], "granite3.1-dense:2b": ["Tory leader Michael Howard criticized Prime Minister Tony Blair for reportedly performing \"U-turns\" regarding proposed changes to self-defense laws against burglars.", "The government initially pledged to review the current law, which permits \"reasonable force,\" but ultimately decided no amendment is necessary.", "Home Secretary Charles Clarke defended the decision, stating that the existing rules are not biased in favor of burglars and that there has been insufficient understanding of the legal framework, as demonstrated by a high number of unprosecuted householder cases over 15 years (11 instances).", "The issue gained attention following Norfolk farmer Tony Martin's imprisonment for shooting a fleeing burglar in 1999.", "Despite these claims, Howard accused Blair of initially refusing the law change before changing his stance and now backtracking, causing skepticism among MPs.", "A publicity campaign will be launched to clarify self-defense rights under the existing law.", "Meanwhile, a private member's bill by Tory MP Patrick Mercer is set for a full debate in Parliament next month."], "chatgpt-4o-latest": ["Tory leader Michael Howard accused Tony Blair of making U-turns on laws regarding the use of force against burglars.", "The government decided not to amend the law, which allows \"reasonable force\" in self-defense, despite earlier indications of a review.", "Howard criticized Blair for shifting positions multiple times.", "Metropolitan Police Commissioner Sir John Stevens had supported a Tory proposal to change the law so only \"grossly disproportionate\" force would be prosecutable.", "The government instead opted for a publicity campaign to clarify existing rights.", "Home Secretary Charles Clarke defended the law, arguing it already favors householders.", "The issue gained attention after Norfolk farmer Tony Martin was jailed for killing a burglar in 1999.", "Clarke cited statistics showing few prosecutions of householders, emphasizing the need for better public understanding.", "Meanwhile, Tory MP Patrick Mercer introduced a private member’s bill to change the law, set for debate next month."]}