{"raw_text": "Borders rail link campaign rally\n \n Campaigners are to stage a rally calling for a Borders rail link which was closed in 1969 to be reopened.\n \n They will mark the 36th anniversary of the line closure, which ran from Edinburgh through the Borders and on to Carlisle, with a walk at Tweedbank. Anne Borthwick, of Campaign for Borders Rail, said reopening the Waverley Line would restore the area's prosperity. MSPs are considering the reintroduction of passenger rail services through Midlothian to the Borders. Campaigners have said that reopening the Waverley Line, which could cost up to £100m, would be a huge economic boost for the Borders.\n \n In 2000, Borders Council said the area's economy had suffered since the closure. Ms Borthwick said the lobby group was determined to keep the pressure on the Scottish Executive. \"We are hoping that many people will join us in a march to mark the 36th anniversary of the closure of the Waverley Line,\" she said. \"Campaign for Borders Rail is the biggest independent lobby group in Scotland and we have been lobbying tirelessly for the reinstatement of rail services to the Borders and eventually to Carlisle.\n \n \"We believe that it is time for the Scottish Executive to commit to the first phase of the project by pledging to fund the line between Edinburgh and Tweedbank in the first instance and then investigate extending the line in the future.\" Ms Borthwick said reopening the line would be a prosperous move and protect the character of the Scottish Borders. A study in 2000, which was commissioned by the executive, Scottish Borders Council, Midlothian Council and Scottish Borders Enterprise, found that a half-hourly service from Tweedbank to Edinburgh could cover its operating costs. It also found that a half-hourly service from Gorebridge to Edinburgh could cover operating costs and that a freight railway joining the West Coast Main Line at Longtown could also be reinstated.\n", "llama3.2:1b": ["Campaigners are calling for a Borders rail link to be reopened, which was closed in 1969.", "The group is marking the 36th anniversary of the closure with a walk from Tweedbank.", "MSPs have been considering reintroducing passenger rail services through Midlothian to the Borders.", "Campaigners believe that reopening the Waverley Line would restore the area's prosperity and protect its character."], "llama3.2:3b": ["Campaigners are staging a rally in the Borders to call for the reopening of the Waverley Line, which closed in 1969.", "The line runs from Edinburgh through the Borders to Carlisle and would cost up to £100m to reopen.", "Reopening the line is seen as an economic boost for the area, with some studies suggesting it could be profitable with a half-hourly service."], "gemma2:2b": ["Campaigners will hold a rally commemorating the 36th anniversary of the closure of the Waverley Line, calling for its reopening.", "The campaign advocates for the line's restoration to boost the region's economy and preserve its character.", "The group highlights economic studies that show a half-hourly service between Tweedbank and Edinburgh could cover operating costs and emphasizes the potential benefits of reintroducing rail services to the Borders."], "qwen2.5:0.5b": ["The Borders rail link campaign aims to mark 36 years since the line was closed in 1969, calling for its reopening with a walk along the Tweedbank route from Edinburgh to Carlisle.", "The campaign is supported by MSPs and has been lobbying for passenger rail services between Midlothian and the Borders.", "A study commissioned by the executive concluded that a half-hourly service could cover operating costs."], "qwen2.5:1.5b": ["Campaigners call for reopening of Borders rail link, marking 36th anniversary closure in Tweedbank area; MSPs consider reintroduction of passenger services through Midlothian to Carlisle via Waverley Line, estimated cost up to £100m would boost economic prosperity.", "The event aims to keep pressure on the Scottish Executive for funding and extension of rail service."], "qwen2.5:3b": ["Campaigners are staging a rally to reopen the Borders rail link, which was closed in 1969.", "They aim to restore economic prosperity for the area by reopening the Waverley Line, which costs up to £100m and could see passenger services reintroduced from Edinburgh through Tweedbank to Carlisle.", "The campaign is marking the line’s closure anniversary and has lobbied MSPs and the Scottish Executive for reinstated rail services.", "In 2000, a study suggested that a half-hourly service would cover costs, with plans considering both passenger and freight services."], "opencoder:1.5b": ["Borders rail link campaign rally.", "Campaigners are marking the 36th anniversary of the closure of the Waverley Line, which was running from Edinburgh through the Borders and Carlisle.", "The area's prosperity will be restored by reopening the line with a huge economic boost for the Borders.", "MSPs are considering the reintroduction of passenger rail services through Midlothian to the Borders.", "They have expressed their concerns that reopening the Waverley Line would strain the Scottish Executive.", "The Council, in 2,000, has noted that the area's economy had suffered due to the closure of the line.", "The lobby group said they hope many people will join us in a march to mark the 36th anniversary of the closure and continue their march towards the brighter future."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details:\n\n1.", "Borders rail link campaign rally: The campaigners will stage a rally calling for a Borders rail link which was closed in 1969 to be reopened.", "2.", "Campaigners are to mark the 36th anniversary of the line closure with a walk at Tweedbank: Anne Borthwick, of Campaign for Borders Rail, said reopening the Waverley Line would restore the area's prosperity.", "3.", "MSPs are considering the reintroduction of passenger rail services through Midlothian to the Borders: Campaigners have said that reopening the Waverley Line, which could cost up to £100m, would be a huge economic boost for the Borders.", "4.", "In 2000, Borders Council said the area's economy had suffered since the closure: Ms Borthwick said the lobby group was determined to keep the pressure on the Scottish Executive.", "5.", "Campaign for Borders Rail is the biggest independent lobby group in Scotland and we have been lobbying tirelessly for the reinstatement of rail services to the Borders and eventually to Carlisle: We believe that it is time for the Scottish Executive to commit to the first phase of the project by pledging to fund the line between Edinburgh and Tweedbank in the first instance and then investigate extending the line in the future.", "6.", "Study in 2000 found that a half-hourly service from Gorebridge to Edinburgh could cover its operating costs: It also found that a half-hourly service from Gorebridge to Edinburgh could cover operating costs and that a freight railway joining the West Coast Main Line at Longtown could also be reinstated."], "deepseek-r1:1.5b": ["The Borders Rail link campaign aims to reopen the Waverly Line in 2034 as part of their anniversary event at Tweedbank in 2023.", "Anne Borthwick assures an economic prosperity for the area by reopening this critical rail link, which could cost up to £100 million.", "MSPs are exploring reintroducing services from Midlothian to Borders and emphasizing the need for financial support from the Scottish Executive to fund the project's first phase, including Edinburgh-Tweedbank connectivity."], "tinyllama:1.1b": ["The Border regions have been facing economic challenges for decades, but a lobby group is calling for reopening a closed rail link between the towns of Tweedbank and Edinburgh.", "The proposed route would bring passengers and freight services to the Border region's prosperous character, according to campaigners.", "In 1969, the Border Rail Link was closed due to budget constraints, but in 2000, campaigners renewed their push for reopening the Waverley Line to restore the area's prosperity.", "The lobby group is determined to keep pressure on Scottish Executive and has been advocating for a half-hourly service from Tweedbank to Edinburgh.", "The study commissioned in 2000 found that a half-hourly service could cover operating costs, while a half-hourly service from Gorebridge to Edinburgh could also be reinvented."], "tinydolphin:1.1b": [" The campaigners are organizing a rally to demand the reopening of the Waverley Line, which was closed in 1969 for passenger rail services between Edinburgh and Tweedbank.", "The closure of this line has had a significant impact on the Borders region's economy, affecting the local economy and job market.", "They are hoping that many people will join them in marching to commemorate the 36th anniversary of the line's closure and to show their support for reopening the line."], "phi:2.7b": [" Campaigners plan a rally in Scotland to reopen the Borders rail link, which was closed down in 1989.", "They will walk 36 years after the closure and call for reopening the Waverley Line from Edinburgh to Carlisle.", "The campaign group believes that this would boost the area's economy and restore its prosperity.", "A study commissioned by the Scottish Executive, councils, and enterprise found that a half-hourly service between Tweedbank and Edinburgh could cover operating costs."], "orca-mini:3b": [" Campaigners are holding a rally calling for a Borders rail link, which was closed in 1969, to be reopened.", "They will mark the 36th anniversary of the line closure with a walk at Tweedbank.", "Reopening the Waverley Line would restore prosperity to the area, according to campaigners.", "MSPs are considering the reintroduction of passenger rail services through Midlothian to the Borders.", "Campaigners want the Scottish Executive to fund the first phase of the project and investigate extending the line in the future.", "A study in 2000 found that a half-hourly service from Tweedbank to Edinburgh could cover its operating costs, while a half-hourly service from Gorebridge to Edinburgh could as well.", "A freight railway joining the West Coast Main Line at Longtown could also be reinstated."], "hermes3:3b": ["Campaigners hold rally for reopened Borders rail link; aim to revive 1969 closed line between Edinburgh, Tweedbank, and boost area's economy."], "stablelm-zephyr:3b": ["Campaigners are holding a rally for the reopening of the Borders rail link, which was closed in 1969.", "They argue that restoring the Waverley Line from Edinburgh through the Borders to Carlisle would boost the economy and restore area prosperity.", "The cost of such restoration could reach £100m, but previous studies have shown that operating costs can be covered with a half-hourly service.", "MSPs are considering reintroducing passenger rail services through Midlothian to the Borders."], "stablelm2:1.6b": ["Campaigners are organizing a rally to call for reopening of the Borders rail link, closed in 2000, which connects Edinburgh to Carlisle via the Borders.", "This event is happening on the anniversary of the closure and will involve a walk in Tweedbank.", "The Campaign for Borders Rail argues that restoring the Waverley Line could help restore economic prosperity in the area.", "MSPs are considering reintroducing passenger rail services through Midlothian, which has found evidence to cover operating costs for hourly services between Tweedbank and Edinburgh.", "Reopening the line could cost up to £m but would be a significant economic boost for the Borders."], "granite3.1-dense:2b": ["Campaigners for the reopening of the Borders rail line, closed in 1969 between Edinburgh and Carlisle via the Borders, are organizing a rally on the 36th anniversary of its closure.", "The walk at Tweedbank aims to highlight the potential economic benefits, estimated at up to £100m, of reinstating passenger services along the Waverley Line.", "Anne Borthwick from Campaign for Borders Rail emphasizes that reopening would revitalize the Borders' economy and preserve its character.", "MSPs are currently evaluating the possibility of restoring rail connections through Midlothian to the Borders.", "In 2000, a study commissioned by local authorities suggested that a half-hourly service between Tweedbank and Edinburgh could be cost-effective.", "The campaign group is pushing for the Scottish Executive to commit to funding the line's initial extension from Edinburgh to Tweedbank and further consider extending it to Carlisle."], "chatgpt-4o-latest": ["Campaigners are rallying to reopen the Waverley Line, a rail link from Edinburgh through the Borders to Carlisle that was closed in 1969.", "Marking the 36th anniversary of its closure, they will march at Tweedbank, emphasizing the economic benefits of reinstating the line, which could cost up to £100m.", "The Campaign for Borders Rail, Scotland’s largest independent lobby group, is urging the Scottish Executive to fund the first phase between Edinburgh and Tweedbank, with potential future extensions.", "A 2000 study found that a half-hourly service from Tweedbank or Gorebridge to Edinburgh could cover operating costs, and a freight railway connection to the West Coast Main Line could also be viable."]}