{"raw_text": "Lords wrong on detainees - Straw\n \n Jack Straw has attacked the decision by Britain's highest court that detaining foreign terrorist suspects without trial breaks human rights laws.\n \n The foreign secretary said the right to life was the \"most important liberty\" and the government had a duty to protect people from terrorism. Law lords were \"simply wrong\" to imply the men were being held arbitrarily. New Home Secretary Charles Clarke vowed the nine men would remain in prison while the law was being reviewed.\n \n The House of Lords ruled by an eight to one majority in favour of appeals by the men - dealing a major blow to the government's anti-terror policy.\n \n But Mr Straw denied it amounted to a \"constitutional crisis\". He said those held had a right of appeal to the special immigration appeal tribunal and the decision to hold the suspects was upheld by that court. \"The law lords are simply wrong to imply that this is a decision to detain these people on the whim or the certificate of the home secretary,\" he told BBC Radio 4's Today programme. The foreign secretary insisted it was for Parliament, and not judges, to decide how best Britain could be defended against the threat of terrorism. But Liberal Democrat peer Lord Carlile, the government's independent reviewer of anti-terrorism laws, said it was possible some of the detainees could now be released. He said the Law Lords' ruling was an \"embarrassment\" for the government and major changes were needed to the law.\n \n The ruling came on Charles Clarke's first day as home secretary following David Blunkett's resignation. In a statement to MPs, Mr Clarke said: \"I will be asking Parliament to renew this legislation in the New Year.\n \n \"In the meantime, we will be studying the judgment carefully to see whether it is possible to modify our legislation to address the concerns raised by the House of Lords.\" The detainees took their case to the House of Lords after the Court of Appeal backed the Home Office's powers to hold them without limit or charge. The government opted out of part of the European Convention on Human Rights concerning the right to a fair trial in order to bring in anti-terrorism legislation in response to the 11 September attacks in the US. Any foreign national suspected of links with terrorism can be detained or can opt to be deported. But those detained cannot be deported if this would mean persecution in their homeland. On Thursday, Lord Bingham - a senior law lord - said the rules were incompatible with the European Convention on Human Rights as they allowed detentions \"in a way that discriminates on the ground of nationality or immigration status\" by justifying detention without trial for foreign suspects, but not Britons. Lord Nicholls of Birkenhead, in his ruling, said: \"Indefinite imprisonment without charge or trial is anathema in any country which observes the rule of law.\n \n In a statement, detainee 'A' in Woodhill Prison said: \"I hope now that the government will act upon this decision, scrap this illegal 'law' and release me and the other internees to return to our families and loved ones.\" The case was heard by a panel of nine law lords rather than the usual five because of the constitutional importance of the case. Solicitor Gareth Pierce, who represents eight of the detainees, claimed the detention had driven four of the detainees to \"madness\", saying two were being held in Broadmoor hospital.\n", "llama3.2:1b": ["The British government's decision to detain foreign terrorist suspects without trial has been ruled unconstitutional by the House of Lords.", "The law lords found that the right to life is fundamental and that the government must protect people from terrorism, but ultimately upheld a decision made by the Home Office.", "The case involved nine men detained for suspected links with terrorism, who took their appeal to the House of Lords after the Court of Appeal rejected their application for bail.", "The court ruled in favor of the government, allowing them to continue detaining the suspects without trial.", "However, Lord Carlile, a Liberal Democrat peer and independent reviewer of anti-terrorism laws, has expressed concerns that some detainees may be released.", "He claims that the decision by the law lords was an \"embarrassment\" for the government and suggests that changes are needed to anti-terrorism laws.", "The Home Office has pledged to review the case and potentially modify its legislation to address concerns raised by Lord Carlile.", "Meanwhile, the detainees have expressed hopes for a positive outcome and demand the release of all internees."], "llama3.2:3b": ["Jack Straw attacked the House of Lords' decision that detaining foreign terrorist suspects without trial breaks human rights laws.", "The right to life is the \"most important liberty\" and the government has a duty to protect people from terrorism.", "Straw said the law lords were \"simply wrong\" and denied it amounts to a constitutional crisis.", "Liberal Democrat peer Lord Carlile said the ruling could lead to detainees' release, while the government vowed to review the law and renew legislation in the New Year."], "gemma2:2b": ["Jack Straw denies that the House of Lords' ruling on detainee detention violates human rights and insists Parliament should determine how to best protect Britain from terrorism.", "The Law Lords disagreed, stating indefinite imprisonment without charge or trial is against the rule of law, highlighting nationality-based discrimination within the current anti-terrorism laws.", "Lord Carlile believes some detainees might be released due to this ruling.", "Charles Clarke plans to modify legislation based on the decision and seek Parliament's renewal in the New Year.", "Detainees have endured indefinite imprisonment without charge, with several experiencing mental distress as a result, as highlighted by solicitor Gareth Pierce."], "qwen2.5:0.5b": ["Lords have rejected detaining foreign suspects without trial, according to Jack Straw.", "Detainees are being tried and may be released after a court review, while British Home Secretary Charles Clarke vowed not to release anyone indefinitely."], "qwen2.5:1.5b": ["The Foreign Secretary has attacked Britain's highest court over its decision that detaining foreign terrorist suspects without trial violates human rights laws.", "Lord Carlile suggests some detainees may be released, while Charles Clarke vows to review the law as Parliament considers renewal of anti-terrorism legislation.", "The ruling comes on Clarke's first day in office following Blunkett's resignation and follows the Court of Appeal backing Home Office powers."], "qwen2.5:3b": ["Jack Straw criticized the decision by Britain's highest court that detaining foreign terrorist suspects without trial breaches human rights laws.", "The House of Lords ruled in favor of appeals by the men, but Foreign Secretary Jack Straw denied it amounted to a \"constitutional crisis.\"", "He insisted that those held had a right to appeal to a special immigration appeal tribunal and that the decision to detain them was upheld by that court.", "The ruling came on Charles Clarke's first day as Home Secretary following David Blunkett's resignation.", "Lord Bingham said the detention rules were incompatible with the European Convention on Human Rights, while Lord Nicholls of Birkenhead argued that indefinite imprisonment without charge or trial is contrary to any country observing the rule of law.", "The detainees and their legal representatives claimed the detention had driven four into \"madness\" and two into Broadmoor hospital."], "opencoder:1.5b": ["The summary is as follows:\n\n\"Jack Straw has attacked the decision by Britain's highest court that detaining foreign terrorist suspects without a trial break on human rights laws, but it was Mr Straw who denied it because he said it was a 'constitutional crisis' - those held had a right to appeal.", "The Law Lords' ruling was an embarrasment for the government and major changes were needed to the law.", "The foreign secretary insisted it was for Parliament, not judges, to decide how Britain could be defended against the threat of terrorism.", "A Lib Dem peer Lord Carlile pointed out that some of the detainees could now be released based on the Government's powers to hold them without limit or charge.", "The ruling came on Charles Clarke's first day as home secretary following David Blunkett's resignation.", "In a statement, Mr Clarke said: 'I will be asking Parliament to renew this legislation in the New Year.'\""], "smollm:1.7b": ["The summary should be:\n\nLords wrong on detainees - Straw\n\nJack Straw has attacked the decision by Britain's highest court that detaining foreign terrorist suspects without trial breaks human rights laws.", "The foreign secretary said the right to life was the \"most important liberty\" and the government had a duty to protect people from terrorism.", "Law lords were \"simply wrong\" to imply the men were being held arbitrarily.", "New Home Secretary Charles Clarke vowed the nine men would remain in prison while the law is being reviewed.", "The foreign secretary denied it amounted to a \"constitutional crisis\".", "He said those held had a right of appeal to the special immigration appeal tribunal and the decision to hold the suspects was upheld by that court.", "But Liberal Democrat peer Lord Carlile, the government's independent reviewer of anti-terrorism laws, said it was possible some of the detainees could now be released.", "He said the law was possible but would require changes to the legislation.", "In a statement, detainee 'A' in Woodhill Prison said: \"I hope now that the government will act upon this decision, scrap this illegal 'law' and release me and the other internees to return to our families and loved ones.\"", "The case was heard by a panel of nine law lords rather than the usual five because of the constitutional importance of the case.", "Solicitor Gareth Pierce, who represents eight of the detainees, claimed the detention had driven four of the detainees to \"madness\", saying two were being held in Broadmoor hospital."], "deepseek-r1:1.5b": ["The UK government's stance on holding foreign terrorism suspects without trial became controversially attacked by former Foreign Secretary Jack Straw.", "Law Lords, particularly Lord Carlile, ruled in their favor, supporting the court's decision to hold them in prison despite claiming it wasn't a constitutional crisis.", "They held the cases for an eight-to-one majority and saw this ruling as a significant blow, but critics accused them of simply refusing to allow free speech or legal protections.", "The government, led by Charles Clarke, later stated they would review their anti-terror policies, including changes to the law to accommodate the detention case."], "tinyllama:1.1b": ["The House of Lords has criticized the Home Office's anti-terrorism legislation by ruling that its detainment and extradition of foreign suspects without trial breaks human rights laws.", "The government appealed against the decision made by the special immigration appeal tribunal which had ruled in favour of appeal from nine men held on suspicion of terrorist offenses.", "The new home secretary, Charles Clarke, vowed to review the legislation as he urged MPs to renew it for renewal.", "The government's legal team argued that the legislation was necessary and legally sufficient in response to the 11 September attacks in the US.", "However, Lord Binham, a senior law lord, ruled that the rules were incompatible with the European Convention on Human Rights as they allowed detention \"in a way that discriminates on the ground of nationality or immigration status\" but not British citizens.", "The ruling has been criticized by the Liberal Democrats and advocacy groups for their ability to be released due to the ill-advised legislation."], "tinydolphin:1.1b": [" The House of Lords ruled by a majority of eight to one against the government's anti-terrorism policy.", "This decision has significant implications for the government and its approach to countering terrorism.", "Foreign national suspects, including those from countries affected by the 11 September attacks, can now be detained or deported on grounds that they pose a risk to national security but cannot be deported if this would mean persecution in their homeland.", "This has led to concerns about the rights of these individuals and potential constitutional implications.", "The government faces pressure to review and revise its approach to terrorism prevention, as the stakes of dealing with these cases are high and the public wants action taken to protect themselves from terrorist threats."], "phi:2.7b": [" The UK's highest court has ruled that detaining foreign terrorist suspects without trial breaks human rights laws.", "The foreign secretary believes the right to life is the \"most important liberty\" and the government must protect people from terrorism.", "However, the law lords are \"simply wrong\" to suggest the men are being held arbitrarily.", "New Home Secretary Charles Clarke says the nine men will remain in prison while the law is reviewed.", "Liberal Democrat peer Lord Carlile believes some of the detainees could be released due to the ruling's implications for government anti-terrorism policy."], "orca-mini:3b": [" The House of Lords ruled against the government's policy on detaining foreign terrorist suspects without trial, stating that it was incompatible with the European Convention on Human Rights.", "This decision was criticized by Jack Straw, who said the right to life was the \"most important liberty\" and the government had a duty to protect people from terrorism.", "Charles Clarke vowed to review the law and release those held if possible.", "Some detainees may now be released, according to Lord Carlile.", "The case was heard by a panel of nine law lords due to its constitutional importance."], "hermes3:3b": ["Jack Straw criticizes House of Lords ruling on detaining foreign terrorist suspects without trial, stating they are 'simply wrong'.", "New Home Secretary Charles Clarke vows men will remain in prison while law is reviewed, intending to renew legislation for Parliament renewal in the New Year."], "stablelm-zephyr:3b": ["Jack Straw criticized the decision by Britain's highest court that detained foreign terrorist suspects without trial violated human rights laws.", "Foreign secretary Straw argued that the right to life was the most important liberty and the government had a duty to protect people from terrorism.", "The Law Lords ruled in favor of appeals by the detainees, dealing a significant blow to the government's anti-terror policy.", "However, Straw denied it amounted to a constitutional crisis as the detainees had a right of appeal to the special immigration appeal tribunal.", "New Home Secretary Charles Clarke vowed that the nine men would remain in prison while the law was being reviewed.", "The case involved a panel of nine law lords due to its constitutional importance."], "stablelm2:1.6b": ["Lords ruled that detaining foreign terrorist suspects without trial violates human rights laws and goes against principle of arbitrary detainment.", "Jack Straw, as UK's foreign secretary, criticized this decision as a \"constitutional crisis.\"", "New Home Secretary Charles Clarke vowed to maintain the nine men's detention while reviewing the law.", "The House of Lords majority supported appeals by detained men despite challenges; however, possible release of some detainees may result from changes needed in the anti-terror law.", "This ruling was concerning the US September attacks and the government opted out of part of the European Convention on Human Rights involving fair trials for foreign suspects.", "Critics argue that this decision disregards the rule of law principles."], "granite3.1-dense:2b": ["Jack Straw, Britain's foreign secretary, criticized a House of Lords ruling that detaining foreign terrorist suspects without trial violates human rights laws.", "The eight-to-one majority decision, which upheld appeals by nine men held indefinitely since 2001, was deemed \"simply wrong\" by Straw, who emphasized the government's duty to protect against terrorism and the importance of the right to life.", "New Home Secretary Charles Clarke pledged to renew anti-terror legislation in Parliament upon reviewing the judgment, acknowledging potential releases for some detainees due to the ruling being an \"embarrassment\" for the government.", "The ruling, delivered on Clarke's first day, found that detaining suspects based on nationality rather than trial violated European Convention on Human Rights.", "Solicitor Gareth Pierce claimed two detainees had been driven to madness by indefinite imprisonment, with one hospitalized at Broadmoor."], "chatgpt-4o-latest": ["Jack Straw criticized the House of Lords' ruling that detaining foreign terrorist suspects without trial violates human rights, arguing that protecting lives is the government's priority.", "He rejected claims that the detentions were arbitrary and insisted Parliament, not judges, should decide security measures.", "Despite the ruling, Home Secretary Charles Clarke stated the detainees would remain imprisoned while the law was reviewed.", "The Lords ruled by an eight-to-one majority that the detentions were discriminatory and violated the European Convention on Human Rights.", "The government had opted out of parts of the convention to implement anti-terror laws after 9/11.", "Some detainees' lawyer claimed the imprisonment had caused severe mental distress.", "Clarke pledged to review the law and consider modifications, while detainees hoped for their release."]}