{"raw_text": "Strike threat over pension plans\n \n Millions of public service workers could strike if ministers scrap their final salary pension scheme and make them work longer, warn union leaders.\n \n The Cabinet Office has confirmed it is reviewing the current pension system, prompting unions representing 4.5m workers to threaten united action. They believe the plans include raising the mandatory retirement age for public service workers from 60 to 65. The government says unions will be consulted before any changes are made.\n \n It is thought the proposed overhaul, due on Thursday, could mean pensions could be based on a \"career average\" salary. For each year served, staff currently get one eightieth of their highest salary in the final three years. Ministers will be anxious to avoid mass strike action in the lead-up to the next general election, which is widely expected next May. In a statement on Sunday, the Cabinet Office said it was reviewing the Civil Service Pension Scheme, and hoped to announce proposals soon. \"Unions will of course be consulted about any proposed changes. \"Public sector pension schemes need to remain affordable and sustainable. People are living longer and pensions are getting more expensive. \"To maintain the long-term affordability of our pension scheme, the government announced in its Green Paper on pensions that pension age would rise from 60 to 65.\" On Monday, Tony Blair's official spokesman declined to say whether the prime minister backed the plans. He said: \"What's important is that there's a process going on, it's out for consultation at the moment, let's wait for that process to complete itself.\"\n \n There is already widespread anger over the chancellor's plans to get rid of more than 100,000 civil servants. Now public service unions are united against the plans and the Trades Union Congress is discussing the issue next Monday. Dave Prentis, general secretary of Unison, said changes to pension provisions for workers in the public sector would mean they had to pay in more but would still face a raw deal. \"Members working in the NHS or for local government have never had high pay or city bonuses, but they could look forward to a decent pension - now all that is being taken away,\" he said. \"What really riles me is the breathtaking hypocrisy of MPs who recently voted themselves the best pension scheme in Europe, but say they can't afford it for anyone else. \"This is a position that Unison cannot accept and will oppose. It will lead to conflict between Unison and the government, if not this year then next.\"\n \n Mr Prentis said workers did not want to go on strike and called for talks between unions and the highest level of government. Mark Serwotka, from the Public and Commercial Services union said there should be a co-ordinated one day strike unless there was a government rethink. The Fire Brigades Union said the government was planning to cut ill health retirement benefits for firefighters and other measures to chip away at pensions. Pensions officer Paul Woolstenholmes said: \"The pensions of millions of public sector workers are under threat - apart from MPs and judges who have the most generous pensions arrangements in the country.\"\n", "llama3.2:1b": ["Millions of public service workers could strike if ministers scrap their pension scheme, with union leaders threatening united action over potential changes to retirement ages.", "The Cabinet Office is reviewing the current system, and unions believe the plans include raising the mandatory retirement age from 60 to 65.", "This could mean pensions based on a \"career average\" salary for each year served."], "llama3.2:3b": ["Millions of public service workers could strike over proposed changes to their pension plans, which may include raising the mandatory retirement age and introducing a career average salary system.", "The government says it will consult with unions before making any changes.", "Public service union leaders warn that the plans would leave workers with a \"raw deal\" and are discussing possible coordinated action."], "gemma2:2b": ["Public service workers' unions are threatening a strike if the government changes their final salary pension scheme, potentially raising the retirement age to 65 and switching to a \"career average\" calculation.", "Unions argue that these changes would increase worker contributions while leaving them with a worse deal than before.", "The government has said it will consult unions but plans for the overhauls are expected soon.", "Unions including Unison and PCS are concerned about the implications of this change and demand negotiation with the government."], "qwen2.5:0.5b": ["Key points:\n- Public service workers could strike over a pension scheme\n- Cabinet Office is reviewing plans to make public servants work longer \n- Government plans include raising retirement age for public service workers \n- Unions are threatening strikes if ministers remove pension protections \n- Public sector pensions need to be affordable and sustainable, but also should remain accessible and sustainable for all public servants \n- Mr. Blair's official spokesman did not confirm backing the changes \n- Changes to pension provisions for public sector workers would mean they have to pay more in but still face a \"raw deal\"\n- Members of the NHS or local government who previously had high pay are now facing lower benefits\n- Unison opposes change as it leads to conflict between unions and government \n- Public service unions plan one day strike unless there is a government rethink, including proposals for cuts to ill health retirement benefits for firefighters \n- The cabinet office has not confirmed backing the changes, but public sector pension schemes need to remain affordable and sustainable\n- MPs who recently voted for best pension scheme in Europe say they can't afford it, leading to conflict between Unison and government"], "qwen2.5:1.5b": ["Public service unions threaten strike action over pension reform plans, including raising retirement age to 65 and shifting benefits to a career average.", "The government hopes to avoid strikes leading up to May's election by consulting unions before making changes.", "Current pension schemes need to remain affordable and sustainable due to increasing longevity and rising costs."], "qwen2.5:3b": ["Millions of public service workers could strike if ministers scrap final salary pension schemes and increase mandatory retirement age to 65.", "Cabinet Office is reviewing the current system, with unions threatening united action.", "Proposed overhaul could see pensions based on career average salary, raising concerns over affordability and sustainability.", "Public sector unions are already angry about plans to reduce civil servant numbers; now they are united against changes to pension provisions.", "Unison claims workers would pay more but still receive a raw deal, criticizing MPs who recently approved generous pensions for themselves.", "Public and Commercial Services union calls for coordinated one-day strike unless government rethinks plans.", "Fire Brigades Union warns of cuts in ill health retirement benefits and other measures affecting public sector pensions."], "opencoder:1.5b": ["\"Strike threat over pension plans; Millions of public service workers could strike.", "The Cabinet Office is reviewing the current pension system, which prompts unions to threaten united action.", "They believe the proposed overhaul could mean that pensions could be based on a 'career average' salary.", "For each year served, staff currently get one eightieth of their highest salary in the final three years.", "Ministers are anxious to avoid mass strike action in the lead-up to the next general election.", "In a statement, unions will of course be consulted about any proposed changes.", "Public sector pension schemes need to remain affordable and sustainable.", "People are living longer and pensions get more expensive.", "To maintain the long-term affordability of our pension scheme, the government announced in its Green Paper on pensions that pension age would rise from 60 to 65.\"", "The union will of course be consulted about any proposed changes.", "Public sector pension schemes need to remain affordable and sustainable.", "People are living longer and pensions get more expensive.", "To maintain the long-term affordability of our pension scheme, the government announced in its Green Paper on pensions that pension age would rise from 60 to 65.\""], "smollm:1.7b": ["The summary is concise and objective, preserving key ideas and details while omitting unnecessary information.", "The main points include:\n\n1.", "Striking a final salary pension scheme for public service workers could be a consequence of the proposed overhaul of the pension system.", "2.", "Unions representing millions of public service workers are threatening to strike if ministers scrap their final salary pension scheme and make them work longer.", "3.", "The Cabinet Office is reviewing the current pension system, with unions expected to be consulted about any proposed changes.", "4.", "The government has announced plans to review the Civil Service Pension Scheme, which would mean pensions could be based on a \"career average\" salary.", "5.", "Public sector pension schemes need to remain affordable and sustainable in order to maintain their long-term viability.", "6.", "There is already widespread anger over the chancellor's plans to get rid of more than 100,000 civil servants.", "Now public service unions are united against the plans and the Trades Union Congress will discuss them next Monday.", "7.", "Dave Prentis, general secretary of Unison, said changes to pension provisions for workers in the public sector would mean they had to pay in more but would still face a raw deal.", "8.", "What really riles me is the breathtaking hypocrisy of MPs who recently voted themselves the best pension scheme in Europe, but say they can't afford it for anyone else.", "9.", "Unison will oppose any strike and calls for talks between unions and the highest level of government.", "10.", "The Fire Brigades Union said the government was planning to cut ill health retirement benefits for firefighters and other measures to chip away at pensions."], "deepseek-r1:1.5b": ["If the government scrapes off its final salary pension scheme for public service workers, they might get more years on the job, risking a strike.", "Union leaders are worried about this and have urged their workers, including those in Unison and the Trades Union Congress, to join a united action.", "They believe plans include replacing the mandatory retirement age from 60 to 65 and adjusting pension calculations based on career averages.", "The government aims to announce more detailed proposals soon.", "Concerns are rising about pensions for public sector employees being unnecessarily expensive, with potential for increased financial strain.", "The government has announced plans to raise the retirement age but is cautious, as employees in public service worry about unrealistic benefits."], "tinyllama:1.1b": ["In a statement on Sunday, the Cabinet Office confirmed that the government is reviewing their current civil service pension scheme, which includes raising the mandatory retirment age for public service workers from 60 to 65.", "The review comes as millions of public service workers are threatening united action over the proposed changes, which include raising the career average salary based on service years served and cutting ill health retirement benefits for firefighters and other measures.", "Union leaders have warned that the planned changes could mean workers face a raw deal while members in the NHS or local government already have high pay or city bonuses, but are looking to oppose the plans with trade unions and government officials."], "tinydolphin:1.1b": [" The proposed changes could lead to higher pension costs for public service workers, leading to mass strikes.", "As Cabinet Office reviews the current pension scheme, public sector unions are voicing their concerns about rising pension costs and are threatening united action.", "This has prompted unions representing 4.5 million workers to demand a meeting with the government before any changes are made.", "The proposed overhaul could mean a system that awards higher salary based on years of service, similar to that in Canada.", "The government hopes for the mass removal of public sector workers from their pension schemes and will consult with unions before making any significant changes."], "phi:2.7b": [" There is a potential strike among 4.5 million British public service workers due to proposed changes to their pension scheme, including raising the mandatory retirement age and possibly switching to a \"career average\" salary system.", "The government will be consulting with unions before making any changes, but public service union leaders are threatening action.", "Meanwhile, there is widespread anger over the planned cuts in civil servants' jobs."], "orca-mini:3b": [" Ministers reviewing a pension scheme for public service workers could face strikes if they scrap their final salary scheme and increase the mandatory retirement age to 65.", "The Cabinet Office confirmed it is reviewing the Civil Service Pension Scheme, with unions warning of united action if changes are made.", "The Trades Union Congress will discuss the issue next Monday.", "Changes to pension provisions for workers in the public sector could mean they have to pay more but still face a raw deal."], "hermes3:3b": ["Public service strikes threatened over changes to final salary pension schemes and potential increase in retirement age."], "stablelm-zephyr:3b": ["Union leaders warn that millions of public service workers could strike if the UK government scraps their final salary pension scheme and makes them work longer.", "The Cabinet Office has confirmed it is reviewing the current pension system, which may result in a \"career average\" salary basis and an increased mandatory retirement age from 60 to 65.", "Unions representing 4.5 million workers believe the proposed overhaul could lead to pension changes based on a career average salary.", "The government hopes to announce proposals soon after consulting with unions about the issue."], "stablelm2:1.6b": ["Union leaders warn that millions of public service workers could strike if ministers scrap their final salary pension scheme.", "The Cabinet Office is reviewing the current system, which includes raising the mandatory retirement age for public service workers to 80 years from 65.", "Unions representing 4.5 million workers will be consulted before any changes are made; however, they believe the plans could mean pensions based on a \"career average\" salary and an increase in the retirement age.", "The government aims to maintain affordability and sustainability of public sector pension schemes by raising the pension age from 65 to 80.", "Public service unions, including Unison, Fire Brigades Union, and Public and Commercial Services union, are discussing the issue and demanding a government rethink unless there is one."], "granite3.1-dense:2b": ["Public service unions, representing 4.5 million workers, have warned of potential strikes if the government proceeds with plans to scrap the final salary pension scheme and increase mandatory retirement age from 60 to 65.", "The Cabinet Office is reviewing the current pension system, which may lead to pensions based on a \"career average\" salary.", "Unions are frustrated that these changes would reduce benefits for NHS workers and local government employees, who previously enjoyed decent pensions despite not receiving high salaries or city bonuses.", "They argue the government's proposed cuts are hypocritical, given MPs have some of the most generous pension arrangements in Europe.", "Unions call for dialogue with the government to avoid strikes and express concern about the government's plans to cut ill-health retirement benefits for firefighters and other pensioners.", "The Trades Union Congress is scheduled to discuss this issue on Monday, while Dave Prentis, general secretary of Unison, emphasized that workers do not desire strikes but will resort to them if the government does not reconsider its plans."], "chatgpt-4o-latest": ["Millions of public service workers may strike if the government scraps their final salary pension scheme and raises the retirement age from 60 to 65.", "The Cabinet Office confirmed a review of the pension system, prompting unions representing 4.5 million workers to threaten action.", "Proposed changes may base pensions on a \"career average\" salary instead of the highest salary in the final years.", "The government insists unions will be consulted, citing the need for affordability as people live longer.", "Union leaders argue the changes would force workers to contribute more while receiving less, criticizing MPs for securing generous pensions for themselves.", "The Trades Union Congress is set to discuss the issue, with union leaders warning of coordinated strikes unless the government rethinks its plans."]}