{"raw_text": "Tory leader 'cleared' over work\n \n Scottish Conservative Party leader David McLetchie claims he has been cleared over a potential conflict of interest.\n \n The Edinburgh MSP earns up to £30,000 a year from the law firm Tods Murray, where he is a partner. Mr McLetchie said he has taken advice from Holyrood officials about what details he needs to declare. He was advised to exercise judgement to avoid the perception of a conflict and said he had done nothing wrong. As an MSP, Mr McLetchie signed a parliamentary motion questioning expansion plans for Edinburgh Airport.\n \n It then emerged Tods Murray has a client which opposes the development. Mr McLetchie then sought guidance from the standards committee to clarify his position. BBC Scotland's political correspondent Glenn Campbell said no complaint had been made against Mr McLetchie, but questions were raised about his dual role. Glenn said MSPs are advised to guard against a conflict of interests and a perception of a conflict.\n \n Mr McLetchie said: \"I'm quite clear that no conflicts of interest arise in my case, that the judgement I took has effectively been vindicated when you look at the advice that has been given to me and that these allegations are unfounded.\" He said nothing had changed in respect of his work with the law firm and it was a matter he would have to discuss with the other partners at Tods Murray. \"The firm and I have a very good working relationship and we have done for the last six years,\" said Mr McLetchie. \"I don't suppose I'll be working forever as a lawyer or a politician. I deserve to retire from both, but I'm not willing to put time limits on them.\"\n", "llama3.2:1b": ["Tory leader David McLetchie has been cleared of potential conflict of interest concerns over his work with law firm Tods Murray, where he earns £30,000 a year.", "He took advice from Holyrood officials and sought guidance from the standards committee after signing a parliamentary motion questioning Edinburgh Airport expansion plans.", "The Scottish Conservative Party leader did not report any complaints against him, but questions remained about his dual role as an MSP and lawyer at Tods Murray."], "llama3.2:3b": ["David McLetchie, Scottish Conservative Party leader and MSP, claims cleared of conflict of interest due to his work with law firm Tods Murray, which opposes Edinburgh Airport expansion plans in which he signed a parliamentary motion."], "gemma2:2b": ["Scottish Conservative leader David McLetchie claims he was cleared of potential conflicts of interest over his work with law firm Tods Murray.", "He signed a parliamentary motion opposing Edinburgh Airport expansion while also working as a partner at the firm, which has a client opposing the development.", "Mr. McLetchie says he followed advice and took no action wrong.", "While no formal complaint was made, questions were raised about dual roles."], "qwen2.5:0.5b": ["David McLetchie is clear that no conflicts of interest arise in his case.", "He told BBC Scotland MSP Glenn Campbell that nothing has changed about the work he has been involved with and that it was a matter he would have to discuss with other partners at Tods Murray.", "He expressed regret over any potential negative impact of his dual role as a lawyer and politician, and said he will not be working forever as a lawyer or politician."], "qwen2.5:1.5b": ["Scottish Conservative Party leader David McLetchie claims he has been cleared of potential conflict of interest regarding his dual role as MSP and partner at law firm Tods Murray that opposes Edinburgh Airport expansion."], "qwen2.5:3b": ["Scottish Conservative Party leader David McLetchie claims he has been cleared of potential conflict of interest over his work at law firm Tods Murray and his involvement in a parliamentary motion questioning Edinburgh Airport expansion plans.", "Despite the opposition client at Tods Murray, McLetchie received advice from Holyrood officials to avoid perception issues.", "BBC Scotland's political correspondent Glenn Campbell stated no complaints had been made against McLetchie but questions remain about his dual role.", "McLetchie insists there are no conflicts and asserts he will discuss working arrangements with other partners at Tods Murray, maintaining a positive relationship for six years."], "opencoder:1.5b": ["Tory leader cleared over work.", "Conservative Party leader David McLetchie has been cleared over a potential conflict of interest.", "The Edinburgh MSP earns up to £30,000 a year from the law firm Tods Murray, where he is a partner.", "Mr McLetchie advised on Holyrood officials about what details he needed to declare and he was given advice to avoid perceived conflict.", "He expressed his belief in avoiding any perception of a conflict and said he had done nothing wrong.", "As an MSP, he agreed to sign a parliamentary motion for questioning of Edinburgh Airport development plans.", "Following this, Mr Tods Murray has a client which opposes the development, Mr McLetchie questioned about their position.", "BBC Scotland's political correspondent Glenn Campbell assured them there was no complain against Mr McLetchie but raised concerns about his role as a MSP and about guarding against a conflict of interests.", "Mr McLetchie expressed clear his view without making any changes in respect of Mr Tods Murray’s work with the law firm, and it would have to be discussed with their other partners.", "He said: \"The firm and I have a very good working relationship and we have done for the last six years,\" he added.", "He also stressed that he won't put time limits on them from now on.", "I do not suppose I'll be working forever as a lawyer or a politician, but I'm not willing to put any limits on them.", "This is his decision after all.\""], "smollm:1.7b": ["The summary is concise and preserves key ideas and details:\n\n1.", "The text describes Tory leader David McLetchie claiming he has been cleared over a potential conflict of interest related to his work with the law firm Tods Murray, where he is a partner.", "2.", "The text explains that Scottish Conservative Party leader David McLetchie earns up to £30,000 a year from the law firm Tods Murray, where he is a partner.", "3.", "The text states that Mr McLetchie claims he has taken advice from Holyrood officials about what details he needs to declare in order to avoid a conflict of interest and that he did nothing wrong.", "4.", "The text explains that as an MSP, Mr McLetchie signed a parliamentary motion questioning expansion plans for Edinburgh Airport.", "5.", "The text then reveals that Tods Murray has a client which opposes the development.", "Mr McLetchie then sought guidance from the standards committee to clarify his position.", "6.", "The text mentions no complaint had been made against Mr McLetchie, but questions were raised about his dual role as an MSP and a lawyer.", "Glenn Campbell said no complaint had been made against Mr McLetchie, but questions were raised about his work with Tods Murray.", "7.", "The text concludes by stating that Mr McLetchie is quite clear that no conflicts of interest arise in his case and that the advice he took has effectively been vindicated when you look at the advice given to him and that these allegations are unfounded.", "He said nothing had changed in respect of his work with the law firm and it was a matter he will discuss with the other partners at Tods Murray."], "deepseek-r1:1.5b": ["David McLetchie has defended himself in the context of a potential conflict of interest related to Tods Murray's potential airport expansion plan.", "As a Conservative Party leader, he claims he has been cleared and made decisions based on his judgment without hiding any details.", "He was advised by Holyrood officials to avoid perceptions of conflict or mistake, yet stated that no such issues arose.", "McLetchie is the Scottish MSP group, earning money from Tods Murray, whose client opposes the airport expansion.", "After a complaint emerged, he sought advice from the standards committee but faced questions about his role.", "He clarified his position and emphasized the strong working relationship between him and Tods Murray, who have been partners for six years.", "McLetchie expressed frustration with how both his work and the firm's roles are seen as non-committal or time-bound, suggesting retirement could be unfair to him."], "tinyllama:1.1b": ["Scottish Conservative Party leader David McLetchié has been cleared of any potential conflict of interest over work with law firm Tods Murray as he explained that he takes advice from Holyrood officials and did nothing wrong.", "Mr McLetchié stated that he signed a parliamentary motion questioning expansion plans for Edinburgh Airport, but the judgement was later clarified.", "There were no complaints made against him or any perceived conflict of interests, and legal advice had already been received to avoid an impression of a conflict.", "Despite no apparent concerns over Mr McLetchié's work with Tods Murray, questions remain around his dual role as an MSP and lawyer, but he has no intention of leaving either field."], "tinydolphin:1.1b": [" David McLetchie has recently been cleared of any conflict of interest over his work with the law firm Tods Murray.", "The Edinburgh MSP earned up to £30,000 a year from the law firm and took advice from Holyrood officials before signing a parliamentary motion questioning expansion plans for Edinburgh Airport.", "However, it has been revealed that Tods Murray has a client who opposes these plans, raising questions about McLetchie's dual role as an MSP and a political figure.", "Despite no complaint being made against him, questions have been raised about his dual role with the law firm.", "The advice was given by the standards committee to clarify McLetchie's position and he has now sought guidance from them to avoid drawing attention to any potential conflicts of interest.", "McLetchie maintains he took no action in conflict of interests and will continue working with the law firm, as it is a matter he would have to discuss with the other partners at Tods Murray."], "phi:2.7b": [" A Scottish Conservative Party leader has been cleared of any potential conflict of interest after seeking guidance over a law firm's client opposing Edinburgh Airport expansion plans, where he is also a partner.", "The party's leader said that the allegations were unfounded and no complaints have been made against him.", "The issue was discussed with the other partners at the firm, who had a \"very good working relationship\" with the leader for the past six years."], "orca-mini:3b": [" Scottish Tory Party leader David McLetchie has been cleared of any conflict of interest after taking advice from Holyrood officials and signing a parliamentary motion questioning Edinburgh Airport expansion plans.", "However, questions were raised about his dual role as an MSP and a partner at the Tods Murray law firm after it emerged that the client opposing the airport expansion had worked with the firm.", "No complaints were made against McLetchie, but he was advised to guard against conflicts of interests and to seek clarification from the standards committee.", "He claimed that no conflicts arose in his case and that his work with the law firm was a matter he would have to discuss with the other partners."], "hermes3:3b": ["David McLetchie cleared of conflict of interest; Scottish Conservative leader declared not wrong over potential relationship with law firm despite being an MSP and earning money from it."], "stablelm-zephyr:3b": ["Scottish Conservative Party leader David McLetchie claimed he was cleared of a potential conflict of interest regarding his role as a partner in the law firm Tods Murray, which also has a client opposing the expansion plans for Edinburgh Airport.", "After receiving advice from Holyrood officials and the standards committee, McLetchie said no conflicts of interest arose and that allegations were unfounded.", "He added that his working relationship with Tods Murray remained strong and he did not intend to limit his future in either law or politics."], "stablelm2:1.6b": ["Scottish Conservative Party leader David McLetchie claims he has been cleared of a potential conflict of interest due to advice from Holyrood officials and no complaint was filed against him in relation to his work with law firm Tods Murray.", "Despite questions arising about his dual role as an MSP and lawyer, there are no indications that any change occurred in respect of McLetchie's work at the firm, which he has worked for six years."], "granite3.1-dense:2b": ["Scottish Conservative Party leader David McLetchie has been deemed cleared of potential conflict of interest regarding his work with the Edinburgh law firm Tods Murray.", "Earning up to £30,000 annually as a partner, McLetchie sought guidance from Holyrood officials and later from the standards committee after learning that one of Tods Murray's clients opposes Edinburgh Airport expansion plans.", "Despite these revelations, no formal complaint was made against him.", "McLetchie maintains that his actions were guided by judgment to avoid perceptions of conflict and asserts that his dual role has not resulted in any actual conflicts of interest.", "He emphasizes a strong working relationship with Tods Murray and intends to continue this partnership, possibly as both a lawyer and an MSP without setting time limits on either profession."], "chatgpt-4o-latest": ["Scottish Conservative leader David McLetchie claims he has been cleared of any conflict of interest regarding his dual role as an MSP and a partner at law firm Tods Murray.", "He sought advice from Holyrood officials and the standards committee after it was revealed that Tods Murray had a client opposing Edinburgh Airport expansion, which he had questioned in a parliamentary motion.", "No formal complaint was made, but concerns were raised about potential conflicts.", "McLetchie insists he acted appropriately, maintains a good relationship with his firm, and sees no issue with his continued dual role."]}