{"raw_text": "Student 'fee factor' played down\n \n A rise has been recorded in the number of students from south of the border applying to universities in Scotland.\n \n However, Lifelong Learning Minister Jim Wallace said that this would not result in Scottish students missing out. Applications from England and Wales rose by 17% between January 2005 and the previous year, up 23,600 to 27,700. Fears had been expressed that a flood of \"fee refugees\" would try to avoid top-up fees of up to £3,000 a year being introduced in England. In June last year, Mr Wallace announced proposals to increase tuition fees for English students studying in Scotland by £2,000 in an attempt to prevent a cross-border flood, although no figure has yet been agreed. Legislation to introduce the top-up fees in England is not due to take effect until autumn 2006 and students who start before then will not have to pay additional fees at all.\n \n The figures were made public on Thursday by admissions service Ucas. Universities Scotland, which represents university principals, claimed that an increase in applications did not amount to Scottish students being squeezed out. Director, David Caldwell, said some students could be applying in an attempt to avoid the possible increase in annual fees at English universities, but this was not a major factor. He told BBC Radio Scotland's Good Morning Scotland programme: \"The reason people are opting for Scottish universities is that they are perceived as being of very high quality, they offer very attractive courses and Scotland is seen as a very attractive place to study.\n \n \"They know that when they take up their studies in 2006 they will be hit by top-up fees if they are going to a university in England and that may be part of the reason why the numbers coming to Scotland are so inflated. \"However, it does not mean that we will see thousands of additional students from England studying here.\" Mr Wallace agreed and said the figures had to be looked at in context. He explained that when applications were translated into acceptances, the number was not huge - an additional figure of about 200.\n \n Also, the picture was further blurred by the fact that applications from Wales, where there are no plans for top-up fees, have also risen, by 19%. Mr Wallace said: \"Accepting students from all parts of the world does show the high regard in which Scottish higher education is held, not just in Britain. \"We want to make sure that when students are making their choice, they do so on the nature of the course and not because they are under some sort of financial pressure to go to Scotland. \"We do not want to have a situation where it becomes impossible for Scottish students to get places at Scottish universities because we are seen as the cheap option. \"Very often the quality of the university experience is enhanced by the fact there are students coming from a wide range of backgrounds so it would be wrong to go the other way and start excluding students.\"\n", "llama3.2:1b": ["Student applications to Scottish universities rose 17% between 2005 and 2006, with 27,700 more students applying in England.", "Despite concerns about \"fee refugees\" trying to avoid top-up fees, Lifelong Learning Minister Jim Wallace stated that this would not mean Scottish students are being squeezed out.", "The increase is attributed to some applicants attempting to avoid English universities due to higher annual fees."], "llama3.2:3b": ["The number of students from south of the border applying to universities in Scotland has risen, but Lifelong Learning Minister Jim Wallace says this does not mean Scottish students will miss out.", "Applications from England and Wales rose by 17% last year, while those from South of England rose by a smaller percentage.", "The rise is partly due to concerns that top-up fees in England may deter students, but Wallace assures that the number of additional students coming to Scotland is small, around 200."], "gemma2:2b": ["Applications from England and Wales increased for Scottish universities, but this increase doesn't mean that Scotland will lose out on its student population.", "The rise in applications is likely due to students avoiding top-up fees in England.", "While some students might be influenced by potential tuition fee increases, the majority are drawn to high quality courses offered by Scottish institutions and believe in a more diverse student body."], "qwen2.5:0.5b": ["Key points:\n\n- The number of students applying to universities in Scotland has increased.", "- This can be attributed to rising fees for English students and Brexit concerns.", "- Applications have also increased from Wales, but not significantly compared to England.", "The text notes that despite these increases in applications, Scottish students are receiving better values from universities across the UK."], "qwen2.5:1.5b": ["The number of students applying to Scottish universities has increased compared to England and Wales, but this doesn't mean that Scottish students will necessarily miss out on opportunities due to high tuition fees.", "Wallace suggests the rise is partly due to perceived quality of Scottish education and low financial pressure from potential fee increases in England.", "The actual increase in student numbers translating into acceptances was only about 200, and applications also rose by 19% from Wales where no top-up fees are planned.", "Wallace emphasizes that while quality matters, it's not the primary reason students choose Scottish universities; they want good courses irrespective of location."], "qwen2.5:3b": ["A rise in applications from England and Wales to Scottish universities has been reported, with 17% increase between January 2005 and last year.", "However, Lifelong Learning Minister Jim Wallace stated that this does not mean Scottish students will miss out on places.", "Universities Scotland director David Caldwell added that while some English students might apply due to potential fee increases in England, it is not a major factor.", "Both the rise in applications from Wales (19%) and those from England/Wales have been mentioned.", "Jim Wallace reassured that these numbers do not amount to Scottish students being squeezed out, as he acknowledged about 200 additional acceptances.", "The minister also highlighted that accepting students from all parts of the world demonstrates high regard for Scottish higher education, but they want to ensure students make choices based on course nature rather than financial pressure.", "He stressed maintaining diversity in student backgrounds is beneficial for university experiences."], "opencoder:1.5b": ["\"Students who are applying for fee-refugees could avoid top-up fees introduced in England, although no figure has yet been agreed.", "The figures were made public on Thursday by admissions service Ucas.", "Universities Scotland have claimed that an increase in applications did not amount to Scottish students being squeezed out because they perceive the university as of high quality and attractive courses and Scotland is seen as a very attractive place to study.\"", "-Informed from various sources regarding the rise in fee-refugees, it's clear that this statement is reflecting on the current situation of top-up fees and Universities Scotland."], "smollm:1.7b": ["The summary above captures the main ideas, key points, and details of the text in concise and clear language.", "The text describes a rise in applications from south of the border students applying to universities in Scotland, but also mentions that this would not result in Scottish students missing out on top-up fees.", "It then notes that Lifelong Learning Minister Jim Wallace has said that this would not lead to Scottish students being denied places at English universities because they are already popular and well-regarded.", "The text concludes by emphasizing the importance of maintaining high standards in higher education, regardless of where students come from."], "deepseek-r1:1.5b": ["A rise in applications from Scotland's south has been recorded, particularly concerning top-up fees introduced by England's Lifelong Learning Minister, Jim Wallace.", "Applications from England and Wales increased by 17% between January 2005 and the previous year, reaching 23,600 out of 27,700. fears about potential pressure on quality education were raised, though figures for this are set to be finalized in autumn 2006.", "The top-up fees will take effect later, affecting only students starting before then.", "Figures from Ucas and Scotland's universities highlight that acceptance rates do not significantly drop due to these changes.", "However, concerns remain about the impact on quality education when moving to England.", "Wales also saw a 19% increase in applicants, further blurring the line between the two countries."], "tinyllama:1.1b": ["The rise in applications from south of the border applying to universities in Scotland has been mentioned, but some experts have expressed concern that a potential \"fee refugee\" wave could result in Scottish students missing out on the introduction of top-up fees for English students studying in England.", "However, LifeLong Learning Minister Jim Wallace and Scottish Universities' Secretary David Caldwell both stressed that Scottish universities remain perceived as high quality and attractive to international students, with a potential influx of foreign students expected to benefit from the introduction of top-up fees in England.", "Nonetheless, Mr Wallace acknowledged that some applications had been affected by the possible increase in annual fee increases at English universities, but added that the figures were not a major factor."], "tinydolphin:1.1b": [" Based on the given text, the summary can be written as: \n\n\"Due to increasing application numbers from south of the border, higher education in Scotland is under pressure to increase top-up fees.", "Some students may opt out to avoid these higher costs, while others seek additional Scottish university admissions.", "Ucas data shows a 20% rise in applications between January 2005 and February 2006; however, this has not resulted in a flood of \"fee refugees.\"", "In June, Mr. Wallace announced plans to increase tuition fees for English students studying in Scotland by £2,000 per year, although no figures have been agreed.", "He also claimed that an increase in applications did not significantly affect the number of Scottish students applying to universities.", "Some students may be choosing not to take up their places due to the potential introduction of top-up fees at English universities.\""], "phi:2.7b": [" The number of students applying to Scottish universities has increased, but fears have been expressed that this could result in Scottish students missing out due to potential top-up fees.", "However, Lifelong Learning Minister Jim Wallace stated that this was not the case as applications from England and Wales had risen by 17% and 23%, respectively.", "Legislation for these fees is not yet implemented in Scotland, so it will not affect current students who have already started their studies before autumn 2006.", "Universities Scotland claims that while some English students may be applying to Scottish universities to avoid top-up fees, this is not a significant factor.", "David Caldwell, director of Universities Scotland, believes that the reason for the increase in applications is due to high-quality courses and Scotland's attractiveness as a study destination.", "Mr Wallace agrees, but notes that context must be taken into consideration when looking at the figures.", "He also clarifies that the rise in Welsh applicants has caused some confusion.", "Ultimately, he emphasizes the importance of ensuring that Scottish universities remain accessible to all students, regardless of their country of origin or financial situation."], "orca-mini:3b": [" The number of students applying for undergraduate courses in Scotland has increased by 17%, but Scottish students will not be affected by top-up fees in England.", "Lifelong Learning Minister Jim Wallace said that while there may be a flow of \"fee refugees\" trying to avoid top-up fees, it was not a major factor affecting applications to Scottish universities."], "hermes3:3b": ["Student border fee applications increased in Scotland, but not implying Scottish students miss out on places, according to UK data."], "stablelm-zephyr:3b": ["A rise in students from England and Wales applying to Scottish universities has raised concerns about the \"fee factor.\"", "However, Lifelong Learning Minister Jim Wallace assured that this would not result in Scottish students missing out.", "He explained that when applications are translated into acceptances, the increase is only around 200.", "Additionally, Wallace said that accepting students from all parts of the world shows the high regard for Scottish higher education and they do not want to have a situation where it becomes impossible for Scottish students to get places at Scottish universities due to being seen as the cheap option."], "stablelm2:1.6b": ["A rise in the number of students from southern Europe applying for universities in Scotland has been noted, but Scottish higher education institutions won Suffer No Disadvantage.", "Lifelong Learning Minister Jim Wallace announced proposals to increase tuition fees for English students studying in Scotland by £2 per cent.", "Despite an expected influx of \"fee refugees,\" applications from England and Wales rose by 5 percent between January and the previous year, up by 18 percent, up to 19 percent.", "Universities Scotland argues that an increase in applications doesn"], "granite3.1-dense:2b": ["A 17% increase in applications from England and Wales, totaling 23,600 more applicants between January 2005 and the previous year, has been recorded.", "This rise was expected to potentially flood Scottish universities with \"fee refugees\" avoiding top-up fees in England.", "However, Lifelong Learning Minister Jim Wallace downplayed these fears, emphasizing that only about 200 additional students from England might accept offers due to contextual factors and the increased competition from Wales (a country without top-up fees).", "Universities Scotland's Director, David Caldwell, agreed, stating that Scottish universities are highly regarded for their quality courses and attractive study environment.", "The ministers assured that Scottish students would still have access to places despite the increased applications from other regions, as they prioritize a diverse student body over financial constraints."], "chatgpt-4o-latest": ["Applications from students in England and Wales to Scottish universities rose by 17% in 2005, prompting concerns about \"fee refugees\" avoiding upcoming top-up fees in England.", "However, Lifelong Learning Minister Jim Wallace and Universities Scotland dismissed fears that Scottish students would be displaced.", "Wallace noted that the actual increase in accepted students was only about 200, and applications from Wales, where no top-up fees are planned, also rose by 19%.", "Universities Scotland attributed the rise to the high quality and attractiveness of Scottish universities rather than financial motives.", "Wallace emphasized that students should choose universities based on courses rather than cost and stressed the importance of maintaining diversity without disadvantaging Scottish students."]}