{"raw_text": "Scots smoking ban details set out\n \n Smoke-free areas will save lives and improve Scotland's health, First Minister Jack McConnell has insisted.\n \n He told the Scottish Parliament on Wednesday that a \"comprehensive ban\" on smoking in public places would be introduced by the spring of 2006. Mr McConnell said the country's health rates were \"lamentable\" not least because of smoking. He said fines of up to £2,500 would be levied on employers and licences would be removed for non-compliance. Earlier, the Scottish Executive considered a range of options but agreed unanimously to introduce an all-out ban on smoking in public places. In a statement to parliament, Mr McConnell said that the licensed trade would be asked to join an expert committee prior to the ban coming into force.\n \n The health arguments far outweighed lingering public disquiet about a complete ban and claims by the licensed trade that jobs would be lost, he told MSPs. He said there would be an international marketing campaign whereby \"tourists can enjoy smoke free environment and the sick man of Europe image becomes a thing of the past\". \"There are still national habits which hold us back - the time has come for this parliament to accelerate improvements in health,\" he declared. \"Health rates are lamentable because of a lack of exercise, drugs abuse, excessive drinking and over-eating. \"They all make us one of the most unhealthy countries in Europe, and too many smoke. \"It is clear that Scotland must not be held back by poor public health - the single biggest contribution devolved government can make is to reduce the toll of preventable death caused by smoking.\" The legislation will be introduced as part of the Health Service (Miscellaneous Provisions) Bill, which will be considered by parliament before Christmas. Main points of the plan:\n \n \n  - A comprehensive ban on smoking in all enclosed public places in Scotland \n  - The legislation will be enforced by environmental health and local licensing officers \n  - Licensees or employers who fail to enforce the law will face fines up to a maximum of £2,500 \n  - Licensees who persistently refuse to comply with the law will face the ultimate sanction of losing their liquor licence \n  - A system of issuing fixed penalty notices for those individuals who break the law will be examined \n  - Individuals who persistently break the law will face a maximum fine of £1,000. \n  \n \n Mr McConnell claimed there was evidence that smoking bans had helped smokers to either give up quicker or smoke less. He said there had been falling cigarette sales of 13% in New York and 16% in Ireland. Mr McConnell added that there had been a near nine per cent rise in tax revenues from New York bars and restaurants and, in Ireland, only a one point three per cent volume sales fall, where they were declining before the ban. The afternoon announcement, following a cabinet meeting on Wednesday morning, won broad support from opposition parties.\n \n The Scottish National Party's Holyrood leader, Nicola Sturgeon, welcomed the move but added that the public should be consulted as the clock ticked towards the ban date. She said: \"The time has come for a ban on smoking in public places. \"There is evidence a ban can cut deaths from passive smoking and makes it easier for the 70% of smokers who desperately want to give up the habit. \"But we must also recognise that some people have concerns and reservations - there are people who are yet to be persuaded.\" The Scottish Conservative Party leader, David McLetchie, questioned what would be exempted from the ban. He was keen to know if inmates in Scottish prisons would continue to be allowed to smoke. Mr McLetchie asked: \"Would it not be ironic and perhaps entirely typical of the first minister's brave new Scotland that the criminals can be smokers but the smokers will become criminals?\" The Scottish Green Party's health spokeswoman, Eleanor Scott, said she was pleased Scotland would be following the \"success stories of New York and Ireland\". She believed the majority of people in Scotland wanted to go out without having to breathe in harmful tobacco smoke.\n", "llama3.2:1b": ["Here is a concise summary of the text:\n\nScots smoking ban details set out by First Minister Jack McConnell include:\n- A comprehensive ban on smoking in all enclosed public places\n- Fines up to £2,500 for licensees and employers who fail to enforce the law\n- Licensees who persistently refuse to comply face losing their liquor licence\n- Individuals who break the law may face a maximum fine of £1,000\n- A fixed penalty notice system will be introduced\nMcConnell argues that a ban on smoking can save lives and improve health, citing evidence from other countries.", "The plan is set to come into force in spring 2006."], "llama3.2:3b": ["First Minister Jack McConnell announced a comprehensive ban on smoking in all enclosed public places in Scotland by spring 2006, with fines up to £2,500 for non-compliance.", "The ban aims to improve health rates and reduce preventable deaths caused by smoking.", "Licensing trade will be asked to join an expert committee prior to the ban's implementation."], "gemma2:2b": ["Scotland will implement a comprehensive smoking ban in public places by spring 2006.", "Fines of up to £2,500 will be levied on employers and non-compliance will result in license removal.", "The Health Service (Miscellaneous Provisions) Bill will be introduced to parliament before Christmas, with enforcement by environmental health officers.", "The ban is supported by opposition parties and evidence suggests it could improve public health."], "qwen2.5:0.5b": ["The government is considering banning smoking in public places across the country by spring 2006.", "The ban would apply to enclosed areas where smokers are permitted, such as airports, beaches, and shopping malls.", "Smokers would be fined up to £2,500 for non-compliance and lose their liquor licenses.", "Individuals who break the law could face a maximum fine of £1,000.", "The Scottish National Party welcomed the move but stressed that public consultation is necessary."], "qwen2.5:1.5b": ["First Minister Jack McConnell announced a comprehensive smoking ban on public places in Scotland, with fines for non-compliance, starting from spring 2006, aiming to improve health and reduce smoking rates.", "The plan includes an international marketing campaign and will be part of the Health Service (Miscellaneous Provisions) Bill."], "qwen2.5:3b": ["Scots smoking ban details set out:\nFirst Minister Jack McConnell insists a comprehensive ban on smoking in all enclosed public places by spring 2006 will save lives and improve health rates.", "He argues against concerns about job losses, emphasizing the negative impact of smoking on health via lack of exercise, drug abuse, over-drinking, and over-eating.", "The plan includes fines up to £2,500 for non-compliance and losing liquor licences for persistent offenders.", "McConnell cites evidence from New York and Ireland showing smoking bans can reduce deaths from passive smoking and make quitting easier.", "Opposition parties broadly support the ban but advocate consulting the public before implementation, with concerns raised about exemptions like prisons."], "opencoder:1.5b": ["Scots smoking ban details set out a comprehensive ban on smoking in public places in Scotland.", "The introduction of this legislation will be followed by a number of other initiatives aimed at improving health and promoting public health.", "The main points of the plan are:\n\n- A comprehensive ban on smoking in all enclosed public places in Scotland \n- The legislation will be enforced by environmental health and licensed officers\n- Licensees or employers who fail to comply with the law will face fines up to a maximum of £2,500 \n- Licensees who persistently refuse to comply with the law will face the ultimate sanction of losing their liquor licence \n- A system of issuing fixed penalty notices for those individuals who break the law will be examined \n- Individuals who persistently break the law will face a maximum fine of £1,000.", "The announcement was supported by a broad support from opposition parties and a celebration of the 2006 Health Service (Miscellaneous Provisions) Bill's effectiveness.", "Mr. Jack McConnell had expressed his support for the move and added that there would be concerns about the public's understanding of the ban.", "The National Party leader, Nicola Sturgeon, held a positive concession but insisted on further consultation.", "David McLetchie questioned the legitimacy of being a smoker in prison which helped raise questions around the right to smoking.", "Eleanor Scott, Green Party health spokeswoman, appreciated the emphasis on success stories and overall health in Scotland."], "smollm:1.7b": ["The summary is:\n\n* Scots smoking ban details set out\n* Smoke-free areas will save lives and improve Scotland's health, First Minister Jack McConnell has insisted.", "* He told the Scottish Parliament on Wednesday that a \"comprehensive ban\" on smoking in public places would be introduced by the spring of 2006.", "* Mr McConnell said the country's health rates were \"lamentable not least because of smoking\".", "* He said there would be an international marketing campaign whereby \"tourists can enjoy smoke-free environment and the sick man of Europe image becomes a thing of the past\".", "* There are still national habits which hold us back - the time has come for this parliament to accelerate improvements in health, the single biggest contribution devolved government can make is to reduce the toll of preventable death caused by smoking.", "* The legislation will be introduced as part of the Health Service (Miscellaneous Provisions) Bill, which will be considered by parliament before Christmas.", "* Main points of the plan:\n\t+ A comprehensive ban on smoking in all enclosed public places in Scotland\n\t+ The legislation will be enforced by environmental health and local licensing officers\n\t+ Licensees or employers who fail to enforce the law will face fines up to a maximum of £2,500\n\t+ Individuals who persistently break the law will face the ultimate sanction of losing their liquor license"], "deepseek-r1:1.5b": ["Scotsman says comprehensive smoking ban on public places starting mid-2006.", "Health arguments outweigh concerns about jobs and smoking trends.", "Public consultation needed near ban date.", "Legal penalties include £2500 fines or loss of liquor licence for non-compliance.", "Ban will go to smoke-free areas, including prisons if possible."], "tinyllama:1.1b": ["The Scottish Parliament has agreed to introduce an all-out smoking ban on public places, including bars and restaurants, by spring 2006.", "The bill will be introduced as part of the Health Service (Miscellaneous Provisions) Bill, which aims to improve health and reduce tobacco consumption in Scotland by introducing a comprehensive ban on smoking in all enclosed public places.", "The legislation will impose fines for non-compliance with the law and licensees or employers who fail to enforce it will face the ultimate sanction of losing their liquor licenses.", "Environmental health officers and local licensing officers will enforce the ban, which aims to reduce tobacco use by up to 25% in Scotland within three years.", "The bill will be examined by an expert committee prior to going before Parliament.", "Some individuals who continue to smoke despite being exempted from the ban were questioned by Conservative leader David McLeish on whether prison inmates would also face punishment for continuing to smoke."], "tinydolphin:1.1b": [" Summarized: The Scottish First Minister announced that a comprehensive smoking ban will come into effect in Scotland by Spring 2006, enforced by environmental health and local licensing officers.", "The ban applies to all enclosed public places, including restaurants, cafes, bars and clubs, as well as outdoor areas where it is permissible to smoke.", "Non-compliance with the law will result in fines of up to £2,500, while those who persistently break the ban face the maximum penalty of losing their liquor licence.", "A system of fixed penalty notices will also be introduced for individuals who break the law.", "The health benefits of smoking bans are argued by the First Minister, who points out that the number of people who smoke has fallen in New York and Ireland due to a 13% decline in sales of cigarettes, as well as a rise in tax revenues for bars and restaurants.", "However, opponents argue that smoking bans can be controversial, with some individuals arguing that they are not yet persuaded to quit their habit, while others fear the ban could be used by criminals to escape from jail."], "phi:2.7b": [" A comprehensive ban on smoking in public places will be introduced by 2006 in Scotland, according to First Minister Jack McConnell.", "The ban will apply to all enclosed public spaces, and fines of up to £2,500 will be imposed on non-compliant employers or licensees.", "Mr McConnell cited the health benefits of such a ban and the positive experiences of other countries that have implemented similar legislation."], "orca-mini:3b": [" The First Minister Jack McConnell has announced that a comprehensive ban on smoking in public places will be introduced in Scotland by the spring of 2006.", "The ban will include all enclosed public places, including bars, restaurants, and public buildings such as shopping centers.", "Fines of up to £2,500 will be imposed on employers who fail to enforce the law, while licensees who persistently refuse to comply with the law will face the ultimate sanction of losing their liquor licence.", "A system of issuing fixed penalty notices for those who break the law will be examined.", "Smokers who give up or reduce their smoking rate due to the ban could receive a tax credit.", "The Scottish Executive considered a range of options but decided to introduce an all-out ban on smoking in public places."], "hermes3:3b": ["Scotland to have comprehensive smoking ban by spring 2006, with fines up to £2500 for non-compliance; aims to reduce preventable deaths due to smoking."], "stablelm-zephyr:3b": ["Scotland is set to introduce a comprehensive ban on smoking in public places by spring 2006, claiming that it will save lives and improve the country's health.", "First Minister Jack McConnell emphasized that the measure would be enforced by environmental health and local licensing officers, with fines up to £2,500 for employers and licences being removed for non-compliance.", "The Scottish National Party welcomed the move but urged consultation with the public as the date of implementation approaches."], "stablelm2:1.6b": ["Scotland plans a comprehensive ban on smoking in all enclosed public places, with licensees or employers facing fines up to £2,0..", "The legislation will be enforced by environmental health and local licensing officers.", "Licensees who persistently refuse to comply with the law will face the ultimate sanction of losing their liquor licence.", "Individuals who persistently break the law will face a maximum fine of £1,000.", "First Minister Jack McConnell claimed there was evidence that smoking bans had helped smokers to either give up quicker or smoke less."], "granite3.1-dense:2b": ["Scotland's First Minister, Jack McConnell, announced a comprehensive smoking ban in all enclosed public places by spring 2006 during a Scottish Parliament session on Wednesday.", "The ban aims to improve health rates, which are \"lamentable,\" primarily due to smoking-related issues like poor exercise habits, drug abuse, excessive drinking, and overeating.", "To enforce the ban, environmental health and local licensing officers will be responsible.", "Non-compliance fines will reach up to £2,500, with licensees who persistently refuse to comply risking loss of their liquor licenses.", "Mr. McConnell cited successful smoking bans in New York (13% decline in cigarette sales) and Ireland (9% rise in tax revenues from bars/restaurants), arguing that such legislation can reduce passive smoking deaths and encourage smokers to quit.", "The plan includes a system for issuing fixed penalty notices and a maximum fine of £1,000 for persistent violators.", "Opposition parties generally supported the move, with Nicola Sturgeon welcoming it but calling for public consultation as the ban approaches.", "David McLetchie questioned potential prison exemptions, while Eleanor Scott expressed support and anticipated that most Scots would appreciate going out without inhaling tobacco smoke."], "chatgpt-4o-latest": ["Scotland will implement a comprehensive smoking ban in all enclosed public places by spring 2006 to improve public health, according to First Minister Jack McConnell.", "The legislation, part of the Health Service (Miscellaneous Provisions) Bill, will be enforced by environmental health and local licensing officers.", "Employers and licensees who fail to comply will face fines up to £2,500, with persistent offenders risking the loss of their liquor licenses.", "Individuals breaking the law may face fines up to £1,000.", "McConnell cited evidence from New York and Ireland showing smoking bans reduce smoking rates and do not significantly harm businesses.", "The move received broad political support, though some, including Scottish Conservative leader David McLetchie, raised concerns about exemptions, such as for prison inmates.", "Scottish National Party leader Nicola Sturgeon supported the ban but emphasized the need for public consultation.", "The Scottish Green Party welcomed the decision, highlighting public demand for smoke-free environments."]}