{"raw_text": "Kelly trails new discipline power\n \n Teachers could get more powers to remove unruly pupils from classes under a \"zero tolerance\" drive, Education Secretary Ruth Kelly has suggested.\n \n Ms Kelly told the BBC progress had been made against severely disruptive children but parents were still worried about lower level problems. The minister also confirmed she received \"spiritual support\" from the Catholic movement Opus Dei. But she denied her faith meant she would refuse key government jobs.\n \n The Conservatives have made school discipline one of their five priority areas in the run-up to the next general election. Ms Kelly is expected to announce her plans on the issue in the next fortnight. She told BBC One's Breakfast with Frost: \"It is really important to support head teachers and teachers in tackling disruption in the classroom. \"We have made huge progress on the really difficult cases, the pupils who have severely disruptive behaviour.\n \n \"But quite rightly what teachers are concerned about and what parents are concerned about is that this lower level disruption that goes on in the classroom now is tackled. \"I would like to see the teacher being able to remove disruptive children from the classroom completely and have either alternative provision within the school or indeed off the school and may be working together with other schools in a particular area to provide that provision.\" It is thought the plans may distinguish between excluding pupils from schools and taking them out of mainstream classes. Head teachers can currently exclude pupils who commit or threaten violence in school, who sexually abuse pupils or other people, who sell illegal drugs or who have persistent and malicious disruptive behaviour. Ms Kelly entered the Cabinet last month in the reshuffle forced by the resignation of the then Home Secretary David Blunkett. Her links to Opus Dei, which means \"Work of God\" in Latin, have provoked controversy.\n \n Critics say the organisation, which adheres strictly to Catholic teachings, is secretive and elitist but its members reject such claims. Asked if she was a member of the group, Ms Kelly said: \"I do have spiritual support from Opus Dei and that is right. \"But those are private spiritual matters and I'm sure you'll respect that politicians are entitled to a private life.\" She categorically denied reports that her beliefs on issues such as contraception would make her refuse to serve as a health or international development minister. Her collective responsibility as a Cabinet minister meant she also took responsibility for policies in those areas, she argued.\n \n The government has yet to issue its official response to the Tomlinson review, which recommended absorbing existing exam qualifications into a diploma. Ms Kelly said reforms should build on GCSEs and A-levels. Her comments did not impress Tory shadow education secretary Tim Collins. \"Ruth Kelly wants to ditch the Tomlinson report on exam structures but has absolutely no idea what to put in its place,\" he said. \"She also talks of improving discipline but cannot make her mind up how. This is an all talk agenda that lets down children, teachers and parents.\"\n", "llama3.2:1b": ["Kelly suggests expanding zero-tolerance policies for unruly pupils, allowing head teachers to remove disruptive students from classes without alternative provision or off-school options.", "The government has yet to issue a response to the Tomlinson review, which recommended incorporating existing exam qualifications into diploma programs.", "Education Secretary Ruth Kelly received \"spiritual support\" from Opus Dei but denied taking up Catholic positions, and faces criticism for her links to the organization."], "llama3.2:3b": ["Education Secretary Ruth Kelly suggests new powers for teachers to remove unruly pupils from classes under a \"zero tolerance\" drive to tackle lower-level disruption in schools."], "gemma2:2b": ["Education Secretary Ruth Kelly proposes increasing teacher powers to remove disruptive students from classrooms under a \"zero tolerance\" approach.", "She suggests this could involve alternative provisions within or outside schools, working with other schools in the area.", "Kelly received spiritual support from the Catholic movement Opus Dei, but denied that her faith would prevent her from serving as a government minister.", "Critics argue Kelly's proposed disciplinary measures lack clear plans and contradict the Tomlinson review on exam structure."], "qwen2.5:0.5b": ["Key points:\n\n- Kelly supports removing unruly students from classes under a \"zero tolerance\" drive.", "- Ms Kelly was previously the Home Secretary and now as a Cabinet minister.", "- She received support from Opus Dei, which is Catholic but has a secretive and elitist membership.", "Her connection to this group makes her an issue for some critics.", "- The Tomlinson review recommended absorbing existing GCSEs and A-levels into a diploma system.", "Kelly supports this reform, but argues she cannot make up her mind on how to improve discipline in schools.", "Summary: \n\nEducation Secretary Kelly wants to remove unruly students from classes under a \"zero tolerance\" drive.", "She receives support from Opus Dei, which is Catholic but secretive and elitist, while some critics see this as an issue of improving discipline in schools."], "qwen2.5:1.5b": ["Education Secretary Ruth Kelly proposes giving teachers power to remove unruly students from classes under a \"zero tolerance\" policy, aiming to address lower-level disruptions while preserving upper-level issues like violence or drugs in schools.", "She plans to announce the new measures soon.", "Critics criticize her links to Opus Dei, a secretive Catholic organization, and her potential reluctance to serve on health and international development committees due to personal beliefs."], "qwen2.5:3b": ["Education Secretary Ruth Kelly suggests increasing powers for teachers to remove unruly pupils from classes as part of a \"zero tolerance\" drive against disruptive behavior.", "She acknowledges progress in handling severely disruptive cases but emphasizes the need to address lower-level classroom disruptions.", "Kelly received support from Opus Dei, though she denied it would affect her career decisions.", "The government is expected to announce new school discipline plans within the next fortnight, potentially distinguishing between removing pupils from schools and taking them out of mainstream classes.", "While some critics argue that Kelly's links to Catholic group Opus Dei are controversial, she maintains her faith does not influence her political responsibilities.", "Her comments on exam reforms were met with criticism from Tory shadow education secretary Tim Collins, who found Kelly’s agenda lacking clarity and direction."], "opencoder:1.5b": ["The text summarizes the following key points:\n\n1.", "Kelly trails new discipline power.", "2.", "Teachers could get more powers to remove unruly pupils from classes under a \"zero tolerance\" drive.", "3.", "Ms Kelly told the BBC progress had been made against severely disruptive children but parents were still worried about lower level problems.", "4.", "The minister also confirmed she received \"spiritual support\" from the Catholic movement Opus Dei.", "5.", "But she denied her faith meant she would refuse key government jobs.", "6.", "The Conservatives have made school discipline one of their five priority areas in the run-up to the next general election.", "7.", "Ms Kelly is expected to announce her plans on the issue in the next fortnight.", "8.", "Critics say the organisation, which adheres strictly to Catholic teachings, is secretive and elitist but its members reject such claims.", "9.", "Asked if she was a member of the group, Ms Kelly said: \"I do have spiritual support from Opus Dei and that is right.\"", "10.", "She categorically denied reports that her beliefs on issues such as contraception would make her refuse to serve as a health or international development minister.", "11.", "Her collective responsibility as a Cabinet minister meant she also took responsibility for policies in those areas, she argued.", "12.", "The government has yet to issue its official response to the Tomlinson review, which recommended absorbing existing exam qualifications into a diploma."], "smollm:1.7b": ["The summary should be:\nOutput only the summary as plain text—no explanations, no formatting, no reasoning process."], "deepseek-r1:1.5b": ["Ruth Kelly's proposed \"zero tolerance\" policy aims to remove unruly pupils under her zero-tolerance drive, emphasizing school discipline as crucial for maintaining order.Kelly supports radical measures but admits she lacks political authority.", "She holds religious support from the Catholic Church (Opus Dei), which has sparked controversy.", "As Education Secretary, Kelly focuses on school discipline in the upcoming elections, though her approach to excluding students or moving them out of classes is unclear.", "Critics doubt her commitment to private life while others deny her beliefs affect her decision-making.", "The Tomlinson review, recommended by her, deals with exam qualifications, and she seeks reforms beyond GCSEs and A-levels.", "She avoids mentioning her refusal to serve as minister but suggests building on academic standards for a more comprehensive system.", "Her rigid approach risks harming both students and educators."], "tinyllama:1.1b": ["The following text is a summary of the article about Education Secretary Ruth Kelly's plans for addressing school-related issues such as disruptive behavior and low-level offenders.", "In the brief passage, Ms Kelly suggests that parents worry about lower-level problems but teachers still face challenges due to progress made against severe disruptions, and she defended her support for Opus Dei by stating that it did not pose a spiritual problem for her as a Cabinet minister.", "The article also mentioned the Tomlinson review on examinations and its implications for the government's policy regarding diploma qualifications."], "tinydolphin:1.1b": [" Ms. Kelly confirmed she will introduce a new system for removing disruptive pupils from classes to improve discipline in schools.", "She stated that the new plan involves supporting headteachers and teachers to make decisions on how to remove unruly students from the classroom.", "In addition, they will be able to remove them completely or work together with other schools to provide an alternative option for such pupils.", "The plans are expected to be announced in the next fortnight."], "phi:2.7b": [" Education Secretary Ruth Kelly suggests teachers could have more powers to remove unruly pupils from classes under a \"zero tolerance\" drive.", "Ms. Kelly has made progress against severely disruptive children but parents are still concerned about lower level problems.", "She confirms receiving spiritual support from the Catholic movement Opus Dei, but denies it means she will refuse key government jobs.", "Conservatives prioritize school discipline in the run-up to the next election.", "Ms. Kelly plans on announcing her plans soon and intends to allow head teachers more control over disruptive pupils by removing them from the classroom or providing alternative education options within or outside of their schools.", "Critics accuse Opus Dei, which adheres strictly to Catholic teachings, of being secretive and elitist but its members reject such claims.", "Ms. Kelly maintains that her private spiritual support does not affect her political decisions on issues such as contraception.", "She categorically denies reports that her beliefs will make her refuse to serve in health or international development roles.", "The government has yet to issue a response to the Tomlinson review, which recommended integrating exam qualifications into a diploma.", "Ms. Kelly believes reforms should build upon GCSEs and A-levels.", "Her comments do not impress Tory shadow education secretary Tim Collins, who criticizes her for wanting to ditch the Tomlinson report without a viable replacement and expressing uncertainty about how to improve discipline.", "Ms. Kelly's all talk agenda is disappointing children, teachers, and parents."], "orca-mini:3b": [" Kelly supports giving teachers more powers to remove disruptive pupils from classes but wants to allow them to exclude pupils who sexually abuse pupils or commit violence in school and have persistent and malicious disruptive behavior.", "She is a member of Opus Dei but has denied being its spiritual leader and refuses to serve as health or international development minister if her beliefs on contraception would conflict with government policies."], "hermes3:3b": ["Kelly suggests teachers may get powers to remove less disruptive pupils from classrooms for improved school discipline."], "stablelm-zephyr:3b": ["Education Secretary Ruth Kelly suggested that teachers could be given more power to remove unruly pupils from classes under a \"zero tolerance\" discipline policy.", "She acknowledged progress against severely disruptive children but noted concerns from parents about lower-level issues.", "The plans may include distinguishing between excluding pupils from schools and removing them from mainstream classes.", "Critics argue that the Catholic organization Opus Dei, to which Kelly belongs, is secretive and elitist, but she denied such claims and affirmed her commitment to her faith while maintaining her responsibility as a Cabinet minister."], "stablelm2:1.6b": ["Education Secretary Ruth Kelly suggests introducing a \"zero tolerance\" policy for removing unruly pupils from classes under the guidance of more powers given to teachers.", "She acknowledges progress has been made against disruptive children but parents are still concerned about lower-level problems.", "Kelly is expected to announce plans in the next fortnight; these plans may distinguish between excluding pupils from schools and taking them out of mainstream classes.", "Critics say Catholic organization Opus Dei is secretive, elitist, while its members reject such claims.", "Kelly denies membership in the group but admits receiving spiritual support from it.", "She denies reports that her faith would make her refuse to serve as a government minister."], "granite3.1-dense:2b": ["Education Secretary Ruth Kelly proposes enhancing teachers' abilities to manage unruly students by allowing them to remove disruptive pupils from classes entirely, either within or outside the school.", "This initiative aims to address concerns from both teachers and parents regarding less severe disruptions in classrooms.", "The Conservatives have prioritized this issue for the upcoming general election.", "Kelly, who recently joined the Cabinet, emphasizes her spiritual support from Opus Dei but clarifies that her faith does not influence her public duties or prevent her from holding key government positions.", "Critics argue that her stance on contraception might hinder her service in health or international development roles, while Kelly maintains her commitment to collective Cabinet responsibilities and private spiritual matters.", "The government's response to the Tomlinson review, which recommended merging existing exam qualifications into a diploma, is not yet clear.", "Tory shadow education secretary Tim Collins criticizes Kelly's approach as an \"all talk agenda\" that fails children, teachers, and parents."], "chatgpt-4o-latest": ["Education Secretary Ruth Kelly has suggested giving teachers more power to remove disruptive students as part of a \"zero tolerance\" approach to school discipline.", "While progress has been made with severely disruptive pupils, concerns remain about lower-level classroom disruptions.", "Kelly proposed alternative provisions within or outside schools for such students.", "The government is expected to announce plans soon, potentially distinguishing between exclusion from school and removal from mainstream classes.", "Meanwhile, Kelly's links to the Catholic group Opus Dei have drawn controversy, but she insists her faith does not affect her government responsibilities.", "She also indicated that exam reforms should build on GCSEs and A-levels rather than adopting the Tomlinson review's recommendations.", "Conservative critics argue she lacks clear plans on both discipline and education reform."]}