{"raw_text": "Cardinal criticises Iraq war cost\n \n Billions of pounds spent on conflict in Iraq and in the Middle East should have been used to reduce poverty, Cardinal Cormac Murphy-O'Connor has said.\n \n The head of the Catholic Church in England and Wales made the comments on BBC Radio 4 and will re-iterate his stance in his Christmas Midnight Mass. The cardinal used a Christmas message to denounce the war in Iraq as a \"terrible\" waste of money. He and the Archbishop of Canterbury have both spoken out about the war.\n \n Speaking on BBC Radio 4's Thought for the Day slot, he criticised the fact that \"billions\" have been spent on war, instead of being used to bring people \"out of dire poverty and malnourishment and disease\". The cardinal said 2005 should be the year for campaigning to \"make history poverty\". He added: \"If the governments of the rich countries were as ready to devote to peace the resources they are willing to commit to war, that would be to see with new eyes and speak with a new voice and perhaps then others would listen to us with new ears.\" The cardinal will touch on this theme again on Friday night when he will tell the congregation of 2,000 at Westminster Cathedral that peace is \"worth, always, striving for\".\n \n \"How is it that peace has not arrived?,\" the cardinal will ask. \"How is it that there is war in Iraq, violence in the Holy Land, and the horror of pain and death amongst the poor and deprived who suffer from injustice and thus do not find peace?\" \"How can one wish a happy Christmas for our fellow Christians in Iraq or in the Holy Land or those who suffer in Africa unless you and I, in whatever way is open to us, say and do what makes for peace?\" Both the Cardinal and Archbishop of Canterbury Dr Rowan Williams appealed for the weapons inspectors to be given more time in Iraq before the war started. Dr Williams has since criticised the government over its case for war, saying the failure to find weapons of mass destruction had damaged faith in the political system.\n \n On Friday, the Cardinal will ask the congregation to search for peace. \"It is possible, it is real, it is worth, always, striving for, because of the promise of Our Saviour,\" he will say. \"I also wish you peace in your homes because peace in your home is the beginning of peace in the homes of the community. \" A spokesman said Downing Street had no comment to make. But Prime Minister Tony Blair has said he will put Africa at the top of the agenda when Britain chairs the G8 summit next year.\n", "llama3.2:1b": ["Cardinal Cormac Murphy-O'Connor criticised the cost of the Iraq war and said billions should be spent on poverty reduction instead.", "The cardinal made comments during a BBC Radio 4 Thought for the Day slot, where he called the war a \"terrible waste of money\" and said 2005 should be used to campaign against poverty.", "He also questioned why peace had not been achieved in Iraq, Israel, Africa, or other regions.", "Cardinal Murphy-O'Connor appealed for more time for weapons inspectors in Iraq and criticized government policies on the war, including the failure to find weapons of mass destruction.", "The cardinal's comments came ahead of his Christmas Midnight Mass, where he will say \"It is possible, it is real, it is worth, always, striving for, because of the promise of Our Saviour.\"", "He also asked people to search for peace."], "llama3.2:3b": ["Cardinal Cormac Murphy-O'Connor says billions spent on Iraq war should have been used to reduce poverty, calling it a \"terrible\" waste of money.", "He and Archbishop of Canterbury Rowan Williams previously appealed for more time for weapons inspectors before the war started.", "The cardinal will reiterate his stance in his Christmas Midnight Mass, calling for peace and asking how it has not arrived despite ongoing conflict and injustice."], "gemma2:2b": ["Cardinal Cormac Murphy-O'Connor criticized the amount spent on the Iraq war, arguing it could have been used to reduce poverty instead.", "He called for greater commitment to peace and questioned why there has not been more progress in achieving it.", "The Cardinal will discuss these issues during his Christmas Midnight Mass and his Friday sermon at Westminster Cathedral."], "qwen2.5:0.5b": ["The Cardinal criticizes Iraq war's cost, suggesting it should have been used to reduce poverty instead.", "He plans to reiterate his stance during Christmas Midnight Mass on BBC Radio 4 and will touch on this theme again on Friday.", "The cardinal asked people in Iraq or Africa for peace, citing a promise of Jesus' love."], "qwen2.5:1.5b": ["Cardinal Cormac Murphy-O'Connor criticizes war spending, calls for peace, and urges Christians to campaign against poverty in 2005."], "qwen2.5:3b": ["Cardinal Cormac Murphy-O'Connor criticized spending billions on the Iraq war, suggesting funds should have been used to reduce poverty instead.", "He emphasized that 2005 should be a year for campaigning against poverty and advocated for governments to devote more resources to peace.", "The cardinal will highlight these themes in his Christmas Midnight Mass at Westminster Cathedral, calling for efforts towards making peace \"worth striving for\" based on the promise of Jesus.", "He also urged listeners to seek peace within their homes as a foundation for broader community harmony."], "opencoder:1.5b": ["The summary would be: The government of Iraq is using a vast amount of money for peace and recovery, but it needs more of this in order to ensure its return to normalcy.", "The Church has made a concerted effort to promote a future where everyone benefits equally by reducing their poverty levels, and it's clear that the governments have taken steps towards a peaceful transition."], "smollm:1.7b": ["The summary should be:\n\"Billions of pounds spent on conflict in Iraq and in the Middle East should have been used to reduce poverty, Cardinal Cormac Murphy-O'Connor has said.", "The head of the Catholic Church in England and Wales made the comments on BBC Radio 4 and will re-iterate his stance in his Christmas Midnight Mass.", "The cardinal used a Christmas message to denounce the war in Iraq as a \"terrible\" waste of money.\""], "deepseek-r1:1.5b": ["Cardinal Cormac Murphy-O'Connor has criticized billions spent on Iraq's conflict for instead being used to improve poverty and health issues, calling 2005 as the year for such campaigns and emphasizing peace.", "He will speak in a Christmas Mass, appealing for peace and hope in multiple contexts."], "tinyllama:1.1b": ["The following is a summary of the text:\n\nCardinal Cormac Murphy-O'Connor, head of the Catholic Church in England and Wales, criticized the war in Iraq as a \"terrible\" waste of money, instead saying that 2005 should be the year for campaigning to make history poverty.", "The cardinal also touched on the theme of peace being worth, always, striving for, and suggested that peace could bring about changes in the world.", "In his Christmas Midnight Mass speech, Cardinal Murphy-O'Connor criticized Iraq war costs and called for longer weapons inspectors to be given more time before the conflict started.", "He also called for peace in Africa as an important goal for the G8 summit next year.", "Prime Minister Tony Blair has said he will put Africa at the top of his agenda when leading the G8."], "tinydolphin:1.1b": [" Based on the given text, I can summarize it as follows: Cardinal Cormac Murphy-O'Connor criticizes the expensive Iraq war and points out that if governments devote resources to peace instead of conflict, it might lead to a brighter future for people in affected regions.", "He hopes the Christmas message can inspire political leaders to prioritize peace over war.", "The cardinal questions the impact of conflict on the lives of other individuals, particularly those who suffer from poverty and need."], "phi:2.7b": [" The Cardinal Cormac Murphy-O'Connor condemns the use of billions of pounds on the Iraq war and advocates spending this money to reduce poverty instead.", "He believes that peace is worth striving for, and it should be a priority in political decision-making.", "The Archbishop of Canterbury has also spoken out against the war.", "The cardinal will address these issues again during his Christmas Midnight Mass."], "orca-mini:3b": [" Cardinal criticizes Iraq war cost, saying billions spent on conflict should have been used to reduce poverty instead.", "He also speaks out against the war and calls for peace, appealing to the congregation to search for it."], "hermes3:3b": ["Cardinal criticizes Iraq war cost, suggests billions spent on conflict instead reduce poverty."], "stablelm-zephyr:3b": ["Cardinal Cormac Murphy-O'Connor criticized the billions spent on the Iraq war and called for reducing poverty instead, emphasizing that 2005 should be the year to campaign for history to make peace.", "He will reiterate this stance in his Christmas Midnight Mass and ask the congregation at Westminster Cathedral to strive for peace.", "Both the Cardinal and Archbishop of Canterbury have appealed for more time for weapons inspectors in Iraq before the war started.", "Prime Minister Tony Blair plans to prioritize Africa at the G8 summit next year."], "stablelm2:1.6b": ["Cardinal Cormac Murphy- O'Connor criticized billions spent on the Iraq war for being a waste of money instead of reducing poverty.", "He believes that resources should be allocated to fight poverty, stating \"make history poverty.\"", "Cardinal will reiterate his stance during Christmas Midnight Mass and in Thought for the Day slot on BBC Radio 4.", "Both he and Archbishop Rowan Williams urged for more time for weapons inspectors before the war started.", "The Cardinal urges searching for peace and believes it is worth striving for since of the promise of Our Savior.", "Prime Minister Tony Blair said Africa will be at the top of the agenda when Britain chairs the G8 summit next year."], "granite3.1-dense:2b": ["Cardinal Cormac Murphy-O'Connor, head of the Catholic Church in England and Wales, criticizes the Iraq war on BBC Radio 4's Thought for the Day, arguing that billions spent on the conflict should have been used to alleviate global poverty instead.", "He emphasizes that 2005 is a year to campaign against poverty and urges wealthy nations to commit as much resources to peace as they do to war.", "The cardinal will reiterate this stance during his Christmas Midnight Mass at Westminster Cathedral, asking the congregation to strive for peace.", "He also addresses the failure of weapons inspectors in Iraq and the ongoing violence in the region, questioning why peace has not been achieved.", "Dr. Rowan Williams, Archbishop of Canterbury, previously advocated for more time for inspections before the war.", "Cardinal Murphy-O'Connor will plead with his audience to seek peace, both in their homes and communities, emphasizing its realism and potential.", "Downing Street has no comment on these comments, while Prime Minister Tony Blair plans to prioritize Africa at the upcoming G8 summit."], "chatgpt-4o-latest": ["Cardinal Cormac Murphy-O'Connor criticized the billions spent on the Iraq war, arguing the money should have been used to alleviate poverty.", "Speaking on BBC Radio 4 and in his Christmas Midnight Mass, he condemned the war as a \"terrible\" waste and urged governments to prioritize peace over conflict.", "He called for 2005 to be a year of campaigning against poverty and questioned why peace had not been achieved.", "Alongside Archbishop of Canterbury Dr. Rowan Williams, he had previously urged more time for weapons inspections before the war.", "Dr. Williams later criticized the government for its justification of the war.", "The Cardinal emphasized the importance of striving for peace, both globally and within communities.", "Downing Street declined to comment, but Prime Minister Tony Blair pledged to focus on Africa during Britain's G8 presidency."]}