{"raw_text": "Drive to 'save' festive holidays\n \n Efforts are being made to 'protect' workers' days off on Christmas Day and New Year's Day.\n \n Support is being sought for a bill which would ensure that large retailers in Scotland remain closed on Christmas Day and 1 January. The Usdaw trade union said shop workers should be able to enjoy a break with their families. MSP Karen Whitefield wants to ensure only those whose roles are essential are at work over the festive season. In recent years, more stores have been opening on traditional holidays, with some starting their end-of-year sale on Christmas Day or New Year's Day. Ms Whitefield said: \"I have found members of the public to be very supportive when I have been campaigning on the streets.\n \n \"The early evidence shows quite clearly that the vast majority of people believe that shop workers should be given these two special days to spend with friends and family.\" Usdaw general secretary John Hannett added: \"Christmas Day and New Year's Day are special days for everyone in Scotland and the fact that shops do not open is an important part of making them special. They are largely collective days of rest. \"We want people to tell Karen, through her consultation, whether they want the special nature of these days to remain, or whether they want them to become like any other trading day, with shops open for business as usual.\" The consultation on a Christmas & New Year's Day Trading Bill has so far attracted almost 500 responses and closes on 7 February.\n", "llama3.2:1b": ["Efforts are being made to protect workers' days off on Christmas Day and New Year's Day in Scotland by a trade union seeking support for a bill that would close large retailers on these holidays.", "The bill aims to ensure essential workers have time with their families, while non-essential workers can continue to work during the festive season."], "llama3.2:3b": ["A bill is being sought in Scotland to keep large retailers closed on Christmas Day and New Year's Day, allowing shop workers to spend time with their families.", "The move aims to protect workers' days off and preserve the special nature of these holidays.", "A consultation has attracted almost 500 responses, which closes on February 7."], "gemma2:2b": ["A bill is being proposed in Scotland to ensure that large retailers remain closed on Christmas Day and January 1st, protecting workers' days off.", "The proposal aims to preserve these holidays as days of rest for shop workers who should be able to spend time with family.", "Public support for this change has been significant, according to the Usdaw trade union.", "A consultation regarding the bill is ongoing, encouraging feedback on the future of these holiday periods."], "qwen2.5:0.5b": ["The USDaw trade union is advocating for the Scottish government to allow large retailers such as shops not closed during holidays, especially Christmas and New Year's Day, to remain open.", "USDaw general secretary John Hannett emphasizes that Christmas Day and New Year’s Day are special days in Scotland and should be treated similarly to other trading days, with shops being open for business as usual on these days.", "The consultation on a bill to protect holiday workers has so far attracted over 500 responses by the end of February, indicating increasing public support for this measure."], "qwen2.5:1.5b": ["Scotland seeks to protect workers' holiday days by ensuring stores remain closed during the Christmas and New Year periods.", "A bill aims to restrict large retailers from opening on these holidays, with MSP Karen Whitefield arguing for an essential worker exception.", "Support is growing among shoppers who value the special nature of traditional shopping days in Scotland."], "qwen2.5:3b": ["Efforts are underway in Scotland to ensure large retailers remain closed on Christmas Day and New Year's Day through a bill supported by Usdaw, which advocates for shop workers to enjoy time off with families.", "MSP Karen Whitefield aims to protect essential roles during the festive season.", "Despite more stores opening traditionally, public support favors keeping these days as special occasions where shops are closed.", "The consultation has received nearly 500 responses and closes on February 7th."], "opencoder:1.5b": ["\"Drive to 'save' festive holidays\"\n\nEfforts are being made to 'protect' workers' days off on Christmas Day and New Year's Day.", "Support is being sought for a bill which ensures that large retailers in Scotland remain closed on Christmas Day and 1 January.", "The Usdaw trade union plans to offer shop workers with a break with their families, as part of the MSP Karen Whitefield's campaign.", "In recent years, more stores have begun opening on traditional holidays - with some starting their end-of-year sales on Christmas Day or New Year's Day.", "Ms Whitefield has expressed support for this initiative, highlighting the collective nature of the festive season.", "The public is now turning towards her consultation, which has attracted almost 500 responses and closes today."], "smollm:1.7b": ["Drive to 'save' festive holidays"], "deepseek-r1:1.5b": ["Drive to 'save' festive holidays  \n Efforts are being made to protect workers' days off on Christmas Day and New Year's Day.", "Support is sought for a bill ensuring large retailers in Scotland remain closed on these days but shop workers can enjoy breaks with their families.", "The UDSaw union advocates for this, while MSP Karen Whitefield aims to ensure only essential employees work during the festive season.", "Recent trends show widespread support for giving holiday closures special status.", "The consultation on a Christmas & New Year's Day Trading Bill has garnered over 500 responses and is due to close by February 7."], "tinyllama:1.1b": ["Pas de bouches pour les festive holidays (fêtes)"], "tinydolphin:1.1b": [" Summarize the given text: The goal is to ensure that large retailers in Scotland remain closed on Christmas Day and New Year's Day.", "A bill will be introduced to protect workers' days off.", "Support for a bill was expressed by supportive members of the public, who believe shops should respect these holidays as special days."], "phi:2.7b": [" A bill is being sought in Scotland to ensure that large retailers remain closed on Christmas Day and New Year's Day, which are considered special days for shop workers to enjoy with their families.", "The Usdaw trade union supports this proposal, as do the public who believe that these holidays should be treasured.", "The consultation on the bill has received almost 500 responses so far."], "orca-mini:3b": [" The text discusses efforts to protect workers' days off on Christmas Day and New Year's Day, and a bill that would ensure that large retailers in Scotland remain closed during those holidays.", "Some people believe that shop workers should be allowed to spend these days with their families, while others support the current practice of keeping stores closed.", "The Usdaw trade union has found support for their stance among the public.", "The consultation on a Christmas & New Year's Day Trading Bill has received over 500 responses and ends in February."], "hermes3:3b": ["Try to save Christmas holidays, ensure shop workers' days off on Xmas Day and New Year's Day in Scotland (retail bill support)."], "stablelm-zephyr:3b": ["Efforts are being made to protect workers' days off on Christmas Day and New Year's Day by supporting a bill ensuring large retailers in Scotland remain closed on those holidays.", "Usdaw trade union advocates for shop workers to have the ability to enjoy breaks with their families, while MSP Karen Whitefield aims to restrict only essential roles from working during the festive season.", "The public has shown support for maintaining the special nature of Christmas and New Year's Day as largely collective days of rest, with shops remaining closed for business as usual.", "A consultation on the Christmas & New Year's Day Trading Bill has attracted nearly 500 responses, closing on 7 February."], "stablelm2:1.6b": ["Efforts are underway to protect workers' time off on Christmas Day and New Year's Day in Scotland, with support for a bill that would close large retailers during these traditionally important periods.", "Shop workers should be allowed to take breaks with their families, according to MSP Karen Whitefield.", "Increasingly, stores have been opening on traditional holidays, such as starting sales events on Christmas Day or New Year's Day.", "The general secretary of the Usdaw union supports this approach, calling them \"special days of rest.\"", "The consultation period for a proposed \"Christmas & New Year's Day Trading Bill\" has attracted nearly 400 responses and closes on February 7th."], "granite3.1-dense:2b": ["A bill is being proposed in Scotland to preserve the traditional closure of large retailers on Christmas Day and New Year's Day, ensuring shop workers can spend these holidays with their families.", "This initiative aims to maintain the collective rest days that are valued by the public, as indicated by early support from constituents during MSP Karen Whitefield's campaign.", "Usdaw, a trade union, supports this move, emphasizing that Christmas and New Year's Day should remain special, non-trading days for Scotland.", "The consultation on the proposed Christmas & New Year's Day Trading Bill has gathered nearly 500 responses, with the deadline to provide further input extended to February 7.", "The union seeks public opinion on whether these holidays should retain their unique character or be treated as regular business days."], "chatgpt-4o-latest": ["Efforts are underway to protect workers' rights to time off on Christmas Day and New Year's Day in Scotland.", "A proposed bill seeks to ensure large retailers remain closed on these holidays.", "The Usdaw trade union supports the initiative, arguing that shop workers deserve time with their families.", "MSP Karen Whitefield is advocating for only essential workers to be on duty during the festive season.", "With more stores opening on these holidays in recent years, public support for the bill appears strong.", "Usdaw general secretary John Hannett emphasized the importance of maintaining these days as collective rest periods.", "A consultation on the bill has received nearly 500 responses and will close on 7 February."]}