{"raw_text": "Guantanamo pair's passport ban\n \n The government has written to two of the British men freed from Guantanamo Bay telling them they will not be allowed passports.\n \n A letter sent to Martin Mubanga said his British passport would not be issued in the light of evidence gathered against him by the US. This suggested he was likely to take part in action against UK or allied targets if he left Britain, it said. An identical letter has been sent to Feroz Abbasi, the men's solicitor says.\n \n It is not known whether the other two men released from the Cuba detention camp in January - Richard Belmar and Moazzam Begg - have also received letters. The government is implementing the rarely used Royal Prerogative in order to withdraw the men's passports. It is only the 13th time the power has been used since 1947 - the last time was in 1976. The letter, from the Home Office, says: \"I am writing to inform you that on the basis of the information which has come to light during your detention by the United States, the home secretary considered that there are strong grounds for believing that, on leaving the United Kingdom, you would take part in activities against the United Kingdom, or allied targets.\"\n \n The Home Office said it could not comment on individual cases.\n \n The Liberal Democrats say they suspect the move is part of a package of security measures agreed with the US in order for the men to be allowed home from Guantanamo Bay.\n \n Home Affairs spokesman Mark Oaten also demanded assurances that the evidence against the men was not gained under torture. He added: \"The power should only be used in absolute extreme circumstances and I find it hard to believe that these conditions have been met this time.\" He said the move also raised complex questions about the use of the Royal Prerogative. The Liberal Democrats have promised to raise the issue in Parliament.\n \n Amnesty International UK also questioned whether the decisions had been based on \"torture evidence\" obtained at Guantanamo Bay. \"Furthermore, we believe there should be an investigation into the role played by the UK in the detention of UK residents and nationals and possibly many others at Guantanamo Bay,\" said director Kate Allen. The men's solicitor, Louise Christian, has raised questions about whether the evidence was gathered through torture. But the Pentagon told BBC News US policy \"condemns and prohibits\" torture and said there was no evidence that any British detainee was tortured or abused. Mr Abbasi, 23, from Croydon, south London, was taken to Guantanamo Bay after being captured in Afghanistan in 2001. Mr Mubanga, 29, from north London, was originally detained in Zambia.\n", "llama3.2:1b": ["Two men released from Guantanamo Bay have had their passports confiscated by the UK government as a result of evidence gathered against them by the US.", "A letter to Martin Mubanga suggests that if he leaves the UK, he would take part in action against UK or allied targets, and an identical letter has been sent to Feroz Abbasi, who was also detained at Guantanamo Bay."], "llama3.2:3b": ["Two British men released from Guantanamo Bay will not be allowed passports due to evidence gathered against them by the US.", "The Home Office has implemented the Royal Prerogative to withdraw their passports, citing a risk they would take part in activities against the UK or allied targets if they left Britain."], "gemma2:2b": ["The British men released from Guantanamo Bay have been denied passports because of evidence suggesting they may engage in hostile activities against the UK or its allies if they leave Britain.", "The government is using a rarely used power called the Royal Prerogative to do this.", "The move has raised concerns about the evidence's legitimacy and the use of the royal prerogative itself."], "qwen2.5:0.5b": ["Two British men have been released from Guantanamo Bay and their passports will not be issued due to evidence gathered against them by the US.", "The Home Office is considering withdrawing their passports."], "qwen2.5:1.5b": ["The Home Office has written letters banning two British men released from Guantanamo Bay from obtaining passports due to concerns over their potential involvement with the United Kingdom or its allies.", "The decision is a rare use of the Royal Prerogative power and involves 13 instances since 1947, most recently in 1976.", "The move reflects security measures agreed between the US and UK governments for the men's release from Guantanamo Bay."], "qwen2.5:3b": ["The British government has sent letters to two of the three men freed from Guantanamo Bay stating they will not receive passports because evidence suggests they might participate in actions against UK or allied targets if released.", "This is an unusual use of the Royal Prerogative, invoked only 13 times since 1947.", "The other man's passport ban status remains unknown.", "The Liberal Democrats suspect it's part of security measures with the US and are questioning whether the evidence comes from torture.", "Amnesty International raised concerns about this decision and is investigating UK involvement in detaining British nationals at Guantanamo Bay."], "opencoder:1.5b": ["The government has written to two of the British men freed from Guantanamo Bay telling them they will not be allowed passports.", "The letter from Martin Mubanga said his British passport would not be issued in the light of evidence gathered against him by the US.", "An identical letter has been sent to Feroz Abbasi, the men's solicitor says.", "The government is implementing the rarely used Royal Prerogative in order to withdraw the men's passports.", "The letter from the Home Office states: \"I am writing to inform you that on the basis of the information which has come to light during your detention by the United States, the home secretary considered that there are strong grounds for believing that, on leaving the United Kingdom, you would take part in activities against the United Kingdom, or allied targets.\"", "The Home Affairs spokesman Mark Oaten also demanded assurances that the evidence against the men was not gained under torture.", "He added: \"The power should only be used in absolute extreme circumstances and I find it hard to believe that these conditions have been met this time.\"", "He said the move also raised complex questions about the use of the Royal Prerogative.", "Amnesty International UK also questioned whether the decisions had been based on \"torture evidence\" obtained at Guantanamo Bay.", "However, the Pentagon told BBC News US policy \"condemns and prohibits\" torture and said there was no evidence that any British detainee was tortured or abused.", "Mr Abbasi, 23, from Croydon, moved to Guantanamo Bay after being captured in Afghanistan in 2001.", "Mr Mubanga, 29, from north London, was originally detained in Zambia.", "The Liberal Democrats say they suspect the move is part of a package of security measures agreed with the US in order for the men to be allowed home from Guantanamo Bay."], "smollm:1.7b": ["The summary should be:\nGuantanamo pair's passport ban\nTwo letters sent to Martin Mubanga and Feroz Abbasi have been written to them by the Home Office, informing them that they will not be allowed passports if they leave Britain.", "The government has used the Royal Prerogative in order to withdraw their passports.", "It is only the 13th time the power has been used since 1947 - the last time it was used was in 1976.", "The Home Office said it could not comment on individual cases.", "The Liberal Democrats say they suspect the move is part of a package of security measures agreed with the US in order for the men to be allowed home from Guantanamo Bay.", "Mark Oaten also demanded assurances that the evidence against the men was not gained through torture.", "He added: \"The power should only be used in absolute extreme circumstances and I find it hard to believe that these conditions have been met this time.\"", "The move also raised complex questions about the use of the Royal Prerogative.", "The Liberal Democrats have promised to raise the issue in Parliament.", "Amnesty International UK also questioned whether the decisions had been based on \"torture evidence\" obtained at Guantanamo Bay.", "\"Furthermore, we believe there should be an investigation into the role played by the UK in the detention of UK residents and nationals and possibly many others at Guantanamo Bay,\" said director Kate Allen.", "The men's solicitor, Louise Christian, has raised questions about whether the evidence was gathered through torture.", "But the Pentagon told BBC News US policy \"condemns and prohibits\" torture and said there was no evidence that any British detainee was tortured or abused.", "Mr Abbasi, 23, from north London, was originally detained in Zambia."], "deepseek-r1:1.5b": ["The government has issued passport rejections to two men freed from Cuba, suggesting they may participate in actions targeting the UK or allies.", "These rejections apply if they leave Britain, raising questions about their intentions.", "The policy, called the Royal Prerogative, is rare and used for 13 times since 1976, with the last incident in 1976.", "It's unclear if the Cuban men received similar letters, but the Home Office cannot comment on individual cases except via the letters sent.", "The Liberal Democrats believe this move stems from a security package with the US, raising concerns about UK involvement in Guantanamo surveillance and potential torture."], "tinyllama:1.1b": ["The British government has written to two men who were freed from Guantanamo Bay and told them they will not be allowed passports, citing evidence gathered against them by the US.", "The letters were sent after the Home Office issued a rare Royal Prerogative power allowing for their deportation.", "The government is implementing the rarely used Royal Prerogative in order to withdraw their passports, while the Liberal Democrats have called for assurances that the evidence they had been detained in Guantanamo Bay was gained under torture.", "The Amnesty International UK has raised questions about whether the men's detention at Guantañamo Bay involved torture and urged an investigation into the role of the UK in their detention.", "The government also responded to criticism by stating that they would not give details about the evidence gathered against them, citing security reasons."], "tinydolphin:1.1b": [" The Home Office has written two letters to two of the British men freed from Guantanamo Bay, warning them that they cannot have passports because evidence against them was gathered under torture.", "This action is part of a security package reached with the US concerning these men's release.", "The letters state that their UK passports will not be issued due to grounds of doubt or potential involvement in activities against the UK or its allies, as stated by the US.", "The Home Office claims it used this power for the first time since 1976, but others believe it is part of a package of security measures.", "The Liberal Democrats have called for assurances that the evidence was not obtained under torture and are raising concerns about the use of this power to target individuals at Guantanamo Bay."], "phi:2.7b": [" The government has written two British men freed from Guantanamo Bay stating they will not be allowed passports due to evidence gathered against them by the US.", "This suggests they may take part in action against UK or allied targets if they leave Britain.", "It is unclear whether the other released men have received similar letters.", "The power to withdraw their passports has only been used 13 times since 1997 and the decision was made using the Royal Prerogative, which raises questions about its use.", "Home Affairs spokesman Mark Oaten demanded assurances that the evidence against the men was not obtained under torture and raised concerns about the role played by the UK in Guantanamo Bay detention center."], "orca-mini:3b": [" The government has informed two British men freed from Guantanamo Bay that their passports will not be issued due to evidence gathered against them by the US.", "This suggests they are likely to take part in action against UK or allied targets if they leave Britain.", "It is the 13th time the Royal Prerogative power has been used since 1947, and only once before in 1976.", "The letter says the home secretary considered there were strong grounds for believing that the men would take part in activities against the UK or allied targets if they left the UK.", "However, the Liberal Democrats suspect a package of security measures agreed with the US includes this move, and Amnesty International UK questions whether the decisions were based on torture evidence."], "hermes3:3b": ["Guantanamo released Brits banned from passports.", "Government letter says men are likely to participate against UK or allied targets if they leave country, as per rarely used Royal Prerogative power (13th time)."], "stablelm-zephyr:3b": ["The UK government has written letters to two British men who were previously freed from Guantanamo Bay, informing them that they will not be issued passports.", "The letters, sent to Martin Mubanga and Feroz Abbasi, state that the decision is based on evidence gathered against them by the US, suggesting that they may take part in actions against the UK or allied targets if they leave Britain.", "This marks the 13th time the rarely used Royal Prerogative has been implemented since 1947.", "Critics argue that this move raises questions about the use of the power and whether it was justified based on evidence obtained through torture at Guantanamo Bay."], "stablelm2:1.6b": ["The U.K. government has instructed two men freed from Guantanamo Bay not to receive British passports due to evidence gathered against them by the U.S., which raises concerns about the likelihood of these individuals engaging in actions against UK or allied targets if they leave Britain.", "This rare use of the Royal Prerogative is part of a security package agreed with the US, but some critics question whether the evidence was obtained through torture at Guantanamo Bay.", "Amnesty International questions the decisions based on such evidence and calls for an investigation into the role played by the U.K. in the detention of UK residents and nationals at Guantanamo Bay."], "granite3.1-dense:2b": ["The UK government has decided not to issue passports to two British men, Martin Mubanga and Feroz Abbasi, who were released from Guantanamo Bay in January 2014.", "This decision is based on evidence suggesting they might engage in activities against the UK or allied targets if they left Britain.", "This is the 13th instance of using the Royal Prerogative since 1947, with the last occurrence being in 1976.", "The Home Office letter to Mubanga cites intelligence gathered during his detention by the US as grounds for this decision.", "Critics, including the Liberal Democrats and Amnesty International UK, question the basis of these decisions, expressing concern about potential torture evidence and demanding assurances that the evidence was not obtained under coercion.", "The Pentagon denies any torture involvement in British detainees' cases."], "chatgpt-4o-latest": ["The UK government has denied passports to two British men, Martin Mubanga and Feroz Abbasi, who were released from Guantanamo Bay, citing US evidence suggesting they might engage in actions against the UK or its allies.", "The decision was made using the rarely invoked Royal Prerogative, last used in 1976.", "The Home Office declined to comment on individual cases.", "The Liberal Democrats suspect the move was part of a security agreement with the US and have raised concerns about whether the evidence was obtained through torture.", "Amnesty International and the men's solicitor have also questioned the legitimacy of the evidence.", "The Pentagon denies any torture or abuse of British detainees."]}