{"raw_text": "Commons hunt protest charges\n \n Eight protesters who stormed the House of Commons chamber during a debate on the Hunting Bill have been charged with disorderly conduct.\n \n The men were arrested in September after bursting into the chamber causing a hunting ban debate to be halted. Those charged included Otis Ferry, the 22-year-old son of rock star Bryan Ferry and Luke Tomlinson, 27, a close friend of princes William and Harry. They were charged under Section 5 of the Public Order Act, police said.\n \n Five of the eight men held an impromptu news conference outside Charing Cross Police Station on Monday evening, after the charges were formerly put to them. The men's solicitor Matthew Knight, said that at no time had it occurred to the men that they were committing a criminal offence.\n \n \"There is no offence of trespassing in the House of Commons - it is not a criminal offence,\" he said. \"If Parliament wanted to make entering the House of Commons chamber on foot a criminal offence it should have done so, but it can't do so retrospectively. \"We are not prosecuted for that. We are prosecuted for a Public Order Act offence. We are not guilty of it.\" They will appear at Bow Street Magistrates' Court on 21 December, a police spokesman said. Otis Ferry, a former Eton pupil and joint leader of the South Shropshire Hunt, said: \"I have no regrets. \"We have done nothing wrong beyond the obvious which was to stand up for our rights and not act like a sheep like the rest of the country.\" One of the men, David Redvers, 34, from Hartpury, Gloucestershire, said he and the other seven protesters would plead not guilty to the charges.\n \n The other protesters are John Holliday, 37, a huntsman from Ledbury, Herefordshire, Robert Thame, 34, who plays polo with Princes Charles in Team Highgrove, auctioneer Andrew Elliot, 42, from Bromesberrow, near Ledbury, point-to-point jockey Richard Wakeham, 34, from York, and former royal chef Nick Wood, 41. The 15 September protest came on the same day as a huge pro-hunting demonstration in Parliament Square. Four of the men ran out from behind the speaker's chair while another wrestled past a doorkeeper from a different entrance. The five tried to confront MPs before they were bundled out of the chamber and later led away handcuffed by police. Three others had been intercepted by security staff as they tried to join the five in the chamber.\n \n Speaker Michael Martin later said the men had used a forged letter to gain access to the House of Commons and had been helped to get close to the chamber by a parliamentary pass holder. In November, the use of the Parliament Act meant a total ban on hunting with dogs in England and Wales. However, many pro-hunt activists remained defiant after the law was passed, saying they would ignore the ban and continue to hunt. Last week, the Countryside Alliance said more than 250 hunts would meet legally the day after the ban on hunting with dogs comes into force. The alliance said the 19 February meets would show the new law was \"impossibly difficult to determine\" and open to different interpretations.\n", "llama3.2:1b": ["Eight protesters who stormed the House of Commons chamber during a debate on the Hunting Bill have been charged with disorderly conduct under Section 5 of the Public Order Act.", "The men, including Otis Ferry and Luke Tomlinson, were arrested in September for bursting into the chamber and disrupting the debate.", "They will appear at Bow Street Magistrates' Court on December 21.", "Five other protesters who attempted to enter the chamber earlier that day are also facing charges."], "llama3.2:3b": ["Eight protesters who stormed the House of Commons chamber during a debate on the Hunting Bill have been charged with disorderly conduct under Section 5 of the Public Order Act.", "The men, including Otis Ferry, Luke Tomlinson, and former royal chef Nick Wood, were charged after being arrested in September.", "Their solicitor claims they did not intentionally commit a crime, citing lack of trespassing laws within the House of Commons."], "gemma2:2b": ["Eight protesters were charged with disorderly conduct for storming the House of Commons during a debate on the Hunting Bill.", "They allegedly gained access using a forged letter and a parliamentary pass, interrupting the session.", "The charges are based under Section 5 of the Public Order Act, which they dispute.", "Their court date is December 21st."], "qwen2.5:0.5b": ["The House of Commons had a riot during a debate about a bill that would ban hunting in England and Wales after it passed.", "Protesters stormed the chamber, causing a hunting ban debate to be suspended, and were arrested with charges for disorderly conduct.", "Five of them, including Otis Ferry, Luke Tomlinson, Matthew Knight, David Redvers, Richard Wakeham, Andrew Elliot, and Andrew Elliot, will appear in court on December 21."], "qwen2.5:1.5b": ["Eight protesters were charged under Section 5 of the Public Order Act for entering the House of Commons during a Hunting Bill debate, claiming it wasn't an offense to enter without permission.", "They faced charges that they broke into the chamber despite there being no trespassing law in place.", "The men apologized for their actions but denied criminal intent and planned to plead not guilty at Bow Street Magistrates' Court on December 21st."], "qwen2.5:3b": ["Eight protesters who stormed the House of Commons during a Hunting Bill debate were charged with disorderly conduct under Section 5 of the Public Order Act.", "They include Otis Ferry, son of rock star Bryan Ferry, and Luke Tomlinson, a friend of William and Harry.", "The men deny trespassing as it is not illegal to enter the chamber, only public order violations are at issue.", "Five protesters held a news conference about their charges, which will be heard in Bow Street Magistrates' Court on 21 December.", "They claim they were exercising their right to protest.", "Other charged individuals include David Redvers, John Holliday, Robert Thame, Andrew Elliot, Richard Wakeham, and Nick Wood.", "The incident occurred alongside a pro-hunting demonstration and security staff helped the protesters enter.", "Despite the Hunting Act banning hunting with dogs in England and Wales, many activists plan to ignore the ban."], "opencoder:1.5b": ["Commons hunt protest charges were carried out by eight protesters who stormed the House of Commons during a debate on the Hunting Bill.", "They were charged under Section 5 of the Public Order Act with disorderly conduct, which was apprehended in September.", "The men were arrested and the charges were put to them under police reports.", "Five of the eight men held an impromptu news conference outside Charing Cross Police Station on Monday evening after the charges.", "They argued against a criminal offence prescribed by the law.", "They refused to commit any criminal charges, a judge said.", "The others attended a magistrate's court on 21 December where they argued that the charges were made in error, police confirmed.", "The men tried to plead not guilty to the charges but failed repeatedly and had to be dismissed.", "Prosecutors in court dismissed them with their pleas of not guilty."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details while omitting unnecessary information.", "It captures the essence of the text without paraphrasing or explaining it in detail.", "The main points are:\n\n1.", "The eight protesters who stormed the House of Commons chamber during a debate on the Hunting Bill were charged with disorderly conduct.", "2.", "They were arrested in September after bursting into the chamber causing a hunting ban debate to be halted.", "3.", "Five of the eight men held an impromptu news conference outside Charing Cross Police Station on Monday evening, after the charges were formerly put to them.", "4.", "Otis Ferry, the 22-year-old son of rock star Bryan Ferry and Luke Tomlinson, 27, a close friend of princes William and Harry, was charged under Section 5 of the Public Order Act, police said.", "5.", "The men's solicitor Matthew Knight, said that at no time had it occurred to the men that they were committing a criminal offence.", "If Parliament wanted to make entering the House of Commons chamber on foot a criminal offence, it could have done so, but it cannot do so retrospectively.", "They will appear at Bow Street Magistrates' Court on 21 December for a prosecution in their own right.", "6.", "The other protesters are John Holliday, 37, from Ledbury, Herefordshire, Robert Thame, 34, who plays polo with Princes Charles in Team Highgrove, auctioneer Andrew Elliot, 42, from York, point-to-point jockey Richard Wakeham, 34, from York, and former royal chef Nick Wood, 41.", "The 15 September protest came on the same day as a huge pro-hunting demonstration in Parliament Square.", "Four of the men ran out from behind the speaker's chair while another wrestled past a doorkeeper from a different entrance.", "7.", "The summary captures the key points of the text, including the charges against the protesters and their role in the 19 February meeting that led to the Hunting Act being passed."], "deepseek-r1:1.5b": ["Eight protesters, including Otis Ferry, who is 22 and the son of Bryan Ferry (a rock star) and Luke Tomlinson, who is 27 and a close friend of princes William and Harry, were arrested in September after bursting into the House of Commons to halt a hunting debate.", "They were charged with disorderly conduct under Section 5 of the Public Order Act.", "They will appear at Bow Street Magistrates' Court on December 21.", "Five of them held a news conference outside Charing Cross Police Station afterward.", "The others, including David Redvers from Hartpury and Robert Thame from Ledbury, are part of a pro-hunting group.", "A later demonstration in Parliament Square on September 15 involved four protesters running out to discuss hunting, with one using a dog and another jockeying past a doorkeeper.", "Later, five men were able to confront MPs, while others were intercepted by security.", "In November, the Parliament Act banned hunting with dogs in England and Wales.", "The Countryside Alliance reported that more than 250 legal hunts could now meet on February 19 due to ambiguous law enforcement.", "Pro-hunters remain defiant, highlighting the ongoing debate around hunting rights."], "tinyllama:1.1b": ["The eight protesters who stormed the House of Commons during a debate on the Hunting Bill have been charged with disorderly conduct.", "The men were arrested after bursting into the chamber, causing a hunting ban debate to be halted.", "Imprisoned are five of the eight men, who were joined by three others who had earlier tried to join them in the chamber.", "The charges against them come under Section 5 of the Public Order Act, which makes it an offense to \"trespass\" within the House of Commons or its grounds.", "The charges carry a maximum penalty of six months' imprisonment for each person.", "The men were charged after being granted immunity by the Speaker Michael Martin in November to avoid a legal challenge to the Hunting Bill law, which bans hunting with dogs in England and Wales.", "The Countryside Alliance, which claimed more than 250 hunts would meet legally within days of the ban coming into force, said the 19 February meets would show the new law was \"impractically difficult to determine\" and subject to interpretation by different interpretations."], "tinydolphin:1.1b": [" A group of protesters stormed the House of Commons on September 8th during a debate on the Hunting Bill, charging with disorderly conduct.", "The eight men, including three family members of royalty, were arrested after breaking into the chamber during a heated debate on hunting.", "They face potential sentences of up to six months in prison.", "The charges stem from their actions during a protest against the Conservative government's Hunting Bill."], "phi:2.7b": [" Eight protesters who stormed the House of Commons chamber during a debate on the Hunting Bill have been charged with disorderly conduct under Section 5 of the Public Order Act."], "orca-mini:3b": [" Eight protesters who stormed the House of Commons chamber during a debate on the Hunting Bill have been charged with disorderly conduct.", "The men were arrested in September after bursting into the chamber causing a hunting ban debate to be halted.", "Those charged included Otis Ferry, the 22-year-old son of rock star Bryan Ferry and Luke Tomlinson, 27, a close friend of princes William and Harry.", "They were charged under Section 5 of the Public Order Act, police said.", "Five of the eight men held an impromptu news conference outside Charing Cross Police Station on Monday evening, after the charges were formerly put to them.", "The men's solicitor Matthew Knight, said that at no time had it occurred to the men that they were committing a criminal offence.", "They will appear at Bow Street Magistrates' Court on 21 December, a police spokesman said.", "Otis Ferry, a former Eton pupil and joint leader of the South Shropshire Hunt, said: \"I have no regrets.", "We have done nothing wrong beyond the obvious which was to stand up for our rights and not act like a sheep like the rest of the country.\"", "One of the men, David Redvers, 34, from Hartpury, Gloucestershire, said he and the other seven protesters would plead not guilty to the charges.", "The other protesters are John Holliday, 37, a huntsman from Ledbury, Herefordshire, Robert Thame, 34, who plays polo with Princes Charles in Team Highgrove, auctioneer Andrew Elliot, 42, from Bromesberrow, near Ledbury, point-to-point jockey Richard Wakeham, 34, from York, and former royal chef Nick Wood, 41.", "The 15 September protest came on the same day as a huge pro-hunting demonstration in Parliament Square.", "Four of the men ran out from behind the speaker's chair while another wrestled past a doorkeeper from a different entrance.", "The five tried to confront MPs before they were bundled out of the chamber and later led away handcuffed by police."], "hermes3:3b": ["Commons chamber protesters charged for disorderly conduct.", "8 men charged under Public Order Act for entering House of Commons during a debate on Hunting Bill in September, despite not knowing it was an offence."], "stablelm-zephyr:3b": ["Eight protesters, including the son of rock star Bryan Ferry and a close friend of princes William and Harry, were charged with disorderly conduct after storming the House of Commons chamber during a debate on the Hunting Bill in September.", "The men were arrested for bursting into the chamber and causing the debate to be halted.", "They claim they are being prosecuted under the Public Order Act and not for trespassing as claimed by the parliament.", "They will appear at Bow Street Magistrates' Court on 21 December."], "stablelm2:1.6b": ["Eight protesters charged for disorderly conduct during a debate on the Hunting Bill at the House of Commons; they included Bryan Ferry's son Otis Ferry and Prince Harry's friend Luke Tomlinson.", "Charged under Section  F, 5 of the Public Order Act, they argued that entering the chamber was not a criminal offense if Parliament wanted to make it so.", "Defendants will appear in court on December 14th; some are pleading not guilty, while others were caught attempting to enter the chamber during a pro-hunting protest."], "granite3.1-dense:2b": ["Eight protesters, including Otis Ferry (son of Bryan Ferry) and Luke Tomlinson (friend of princes William and Harry), have been charged with disorderly conduct for storming the House of Commons chamber during a debate on the Hunting Bill in September.", "The men, described as high-profile individuals, were arrested and charged under Section 5 of the Public Order Act.", "They claimed they had no intent to commit a criminal offense, asserting that there's no trespassing law in the House of Commons.", "They will appear at Bow Street Magistrates' Court on December 21.", "The protest occurred on the same day as a large anti-hunting rally in Parliament Square.", "The men used forged letters to enter the chamber and were confronted by MPs before being arrested.", "This incident took place after England and Wales banned hunting with dogs through the Parliament Act in November, but many pro-hunt activists remain defiant about enforcing the ban.", "The Countryside Alliance announced plans for over 250 hunts to meet legally on the day the ban comes into effect, arguing the law is hard to enforce and open to various interpretations."], "chatgpt-4o-latest": ["Eight protesters, including Otis Ferry and Luke Tomlinson, were charged with disorderly conduct after storming the House of Commons during a debate on the Hunting Bill.", "They were arrested in September and charged under the Public Order Act.", "Their solicitor argued they had not committed a criminal offense, as trespassing in the Commons is not illegal.", "The protesters, who include huntsmen, polo players, and a former royal chef, plan to plead not guilty.", "The protest coincided with a large pro-hunting demonstration, and the men gained access using a forged letter.", "The incident occurred before the Parliament Act enforced a total ban on hunting with dogs in England and Wales, which pro-hunt activists vowed to defy.", "The Countryside Alliance announced that over 250 hunts would meet legally after the ban to challenge its enforceability."]}