{"raw_text": "Talks aim to avert pension strike\n \n Talks aimed at averting a series of national strikes over pensions reforms will take place this weekend.\n \n Five public sector unions will hold private talks with Deputy Prime Minister John Prescott at Labour's spring conference in Gateshead. They want the government to withdraw regulations - due to be introduced in weeks - which would raise the pension age for council workers from 60 to 65. Up to 1.4m workers could take part in a strike already earmarked for 23 March. However, all sides are anxious to avoid a major confrontation in the run up to the general election, said BBC labour affairs correspondent Stephen Cape. In four days, Britain's biggest union Unison will start balloting 800,000 local government workers on strikes. Other public sector unions have pledged to follow. It is just weeks before new regulations are introduced to raise the pension age of local government workers.\n \n The five unions meeting Mr Prescott want the government to withdraw these regulations. This would allow months of tough negotiations to follow, said our correspondent. But a spokesman for Mr Prescott warned that the changes to the local government pension scheme would have to go ahead in April. Privately ministers believe this will be the \"less painful\" option, our correspondent added. The Public and Commercial Services Union (PCS) will co-ordinate any industrial action with up to six other public sector unions. PCS leader Mark Serwotka warned last week that there could be further walkouts unless there was a government rethink. \"For a government that lectures everyone on choice - choice on public service, choice on this and choice on that - isn't it ironic that they're saying to public sector workers there is no choice,\" he said. \"If you want the pension you were promised when you started you must work for an extra five years - that is working until people drop. \"In the 20th century, it's completely unacceptable.\"\n \n Unison's 800,000 workers, the Transport and General Workers' Union's 70,000 and Amicus' 20,000 are among those being balloted about a 23 March walkout. Mr Prescott held a private meeting with senior union figures last week. It is understood no deal was offered in that meeting but there was room for further negotiations.\n", "llama3.2:1b": ["Public sector unions will hold private talks with the Deputy Prime Minister to discuss pension reform regulations that could lead to national strikes, including those affecting council workers and local government pension scheme changes.", "The talks aim to avoid confrontation before the general election."], "llama3.2:3b": ["Talks aimed at preventing national strikes over pension reforms will take place this weekend as five public sector unions meet with Deputy Prime Minister John Prescott to discuss withdrawing regulations on raising the pension age for council workers from 60 to 65.", "Up to 1.4m workers could participate in a strike already scheduled for March 23, but all sides aim to avoid a major confrontation ahead of the general election."], "gemma2:2b": ["Talks will take place this weekend between five public sector unions and Deputy Prime Minister John Prescott to discuss pension reforms and potential strikes.", "Unions are demanding the government withdraw proposed regulations raising the pension age, while the government insists on implementing the changes.", "The outcome of these talks could impact a potential strike by up to 1.4 million workers planned for March 23rd.", "Public sector unions have pledged their support for action if the government does not compromise."], "qwen2.5:0.5b": ["The public sector unions will hold private talks with Deputy Prime Minister John Prescott at Labour's spring conference in Gateshead.", "They want the government to withdraw regulations raising the pension age for council workers from 60 to 65, which would have raised the pension age for local government workers by up to 1.4 million.", "The talks are ongoing and will take place over the next few days.", "Unison is holding a public ballot on strikes for up to 800,000 local government workers, including members of other unions.", "The Public and Commercial Services Union (PCS) leader Mark Serwotka warned that there could be further walkouts unless there was a government rethink.", "\"If you want the pension you were promised when you started you must work for an extra five years - that is working until people drop,\" he said."], "qwen2.5:1.5b": ["Five public sector unions will meet Deputy Prime Minister John Prescott at Labour's spring conference to discuss pension reform regulations, which could lead to strikes involving up to 1.4 million workers on March 23rd and potentially more industrial action in the run-up to the general election.", "The government is considering removing these regulations that would raise the pension age for local government workers from 60 to 65."], "qwen2.5:3b": ["Talks aimed at averting pension strike aim to withdraw regulations raising the pension age from 60 to 65 for council workers, leading up to a March 23 strike involving up to 1.4 million public sector workers.", "Five unions will meet Deputy Prime Minister John Prescott at Labour's spring conference in Gateshead; they want pension reforms withdrawn to allow months of negotiation.", "Unions are concerned about avoiding confrontation before the general election and will co-ordinate industrial action.", "PCS warns against further strikes unless there is a rethink, citing government's previous claims of choice on public services.", "The 23 March walkout involves 800,000 Unison workers, 70,000 T&G Workers, and 20,000 Amicus members; Prescott held a private meeting last week with union leaders but no deal was reached."], "opencoder:1.5b": ["\"Talks aimed at averting a series of national strikes over pensions reforms will take place this weekend.", "Five public sector unions will hold private talks with Deputy Prime Minister John Prescott at Labour's spring conference in Gateshead.", "They want the government to withdraw regulations - due to be introduced in weeks - which would raise the pension age for council workers from 60 to 65.", "Up to 1.4m workers could take part in a strike already earmarked for 23 March.", "However, all sides are anxious to avoid a major confrontation in the run up to the general election.\""], "smollm:1.7b": ["The main idea of the text is to summarize the key points of the article, which are:\n\n1.", "Talks aim to avert pension strike\n2.", "Talks aimed at averting a series of national strikes over pensions reforms will take place this weekend\n3.", "Five public sector unions will hold private talks with Deputy Prime Minister John Prescott at Labour's spring conference in Gateshead\n4.", "They want the government to withdraw regulations - due to be introduced in weeks - which would raise the pension age for council workers from 60 to 65\n5.", "Up to 1.4m workers could take part in a strike already earmarked for 23 March\n6.", "However, all sides are anxious to avoid a major confrontation in the run up to the general election, said BBC labour affairs correspondent Stephen Cape\n7.", "In four days, Britain's biggest union will start balloting 800,000 local government workers on strikes\n8.", "Other public sector unions have pledged to follow\n9.", "It is just weeks before new regulations are introduced to raise the pension age of local government workers\n10.", "The five unions meeting Mr Prescott want the government to withdraw these regulations\n11.", "The Public and Commercial Services Union (PCS) will co-ordinate any industrial action with up to six other public sector unions\n12.", "PCS leader Mark Serwotka warned last week that there could be further walkouts unless there was a government rethink\n13.", "If you want the pension you were promised when you started you must work for an extra five years - that is working until people drop.", "14.", "In the 20th century, it's completely unacceptable."], "deepseek-r1:1.5b": ["Pension strike talks aim to avoid major strikes, with five unions meeting to withdraw plans for extending pension ages.", "Private meetings with Prime Minister John Prescott are planned, possibly delaying negotiations.", "Walks starting on March 23rd involve Unison and other unions.", "The UK government is considering reforms including raising local pensions.", "PSC leader warned that longer work could be needed due to promised benefits.", "Unison unions will vote on strikes in April."], "tinyllama:1.1b": ["The government has been invited to hold private talks with five public sector unions regarding the penSION reform laws, which would raise the age for council workers from 60 to 65.", "The unionists want these regulations to be immediately withdrawn, and up to six other public sector unions will also co-ordinate industrial action in response.", "As it is just weeks before new regulatory changes are due to take effect, negotiations must continue, and private ministers have warned that a government retention on choosing between the penSION or the cost of living, could result in more walkouts."], "tinydolphin:1.1b": [" A pension strike by public sector workers, scheduled to take place this Sunday, has been averted after the government announced plans to withdraw regulations raising the pension age of local government workers.", "The five unions involved in the negotiations aim to avoid a major confrontation before the general election and have already started balloting 800,000 local government workers on strikes."], "phi:2.7b": [" Talks aimed at averting a series of national strikes over pensions reforms will take place this weekend, with the government and five public sector unions holding private talks to discuss withdrawing regulations due to be introduced in weeks which would raise the pension age for council workers from 60 to 65.", "The unions fear that these changes would affect up to 1.4 million workers, leading to a major confrontation in the run-up to the general election.", "Unison is set to start balloting 800,000 local government workers on strikes, and other public sector unions have pledged to follow."], "orca-mini:3b": [" Talks between the government and five public sector unions aimed at averting a series of national strikes over pensions reforms will take place this weekend.", "The unions want the government to withdraw regulations, due to be introduced in weeks, which would raise the pension age for council workers from 60 to 65.", "Up to 1.4 million workers could participate in a strike already planned for 23 March.", "However, all sides are anxious to avoid a major confrontation in the run up to the general election, said BBC labour affairs correspondent Stephen Cape.", "In four days, Britain's biggest union Unison will start balloting 800,000 local government workers on strikes.", "Other public sector unions have pledged to follow.", "It is just weeks before new regulations are introduced to raise the pension age of local government workers.", "The Public and Commercial Services Union (PCS) will co-ordinate any industrial action with up to six other public sector unions.", "PCS leader Mark Serwotka warned last week that there could be further walkouts unless there was a government rethink.", "\"For a government that lectures everyone on choice - choice on public service, choice on this and choice on that - isn't it ironic that they're saying to public sector workers there is no choice,\" he said.", "\"If you want the pension you were promised when you started you must work for an extra five years - that is working until people drop.", "\"In the 20th century, it's completely unacceptable.\""], "hermes3:3b": ["Talks to prevent pension strikes over raising local government pension age will take place this weekend.", "Five public sector unions plan to meet Deputy Prime Minister John Prescott, aiming to withdraw the regulations increasing pension age from 60 to 65.", "Up to 1.4m workers may strike on March 23 if no deal is reached."], "stablelm-zephyr:3b": ["Five public sector unions plan to hold private talks with Deputy Prime Minister John Prescott regarding pension reforms and potential strikes.", "They want the government to withdraw regulations raising the pension age for council workers from 60 to 65, which could lead to a strike by up to 1.4 million workers on 23 March.", "Unions are meeting with Mr. Prescott in an attempt to avoid major confrontation before the general election.", "Although negotiations may take months, a spokesman for Mr. Prescott warned that changes to the local government pension scheme must go ahead in April.", "Britain's biggest union, Unison, will start balloting 800,000 local government workers on potential strikes starting 23 March."], "stablelm2:1.6b": ["Talks will be held this weekend to prevent national strikes over pension reforms; five public sector unions are having private talks with Deputy Prime Minister John Prescott at Labour's spring conference in Gateshead.", "The unions want the government to withdraw new regulations, which would raise the pension age for council workers from 65 to 70, affecting up to 1.4 million workers.", "A major confrontation is avoided before the general election.", "Unison will start a ballot of local government workers and other public sector unions are expected to follow.", "Ministers believe introducing these changes in April will be \"the less painful\" option."], "granite3.1-dense:2b": ["Public sector unions plan to hold talks this weekend with Deputy Prime Minister John Prescott, seeking withdrawal of government-proposed pension age increases for council workers from 60 to 65.", "These talks are crucial to prevent an expected strike on March 23, involving up to 1.4 million workers.", "Four major unions—Unison, Transport and General Workers' Union, Amicus, and PCS—are balloting their members for industrial action due to the proposed changes.", "The government has set April as the deadline for these regulations, aiming for the \"least painful\" outcome.", "However, union leaders argue that forcing workers to remain employed until the age of 65 is unacceptable and against the government's own principles of choice in public services."], "chatgpt-4o-latest": ["Talks will be held this weekend between five public sector unions and Deputy Prime Minister John Prescott to prevent national strikes over pension reforms.", "The unions oppose new regulations set to raise the pension age for council workers from 60 to 65 and are demanding their withdrawal.", "Up to 1.4 million workers could strike on 23 March, with Unison balloting 800,000 members and other unions planning to follow.", "Ministers insist the changes must proceed in April, believing this to be the least disruptive option.", "PCS leader Mark Serwotka criticized the lack of choice for workers, warning of further strikes unless the government reconsiders.", "Prescott previously met union leaders without offering a deal, but further negotiations remain possible."]}