{"raw_text": "Labour's 'EU propaganda'\n \n A \"taxpayer subsidised propaganda exercise\" on the EU is being used to lull the British public into a false sense of security, say the Tories.\n \n Shadow foreign secretary Michael Ancram told MPs a new White Paper was part of trying to soften up opinion ahead of the referendum on the EU constitution. His claims were denied by Foreign Secretary Jack Straw, who accused the Tories of \"running scared\" of debate. EU cooperation would help get better UK immigration controls, he argued.\n \n Mr Straw used Thursday's Commons debate to launch the new White Paper on the prospects for the EU in 2005. Security, stability and prosperity would be the key themes when the UK took over the chairmanship of the EU in July, said Mr Straw. Africa and climate change would also feature highly. He said the UK was trying to ensure future EU budgets were limited to 1% of Europe's economic output and were spent \"where it adds most value\". Mr Straw promised to continue to ensure the UK's budget rebate, secured in 1984 by Margaret Thatcher, was \"fully justified\". \"We, like all other countries, have a veto on any changes proposed in this area,\" he said.\n \n Mr Ancram condemned the document, which the Foreign Office says has cost about £2,500 to design, print and deliver. \"Isn't the reason that the government is now involved in a taxpayer subsidised propaganda exercise to try to sell the new EU to the country in advance of the forthcoming referendum and general election?,\" he asked. The Tory spokesman also criticised the government for claiming the EU constitution would make Europe easier to understand. \"The government, last week, had to publish a commentary of 500 pages to try and explain this 'easy and simple' constitution to the British people,\" he said. \"Who are they trying to kid?\" The proposed question for the constitution referendum is: \"Should the United Kingdom approve the Treaty establishing a Constitution for the European Union?\" The Electoral Commission on Thursday said it was satisfied the question was easy to understand. The government has suggested the referendum on the constitution could take place in spring 2006, with the Tories set to campaign for a \"no\" vote.\n \n Mr Ancram said ministers were prolonging uncertainty by putting the vote off until the latest date possible. The foreign secretary hit back by saying Tory attitudes to Europe had helped keep the party out of power for more than a decade. Mr Straw argued cooperation with European partners could bring a \"level playing field\" on immigration and asylum controls. \"You are setting your face against all of these things,\" he added. For the Liberal Democrats, Sir Menzies Campbell said the UK should not ignore the need to reform the EU Common Agricultural Policy. Change was particularly important for developing countries wanting access to markets, he argued. Sir Menzies was among those worried about plans, backed by the UK, to lift the arms embargo imposed on China after the Tiananmen Square massacre. Mr Straw said no decisions had been taken - Chinese human rights had improved but not by enough.\n", "llama3.2:1b": ["Labour's proposed White Paper on the EU is being criticized for being a \"taxpayer subsidised propaganda exercise\" and lulling the public into a false sense of security ahead of the referendum on the EU constitution.", "Shadow foreign secretary Michael Ancram accused the government of trying to soften up opinion with a new document that costs £2,500 to design, print, and deliver.", "The Foreign Secretary Jack Straw defended the document as part of an effort to ensure European stability and prosperity during the UK's chairmanship in 2005.", "Ancram criticized the document for claiming the EU constitution would make Europe easier to understand, while the Electoral Commission found it easy to understand.", "The government has suggested the EU constitution referendum could take place in spring 2006, with the Tories set to campaign for a \"no\" vote."], "llama3.2:3b": ["Tories claim EU document is a \"taxpayer subsidised propaganda exercise\" to soften public opinion ahead of referendum and general election.", "Foreign Secretary Jack Straw denies this, saying cooperation with European partners could bring better UK immigration controls.", "Straw promises to limit future EU budgets to 1% of Europe's economic output.", "The proposed EU constitution referendum question has been deemed easy to understand by the Electoral Commission."], "gemma2:2b": ["The Tory party accuses the government of using a new White Paper on EU prospects as \"taxpayer subsidized propaganda\" to influence public opinion before the EU constitution referendum.", "The Foreign Secretary claims this is part of ensuring the UK takes over EU chairmanship in July with its focus on security, stability and prosperity.", "He also defends limiting EU budgets to 1% of Europe's economic output and promises to continue the UK's budget rebate.", "Critics argue the government's efforts are misguided and that EU reforms are needed, especially regarding agricultural policy and China's human rights record."], "qwen2.5:0.5b": ["Tories are lulling public into believing the EU will benefit Britain in advance of a referendum.", "They accuse the Tories of \"running scared\" before the vote, suggesting they want to soften up opinions and avoid conflict with Brussels.", "Shadow Foreign Secretary Michael Ancram claims the new White Paper will help secure better UK immigration controls and aid in limiting EU budget spending and European Union (EU) member-state relationships.", "He also says the government is running a taxpayer subsidised propaganda exercise to sell the EU to the British public before the upcoming referendum, while criticising the foreign secretary's claim that the EU constitution would make Europe simpler.", "Foreign Secretary Jack Straw argues for a more cautious approach with his new White Paper, promising to protect UK budget rebates from 1% economic output and adhere strictly to \"where it adds most value\".", "He claims the UK wants to ensure future EU budgets are limited to just 1% of Europe's economy.", "However, he suggests this could be achieved through a European Union Common Agricultural Policy (CAP) reform.", "Liberal Democrat Shadow Home Secretary Nick Grieve argues for stronger EU institutions and reforms in the European Union.", "For British politicians, these issues often make them wary of the EU, especially when Brexit discussions are on the cards."], "qwen2.5:1.5b": ["The Tories claim EU propaganda exercise is misleading British public ahead of referendum and general election.", "Shadow Foreign Secretary criticizes new White Paper, which costs £2,500 to design, print and deliver.", "UK's stance on the EU constitution questioned as government claims it would make Europe easier to understand despite complex nature of the text.", "The proposed constitution question for referendum is \"Should the United Kingdom approve the Treaty establishing a Constitution for the European Union?", "\"."], "qwen2.5:3b": ["Labour criticises the government for a taxpayer-funded propaganda campaign promoting the EU constitution ahead of referendum and general election.", "Shadow foreign secretary Michael Ancram claims it is an attempt to deceive the public, while Foreign Secretary Jack Straw defends the initiative as beneficial for UK interests in areas like immigration control and budget management.", "Ancram also argues that explaining the EU constitution requires extensive documentation.", "The proposed referendum question asks if the UK should approve the EU Constitution.", "Tory MPs emphasize the need for improved UK-EU cooperation on issues such as asylum, while Lib Dems advocate reform of the Common Agricultural Policy.", "Sir Menzies Campbell warns against lifting China's arms embargo due to human rights concerns."], "opencoder:1.5b": ["The text provides information about a \"taxpayer subsidised propaganda exercise\" on the EU, which may have involved lulling the British public into a false sense of security.", "It also mentions an attempt to make Europe easier to understand, as well as concerns regarding cooperation with European partners on immigration and asylum controls."], "smollm:1.7b": ["The Labour's \"EU propaganda\" is a key idea in this text.", "The Tories' attempt to use EU cooperation as a way to soften up public opinion before the referendum on the EU constitution is a key aspect of their strategy.", "The Foreign Secretary's claims that the UK would be running scared if it didn't accept the EU constitution are denied by the Foreign Office, which argues that the UK has a veto over any changes proposed in this area.", "The Labour's \"EU propaganda\" idea suggests that the Tories' campaign to promote the EU as a positive force for Britain is not genuine and may be used to distract from their own negative policies on Europe."], "deepseek-r1:1.5b": ["The Labour Tories are using a \"taxpayer subsidised propaganda exercise\" targeting the European Union to ease British public sentiment leading up to the upcoming referendum.", "They claim this effort aims to soften public opinion by preparing them for a false sense of security on EU issues.", "The shadow Foreign Secretary Michael Ancram mentions a White Paper published by Jack Straw, which outlines plans to improve EU immigration and asylum controls.", "The paper suggests spending \"where it adds most value,\" aiming to limit the UK's budget spent in 1984 as part of Margaret Thatcher's rebate claim.", "Mr.", "Straw also criticized the government for claiming the EU constitution simplifies Europe too much without context, while supporting claims that China's arms embargo on Taiwan may affect human rights.", "The referendum question will focus on the UK approving a treaty establishing their own EU constitution.", "The vote is set to end in spring 2006, intended to prevent the Tories from being re-elected for more than a decade."], "tinyllama:1.1b": ["The Labour party's \"EU propaganda\" in their proposed White Papers for the EU constitution referendum is being used to soften up opinion and achieve better immigration controls, according to shadow foreign secretary Michael Ancaira.", "In response, Foreign Secretary Jack Straw claimed that the UK was trying to ensure future EU budget limits were spent \"where it adds most value\".", "The Foreign Office's new document cost approximately £2,500 to design, print, and deliver but the Torie speaksmand condemned the proposed question for the constitution referendum as \"easy to understan\" and questioned its feasibility.", "Ministers have been prolonging political uncertainty by putting the vote off until the latest date possible but the Liberal Democrats argued that reform was important for developing countries looking to access European markets.", "The Labour party's proposed changes for the EU Common Agricultural Policy were also criticized, with Sir Menzie Chong calling for change and arguing that Britain should prioritize developing countries' access to market."], "tinydolphin:1.1b": [" The text provided presents a summary of the article discussing the European Union's (EU) taxpayer subsidised propaganda exercise, aimed at lulling the British public into a false sense of security before the referendum on the EU constitution in July.", "The Tories' new White Paper suggests a shift towards a more open and inclusive approach to the EU by emphasizing the importance of cooperation with partners such as Africa and climate change, while also advocating for a less restrictive immigration policy.", "The Liberal Democrats, led by Sir Menzies Campbell, have expressed concerns over the proposed reform of the EU Common Agricultural Policy, which could potentially benefit developing countries seeking access to markets.", "The EU arms embargo imposed on China after the Tiananmen Square massacre also comes under debate, with no decisions made as of yet.", "The Foreign Office suggests the European Union has cost about £2,500 to design and print the new White Paper.", "The proposed question for the constitution referendum is: \"Should the United Kingdom approve the Treaty establishing a Constitution for the European Union?\"", "The Electoral Commission on Thursday said it was satisfied with the question."], "phi:2.7b": [" Labour's EU propaganda is a taxpayer subsidised exercise aimed at softening up public opinion ahead of the referendum on the EU constitution.", "The Tories believe it is an attempt to trick people into accepting the new EU proposals.", "However, Foreign Secretary Jack Straw denies this and argues that cooperation with European partners can bring benefits such as better immigration controls.", "He also promises to continue ensuring that UK budgets are limited and spent wisely.", "A spokesman for Shadow Foreign Secretary Michael Ancram condemns the government's new White Paper on the future of the EU in 2005, claiming it is a propaganda exercise.", "He believes the Tories are running scared of debate on this issue.", "The foreign secretary argues that cooperation with European partners can help get better UK immigration controls and improve security, stability and prosperity for all member states."], "orca-mini:3b": [" The text discusses the British government's proposed White Paper on the European Union and its attempts to soften up public opinion ahead of the referendum on the EU constitution.", "Shadow foreign secretary Michael Ancram accused the government of prolonging uncertainty by putting the vote off until the latest possible date, while Foreign Secretary Jack Straw argued that cooperation with European partners could bring a \"level playing field\" on immigration and asylum controls.", "The Liberal Democrats also expressed concern about reforming the Common Agricultural Policy."], "hermes3:3b": ["Tories claim British public lulled into false EU security through propaganda exercise funded by taxes, criticising White Paper before referendum."], "stablelm-zephyr:3b": ["The UK's shadow foreign secretary, Michael Ancram, claimed that a new White Paper outlining the prospects for EU cooperation in 2005 was a \"taxpayer subsidised propaganda exercise\" intended to influence public opinion before a referendum on the EU constitution.", "However, Foreign Secretary Jack Straw argued that EU cooperation would improve UK immigration controls and that the UK aimed to ensure future EU budgets were limited to 1% of Europe's economic output.", "Straw also promised to defend the UK's budget rebate, secured under Margaret Thatcher in 1984.", "The Tory spokesman criticized the government for trying to simplify the EU constitution for voters, while Liberal Democrats called for reform of the EU Common Agricultural Policy."], "stablelm2:1.6b": ["Tories criticize a \"taxpayer subsidised propaganda exercise\" that Labour uses for EU influence before the referendum and general election.", "Shadow foreign secretary Michael Ancram says a new White Paper is part of softening public opinion, while Foreign Secretary Jack Straw denies this, saying the document will focus on security, stability, and prosperity when the UK becomes chairwoman in July.", "Tory spokesman condemns the cost and purpose of the document, noting that the government tries to sell the EU to the country ahead of the referendum and general election.", "The proposed question for the EU constitution referendum is: \"Should the United Kingdom approve the Treaty establishing a Constitution for the European Union?\""], "granite3.1-dense:2b": ["The Conservatives criticize the Labour government's new White Paper on EU prospects for 2005 as a taxpayer-funded propaganda tool intended to sway public opinion in favor of the EU before a referendum on the EU constitution and general election.", "Shadow Foreign Secretary Michael Ancram accused the government of running scared of debate and highlighted the discrepancy between the government's claims of a simple, easy-to-understand EU constitution (500 pages) and its actual complexity.", "The proposed referendum question is: \"Should the United Kingdom approve the Treaty establishing a Constitution for the European Union?\"", "The Electoral Commission deemed it understandable.", "Foreign Secretary Jack Straw defended the White Paper, emphasizing themes of security, stability, prosperity, Africa, and climate change during Britain's upcoming EU presidency in July 2005.", "He pledged to maintain the UK's budget rebate and ensure future EU budgets don't exceed 1% of Europe's economic output.", "Straw argued that EU cooperation would facilitate better UK immigration controls and asylum policies, including a level playing field on these issues with European partners.", "Liberal Democrat leader Sir Menzies Campbell urged reform of the EU Common Agricultural Policy, stressing its importance for developing countries seeking market access.", "He also raised concerns about lifting China's arms embargo but noted that human rights improvements had been modest since Tiananmen Square in 1989."], "chatgpt-4o-latest": ["The Conservatives accused the Labour government of using taxpayer money for pro-EU propaganda ahead of the referendum on the EU constitution.", "Shadow foreign secretary Michael Ancram criticized a new White Paper as an attempt to sway public opinion, while Foreign Secretary Jack Straw defended it, arguing EU cooperation would benefit the UK, particularly on immigration controls.", "Straw outlined the UK's EU priorities, including security, stability, and budget constraints, while reaffirming the UK's budget rebate.", "Ancram dismissed claims that the EU constitution would simplify governance, pointing to a lengthy government commentary explaining it.", "The referendum, expected in spring 2006, would see the Tories campaigning for a \"no\" vote.", "Ancram accused the government of delaying the vote, while Straw countered that Tory opposition to Europe had kept them out of power.", "Liberal Democrat Sir Menzies Campbell emphasized the need for EU agricultural reform and raised concerns over lifting the arms embargo on China, which Straw said was still under review."]}