{"raw_text": "Campaign 'cold calls' questioned\n \n Labour and the Conservatives are still telephoning the millions of people who have signed up to make sure they do not get marketing \"cold calls\".\n \n The parties say they can stick to the rules by ensuring that their calls are not marketing - for instance by asking about people's voting intentions. The Lib Dems are asking the watchdog overseeing the rules to stop the calls. The information commissioner's office says surveys are allowed but there is a \"grey\" area if personal data is kept. Telephone call centres are expected to be used as never before by all the three major parties in the run-up to the general election.\n \n But seven million telephone numbers are on the Telephone Preference Service (TPS) lists, which ban unsolicited sales and marketing calls. Both schemes are run by the Direct Marketing Association and backed by EU directives on privacy and electronic communications.\n \n The rules on marketing calls apply as much to politicians as to private sector companies. But that does not mean Labour and the Tories are not calling people signed up to the TPS. A Labour Party spokesman told the BBC News website the party avoided those on TPS lists when telephoning people about membership or fundraising. But that did not happen for \"voter identification\" calls. \"When we ask which party they will vote for, that is not marketing and we have very clear legal advice that it is not,\" he said. \"So it is not covered by the Telephone Preference Service.\"\n \n He said the party always asked people if they would be happy to be contacted again and if they said no, they were not rung again. A Conservative spokeswoman said the party stuck to the rules when it rang TPS subscribers. She said: \"We do apply TPS but in line with the law. We would not do things that are not allowed in the law.\" A spokesman for the Information Commissioner's Office said it would be classed as marketing if political parties telephoned people to encourage them to vote for them. But the rules did allow polling organisations to telephone people about their voting intentions if they recorded them only as part of a bigger set of statistics, not person by person. \"If a political party was doing that than it may be that also would not be marketing,\" he said.\n \n The spokesman said it might be considered unsolicited marketing if a party recorded voting preferences with a view to marketing information in the future. The spokesman said there was \"no yes or no\" answer and the area was \"pretty grey\". He added: \"If someone complained, then we would investigate that. Political parties are aware of the regulations. At the last by-elections, we reminded them.\" Lib Dem chairman Matthew Taylor has now written to the watchdog saying: \"The advice we have received on several previous occasions is that such phone calls are illegal.\" He says evidence from local Lib Dem parties around the country suggests there are \"significant\" numbers of such calls. \"I hope you can therefore take swift and efficient action to ensure that this ceases,\" he tells the commissioner. Mr Taylor argues there should be new guidelines so all parties can act in the same way if the watchdog believes the rules allow parties to ring TPS numbers about voting intentions and later urge those people to vote for them.\n", "llama3.2:1b": ["Labour and the Conservatives are continuing to use telephone call centers as they are allowed by law, but still need to ensure their calls do not breach the rules on marketing.", "Both parties have said they will avoid calling certain groups, such as those on the Telephone Preference Service (TPS) lists, which prohibit unsolicited sales and marketing calls.", "However, there is some grey area around when it is considered marketing, particularly for politician calls where voters are asked to vote for their party rather than just being contacted for membership or fundraising purposes.", "A spokesperson for the Information Commissioner's Office has said that if a political party rings TPS subscribers without permission, it could be considered unsolicited marketing."], "llama3.2:3b": ["Labour, Conservatives, and Lib Dems make campaign phone calls despite being on TPS lists, saying they are not marketing.", "Information Commissioner's Office says polling calls may be allowed if done without marketing intent, but lines are unclear.", "Lib Dem chairman Matthew Taylor wants new guidelines to end the practice."], "gemma2:2b": ["Labour and Conservatives are still making calls to people signed up to the Telephone Preference Service (TPS) despite it being illegal for political purposes to do so, according to the Information Commissioner's Office (ICO).", "While Labour claims they only ring TPS subscribers about membership or fundraising, not voter identification, and always ask if people want to be contacted again, a Conservative spokesperson stated that their calls follow legal guidelines.", "However, the ICO states calling to encourage voting for political parties would constitute marketing.", "The Lib Dems are demanding action and new guidelines from the watchdog to ensure all parties adhere to rules regarding TPS phone calls, particularly when voters' choices about future elections are being recorded."], "qwen2.5:0.5b": ["Labour and the Conservatives are still calling millions of people before the general election, questioning whether they're marketing calls.", "They ask telephone call centers to be used as never before.", "Telephone preference service (TPS) lists ban unsolicited sales and marketing calls on members who have signed up before the election.", "Some Labour and Conservative party leaders say they don't call those with TPS numbers because their rules apply to everyone, not just political parties.", "They also question whether the telephone preferences system is actually a rule to stop campaigns from calling people about fundraising or voting intentions."], "qwen2.5:1.5b": ["Labour, Conservatives, and Lib Dems are questioning their ability to follow strict EU privacy regulations when calling voters ahead of an election, citing the Telephone Preference Service (TPS) bans on marketing calls.", "The Liberal Democrats have asked for clarification from the Information Commissioner's Office regarding the legality of such calls.", "Calls that don't involve soliciting votes or recording individuals' voting intentions are allowed under TPS guidelines but could still be considered illegal by some watchdogs due to a \"grey area.\""], "qwen2.5:3b": ["Labour and Conservatives continue making \"cold calls\" despite millions having signed up to avoid such contacts, with Labour stating they do not consider asking about voting intentions as marketing.", "The Lib Dems argue these calls breach rules, supported by the Information Commissioner's Office which states such calls could be considered unsolicited marketing if parties use data for future information.", "Calls are permitted under EU directives and used extensively by all three major parties in election preparation.", "The TPS lists still apply to political contacts; Labour avoids calls on those lists but allows voter identification inquiries, while Conservatives maintain they follow the rules.", "The Information Commissioner's Office acknowledges grey areas and potential complaints could lead to investigations.", "Lib Dem chairman Matthew Taylor urges swift action for swift guidelines, suggesting a need for clearer regulations."], "opencoder:1.5b": ["Campaign 'cold calls' questioned, Labour and the Conservatives are still telephoning the millions of people who have signed up to make sure they do not get marketing \"cold calls\".", "The information commissioner's office says surveys are allowed but there is a \"grey\" area if personal data is kept.", "But seven million telephone numbers are on the TPS lists, which ban unsolicited sales and marketing calls from Telephone Preference Service (TPS) lists.", "A Labour Party spokesman told the BBC News website the party avoided those on TPS lists when telephoning people about membership or fundraising.", "The rules on marketing calls apply as much to politicians as to private sector companies.", "But that does not mean Labour and the Tories are not calling people signed up to the TPS.", "A Labour Party spokesman said the party always asked people if they would be happy to be contacted again and if they said no, they were not rung again.", "The party strolled away when it rang TPS subscribers as agreed.", "A Conservativewoman at the Information Commissioner's Office added: \"We do apply TPS but in line with the law.", "We would not do things that are not allowed in the law.\"", "A spokesman for the Information Commissioner's Office said it would be classed as marketing if political parties telephoned people to encourage them to vote for them.", "The watchdog has now written to the Direct Marketing Association, backed by EU directives on privacy and electronic communications.", "However, there was a \"grey\" area if voting preferences are recorded to be used for marketing information in the future.", "The last speaker made: \"If someone complained, then we would investigate that.", "Political parties are aware of the regulations.", "At the last by-elections, we reminded them.\"", "The Lib Dem chairman has written an email requesting new guidelines to ensure all parties can act in a manner similar to TPS numbers when they urge those people to vote for them.", "Lib Dems argue there should be new guidelines so that all parties can act in the same way if the watchdog believes the rules allow political parties to ring TPS numbers about voting intentions and later urge those people to vote for them.", "It is hoped this will help regulate the telephone call system and prevent unsolicited marketing calls from being used by political parties."], "smollm:1.7b": ["The campaign 'cold calls' questioned Labour and the Conservatives' ability to stick to the rules by ensuring that their calls are not marketing - for instance, by asking about people's voting intentions.", "The parties say they can stop calling people who have signed up to make sure they do not get marketing \"cold calls\".", "The Telephone Preference Service (TPS) is a EU-backed scheme that bans unsolicited sales and marketing calls.", "Both the Labour Party and the Conservatives are banned from telephoning people on TPS lists, which ban unsolicited sales and marketing calls.", "But that does not mean Labour and the Tories are not calling people signed up to the TPS about membership or fundraising.", "A Labour Party spokesman told the BBC News website that the party avoided those on TPS lists when telephoning people about membership or fundraising.", "But that did not happen for \"voter identification\" calls.", "\"When we ask which party they will vote for, that is not marketing and we have very clear legal advice that it is not,\" he said.", "The Labour Party spokeswoman said the party always asked people if they would be happy to be contacted again and if they said no, they were not called again.", "A Conservative spokeswoman said the party stuck to the rules when it rang TPS subscribers.", "She said: \"We do apply TPS but in line with the law.", "We would not do things that are not allowed in the law.\"", "A spokesman for the Information Commissioner's Office said it would be classed as marketing if political parties telephoned people about their voting intentions if they recorded them only as part of a bigger set of statistics, not person by person.", "\"If a political party was doing that than it may be that also would not be marketing,\" he said.", "The spokesman added: \"If someone complained, then we would investigate that.\"", "The spokesman told the commissioner that there were significant numbers of such calls from local Lib Dem parties around the country.", "He argues that new guidelines should be introduced so all parties can act in the same way if the watchdog believes the rules allow parties to ring TPS numbers about voting intentions and later urge those people to vote for them."], "deepseek-r1:1.5b": ["The Labour and Conservative parties are refusing \"cold calls\" from the Lib Dems.", "They are using the Telephone Preference Service (TPS) lists to send marketing calls, but the Lib Dems aim to block these attempts.", "The TPS prohibits unsolicited sales and marketing emails, yet they remain in use for promoting political candidates' voting intentions.", "The Lib Dems threaten to stop calls involving voters, while Labour's spokesman advises that the call on voter identification doesn't fall under marketing as it concerns election-related contact.", "The Lib Dems plan to block all marketing calls through TPS numbers."], "tinyllama:1.1b": ["The Labor and Conservative parties are still calling millions of sign-up recipients, but they have been asked not to make marketing calls, as per the rules.", "The parties argue that their calls should be considered as \"vote-tapping\", but the Information Commissioner's Office (ICO) believes this is not a marketing call due to the grey area of TPS and poll data gathering.", "The ICO has received complaints from Lib Dem chairman Matthew Taylor, who wrote to the watchdog to request a remedy in case of marketing calls being made."], "tinydolphin:1.1b": [" The summary provided is focused on answering the given question, which asks why telephone campaigns by the Labour and Conservatives are still being made.", "It discusses the UK's policies regarding telephone marketing and mentions that calls from political parties are currently not allowed by the TPS.", "It also touches upon the use of the Telephone Preference Service (TPS) for such calls, along with other EU directives on privacy and electronic communications.", "Overall, it conveys a clear message about why calls from political parties may still be made despite the TPS ban."], "phi:2.7b": [" Labour and Conservative parties are still making \"cold calls\" even though they have not been signed up on the Telephone Preference Service (TPS) lists.", "The Lib Dems have asked for the watchdog to stop the calls because they believe it is illegal for political parties to call TPS subscribers about their voting intentions.", "However, both the Labour and Conservative parties claim to be following the rules by asking whether people are happy to receive future marketing materials.", "The Information Commissioner's Office (ICO) says that surveys are allowed but there is a \"grey area\" if personal data is kept, and the use of telephone call centres will likely increase for all three major political parties in the run-up to the general election.", "However, seven million telephone numbers are on the TPS lists which ban unsolicited sales and marketing calls.", "The rules on marketing calls apply to both politicians and private sector companies, but it does not mean Labour and Conservative parties are not calling people who have signed up for the TPS.", "A Labour Party spokesman says they avoided those on the TPS list when calling about membership or fundraising, but that did happen for \"voter identification\" calls.", "The spokesperson also said they always asked whether people wanted to be contacted again and if they declined, they were not called back.", "On the other hand, a Conservative spokeswoman claims they stuck to the rules by telephoning TPS subscribers.", "She says they applied the TPS but followed the law.", "A spokesman for the ICO says political parties are allowed to telephone TPS subscribers about their voting intentions as long as they record them only for statistical purposes and not person-by-person.", "However, if a political party did this with the intent of marketing information in the future, then it would be considered marketing, according to the spokesperson.", "The spokesman says there is no \"yes or no\" answer and that the area is \"pretty grey\".", "If someone complained, then they would investigate the matter because political parties are aware of the regulations.", "At the last by-elections, the ICO reminded them about the rules.", "A Lib Dem chairman has now written to the watchdog asking for action to stop these calls, as evidence from local Lib Dem parties suggests there are \"significant\" numbers of such calls.", "The Chairman also argues that all political parties should act in the same way if the TPS regulator believes they can call TPS subscribers about voting intentions and urge them to vote for their party."], "orca-mini:3b": [" The text questions the legality of \"cold calling\" by political parties during the upcoming general election, which is against the Telephone Preference Service (TPS) rules.", "Both Labour and the Conservatives are accused of breaking these rules by telephoning people signed up to TPS lists without their permission.", "However, the Information Commissioner's Office says surveys are allowed but there is a \"grey\" area if personal data is kept.", "The parties claim they stick to the rules by ensuring their calls are not marketing, for example by asking about people's voting intentions.", "The Lib Dems ask the watchdog overseeing the rules to stop the calls and are worried that telephone call centres will be used as never before by all three major parties in the run-up to the general election."], "hermes3:3b": ["Labour and Conservatives questioning legal cold calls to voters signed up to the Telephone Preference Service (TPS), despite some calls about voter identification being deemed not marketing.", "The grey area arises when recording personal data with future marketing intent."], "stablelm-zephyr:3b": ["Labour and Conservatives still make phone calls to millions of people who signed up to avoid marketing \"cold calls\", claiming their calls about voting intentions do not constitute marketing.", "The Lib Dems are asking the Information Commissioner's Office to stop these calls, citing a grey area if personal data is kept.", "Seven million telephone numbers are on the Telephone Preference Service list, which bans unsolicited sales and marketing calls.", "Labour says it asks people if they would be happy to be contacted again if they say no, while the Conservatives say they stick to the rules when calling TPS subscribers.", "The Information Commissioner's Office defines political parties phoning about voting intentions as potential unsolicited marketing if they record preferences for future use."], "stablelm2:1.6b": ["Labour, Conservatives, and Lib Dems are making \"cold calls\" to ensure millions of people who have signed up aren H ere is a summary: Labour and Conservative Party continue to make \"cold calls\" but avoid contacting people on TPS lists (i.e., the Telephone Preference Service) that ban unsolicited sales and marketing calls.", "EU directives are followed in both schemes.", "Both political parties face scrutiny for such activities, particularly when it comes to voter identification.", "While polling organizations can contact people about voting intentions if they record it as part of a bigger set of statistics, no explicit legal advice exists on this matter.", "The Information Commissioner's Office has expressed concerns over possible marketing if the party records voting preferences with the intention of marketing information in the future.", "In response, Liberal Democrat (Lib Dem) chairman Matthew Taylor has written to the watchdog urging swift action to end these calls and proposing new guidelines for all parties if it's allowed under the rules."], "granite3.1-dense:2b": ["Political parties, including Labour, Conservatives, and Liberal Democrats (Lib Dems), are engaging in telephone calls to individuals on their respective \"cold call\" lists, which prohibit unsolicited sales and marketing.", "These calls primarily aim to gather voting intentions or confirm membership/fundraising status.", "Both Labour and the Conservatives assert they comply with regulations by not classifying such interactions as marketing when asked about voting preferences.", "However, the Lib Dems argue these calls are illegal under the Telephone Preference Service (TPS) rules, citing evidence of widespread practice among their party branches.", "The Information Commissioner's Office acknowledges a \"grey\" area in these calls, potentially classifying them as marketing if parties record voting preferences with future marketing intentions.", "Lib Dems' chairman has written to the watchdog requesting clear guidelines to prevent such practices."], "chatgpt-4o-latest": ["Labour and the Conservatives continue to call people registered with the Telephone Preference Service (TPS), which is meant to block unsolicited marketing calls.", "They argue that asking about voting intentions does not constitute marketing.", "The Liberal Democrats have asked the Information Commissioner's Office to stop these calls, citing previous advice that they are illegal.", "The watchdog acknowledges a \"grey area\" in the rules, allowing polling but restricting personal data retention for marketing.", "Labour and the Conservatives claim compliance, but concerns remain about potential misuse.", "The Lib Dems seek clearer guidelines to ensure all parties follow the same rules."]}