{"raw_text": "McConnell in 'drunk' remark row\n \n Scotland's first minister has told a group of high school pupils that it is okay to get drunk \"once in a while\".\n \n Jack McConnell was speaking to more than 100 secondary pupils from schools in the Highlands about the problems of binge drinking and drink promotions. He has been criticised by the SNP for encouraging young people to get drunk. But the Scottish Executive has insisted Mr McConnell was speaking about adults and his comments were \"a recognition that people will get drunk\". The first minister's comments came in a question and answer session at Glenurquhart High School in Inverness, attended by pupils from a number of secondary schools. A Highland councillor who was at the event has also defended Mr McConnell. Margaret Davidson, the independent member for the Loch Ness West, said the first minister was speaking in a very general way and she was sure he was speaking about adults at the time.\n \n When one pupil asked Mr McConnell how the executive proposed to tackle under-age drinking, began his response with the quip: \"I'm sure there's no under-age drinking in the Highlands.\" He went on to speak about the evils of binge drinking and railed against irresponsible drinks promotions. He said: \"I hope I'm not going to be seen as preaching to anybody here but the really serious problem at the moment is binge drinking and the impact it has on people's health and their ability to control what's happening round about them.\" Mr McConnell said he regularly saw reports on the effects of binge drinking sprees which ended in assaults or even rapes, and on the health consequences of binge drinking. \"The one thing we are going to do something really serious about is binge drinking and irresponsible drinks promotions that can help lead to that,\" he said. \"Far too many pub chains in particular are selling far too much booze far too cheaply and encouraging people to drink it far too quickly. \"We are go to clamp down on that and make those promotions illegal in the hope that people can enjoy a drink sensibly over the course of an evening.\"\n \n He added: \"By all means get drunk once in a while - but do not get into a situation where people are being encouraged to get completely incapable just to save some money and drink more quickly.\" SNP Holyrood leader Nicola Sturgeon said: \"This is an incredible gaffe by Jack McConnell. \"We all know that under-age drinking is an issue in Scotland but it is quite staggering that any politician, particularly the First Minister, should encourage young people to get drunk. \"The first minister should withdraw these remarks immediately.\" But an executive spokeswoman insisted Mr McConnell had made the remark with adults, not youngsters, in mind. \"He was talking in the context of adults binge drinking and irresponsible drinks promotions - which are for the over-18s,\" she said. \"It was just a recognition that people will get drunk, but that binge drinking and drinks promotions that encourage it are not acceptable.\"\n", "llama3.2:1b": ["Jack McConnell, Scotland's first minister, spoke to high school pupils about problems with binge drinking and drink promotions in the Highlands.", "He acknowledged that some young people may get drunk occasionally but said he was speaking about adults who regularly engage in binge drinking and irresponsible drink promotions.", "McConnell expressed concerns about the impact of binge drinking on health and ability to control drinking.", "The Scottish Executive defended McConnell's comments, saying they were \"a recognition that people will get drunk\" among adults, while independent councillor Margaret Davidson disputed this interpretation, stating McConnell was discussing adult issues."], "llama3.2:3b": ["Jack McConnell has been criticized by the SNP for saying it's okay to get drunk \"once in a while\", in a question and answer session with high school pupils about problems of binge drinking and drink promotions.", "He was speaking about adults, but his comments were misinterpreted as encouraging young people to drink."], "gemma2:2b": ["Scotland's first minister, Jack McConnell, told a group of high school pupils that it is okay to get drunk occasionally, sparking criticism from the SNP who saw this as encouraging underage drinking.", "McConnell defended his comments stating they were about adults and focused on tackling binge drinking and irresponsible promotions.", "He explained the negative health effects of binge drinking and plans to restrict alcohol sales for under-18s.", "The Scottish Executive insists McConnell was speaking about adults in the context of responsible drinking and is committed to reducing underage drinking by banning illegal drinks promotions aimed at youth."], "qwen2.5:0.5b": ["First Minister Jack McConnell criticized the SNP for encouraging young people to get drunk.", "He acknowledged that this could be problematic, but insisted he meant adults rather than teenagers.", "The Scottish Executive has defended Mr. McConnell's comments, stating that the first minister was speaking about adults and his remarks were a recognition of the problems caused by binge drinking and drink promotions.", "A Highland councillor at the event defended Mr. McConnell in her own words."], "qwen2.5:1.5b": ["Scotland's first minister Jack McConnell encouraged high school students about getting drunk occasionally during a speech on young people's alcohol consumption issues.", "His comments were criticized by the SNP for promoting underage drinking and he was defended by a Highland councillor who believed his remarks referred to adults.", "McConnell expressed concerns over binge drinking, responsible promotion of alcoholic beverages, and plans to tighten regulations on irresponsible promotions."], "qwen2.5:3b": ["Scotland's First Minister Jack McConnell made controversial comments suggesting young people should occasionally drink excessively, prompting criticism from SNP members.", "He defended his remarks as addressing adults discussing problems of binge drinking and irresponsible promotions for over-18s.", "McConnell spoke at a Q&A session with school pupils in Inverness about underage drinking issues.", "The Scottish Executive insists the comments were not aimed at young people but rather at older drinkers, leading to criticism from SNP leader Nicola Sturgeon who called it an \"incredible gaffe.\""], "opencoder:1.5b": ["\"McConnell's remark is advocating for the prevention of under-age drinking in the Highlands.", "He has promoted illegal drink promotion through irresponsible practices and advocates for banning alcohol as a means to control what's happening around them.", "Mr McConnell's remarks, while general, were specifically aimed at promoting awareness and prevention of such incidents.", "As it stands, this is an important issue that needs to be addressed to ensure the well-being of people in this increasingly digital world.\""], "smollm:1.7b": ["The first minister's remark about getting drunk once in a while is an example of a general statement that can be summarized as follows:\n\n\"I'm sure there's no under-age drinking in the Highlands.\""], "deepseek-r1:1.5b": ["Jack McConnell spoke at a high school event, criticizing Scotland for promoting irresponsible drinks and encouraging young people to get drunk.", "He argued that under-age drinking is not an issue in Scotland but called politicians and first ministers like Nicola Sturgeon onto their feet, claiming such behavior is unethical.", "The minister emphasized the impact of alcohol on health and well-being and proposed stricter laws against irresponsible promotions."], "tinyllama:1.1b": ["The passage above is a summary of an article on the Scottish First Minister's remarks at a high school.", "The text only contains key ideas and details, such as the specific issue discussed, the politician's comments regarding adults and binge drink promotions, as well as a response from the executive.", "It should be used for reference purposes and without explanation or interpretation of the reasoning process."], "tinydolphin:1.1b": [" First Minister of Scotland, Jack McConnell, made a comment during a question and answer session at Glenurquhart High School in Inverness that was interpreted as encouraging young people to get drunk.", "The criticism comes from the Scottish Executive, which has called for a restoration of independence for the first minister.", "However, an executive spokeswoman insisted that Mr McConnell's comments were not meant for youngsters and were intended for adults.", "McConnell's comments come amidst a debate on under-age drinking in Scotland and the impact of promotions from pub chains."], "phi:2.7b": [" Jack McConnell, Scotland's first minister, acknowledged that getting drunk occasionally is okay but criticized binge drinking and irresponsible drink promotions as serious problems.", "He also spoke about the negative impacts of binge drinking, such as assaults and health consequences.", "The Scottish Executive defended his comments, saying he was speaking to adults and the remarks were made in a general way.", "However, the SNP and some council members criticized his quip about under-age drinking being non-existent in Scotland.", "Mr. McConnell plans to clamp down on binge drinking and make irresponsible drink promotions illegal."], "orca-mini:3b": [" Scotland's first minister Jack McConnell advised high school pupils to get drunk once in a while during a question and answer session at Glenurquhart High School in Inverness.", "He spoke about the problems of under-age drinking and irresponsible drinks promotions, and railed against unsupervised drinks promotions which can lead to assaults or rapes."], "hermes3:3b": ["Jack McConnell criticized for saying it's okay to get drunk 'once in a while' to pupils on binge drinking and under-age drinking issues."], "stablelm-zephyr:3b": ["Scotland's first minister, Jack McConnell, told high school students that it's okay to drink alcohol \"once in a while.\"", "He spoke at Glenurquhart High School about the problems of excessive drinking and drink promotions.", "Critics accused him of encouraging young people to get drunk, but the Scottish Executive said he was speaking about adults and his comments were about recognizing that people may consume alcohol.", "First Minister Margaret Davidson defended McConnell's remarks, stating they were general and related to adult binge drinking and irresponsible promotion of alcohol.", "SNP Holyrood leader Nicola Sturgeon called it an \"incredible gaffe\" and demanded the withdrawal of the remarks."], "chatgpt-4o-latest": ["Scotland's First Minister, Jack McConnell, told high school pupils that it is okay to get drunk \"once in a while,\" sparking criticism from the SNP for allegedly encouraging youth drinking.", "Speaking at a school event in Inverness, McConnell addressed the dangers of binge drinking and irresponsible drink promotions, emphasizing their negative health and social consequences.", "He criticized pub chains for selling alcohol too cheaply and promoting excessive drinking.", "While SNP leader Nicola Sturgeon condemned his remarks, calling for a retraction, the Scottish Executive defended McConnell, stating he was referring to adults, not young people, and merely acknowledging that drinking happens while condemning binge drinking.", "A Highland councillor also supported McConnell, asserting he spoke in a general context about adult drinking."], "stablelm2:1.6b": ["Scotland's first minister, Jack McConnell, spoke to high school pupils about the problems of binge drinking and drink promotions during a Q&A session at Glenurquhart High School in Inverness.", "While he has been criticized by the SNP for encouraging young people to get drunk, the Scottish Executive argues that he was speaking about adults and his comments were \"a recognition that people will get drunk.\"", "McConnell spoke against binge drinking and irresponsible drinks promotions and suggested making those promotions illegal to encourage sensible drinking over an evening.", "The SNP leader Nicola Sturgeon criticized McConnell's remarks as staggering encouragement for young people to get drunk, but the Scottish Executive insists he was speaking in a general way about adults."], "granite3.1-dense:2b": ["Scotland's first minister, Jack McConnell, faced criticism for suggesting it's okay to get drunk \"once in a while\" during a conversation with high school pupils at Glenurquhart High School.", "The remarks were made in a question-and-answer session on the issue of binge drinking and irresponsible drinks promotions.", "McConnell emphasized the harm caused by excessive alcohol consumption, including health risks and potential for violence.", "However, he was criticized by the SNP's Nicola Sturgeon for endorsing underage drinking.", "The Scottish Executive defended McConnell, stating his comments were directed at adults and acknowledged that people would get drunk, but disapproved of binge drinking and irresponsible promotions targeting minors."]}