{"raw_text": "Brown hits back in Blair rift row\n \n Gordon Brown has criticised a union leader who said conflict between himself and Tony Blair was harming the workings of government.\n \n Jonathan Baume, of the top civil servants' union, spoke of \"competing agendas\" between Mr Brown and Mr Blair. But the chancellor said Mr Baume was never at meetings between himself and the prime minister so could not judge. He said the union leader was trying to block civil service reform which threatened his members' jobs. It suited the purpose of Mr Baume's union, the First Division Association, to suggest there were two agendas battling against each other because the union was trying to resist the planned reforms, Mr Brown told BBC Radio 4's Today programme.\n \n Under the plans, unveiled in the Gershon report, some 84,000 civil servants jobs will be axed or changed and the savings ploughed back into frontline services. Mr Brown said: \"To be honest I don't think you can rely on his [Mr Baume's] judgement on this matter when it comes to the decisions that the government are making. \"Mr Blair and I are making exactly the same decisions on civil service reforms. We are determined to go on with the Gershon reforms.\" He also said that as Mr Baume was never present at meetings between himself and the prime minister, he was not in a position to judge. On Wednesday, ahead of the Chancellor's pre-Budget report, Mr Baume told BBC News there were sometimes \"conflicting and competing agendas for government\" between Number 10 and the Treasury.\n \n What the chancellor wanted was \"not by any means what Alan Milburn and the prime minister want to see\", Mr Baume said. \"Government departments get their money from the Treasury on the basis of public service agreements they sign up to, but at the same time the prime minister also has an agenda and that's not necessarily the same as the Treasury's and the prime minister is of course a very powerful figure in any government. \"He also sends instructions and messages and directions to departments about how he would like each secretary of state and each department to implement a policy agenda. \"The problem is that on many occasions these two don't add up and individual cabinet ministers as well as departments have to make sense of this battle.\" Number 10 said ministers were interested in governing and not a \"soap opera\" about Mr Blair and Mr Brown. Tory shadow chancellor Oliver Letwin said: \"The battle Royal that the top civil servants are now reporting on between the chancellor and Tony Blair is preventing them both from getting on with the business of getting taxpayers value for money.\"\n", "llama3.2:1b": ["Gordon Brown has criticized union leader Jonathan Baume, who accused the government of conflicting agendas between himself and Prime Minister Tony Blair.", "The chancellor said Baume was unable to judge due to being present only at specific meetings, while also stating that Blair and he are making similar decisions on civil service reforms."], "llama3.2:3b": ["Gordon Brown criticized Jonathan Baume, a union leader, over comments about conflict between himself and Tony Blair.", "Brown said Baume was out of touch as he never attended meetings with Blair and that the union's motive was to resist civil service reforms which threatened their jobs."], "gemma2:2b": ["Gordon Brown criticized Jonathan Baume, head of a union representing civil servants, who claimed there were competing agendas between him and Tony Blair regarding civil service reform.", "Brown countered that Baume was never present at meetings between himself and Blair and therefore lacked expertise to judge the government's decisions.", "He argued that both he and Blair shared the same goal of implementing reforms outlined in the Gershon report, while noting that Baume's union opposed these changes."], "qwen2.5:0.5b": ["Brown says he will not give in to Blair's demands but wants him to work it through."], "qwen2.5:1.5b": ["Gordon Brown criticized a union leader who accused him of damaging government operations by arguing over reforms, saying he lacks judgment due to not being present at meetings.", "The civil servants' union leader also claimed the two leaders have different agendas and said they are making the same decisions on reforms but disagree with them.", "Brown believes there is a conflict between White House and Treasury's agenda, which results in conflicting policies."], "qwen2.5:3b": ["Gordon Brown criticized Jonathan Baume, a union leader who claimed conflict existed between him and Tony Blair.", "Brown stated he had never attended meetings where such disagreements occurred and that civil service reforms planned by the Gershon report would proceed despite any perceived internal conflicts.", "In response, Baume argued there were competing agendas within government between different departments.", "Letwin of the Tories called this rift impeding effective governance."], "opencoder:1.5b": ["Brown hits back in Blair rift row.", "Gordon Brown has criticized a union leader who said conflict between himself and Tony Blair was harming the workings of government.", "Jonathan Baume, of the top civil servants' union, spoke of competing agendas between Mr Brown and Mr Blair.", "But the chancellor said Mr Baume was never at meetings between himself and the prime minister so could not judge.", "He suggested there were two agendas battling against each other because the union tried to resist the planned reforms, Mr Brown told BBC Radio 4's Today programme.", "Under the plans unveiled in the Gershon report, some 84,000 civil servants jobs will be axed or changed and the savings ploughed back into frontline services.", "Mr Brown said: \"To be honest I don't think you can rely on his judgement on this matter when it comes to the decisions that the government are making.\"", "Mr Blair and I are making exactly the same decisions on civil service reforms, we are determined to go on with the Gershon reforms.", "He also told BBC News there were sometimes \"conflicting and competing agendas for government\" between Number 10 and the Treasury.", "What the chancellor wanted was not by any means what Alan Milburn and the prime minister want to see, Mr Baume said.", "The problem is that on many occasions these two don't add up and individual cabinet ministers as well as departments have to make sense of this battle."], "smollm:1.7b": ["Brown hits back in Blair rift row\nGordon Brown has criticized a union leader who said conflict between himself and Tony Blair was harming the workings of government.", "Jonathan Baume, of the top civil servants' union, spoke of \"competing agendas\" between Mr Brown and Mr Blair.", "But the chancellor said Mr Baume was never at meetings between himself and the prime minister so could not judge.", "He said the union leader was trying to block civil service reform which threatened his members' jobs.", "It suited the purpose of Mr Baume's union, the First Division Association, to suggest there were two agendas battling against each other because the union was trying to resist the planned reforms, Mr Brown told BBC Radio 4's Today programme.", "Under the plans, unveiled in the Gershon report, some 84,000 civil servants jobs will be axed or changed and the savings ploughed back into frontline services.", "Mr Brown said: \"To be honest I don't think you can rely on his [Mr Baume's] judgement on this matter when it comes to the decisions that the government are making.", "\"Mr Blair and I are making exactly the same decisions on civil service reforms.", "We are determined to go on with the Gershon reforms.\"", "He also said that as Mr Baume was never present at meetings between himself and the prime minister, he was not in a position to judge.", "On Wednesday, ahead of the Chancellor's pre-Budget report, Mr Baume told BBC News there were sometimes \"conflicting and competing agendas for government\" between Number 10 and the Treasury.", "What the chancellor wanted was \"not by any means what Alan Milburn and the prime minister want to see\", Mr Baume said.", "\"Government departments get their money from the Treasury on the basis of public service agreements they sign up to, but at the same time the prime minister also has an agenda and that's not necessarily the same as the Treasury's and the prime minister is of course a very powerful figure in any government.\"", "He also sent instructions and messages and directions to departments about how he would like each secretary of state and each department to implement a policy agenda.", "The problem is that on many occasions these two don't add up and individual cabinet ministers as well as departments have to make sense of this battle.", "The chancellor said the battle royal between Mr Brown and Mr Blair was preventing them both from getting on with the business of getting taxpayers value for money.", "Tory shadow chancellor Oliver Letwin said: \"The battle Royal that the top civil servants are now reporting on between the chancellor and Tony Blair is preventing them both from getting taxpayers value for money.\"", "Mr Baume's criticism of Mr Brown was seen as a personal attack by some, but others welcomed his honesty.", "The union leader said he had been unfairly maligned and accused of being \"a bit of a doormat\" for the chancellor.", "He said: \"I think it would be unfair to say that I have been unfairly maligned.", "I've always tried to work with the chancellor, but there are times when we can't agree on what is best for the public purse.\""], "deepseek-r1:1.5b": ["Brown criticized a union leader for conflicting with Blair over government operations.", "The top civil servants' union member mentioned competing agendas between Brown and Blair but couldn't judge meetings.", "The government planned job cuts and savings from Gershon reforms, but its decisions were uncertain due to Brown's judgment uncertainty.", "Blair and himself agreed on reforms but faced challenges in reconciling their perspectives with the bottom line."], "tinyllama:1.1b": ["The article summarizes Gordon Brown's criticism of a union leader who accused him of attempting to impede his government's plans for civil service reform, which would involve the axing or change of some 84,000 jobs.", "The chancelloor questioned the Prime Minister's intentions and claimed that the two have different agendas battling against each other.", "Brown said that he didn't rely on his colleague's judgment when it came to making decisions related to the reform plan, and stated that Mr Baume was not present during meetings between himself and the Prime Minister regarding the Gershon report.", "The chaNCellor claimed that Mr Blair and he were both interested in governance and needed clarification from ministers about the conflicting agendas."], "tinydolphin:1.1b": [" In a dispute over government reforms, Brown criticises union leader Baume.", "According to Mr. Brown, there's no reason for Baume to be at meetings between himself and Tony Blair as they have conflicting agendas.", "Jonathan Baume of the top civil servants' union is said to have been at those meetings, but Brown claims that he cannot judge whether their discussions were about competing or conflicting agendas."], "phi:2.7b": [" The text summarizes a conflict between Gordon Brown, the Chancellor, and Jonathan Baume, the leader of the top civil servants' union.", "Baume claims that there are competing agendas between him and Prime Minister Tony Blair which is affecting government operations.", "However, Brown disputes this claim and says that he trusts his judgement as he has not been present at meetings with the prime minister.", "He accuses the union of opposing reforms to cut jobs in the civil service for its own benefit.", "The text concludes by stating that there was no soap opera between the Chancellor and the Prime Minister, but rather a battle for control over government operations."], "orca-mini:3b": [" Brown criticizes union leader over Blair rift row"], "hermes3:3b": ["G Brown criticizes union leader Baume over conflict between himself & Tony Blair, claiming Baume opposes civil service reform for political gain.", "Brown argues Gershon report's reforms are same for both Treasury & Number 10, aiming to save jobs in civil services."], "stablelm-zephyr:3b": ["Gordon Brown responded to a criticism by Jonathan Baume, a union leader who claimed that conflicts between himself and Tony Blair were harming the government's functioning, by saying that Mr. Baume was not present at meetings where these decisions were made.", "Mr. Brown emphasized that both he and Mr. Blair are pursuing civil service reforms under the Gershon report, which aims to cut or change 84,000 civil servant jobs and invest savings back into frontline services.", "He argued that relying on Mr. Baume's judgment would not be trustworthy as he was trying to block the planned reforms.", "The issue highlighted the potential conflicts between the Treasury and Number 10 agendas in government."], "chatgpt-4o-latest": ["Gordon Brown dismissed claims by union leader Jonathan Baume that tensions between him and Tony Blair were disrupting government operations.", "Baume, representing top civil servants, suggested there were \"competing agendas\" between the Treasury and Number 10, but Brown argued Baume was not present at key meetings and was opposing civil service reforms to protect union jobs.", "The reforms, outlined in the Gershon report, aim to cut or restructure 84,000 civil service jobs to redirect savings into frontline services.", "Brown insisted he and Blair were aligned on these reforms.", "Baume had earlier stated that conflicting directives from the Treasury and the prime minister created challenges for government departments.", "Downing Street dismissed the issue as political drama, while Tory shadow chancellor Oliver Letwin claimed the reported conflict was hindering effective governance."], "stablelm2:1.6b": ["Chancellor Brown criticized union leader Jonathan Baume's comments about conflicting agendas between himself and Prime Minister Tony Blair, stating that Baume couldn \"t judge\" their meetings due to his lack of attendance.", "Baume suggested there were two opposing agendas in resisting civil service reform.", "However, Brown insisted they are making the same decisions on reforms and won't back down.", "The Gershon report plans to cut jobs and invest the savings in frontline services.", "Critics argue this could block government progress on reform."], "granite3.1-dense:2b": ["Gordon Brown has responded to criticism from union leader Jonathan Baume, who suggested a rift between him and then-Prime Minister Tony Blair was harming government operations.", "Brown dismissed Baume's claims, arguing that the union leader wasn't present at crucial meetings and thus couldn't accurately judge their decisions.", "Instead, Brown asserted that he and Blair were in agreement on civil service reforms, which aim to reduce 84,000 jobs and redirect savings into frontline services.", "Baume previously stated that there were conflicting agendas between Number 10 (Blair's office) and the Treasury, emphasizing that the prime minister's policy directions sometimes clashed with those of the Treasury and individual cabinet ministers.", "The government dismissed these claims as a \"soap opera,\" stating they were focused on delivering value for taxpayers' money rather than internal politics.", "Tory shadow chancellor Oliver Letwin echoed this, criticizing the perceived conflict as impeding effective governance and budget management."]}