{"raw_text": "Tories 'would cut number of MPs'\n \n The Conservative Party would cut the number of MPs by about one-fifth if they were elected, Tory leader Michael Howard has said.\n \n The plan forms part of the party's \"smaller government bill\", to be unveiled later this week. Mr Howard told the Sunday Times the party would also reduce the number of government special advisers. And he said a referendum would be held in Wales to decide whether or not to scrap the Welsh Assembly.\n \n The changes would all take place within five years of the Conservatives winning a general election, Mr Howard told the paper.\n \n The precise number of MPs to go would depend on the result of the Welsh referendum, but it would probably mean a reduction of around 120 from the current total of 659. If Wales decided to keep its assembly it would stand to lose more MPs. Mr Howard said as both parties planned to cut the number of civil servants at Whitehall - Labour by more than 80,000 and the Tories by almost 100,000 - they should accept a similar drop in their own numbers. \"It is all very well saying government departments should be reduced, but what about ministers, Parliament and special advisers?\" he said. Shadow leader of the Commons Oliver Heald said: \"This will be part of our aim to reduce unnecessary and costly interference in people's lives by reducing the size and role of the State\".\n \n Mr Howard said the plan would also even out the \"great unfairness\" of there being proportionately more Scottish and Welsh MPs at Westminster than those from England. The average size of an English constituency was 70,000 people, Mr Howard said. In Northern Ireland it was just over 66,000, in Wales just over 59,000 and in Scotland 53,000. The number of Welsh MPs would be set at an amount that was \"consistent and fair in terms of representation with the rest of the United Kingdom\" if the assembly was scrapped. Mr Howard said the changes should be carried out quickly and could even be implemented by the election after next. \"You have got to have a big bang. We don't want this like the House of Lords reform, getting to one stage and then not having the next stage.\"\n", "llama3.2:1b": ["The Conservative Party plans to cut the number of MPs by 20% in five years if elected, reducing the total from 659 to around 549.", "If Wales decides not to keep its assembly, it would lose more MPs, with around 120 fewer.", "The party aims to reduce civil servants at Whitehall and Parliament equally, but is exempt from this plan due to their role as government departments."], "llama3.2:3b": ["The Conservative Party plans to cut the number of MPs by about one-fifth if elected, as part of their \"smaller government bill\", potentially reducing around 120 seats.", "This would be decided in a Welsh referendum, with a possible reduction depending on the outcome.", "The party also aims to reduce government special advisers and has set a goal to downsize civil servants at Whitehall."], "gemma2:2b": ["The Conservative Party plans to cut the number of MPs by about 1/5 if elected, as part of their \"smaller government\" bill.", "A referendum in Wales on abolishing the Welsh Assembly is also proposed.", "The changes would occur within five years of a general election victory.", "MPs could potentially decrease by around 120 if Wales decides to keep the Assembly, depending on the result of the referendum.", "To achieve this reform and reduce the size of government, they propose reducing the number of civil servants in both Labour and Conservative parties.", "Mr. Howard aims for immediate implementation of these changes after a general election."], "qwen2.5:0.5b": ["Cabinet reshuffle would cut 120 MPs from the Conservative Party, according to Mr. Howard.", "The Tories plan to keep UK-wide civil servants but will reduce their own number by about half.", "The changes are part of \"smaller government bill\" and will be achieved in five years if the Conservatives win an election."], "qwen2.5:1.5b": ["Tories propose cutting MPs by 20-25% if elected, including Welsh referendum on assembly and reducing civil servants at Whitehall."], "qwen2.5:3b": ["Tory leader Michael Howard proposes cutting the number of MPs by about one-fifth if his party wins an election.", "This includes reducing the number of government special advisers and holding a referendum on whether to scrap the Welsh Assembly.", "The changes would lead to a reduction of around 120 from the current total of 659 MPs, with Wales potentially losing more if it keeps its assembly.", "Howard aims to reduce the size of government departments proportionally and argues for proportional representation adjustments based on constituency sizes across different regions.", "He suggests these reforms could be implemented quickly, possibly even before the election after next."], "opencoder:1.5b": ["The Conservatives would cut the number of MPs by about one-fifth if they were elected.", "The party would reduce the number of government special advisers as well, considering a referendum in Wales to decide whether or not to scrap the Welsh Assembly.", "They will all take part in reducing unnecessary and costly interference in people's lives.", "The plan forms part of their \"smaller government bill\".", "The changes would all occur within five years, and it depends on the result of the Welsh referendum."], "smollm:1.7b": ["The Conservative Party would cut the number of MPs by about one-fifth if they were elected, according to Tory leader Michael Howard.", "The plan forms part of the party's \"smaller government bill\", which is expected to be unveiled later this week.", "Mr Howard told the Sunday Times that the party would also reduce the number of government special advisers and hold a referendum in Wales on whether or not to scrap the Welsh Assembly.", "The precise number of MPs to go would depend on the result of the Welsh referendum, but it would probably mean a reduction of around 120 from the current total of 659.", "If Wales decided to keep its assembly it would stand to lose more MPs.", "Mr Howard said as both parties plan to cut the number of civil servants at Whitehall - Labour by more than 80,000 and the Tories by almost 100,000 - they should accept a similar drop in their own numbers.", "\"It is all very well saying government departments should be reduced, but what about ministers, Parliament and special advisers?\"", "he said.", "Shadow leader of the Commons Oliver Heald said: \"This will be part of our aim to reduce unnecessary and costly interference in people's lives by reducing the size and role of the State\".", "Mr Howard said the plan would also even out the \"great unfairness\" of there being proportionately more Scottish and Welsh MPs at Westminster than those from England.", "The average number of MPs was 70,000 in Scotland, 66,000 in Wales and 59,000 in Northern Ireland.", "The number of Welsh MPs would be set at an amount that is \"consistent and fair\" in terms of representation with the rest of the United Kingdom if the assembly were scrapped.", "Mr Howard said the changes should be carried out quickly and could even be implemented by the election after next.", "\"You have got to have a big bang,\" he told the Sunday Times.", "\"We don't want this like the House of Lords reform, getting to one stage and not having the next stage.\""], "deepseek-r1:1.5b": ["The Conservative Party plans to cut the number of MPs by about one-fifth if elected, led by Michael Howard, according to the text.", "This change forms part of their \"smaller government bill\" to be unveiled later this week.", "Mr Howard mentioned reducing the number of government special advisers and a referendum on whether to scrap the Welsh Assembly.", "The changes will occur within five years after the Conservative Party wins a general election.", "The reduction is expected to bring down around 120 MPs, with exact figures depending on the Welsh referendum outcome.", "The party aims to reduce civil servants across all sectors, including government departments, ministers, and special advisers.", "They aim for similar reductions in their own sectors as other parties plan, focusing on equalizing representation in Westminster with the rest of the United Kingdom."], "tinyllama:1.1b": ["Conservative Party leader Michael Howard has said that they plan to reduce the number of MPs in Parliament by about one-fifth within five years of a general election.", "The changes will take place in Wales if there is a referendum on scrapping the Welsh Assembly, which could result in a reduction of around 120 MPs.", "The Conservatives believe that this would align the size of constituencies with the rest of the United Kingdom and ensure fair representation for the people of Wales.", "The plan will also even out the unequal number of seats in England, Scotland, and Wales by reducing the number of MPs from each region proportionately.", "The average size of an English constituency is around 70,000, while that of a Welsh or Scottish one can be as high as 59,000 or 66,000 respectively."], "tinydolphin:1.1b": [" Tories would cut number of MPs by about one-fifth if they were elected, according to UK Conservative Party leader Michael Howard.", "In a plan for smaller government and fewer civil servants, Mr. Howard said that the Tories would reduce the number of government special advisers.", "Welsh voters will also have a say in whether to scrap the Welsh Assembly.", "With these changes, the Conservatives aim to reduce the size of Parliament from 659 MPs to 120 by 2015.", "This could potentially save £3 billion over the next five years, according to Mr. Howard."], "phi:2.7b": [" The Conservative Party plans to reduce the number of MPs by 20%, as well as cutting special advisers and holding a referendum in Wales.", "This would lead to an average constituency size of 70,000 people, while Scotland has fewer than 60,000 constituents per MP."], "orca-mini:3b": [" The Conservative Party plans to reduce the number of MPs by about 15% if they win a general election.", "This would mean a reduction of around 120 from the current total of 659.", "If Wales decides to keep its assembly, the party would lose more MPs.", "Michael Howard told the Sunday Times that the plan formed part of their \"smaller government bill\" to be unveiled later this week.", "The party wants to reduce unnecessary and costly interference in people's lives by reducing the size and role of the State.", "Mr Howard also said the plan should be carried out quickly and could be implemented by the election after next."], "hermes3:3b": ["Conservatives plan to reduce MPs by 1/5 if elected, according to Tory leader Michael Howard.", "This forms part of 'smaller government bill', which includes reducing special advisers and cutting civil servants' numbers."], "stablelm-zephyr:3b": ["Tory leader Michael Howard has stated that if the Conservative Party were to be elected, they would cut the number of MPs by around one-fifth within five years.", "These changes are part of their \"smaller government bill\" and include reducing the number of government special advisers, as well as a potential referendum in Wales to determine the future of the Welsh Assembly.", "The reduction in MPs would depend on the outcome of this Welsh referendum, but is expected to result in a decrease of around 120 from the current total of 659.", "This plan aims to reduce the size and role of the state and even out the disproportionate representation of MPs from different regions."], "chatgpt-4o-latest": ["The Conservative Party, led by Michael Howard, plans to cut the number of MPs by about one-fifth if elected, as part of a \"smaller government bill.\"", "The proposal includes reducing government special advisers and holding a referendum in Wales on whether to abolish the Welsh Assembly.", "The number of MPs cut would depend on the referendum outcome, with a likely reduction of around 120 from the current 659.", "Howard argues that as both major parties plan to cut civil servants, they should also reduce MPs, ministers, and advisers.", "The plan aims to address the disproportionate representation of Scottish and Welsh MPs compared to English MPs.", "If the Welsh Assembly is abolished, Welsh MP numbers would be adjusted for fairness.", "Howard insists the changes should be implemented swiftly, avoiding delays like those seen in House of Lords reform."], "stablelm2:1.6b": ["The Conservative Party plans to cut around 1/5 of MPs if elected, reducing the number of government special advisers as part of their \"smaller government bill\".", "A referendum in Wales will decide whether to scrap the Welsh Assembly.", "The precise reduction would depend on the result of the referendum; if Wales decides to keep its assembly, it could lose more MPs.", "This plan aims to reduce unnecessary and costly interference by reducing the size and role of the state and balancing the number of Scottish, Welsh, and English MPs at Westminster.", "The changes are expected to be implemented within five years of winning a general election."], "granite3.1-dense:2b": ["Tory leader Michael Howard has proposed a \"smaller government bill\" for the Conservative Party, which includes reducing the number of MPs by about one-fifth (120) within five years if elected.", "This reduction would also impact government special advisers and could affect Welsh representation, as a referendum on the Welsh Assembly's status is planned.", "The plan aims to address the disparity in constituency sizes across the UK, with England's average being 70,000 people, while Scotland (53,000), Wales (59,000), and Northern Ireland (66,000) have larger representation.", "Howard argues that this change would reflect a fairer distribution of parliamentary representation.", "Labour's shadow leader of the Commons, Oliver Heald, supports the initiative as part of reducing unnecessary state intervention in people's lives and aligning ministerial numbers with departmental reductions.", "The Tories aim to implement these changes promptly, ideally by the next general election."]}