{"raw_text": "UK plan to deport terror suspects\n \n Deals are being sought to allow the UK to deport terror suspects to their home countries without risk of them being tortured or sentenced to death.\n \n Home Secretary Charles Clarke told the Times he hoped agreement with several countries could be reached. The move follows a Law Lords judgement that the detention of 12 men at Belmarsh prison, London, and Woodhill, Milton Keynes, was unlawful. The 12 affected by the ruling are from Algeria, Tunisia, Egypt and Jordan. The government was told that using anti-terror legislation brought in after 11 September to hold the men indefinitely without charge broke human rights laws.\n \n Mr Clarke told The Times: \"I think we should be prosecuting much more energetically our ability to deport the individuals concerned to the countries from which they come.\" He said it was a route that was being pursued in collaboration with Foreign Secretary Jack Straw \"in a very positive way\". Mr Clarke said that he was seeking \"memorandums of understanding\" between overseas governments and Britain to ensure suspects would not be subjected to the death penalty on their return. However, he added: \"I do not think the solution to the Law Lords' judgement for this government is in deportations, but they will help. \"There are other strands that we have to do.\" But the Liberal Democrat's shadow home secretary, Mark Oaten, accused Mr Clarke of avoiding the main issue with the Belmarsh detainees.\n \n \"The critical issue that the home secretary is dodging at this stage is to deal with the very principle, to deal with how we tackle this problem in the future,\" he told BBC News. \"And I do want him to grasp those issues and that means looking at how we can actually secure convictions in this country allowing, for example, intercept communications, telephone tapping to be included,\" Mr Oaten said. \"Deportation may tackle this initial problem but I want to see a wider debate urgently about how we can actually get trials and convictions in this country.\" \"Unless we get that, the Liberal Democrats will vote against this measure when it comes for renewal in March.\"\n \n The BBC's home affairs correspondent, Daniel Sandford, said it appeared Mr Clarke was putting more emphasis on the possibility of deportation than his predecessor, David Blunkett. But he said reaching an understanding with some of the detainees' home countries could be difficult. \"Some of these people are accused of very, very serious crimes in their home countries so it's not an easy agreement to get and I think for some of these suspects it won't be the solution.\" Daniel Sandford said ministers may try to put forward other solutions - such as allowing more secret evidence to be put into normal criminal trials or developing a more secret trials process - in the next few weeks. \"The government may try and deport some of them and then those that are left see if they can work out some way of putting them on trial,\" he said.\n", "llama3.2:1b": ["UK plans to deport terror suspects without risk of torture or death, with agreements sought to be reached with several countries including Algeria, Tunisia, Egypt, and Jordan.", "The government is seeking memorandums of understanding between overseas governments and Britain to ensure that suspects would not face the death penalty on their return.", "However, Home Secretary Charles Clarke has acknowledged that deportation may only address the initial problem and that a wider debate is needed on how to secure convictions in the UK.", "Mark Oaten, Liberal Democrat's shadow home secretary, calls for the government to address the underlying issues including securing convictions and intercepting communications."], "llama3.2:3b": ["UK Home Secretary Charles Clarke seeks deal to allow deportation of terror suspects from their home countries without risk of torture or death penalty, following Law Lords ruling that detention of 12 men was unlawful; Liberal Democrat's Mark Oaten opposes plan, arguing for wider debate on securing convictions in the UK."], "gemma2:2b": ["The UK government plans to deport terror suspects to their home countries, seeking agreements with nations to ensure they won't face torture or execution upon return.", "This follows a Law Lords ruling deeming indefinite detention unlawful and breaking human rights laws.", "While deportation is considered beneficial, the plan may be part of broader solutions addressing the issue.", "The government aims for memorandums of understanding with foreign governments to avoid these problems when suspects are returned.", "Some political parties, however, criticize the government's focus on deportation alone and argue that more attention should be paid to securing convictions in UK trials using methods like intercepting communications and telephone tapping."], "qwen2.5:0.5b": ["UK plans to deport terror suspects from Belmarsh prison, but not for long-term use.", "Foreign Secretary Jack Straw hopes a deal can be reached with many countries.", "Mr Clarke: \"We should prosecute more energetically to deport these people.\"", "The Lib Dems want to deal with how to secure convictions in the UK."], "qwen2.5:1.5b": ["The UK is seeking agreements with foreign governments to allow suspected terrorists to be deported without risk of torture or execution, following a High Court ruling over 12 individuals held at the Belmarsh prison and Woodhill.", "The Home Secretary hopes these arrangements can help deal with the Law Lords' decision to stop indefinite detention under anti-terrorism laws.", "However, some critics argue this is merely a temporary fix and do not address the root cause of terrorism."], "qwen2.5:3b": ["UK aims to deport terror suspects without risk of torture or death penalty by seeking deals with several countries.", "This follows a Law Lords ruling invalidating their detention at Belmarsh prison.", "Home Secretary Charles Clarke seeks memorandums of understanding for deportation, while Liberal Democrat shadow home secretary Mark Oaten criticizes deportation as not addressing broader legal issues such as interception evidence and trial security.", "Some deportations may be possible but other solutions are sought including secret trials or evidence processes."], "opencoder:1.5b": ["The UK plans to deport terrorist suspects, with the goal of allowing it to continue without risk for them being tortured or released from jail.", "The move was made due to a Law Lords judgement that a series of illegal detents were upheld against 12 members of Belmarsh prison in London and Woodhill, Milton Keynes.", "The affected are from countries including Egypt, Tunisia, and Jordan.", "The government has been told that any attempt at imprisonment could lead to serious consequences if not properly investigated.", "It was the government's intention to use anti-terror legislation intended to keep the suspects indefinitely without charge that broke human rights laws in a bid to secure suspects for future trials.", "Home Secretary Charles Clarke, who has spoken publicly about this move, has advocated a more proactive approach to deter potential fugitives and sought memorandums of understanding between overseas governments.", "He noted that Mr Oaten has accused Mr Clarke of avoiding the main issue with the Belmarsh detainees, adding that it is noteworthy for addressing these issues in future investigations."], "smollm:1.7b": ["Summarizing the text, we get:\n\n\"Deals are being sought to allow the UK to deport terror suspects from their home countries without risk of them being tortured or sentenced to death.\"", "This summary preserves key ideas and details while omitting unnecessary information.", "The main points covered in this summary include:\n\n1.", "Deals are being sought to allow the UK to deport terror suspects from their home countries without risk of them being tortured or sentenced to death.", "2.", "Home Secretary Charles Clarke told the Times he hoped agreement with several countries could be reached.", "3.", "The move follows a Law Lords judgment that the detention of 12 men at Belmarsh prison, London, and Woodhill, Milton Keynes, was unlawful.", "4.", "The UK is seeking to deport the 12 terror suspects from their home countries without risk of them being tortured or sentenced to death.", "5.", "Mr Clarke told the Times he hopes agreement with overseas governments will help secure convictions in this country allowing for the deportation of the 12 terrorists.", "6.", "However, the critical issue that the home secretary is dodging at this stage is to deal with the very principle, to deal with how we tackle this problem in the future.", "7.", "Unless we get that, the Liberal Democrats will vote against this measure when it comes for renewal in March."], "deepseek-r1:1.5b": ["The UK plans to deport terror suspects from their current countries to home nations without immediate legal consequences.", "A judgment in London allowed indefinite detention of 12 men but faced ongoing issues.", "The Prime Minister (Charles Clarke) seeks collaboration with Foreign Secretary Jack Straw to expedite the process, emphasizing \"memorandums of understanding\" for returns and ensuring legal safeguards.", "Shadow Home Secretary Mark Oaten criticized focusing on physical actions, calling trial processes crucial.", "BBC's Daniel Sandford compared Clarke's approach to David Blunkett, noting a shift in emphasis but suggesting other solutions might be needed."], "tinyllama:1.1b": ["The UK plans to deploy deportation measures to deport terror suspects from Belmarsh prison, as well as their detained relatives who have been held in Woodhill prison and Milton Keynes Central prison.", "Home Secretary Charles Clark has promised a review of the detainment of 12 individuals after a ruling that they were unlawfully detained, with the government seeking to pursue deportation as a route to curb terrorism.", "However, Liberal Democrat shadow home secretary Mark Oaten claims that the UK can tackle the problem in future by including intercept communication and telephone tapping in conviction-seeking measures.", "Ministers may try to reach agreements with several countries regarding deportation, but they will face difficulties in reaching a solution for some suspects who have been accused of serious crime in their home countries.", "The government is considering other solutions such as offering secret evidence or developing a more secret trial process in the coming weeks."], "tinydolphin:1.1b": [" The Home Secretary, Charles Clarke, has announced that plans to deport terror suspects from the UK to their home countries without risking their torture or death have received support from several governments.", "This move comes after a recent ruling by the Law Lords that deemed the detention of 12 men at Belmarsh prison and Woodhill, Milton Keynes, unlawful.", "The 12 affected by the ruling are from Algeria, Tunisia, Egypt, and Jordan.", "However, the Home Secretary has emphasized his desire to seek memorandums of understanding with other countries in order to ensure the safety of suspects who will be deported.", "This approach aims to resolve the issue with the Law Lords' judgement for this government.", "British Prime Minister Tony Blair has also expressed his support for the plan, stating that it is a \"revolutionary\" step that should not lead to the execution of detainees in future."], "phi:2.7b": [" The UK is seeking ways to deport terror suspects to their home countries without risk of torture or death.", "Home Secretary Charles Clarke hopes agreements with several countries will be reached, following a ruling by the Law Lords that detention of 12 men at Belmarsh prison was unlawful.", "Mr Clarke wants to use anti-terror legislation brought in after 11 September to prosecute more energetically and is seeking memorandums of understanding between overseas governments and Britain to ensure suspects won't face the death penalty on their return.", "However, the Liberal Democrats' shadow home secretary accuses him of avoiding the main issue by not dealing with how to secure convictions in the future, and argues that unless this happens, they will vote against the measure when it comes up for renewal."], "orca-mini:3b": [" The UK plans to deport terror suspects to their home countries without risk of torture or capital punishment.", "Home Secretary Charles Clarke seeks memorandums of understanding with foreign governments to ensure suspects are not subjected to the death penalty upon return.", "However, Liberal Democrat shadow home secretary Mark Oaten accuses Clarke of avoiding the main issue with the Belmarsh detainees.", "It appears that Clarke is putting more emphasis on deportation than his predecessor, David Blunkett.", "Ministers may try to put forward other solutions, such as allowing more secret evidence to be put into normal criminal trials or developing a more secret trial process, in the next few weeks."], "hermes3:3b": ["UK plans to deport terror suspects without risk of torture, aiming for memorandums of understanding with home countries to avoid death penalty."], "stablelm-zephyr:3b": ["The UK is seeking deals to allow deportation of terror suspects to their home countries without risk of being tortured or sentenced to death.", "Home Secretary Charles Clarke hopes to reach agreements with several countries, following a Law Lords' judgement that the detention of 12 men at Belmarsh prison and Woodhill detention center was unlawful.", "The affected individuals are from Algeria, Tunisia, Egypt, and Jordan.", "Liberal Democrat's shadow home secretary, Mark Oaten, calls for a wider debate on securing convictions in the UK."], "chatgpt-4o-latest": ["The UK government is seeking agreements with several countries to deport terror suspects without risking torture or the death penalty.", "Home Secretary Charles Clarke emphasized the importance of deportation but acknowledged it was not the sole solution to a Law Lords ruling that deemed the indefinite detention of 12 men under anti-terror laws unlawful.", "Clarke is working with Foreign Secretary Jack Straw to secure \"memorandums of understanding\" with the suspects' home countries.", "However, Liberal Democrat shadow home secretary Mark Oaten criticized Clarke for not addressing broader issues, such as securing convictions in the UK.", "BBC correspondent Daniel Sandford noted that reaching agreements with some countries could be difficult and suggested the government might explore other solutions, including secret trials or using more secret evidence in criminal cases.", "Ministers may attempt deportations while also considering alternative legal measures."], "stablelm2:1.6b": ["The UK is seeking deals with several countries to allow the deportation of terror suspects without risk of torture or death sentences upon their return.", "Home Secretary Charles Clarke hopes for agreement to be reached, following a Law Lords' judgement that the detention of men at Belmarsh and Woodhill prisons was unlawful due to using anti-terror legislation after September 2001.", "He aims to establish \"memorandums of understanding\" between overseas governments and Britain to ensure no one is subjected to death penalty upon return.", "However, shadow home secretary Mark Oaten accuses Clarke of avoiding the main issue and concentrating on deportation.", "Some of the detainees' home countries may be difficult for an agreement due to serious charges in their country.", "The government may try alternative methods such as secret trials or allowing more secret evidence in normal criminal trials to address the issue."], "granite3.1-dense:2b": ["The UK Home Secretary, Charles Clarke, aims to secure deals with multiple countries for the deportation of 12 terror suspects from Algeria, Tunisia, Egypt, and Jordan.", "These individuals were previously detained without charge due to anti-terror legislation, deemed unlawful by a Law Lords' ruling.", "Clarke emphasizes deportation as a means to address the issue, collaborating with Foreign Secretary Jack Straw.", "However, Liberal Democrat shadow home secretary Mark Oaten criticizes this approach, arguing that it overlooks the need for securing trials and convictions in the UK.", "Oaten suggests focusing on methods like intercepting communications and phone tapping to obtain evidence.", "The government is considering alternative solutions, such as allowing more secret evidence in regular criminal trials or developing a separate trial process, should deportation prove challenging for some suspects due to their alleged serious crimes in their home countries."]}