{"raw_text": "Minimum rate for foster parents\n \n Foster carers are to be guaranteed a minimum allowance to help cover their costs, the government has announced.\n \n Payment levels vary from area to area, with some carers getting just £50 a week for clothes, food and other costs. Minister for Children, Young People and Families Margaret Hodge said new plans will ensure fosterers' allowances would be as fair as possible. However local authorities, which set and pay the allowances, are concerned about how the extra cash will be found. About 50,000 children live with foster families in the UK and carers have said they need more money to make ends meet.\n \n Ms Hodge said: \"Foster carers must not be out of pocket when meeting the costs of caring for a looked after child - a crucial role in society. \"We need to make sure that arrangements for paying foster carers are as fair and transparent as possible. \"Our proposal for a national minimum rate shows we are serious about creating a better deal for foster carers and about encouraging more people to come forward and consider fostering as a worthwhile and rewarding opportunity.\" The government is seeking to amend the Children Bill, which passes through the Commons next week, to establish a national minimum payment.\n \n Fostering Network executive director Robert Tapsfield criticised the existing system. \"There is just no logic to a system which values children differently depending on where they live. \"And with a shortage of over 8,000 foster carers in England, it's not a sustainable situation to expect carers to fund foster care from their own pockets.\" The charity recommends a weekly payment of £108.49 for looking after a baby. In a survey, it discovered that rates paid by neighbouring authorities could vary by as much as £100 per week.\n \n The Association of Directors of Social Services (ADSS) said it agreed in principle with the government's plans. Tony Hunter, the organisation's president, said: \"There are many devils and lots of details hidden within the Government's proposals. \"But ADSS fully supports proper remuneration for valued foster carers and looks forward to working with ministers, local government and the fostering organisations themselves in order to make sure a sensible and practicable policy emerges.\"\n", "llama3.2:1b": ["Foster parents in the UK will receive a minimum allowance of £50 per week to cover their costs.", "The government plans to establish this minimum rate through a national amendment to the Children Bill.", "Foster carers are worried about how the extra funding will be found, with some local authorities concerned it may impact the amount they can pay."], "llama3.2:3b": ["Government proposes national minimum payment for foster carers to ensure they can cover costs; existing system varies by area and has been criticized for being unsustainable; charity recommends weekly payment of £108.49 for looking after a baby; 50,000 children live with foster families in the UK; amendment to Children Bill aimed at establishing fairer arrangements."], "gemma2:2b": ["The UK government is introducing a national minimum allowance for foster parents to ensure they are not out of pocket while caring for children.", "Local authorities will determine the specific payment levels, but the government plans to amend the Children Bill to establish a national minimum rate.", "The Fostering Network supports a weekly payment of £108.49 for baby care and advocates for consistent rates across areas.", "The Association of Directors of Social Services agrees in principle with the government's plan and is ready to work with relevant stakeholders to develop a workable policy."], "qwen2.5:0.5b": ["Foster parents need a minimum allowance of £50 per week to cover their costs.", "To ensure fairness, new plans have been announced that will guarantee this allowance for foster carers.", "However, some local authorities are concerned about how the extra cash would be found and there is currently 50, 000 children in the UK who live with foster families.", "Robert Tapsfield from the Foster Network executive director said there is no logical way to value children differently based on where they come from.", "Without enough foster carers to meet their needs, it's not a sustainable situation for some foster carers to fund foster care from their own pockets.", "The Association of Directors of Social Services (ADSS) agreed in principle with the government's plans and said they support proper remuneration for valued foster carers."], "qwen2.5:1.5b": ["The UK government has announced a minimum rate of £108.49 per week for foster parents, aiming to provide fair compensation for care costs and encourage more people to consider fostering as a rewarding opportunity.", "However, concerns exist about funding the additional cash needed due to local authorities setting different allowance levels."], "qwen2.5:3b": ["Foster carers are to be guaranteed a minimum allowance by the government to cover their costs.", "Currently, some receive just £50 a week for essentials like clothes, food, and other expenses.", "Minister Margaret Hodge aims for fair allowances despite local authorities' concerns about funding.", "About 50,000 children live with foster families in the UK, where carers need more money to meet needs.", "A national minimum rate is proposed to address this issue; fostering Network suggests a weekly payment of £108.49 for looking after a baby.", "The Association of Directors of Social Services supports proper compensation for foster carers while acknowledging that details remain to be addressed."], "opencoder:1.5b": ["Minimum rate for foster parents is an important issue related to care provided by foster carers.", "The government has announced plans to ensure fairness in foster allowances, aiming to cover the costs of caring for children.", "Foster carers are required to pay a minimal amount each week to help cover their costs and meet set delivery obligations.", "The government's proposal outlines a weekly payment of $108.49 for looking after a baby, while rates paid by neighbouring authorities could vary by up to $100 per week.", "The Association of Directors of Social Services (ADSS) agrees with the government's plans, and Tony Hunter, the organisation's president, supports this policy."], "smollm:1.7b": ["The summary is concise and objective, preserving key ideas and details from the original text while omitting unnecessary information.", "The main points are:\n\n1.", "Foster carers will receive a minimum allowance to help cover their costs.", "2.", "Payment levels vary by local authority, with some carers getting just £50 per week for clothes, food, and other expenses.", "3.", "Minister for Children, Young People and Families Margaret Hodge announced new plans to ensure foster carers' allowances would be as fair as possible.", "4.", "Local authorities will need to find ways to pay the additional money needed to support foster carers.", "5.", "About 50,000 children live with foster carers in the UK and carer's costs are a crucial part of their welfare.", "6.", "The government is seeking to amend the Children Bill to establish a national minimum rate for foster carers.", "7.", "Fostering Network executive director Robert Tapsfield criticized the existing system, saying there is no logic to a system that values children differently depending on where they live and that there are many details hidden within the Government's proposals.", "8.", "The Association of Directors of Social Services (ADSS) supports the government's plans for proper remuneration for valued foster carers and looks forward to working with ministers, local government and the fostering organizations themselves in order to make sure a sensible and practicable policy emerges."], "deepseek-r1:1.5b": ["Foster carers receive a minimum allowance to cover their costs, with payment varying by area.", "New plans aim for fairness but local authorities worry about funding.", "Over 50,000 children have foster families, struggling to meet expenses.", "The UK government is considering an amendment to the Children's Bill to set a national minimum rate.", "Foster Networks' director criticized the current system, which lacks logical location-based values.", "ADSS supports the proposal but ensures proper remuneration for valued carers and plans collaborations with local authorities and fostering groups."], "tinyllama:1.1b": ["The UK government has announced plans to guarantee minimum allowances for foster carers, to help cover their costs.", "The payments vary from area to area, with some carers receiving just £50 per week for clothes, food, and other expenses.", "Local authorities are concerned about how the extra cash will be found, as they currently set and pay the allowances.", "About 50,000 children live with foster families in the UK, and carers have said they need more money to make ends meet.", "The government is seeking to introduce a national minimum payment of £108.49 per week for looking after babies, although rates paid by neighboring authorities can vary up to £100 per week.", "Tony Hunter, the ADSS's president, supports proper remuneration for foster carers and looks forward to working with ministers, local government, and fostering organizations in order to make a \"sensible and practical\" policy emerge."], "tinydolphin:1.1b": [" The proposal from the UK government to create a national minimum rate for foster parents is aimed at encouraging more people to consider fostering as an attractive career option.", "This move aims to improve fairness in the payment system, ensuring that all foster carers receive an equivalent sum of money regardless of their location and the type of care they provide for children in need."], "phi:2.7b": [" The UK government has announced plans to guarantee minimum allowances for foster parents to help cover their costs.", "Payment levels vary by area, but new policies will ensure that fosterers' allowances are as fair as possible.", "However, local authorities are concerned about how the extra cash will be found, given that around 50,000 children live with foster families in the UK.", "The government is seeking to amend the Children Bill to establish a national minimum payment, which has been criticised by fostering network executive director Robert Tapsfield for being inconsistent and unsustainable.", "Meanwhile, the Association of Directors of Social Services (ADSS) supports proper remuneration for foster carers but acknowledges that there are many details and devils hidden within the government's proposals."], "orca-mini:3b": [" The UK government has announced that foster carers will receive a minimum allowance of £50 per week for clothes, food, and other costs.", "This is intended to help cover the costs of caring for looked-after children.", "However, some local authorities have different payment levels, which can vary by up to £100 per week.", "The Fostering Network and Association of Directors of Social Services both support proper remuneration for foster carers."], "hermes3:3b": ["Foster parents guaranteed min $50/week allowance (varies by area); UK gov plans national minimum rate."], "stablelm-zephyr:3b": ["The UK government has announced that foster parents will receive a minimum allowance to cover their costs.", "Payment levels vary by area, with some carers receiving £50 per week for clothing and food.", "Minister for Children, Young People, and Families, Margaret Hodge, stated that the new plans aim to make foster care allowances as fair as possible while ensuring fosterers' financial stability when caring for looked after children.", "The government is seeking to amend the Children Bill to establish a national minimum payment, in response to concerns over a shortage of 8,000 foster carers in England and varying payment rates across different areas.", "The Fostering Network recommends a weekly payment of £108.49 per week for looking after a baby, while the Association of Directors of Social Services (ADSS) supports proper remuneration for valued foster carers and looks forward to working with ministers, local government, and fostering organizations to ensure a practical policy emerges."], "chatgpt-4o-latest": ["The government has announced a guaranteed minimum allowance for foster carers to help cover costs, as current payments vary widely, with some receiving as little as £50 per week.", "Minister Margaret Hodge emphasized the need for fair and transparent payments to support foster carers and encourage more people to foster.", "The government plans to amend the Children Bill to establish a national minimum payment.", "The Fostering Network criticized the current system, highlighting inconsistencies in payments and recommending a minimum of £108.49 per week for a baby.", "The Association of Directors of Social Services supports the proposal in principle but stresses the need for practical implementation."], "stablelm2:1.6b": ["The UK government has announced plans for a minimum allowance payment to help cover costs for foster parents.", "Payment levels vary by area, with some receiving just £1 per week for clothing, food, and other expenses.", "Minister Margaret Hodge emphasized that the new system will ensure fair allowances.", "However, local authorities are concerned about finding the extra funds.", "The proposal aims to establish a national minimum payment in the Children Bill.", "Critics argue that there is no logic in valuing children differently based on their location.", "Fostering Network's Robert Tapsfield suggests a weekly payment of £1 for caring for babies.", "The Association of Directors of Social Services agrees with the government's plans, but emphasizes proper remuneration for valued foster carers and collaboration between ministers, local governments, and fostering organizations."], "granite3.1-dense:2b": ["The UK government has proposed a national minimum rate for foster parents to address current inconsistencies in payments across areas.", "This move aims to ensure that foster carers, who support about 50,000 children nationwide, are not out of pocket when covering care costs.", "Minister Margaret Hodge emphasized the need for fair and transparent payment arrangements.", "Fostering Network's executive director, Robert Tapsfield, called the existing system illogical, citing significant disparities in payments between neighboring authorities, up to £100 per week.", "The Association of Directors of Social Services supports the proposal but acknowledges the need for careful implementation to address all practical aspects."]}