{"raw_text": "Muslim police stops 'more likely'\n \n UK Muslims should accept that people of Islamic appearance are more likely to be stopped and searched by police, a Home Office minister has said.\n \n Hazel Blears said innocent Muslims would be targeted because of the search for Islamic extremists. Qualifications for religious leaders to enter the UK could also be made tougher, she told a Commons inquiry. Her comments have been described as \"irresponsible\" and \"outrageous\" by the Islamic Human Rights Commission (IHRC).\n \n \"The threat is most likely to come from those people associated with an extreme form of Islam, or who are falsely hiding behind Islam,\" the Salford MP told the Commons home affairs committee.\n \n \"It means that some of our counter-terrorism powers will be disproportionately experienced by the Muslim community.\" It was a reality that should be recognised, she said. \"If a threat is from a particular place then our action is going to be targeted at that area,\" she added. On ministers of religions, such as imams, she said faith groups would be asked what other qualifications and skills, such as civic knowledge and ability to engage the community, should be demanded. Last year, ministers introduced a requirement that ministers should speak English to a certain level.\n \n IHRC chairman Massoud Shadjareh accused Ms Blears of \"playing an Islamophobia card\" in the run-up to a general election.\n \n \"She is demonising and alienating our community,\" he said. \"It is a legitimisation for a backlash and for racists to have an onslaught on our community. \"This sort of comment is just music to the ears of racists.\" Later, the prime minister's official spokesman urged people to put Ms Blears' comments into context. The minister had been saying she understood there was a perception that stop and search was aimed at one community, but that was not what was happening, the spokesman said.\n \n \"What is happening is that those powers are aimed at those who are suspected of carrying out or planning certain activity who happen to come from one community. \"It is not aimed at a particular community, it is not police policy to aim these powers at a particular community,\" he added. Statistics showed that of the 17 people found guilty of terrorist acts in the UK since the 11 September attacks, only four of the 12 whose ethnic backgrounds were known were Muslim, he added Figures published last week showed that people from ethnic minorities were increasingly likely to be targeted by police stop and search tactics.\n \n Figures showed that, for 2003/2004, Asians were 1.9 times more likely to be stopped and searched, compared with 1.7 times more likely in the previous year. Separate figures on police searches in England and Wales carried out under the Terrorism Act 2000 showed that ethnic minorities were more likely to be targeted. Muslim groups have repeatedly claimed that their communities are being victimised under terror laws. In 2003/2004, 12.5% searches under the laws were on Asian people, even though they make up 4.7% of the population. Last July, the police were accused of Islamophobia by Muslim groups after stop and search figures showed the numbers of Asians targeted had risen by 300% since the introduction of anti-terror laws.\n", "llama3.2:1b": ["UK Home Office minister Hazel Blears said that Muslim individuals are more likely to be stopped and searched by police due to the search for Islamic extremists.", "This is due to a disproportionate impact on the Muslim community, with some counter-terrorism powers being experienced disproportionately.", "The Muslim Human Rights Commission (IHRC) has criticized Blears' comments as \"irresponsible\" and \"outrageous\"."], "llama3.2:3b": ["UK Home Office minister Hazel Blears says Muslims are more likely to be stopped and searched due to searches for Islamic extremists, while also suggesting tougher qualifications for religious leaders to enter the UK.", "The Islamic Human Rights Commission criticizes her comments as \"irresponsible\" and \"outrageous\", accusing her of playing an Islamophobia card."], "gemma2:2b": ["Home Office minister Hazel Blears stated that people of Islamic appearance are more likely to be stopped and searched by police because of the need to target suspected extremists, leading to disproportionate impact on Muslims.", "Blears advocated for stricter qualifications for religious leaders entering the UK and suggested linking stop and search powers with areas where threats are identified.", "This drew criticism from the IHRC who called it Islamophobic and potentially inciting racist backlash.", "The Prime Minister's official spokesman clarified that police actions are not based on community affiliation, but rather targeting individuals suspected of terrorism.", "Statistics reveal increased police stop and search targeting of ethnic minorities, including Asians."], "qwen2.5:0.5b": ["UK Muslims are more likely to be stopped and searched by police because Islamic extremists are associated with them.", "The Home Office's minister Hazel Blears said that because some Muslim communities may not have been identified as \"Islamic\" they would be targeted by police stop and search tactics.", "In the 2017 counter-terrorism law, ministers will only speak English to a certain level of fluency.", "In contrast, people with faith backgrounds are being asked to show their civic knowledge to demonstrate that they understand how to act in public."], "qwen2.5:1.5b": ["Muslims should accept that police searches are more likely to target them due to their association with extremist Islam or hiding behind it, a Home Office minister has stated in response to claims that stop-and-search practices disproportionately affect Muslim communities.", "This position has been criticized as insensitive and potentially fueling backlash against Muslims."], "qwen2.5:3b": ["UK Muslims should accept that people of Islamic appearance are more likely to be stopped and searched by police for investigating extremists, according to Home Office minister Hazel Blears.", "However, her comments have been criticized as Islamophobic, with the IHRC describing them as irresponsible.", "The MP also suggested tougher qualifications for religious leaders entering the UK.", "The Islamic Human Rights Commission (IHRC) chairman accused Ms Blears of playing an Islamophobia card and legitimizing a backlash against Muslims during election campaigns.", "Last year, ministers required ministers to speak English at certain levels.", "IHRC data showed that only 33% of those guilty of terrorist acts in the UK were Muslim, despite being overrepresented among ethnic minorities targeted by police stop and search tactics.", "Separate figures show Asians are more likely to be searched under terrorism laws compared to their proportion of the population."], "opencoder:1.5b": ["Muslim police stops 'more likely' to people of Islamic appearance.", "UK Muslims should accept that people of Islamic appearance are more likely to be stopped and searched by police, a Home Office minister has said.", "Hazel Blears said innocent Muslims would be targeted because of the search for Islamic extremists.", "She described their comment as \"irresponsible\" and \"outrageous\".", "The Islamic Human Rights Commission (IHRC) was accused of playing an Islamophobia card in the run-up to a general election.", "The threat is most likely to come from those people associated with an extreme form of Islam, or who are falsely hiding behind Islam.", "The Salford MP told the Commons home affairs committee that if a threat is from a particular place, our action is going to be targeted at that area.", "Ministers of religion, such as imams, asked what other qualifications and skills, such as civic knowledge and ability to engage the community, should be demanded.", "They have also introduced a requirement that ministers should speak English to a certain level.", "On the IMDP, Massoud Shadjareh accused Ms Blears of playing an Islamophobia card in the run-up to a general election.", "The prime minister's official spokesman urged people to put Ms Blears' comments into context.", "She understood there was a perception that stop and search tactics were aimed at one community, but that was not what was happening.", "In recent years, statistics showed that of the 17 people found guilty of terrorist acts in the UK since the 11 September attacks, only four of the 12 whose ethnic backgrounds were known were Muslim.", "The IHRC chairman, added, was demonising and alienating our community.", "Racists to have an onslaught on our community.", "It is not aimed at a particular community, it is not police policy to aim these powers at a particular community.", "Figures published last week showed that people from ethnic minorities were increasingly likely to be targeted by police stop and search tactics.", "Separate figures on police searches in England and Wales carried out under the Terrorism Act 2002 showed that ethnic minorities were more likely to be targeted.", "Muslim groups have repeatedly claimed that their communities are being victimised under terror laws.", "The police had been accused of Islamophobia by Muslim groups after recent stop and search figures suggested the numbers of Asians targeted had risen by 300% since the introduction of anti-terror laws."], "smollm:1.7b": ["The summary is:\n\nMuslim police stops 'more likely' to target people from Islamic background due to search for Islamic extremists, Home Office minister says.", "Muslim groups accuse ministers of playing Islamophobia card in response to Ms Blears comments.", "Muslims are more likely to be stopped and searched by police if they have an Islamic background."], "deepseek-r1:1.5b": ["The UK government's policy on domestic terrorism has been criticized for targeting Muslim communities disproportionately.", "Home Office minister Hazel Blears stated that innocent Muslims would be targeted due to a search for extremism.", "She also mentioned tougher qualifications for religious leaders entering the UK, which may have contributed to this issue.", "The Prime Minister's official response echoed her concerns, suggesting police actions are not aimed at a particular community but rather those suspected of carrying out acts.", "Key statistics include that only four out of 12 known ethnic minorities were found guilty of terrorist acts in 2003/2004, with Asian Searches being significantly more likely.", "Separate figures from England and Wales show ethnic minorities being more targeted under the Terrorism Act.", "Muslim groups have claimed targeting their communities is justified by terror laws, with specific statistics showing Asian searches rose by 300% since 2003/2004.", "Summary:\n- UK police stop Muslims more likely due to targeting extremism and religious leaders.", "- Home Office minister emphasizes disproportionately targeting Muslim communities.", "- Key statistics include Asian search rate increase and targeted recruitment of minority groups."], "tinyllama:1.1b": ["The UK's Home Office Minister Hazel Blears has said that innocent Muslims would be targeted because of the search for Islamic extremists, and that qualifications required for religious leaders to enter the country could also be made tougher.", "In a discussion at a Parliamentary inquiry, she was asked about her views on \"more likely\" Muslims being searched by police.", "Blears responded with an impassioned statement that her comments were \"irresponsible and outrageous\", suggesting that innocent Muslims would be targeted because of their appearance or association to Islam.", "However, the IHRC chairman accused Blears of playing Islamophobia by demonising Muslim communities and making them feel insecure about their safety.", "The Home Office minister's comments came after figures published last year showed Asian people were more likely to be stopped than other ethnic groups.", "In 2019, 73% of Asian people stopped under the terror laws went on to be arrested or prosecuted, compared with 65% of white people and 48% of black people.", "The figures highlighted concerns that Muslim communities are being targeted unfairly and accused Blears of playing a \"game of Islamophobia\" in her remarks about Islamic extremism."], "tinydolphin:1.1b": [" The Home Office minister recently stated that British Muslims should accept that people of Islamic appearance are more likely to be stopped and searched by police, as a way of addressing concerns about terrorism.", "This approach has been met with criticism from both sides of the political spectrum, with some arguing that it is counterproductive and may lead to increased profiling and discrimination against Muslim communities.", "The minister also proposed increasing the number of police officers and intelligence agency personnel in these areas.", "The IHRC chairman, Massoud Shadjareh, has criticized this approach for being \"playing Islamophobia\" and alienating British Muslims.", "The prime minister's official spokesman later urged people to put the minister's comments into context, noting that there are concerns about targeted stop-and-search tactics but also that there is a perception that these actions are directed at one community."], "phi:2.7b": [" Home Office minister Hazel Blears has stated that people of Islamic appearance are more likely to be stopped and searched by the police in response to potential threats from Islamic extremists.", "She also suggested that qualifications for religious leaders entering the UK should become tougher.", "The comments have been criticized as irresponsible and outrageous by the Islamic Human Rights Commission (IHRC)."], "orca-mini:3b": [" Muslim police stops 'more likely' in UK, Hazel Blears says innocent Muslims would be targeted because of the search for Islamic extremists.", "Qualifications for religious leaders to enter the UK could also be made tougher, she told a Commons inquiry.", "Her comments have been described as \"irresponsible\" and \"outrageous\" by the Islamic Human Rights Commission (IHRC).", "It is playing an Islamophobia card in the run-up to a general election.", "The minister was saying that innocent Muslims would be targeted."], "hermes3:3b": ["Muslims should accept increased police stops due to higher risk of Islamic extremists, per UK Home Office minister Hazel Blears."], "stablelm-zephyr:3b": ["A UK Home Office minister, Hazel Blears, stated that Muslims may accept that people of Islamic appearance are more likely to be stopped and searched by police due to the search for extremists.", "She also mentioned that qualifications for religious leaders could become tougher, and some counter-terrorism powers would disproportionately impact the Muslim community.", "However, the minister clarified that this was not police policy and that stop and search targets were based on suspicion of activity, not a particular community.", "Figures showed that people from ethnic minorities were increasingly targeted by police stop and search tactics.", "The Islamic Human Rights Commission (IHRC) criticized Blears's comments as \"irresponsible\" and \"outrageous.\""], "chatgpt-4o-latest": ["Home Office minister Hazel Blears stated that UK Muslims should accept that they are more likely to be stopped and searched due to counter-terrorism efforts targeting Islamic extremists.", "She acknowledged that these measures disproportionately affect the Muslim community but argued they are necessary given the nature of the threat.", "She also suggested stricter qualifications for religious leaders entering the UK.", "The Islamic Human Rights Commission (IHRC) condemned her remarks as irresponsible and accused her of fueling Islamophobia.", "The prime minister’s spokesman defended Blears, saying the measures target individuals suspected of terrorism, not entire communities.", "Statistics showed ethnic minorities, particularly Asians, were increasingly subjected to stop and search, with Muslim groups arguing they were being unfairly victimized under anti-terror laws.", "Data revealed a significant rise in searches of Asians since the introduction of such laws, leading to accusations of Islamophobia."], "stablelm2:1.6b": ["UK Home Office minister Hazel Blears suggests that people with Islamic appearance are more likely to be stopped and searched by police, while increasing requirements for religious leaders could target them further.", "Critics have called her comments \"irresponsible\" and \"outrageous.\"", "Police stop and search tactics disproportionately affect the UK Muslim community due to perceived threats from those associated with extreme forms of Islam or falsely hiding behind Islam, according Paliwatch.com."], "granite3.1-dense:2b": ["UK Home Office Minister Hazel Blears asserted that individuals appearing as Muslims are more likely to be stopped and searched due to counter-terrorism efforts aimed at extremists.", "She proposed tightening qualifications for religious leaders, such as imams, requiring them to demonstrate stronger community engagement skills alongside English language proficiency.", "Blears' comments were criticized by the Islamic Human Rights Commission (IHRC) as \"irresponsible\" and \"outrageous,\" accusing her of fueling Islamophobia ahead of a general election.", "The IHRC chairman, Massoud Shadjareh, warned that Blears' words would embolden racists.", "However, the prime minister's spokesperson clarified that stop and search powers are not targeted at Muslims as a community but are applied to those suspected of involvement in terrorism, regardless of ethnicity.", "Statistics showed that, while Asians were 1.9 times more likely to be stopped than the previous year (2003/2004), Muslim individuals accounted for only 4.7% of the population.", "This trend has been a persistent concern for Muslim groups, who argue their communities are disproportionately targeted under anti-terrorism laws."]}