{"raw_text": "'Super union' merger plan touted\n \n Two of Britain's big trade unions could merge to form a \"super union\" of two million members.\n \n The move by Amicus and the Transport and General Workers Union (TGWU) would be a seen as a bid to carry more weight with ministers and employers. Amicus has 1.2 million members and the TGWU has 800,000. Any merger would have to be approved by the unions' executives and their membership. It is understood meetings will be held on Wednesday about the proposal. Along with the GMB and Unison, the TGWU and Amicus worked closely together in the last year to hammer out a 56-point deal with Labour's leadership over equality at work, holidays and pensions - the Warwick Agreement. Both unions are remaining tight-lipped about the merger rumours, but one insider pointed out to the BBC News website that \"nobody is denying suggestions a merger could be on the agenda\" when the two unions' executives hold their meetings on Wednesday. Amicus's executive was due to meet in any case although the TGWU is holding specially scheduled talks.\n", "llama3.2:1b": ["Amicus and the Transport and General Workers Union (TGWU) are considering merging to form a \"super union\" with 2 million members, potentially affecting ministers and employers.", "The merger would be approved by the unions' executives and their membership.", "Meetings on Wednesday have been called to discuss the proposal, alongside other trade unions including GMB and Unison, over an agreement they reached with Labour's leadership."], "llama3.2:3b": ["Two of Britain's biggest trade unions, Amicus and the Transport and General Workers Union (TGWU), are considering a merger that would form a \"super union\" with two million members.", "The move aims to increase their influence over ministers and employers."], "gemma2:2b": ["Amicus and TGWU, two of Britain's largest trade unions, are rumored to be discussing a merger creating a \"super union\" of 2 million members.", "If approved, this would give them increased influence with government officials and employers.", "Meetings between the unions' executives will take place on Wednesday to discuss the proposal."], "qwen2.5:0.5b": ["Two of Britain's big trade unions are working together to form a \"super union,\" with around 2 million members, called the \"super union.\"", "The plan involves merging two organizations that each have about 80, 000 members and will require approval from their executives and members' groups."], "qwen2.5:1.5b": ["Two big British trade union leaders, Amicus and the Transport and General Workers Union (TGWU), are reportedly considering a merger that would create the largest labor union in Britain with 2 million members.", "This move aims to gain more influence over government and employer decisions.", "The plan requires approval from both unions' executives and their membership before it can be implemented.", "Meetings on Wednesday will discuss this proposal, including talks scheduled for the TGWU due to its tight internal structure."], "qwen2.5:3b": ["Two of Britain's major trade unions, Amicus and the Transport and General Workers Union (TGWU), plan a merger to form a \"super union\" with two million members, aiming to gain more influence from both employers and government.", "Amicus has 1.2 million members while TGWU has 800,000.", "The proposed merger must be approved by executive committees and membership.", "Talks about the proposal are set for Wednesday, following collaboration on a 56-point deal with Labour's leadership over workplace equality, holidays, and pensions (Warwick Agreement).", "Despite denial of merger rumors, insiders suggest it may be part of their agenda.", "Amicus' executive meeting is scheduled regardless, while TGWU will hold special talks."], "opencoder:1.5b": ["'Two of Britain's big trade unions could merge to form a \"super union\" of two million members.'", "A merger plan by Amicus and the Transport and General Workers Union (TGWU) was announced, with the expectation that it would be seen as a push to increase weight on ministers and employers.", "The move has been seen as a bid to carry more weight in terms of executive duties.", "Executives from both unions are likely to hold meetings about the proposal.", "The Warwick Agreement, which aims at ensuring equality at work, holidays and pensions, is set to be passed if the merger occurs.", "Both unions remain on the fence about this merger as yet to be confirmed.", "One insider has hinted at a suggestion that a possible merger could occur."], "smollm:1.7b": ["The proposed merger between two of Britain's big trade unions, Amicus and the Transport and General Workers Union (TGWU), would be a significant development in the country's labor market.", "The union with more members, Amicus, has 1.2 million members, while the TGWU has 800,000.", "Any merger would need to be approved by both unions' executives and their membership.", "It is understood that meetings will be held on Wednesday about the proposal.", "Along with the GMB (General Motors) and Unison, the TGWU and Amicus worked closely together in the last year to hammer out a 56-point deal over equality at work, holidays and pensions - the Warwick Agreement.", "Both unions are remaining tight-lipped about the merger rumors, but one insider pointed out that \"nobody is denying suggestions a merger could be on the agenda\" when the two unions' executives hold their meetings on Wednesday.", "Amicus's executive was due to meet in any case although the TGWU is holding specially scheduled talks."], "deepseek-r1:1.5b": ["The two big trade unions in Britain, Amicus and Transport and General Workers Union (TGWU), could potentially merge into a \"super union\" with over 2 million members.", "This merger is seen as strategic to impress ministers and employers.", "The move would aim to strengthen its influence compared to smaller unions like the British Trade Union Group (BGT) and Unison.", "Amicus has around 1.2 million members, while TGWU has approximately 800,000.", "Any merger must be approved by the unions' executives and their membership.", "Meetings are scheduled for Wednesday on the proposal.", "Inside a BBC News article, an insider noted that \"no one is denying suggestions of a merger could be on the agenda,\" despite the unions' tight-lipped approach regarding discussions.", "Summary: Two trade unions in Britain, Amicus and TGWU, could merge into a \"super union\" with 2 million members.", "The proposal aims to strengthen its influence by merging smaller unions into a larger one, likely as a strategic move for better representation.", "Details include Amicus having 1.2 million members, TGWU around 800,000, and meetings on Wednesday.", "An insider noted that suggestions of the merger could be on the agenda despite tight-lipped discussions about it."], "tinyllama:1.1b": ["Merger between Britain's big trade unions is in the works, with the Transport and General Workers Union (TGWU) and Amicus Union joining forces to form a super union of two million members.", "The move has been seen as an attempt to secure greater influence with ministers and employers, while also potentially being approved by both unions' executive meetings on Wednesday.", "However, it is not clear whether any merge will be imminent or if there will be further talks before a decision is made.", "Internal sources within the unions have suggested the move is imminent, but have kept mum about its specifics in the meantime."], "tinydolphin:1.1b": [" A recent proposal by two of Britain's biggest trade unions, Amicus and the Transport and General Workers Union (TGWU), could lead to a potential merger that would result in a union representing over two million members.", "This move comes as both unions are currently working together on a 56-point agreement aimed at improving equality at work, holidays, and pensions for their respective members."], "phi:2.7b": [" Two of Britain's big trade unions, Amicus and Transport and General Workers Union (TGWU), are considering merging to form a \"super union\" of two million members.", "The move would give them more bargaining power with ministers and employers.", "They have already worked together on important issues in the last year, including a 56-point deal with Labour's leadership over equality at work, holidays, and pensions.", "However, no official statements have been made about the merger plan as it requires approval from their executives and membership."], "orca-mini:3b": [" Two of Britain's biggest trade unions, Amicus and the Transport and General Workers Union (TGWU), are considering a merger that would create a \"super union\" with over two million members.", "The move is seen as a way to increase their power and influence in negotiations with employers and government.", "The proposal will be discussed by the unions' executives and their members during meetings scheduled for Wednesday.", "No explanations or reasoning process were provided in the summary output."], "hermes3:3b": ["Britain's big trade unions Amicus, TGWU potentially merging to form \"super union\" of 2m members.", "Needs exec approval; meeting on Wednesday."], "stablelm-zephyr:3b": ["Two British trade unions, Amicus and Transport and General Workers Union (TGWU), are reportedly considering merging to form a \"super union\" with two million members.", "The move aims to carry more weight with ministers and employers.", "Both unions must gain approval from their executives and memberships for the merger to proceed.", "Although they remain tight-lipped about the rumours, insider sources suggest that a potential merger is on the table during executive meetings on Wednesday."], "chatgpt-4o-latest": ["Two of Britain's major trade unions, Amicus and the Transport and General Workers Union (TGWU), are considering a merger to form a \"super union\" with two million members.", "The move aims to increase their influence with ministers and employers.", "Amicus has 1.2 million members, while TGWU has 800,000.", "Any merger would require approval from both unions' executives and members, with meetings scheduled for Wednesday to discuss the proposal.", "Both unions previously collaborated with the GMB and Unison on the Warwick Agreement, addressing workplace equality, holidays, and pensions.", "While neither union has confirmed the merger, insiders suggest it is a likely topic at the upcoming meetings."], "stablelm2:1.6b": ["Britain's big trade unions, Amicus and Transport and General Workers Union (TGWU), are considering a potential merger to form a \"super union\" of two million members.", "The move by these unions could give them more influence with ministers and employers.", "Both organizations have around 1.2 million and 350,0..", "Insiders suggest the two unions may hold meetings on Wednesday to discuss the proposal, although neither has confirmed or denied the rumors.", "Both organizations were part of last year's successful effort to reach a compromise deal called the Warwick Agreement regarding work, holidays, and pensions."], "granite3.1-dense:2b": ["Two prominent British trade unions, Amicus (1.2 million members) and the Transport and General Workers Union (TGWU, 800,000), are reportedly considering a merger to create a \"super union\" with approximately two million members.", "This potential unionization is seen as an attempt to enhance their influence on policymakers and employers.", "The merger proposal, if approved by both unions' executives and memberships, follows close collaboration in forming the Warwick Agreement with Labour on workplace equality, holidays, and pensions.", "Despite rumors, the unions have not officially confirmed or denied the merger discussions.", "Amicus's executive meeting is scheduled for Wednesday, while the TGWU has arranged special talks."]}