{"raw_text": "Blair 'damaged' by Blunkett row\n \n A majority of voters (68%) believe the prime minister has been damaged by the row over David Blunkett's involvement in a visa application, a poll suggests.\n \n But nearly half those surveyed said Mr Blunkett should return to Cabinet if Labour won the next election. Some 63% of respondents in the Sunday Times poll thought his former lover - Kimberly Quinn - acted vindictively and 61% that he had been right to resign. YouGov polled a weighted sample of 1,981 voters online on 16-18 December. Mr Blunkett resigned as Home Secretary on Wednesday after an inquiry uncovered an e-mail showing a visa application by Mrs Quinn's former nanny had been speeded up. Sir Alan Budd's inquiry also found Mr Blunkett's account of events had been wrong. Almost a quarter (21%) of those polled for the Sunday Times said he should return to the Cabinet straight after the election. One in four said he should be back in the Government's top ranks within a year or two while 39% opposed a comeback.\n \n Three-quarters said Mr Blunkett was right to go to court for the right to see Mrs Quinn's son - whom he says he fathered - and just 14% voiced sympathy for Mrs Quinn. A total of 53% of those polled said they had sympathy for Mr Blunkett, with 40% saying they did not. Forty-three per cent thought Mr Blunkett had done a good job as home secretary and 17% disagreed. Meantime, 32% said Mr Blair was a good prime minister and 38% disagreed. A majority, 52%, said Chancellor Gordon Brown had done a good job and just 16% disagreed.\n \n A second poll for the Independent on Sunday found that support for all political parties remained largely unchanged after the Blunkett controversy. Labour lead the Conservatives by 39% to 34% with the Liberal Democrats on 19%. CommunicateResearch interviewed 401 people before David Blunkett's resignation and 601 afterwards. Some 82% said Mr Blunkett had set a good example by wanting to take responsibility for the child he says is his, but 42% backed his legal action compared to 45% who thought it was unbecoming. Thirty per cent said the affair showed Mr Blunkett could not be trusted as a minister while 63%, disagreed.\n", "llama3.2:1b": ["A majority of voters (68%) believe Labour has been damaged by the row over David Blunkett's involvement in a visa application, but nearly half think he should return to Cabinet if Labour wins.", "63% think Mr Blunkett acted vindictively towards Kimberly Quinn, while 61% agree that he was right to resign as Home Secretary.", "Almost 21% of those polled support him returning immediately.", "One in four say they sympathize with Blunkett's position on his son's paternity, and three-quarters do not express sympathy for Blunkett.", "A majority (52%) say Labour has been damaged by the row, while a majority (52%) disagree that Chancellor Gordon Brown did a good job."], "llama3.2:3b": ["A majority of voters (68%) believe Prime Minister Tony Blair has been damaged by David Blunkett's visa application controversy.", "Nearly half want Blunkett to return to Cabinet if Labour wins the next election, with 63% believing Quinn acted vindictively and 61% that Blunkett was right to resign."], "gemma2:2b": ["A majority of voters believe the prime minister has been damaged by the David Blunkett controversy.", "A poll suggests that nearly half of respondents believe Blunkett should return to cabinet if Labour wins the next election.", "Public opinion is divided on his actions, with some supporting his decision to take responsibility for the child he claims fathered, while others disagree.", "The scandal did not significantly change voter preferences or political party support."], "qwen2.5:0.5b": ["A survey of British voters in December revealed that over 80% believe David Blunkett has been damaged by the Bligh issue, with 52% calling him \"right to go\" and 16% disagreeing.", "The poll found support for Blair as prime minister remained unchanged after the Bligh controversy."], "qwen2.5:1.5b": ["Blair damaged by Blunkett row; nearly half want him back in Cabinet after next election, but 21% support going to court for right to see son."], "qwen2.5:3b": ["A majority of voters (68%) believe Prime Minister Blair has been damaged by the David Blunkett visa application row, with nearly half supporting his return to Cabinet if Labour wins next election.", "However, 63% thought Quinn acted vindictively and 61% supported Blunkett's resignation.", "Polls showed that almost a quarter would have him back straight after election, while one in four said he should be in Government within a year or two.", "Support for all parties largely remained unchanged post-controversy with Labour leading Conservatives by 39% to 34%, and Lib Dems on 19%.", "Blunkett's reputation was mixed—52% thought him good as Home Secretary, but 32% supported his legal action against Quinn over paternity."], "opencoder:1.5b": ["Blair 'damaged' by Blunkett row\n\nA majority of voters believe the prime minister has been damaged by the row over David Blunkett's involvement in a visa application, a poll suggests.", "Nearly half those surveyed said Mr Blunkett should return to Cabinet if Labour won the next election.", "Some 63% of respondents in the Sunday Times poll thought his former lover - Kimberly Quinn - acted vindictively and 61% that he had been right to resign.", "YouGov polled a weighted sample of 1,981 voters online on 16-18 December.", "Mr Blunkett resigned as Home Secretary on Wednesday after an inquiry uncovered an e-mail showing a visa application by Mrs Quinn's former nanny had been speeded up.", "Sir Alan Budd's inquiry also found Mr Blunkett's account of events had been wrong.", "Almost a quarter (21%) of those polled for the Sunday Times said he should return to the Cabinet straight after the election.", "Three-quarters said Mr Blunkett was right to go to court for the right to see Mrs Quinn's son - whom he says he fathered - and just 14% voiced sympathy for Mrs Quinn.", "A total of 53% of those polled said they had sympathy for Mr Blunkett, with 40% saying they did not.", "Forty-three per cent of those polled said Mr Blunkett had done a good job as home secretary and 17% disagreed.", "Meantime, 32% said Mr Blair was a good prime minister and 38% disagreed.", "A second poll for the Independent on Sunday found that support for all political parties remained largely unchanged after the Blunkett controversy.", "Labour lead the Conservatives by 39% to 34% with the Liberal Democrats on 19%.", "CommunicateResearchInterviewed 401 people before David Blunkett's resignation and 601 afterwards.", "Some 82% said Mr Blunkett had set a good example by wanting to take responsibility for the child he says is his, but 42% backed his legal action compared to 45% who thought it was unbecoming.", "Thirty per cent said the affair showed Mr Blunkett could not be trusted as a minister while 63%, disagreed."], "smollm:1.7b": ["The summary should include:\n\n1.", "The main idea of the text: Blair 'damaged' by Blunkett row\n2.", "Key points from the text: A majority of voters believe the prime minister has been damaged by the row over David Blunkett's involvement in a visa application, but nearly half say Mr Blunkett should return to Cabinet if Labour wins the next election.", "Some 68% of respondents think Mr Blunkett should return to Cabinet if Labour won the next election.", "3.", "The main idea: But nearly half say Mr Blunkett should return to Cabinet if Labour won the next election.", "YouGov polled a weighted sample of 1,981 voters online on 16-18 December.", "Mr Blunkett resigned as Home Secretary on Wednesday after an inquiry uncovered an e-mail showing a visa application by Mrs Quinn's former nanny had been speeded up.", "Sir Alan Budd's inquiry also found Mr Blunkett's account of events had been wrong.", "4.", "The main idea: Three-quarters say Mr Blunkett was right to go to court for the right to see Mrs Quinn's son - whom he says he fathered - and just 14% voice sympathy for Mr Blunkett.", "A total of 53% of those polled said they had sympathy for Mr Blunkett, with 40% saying they did not.", "5.", "The main idea: Meantime, 32% say Mr Blair was a good prime minister and 38% disagree.", "A majority, 52%, says Labour lead the Conservatives by 39% to 34%.", "CommunicateResearch interviewed 401 people before David Blunkett's resignation and 601 afterwards.", "Some 82% say Mr Blunkett had set a good example by wanting to take responsibility for the child he says is his, but 42% backed his legal action compared to 45% who thought it was unbecoming."], "deepseek-r1:1.5b": ["A majority of voters believe the Prime Minister has been damaged by David Blunkett's involvement in a visa application poll suggests, with nearly half surveyed thinking Mr Blunkett should return to cabinet if Labour wins the next election.", "They also noted that 63% felt his former lover Kimberly Quinn acted vindictively, and 61% thought he was right to resign.", "Another poll from The Sunday Times found 52% in favor of returning to cabinet immediately, with various reasons for support or opposition.", "CommunicateResearch interviews showed public opinion that people support Blunkett's taking responsibility but oppose legal action.", "Blair and the Liberal Democrats lead overall."], "tinyllama:1.1b": ["The majority of voters (68%) believe that David Blunkett's resignation has damaged the prime minister, with nearly half (47%) saying he should return to Cabinet if Labour wins the next election.", "However, only one in four (23%) want him back in his current post immediately, and only 39% support his legal action against Mrs Quinn.", "A total of 53% of those interviewed said they had sympathy for Blunkett, with 40% disagreeing.", "The chancellor Gordon Brown is viewed positively by 52%, while 16% have a negative opinion and only 8% have a mixed view.", "The Labour leader Ed Miliband leads the Conservatives by 39% to 34% with the Liberal Democrats on 19%."], "tinydolphin:1.1b": [" The article discusses public opinion on the damaging allegations between David Blankett and his former lover Kimberly Quinn.", "A majority of voters believe the prime minister, Tony Blair, has been damaged by the Blunkett controversy.", "However, only a small percentage (43%) supports him in re-entering Cabinet.", "Many survey respondents expressed sympathy for Mr. Blankett, with only 17% disagreeing."], "phi:2.7b": [" A majority of voters believe that David Blunkett's involvement in a visa application has damaged him, but nearly half want him back if Labour wins the next election.", "Some think Mrs Quinn acted vindictively and he was right to resign after an inquiry showed his account of events was wrong.", "Three-quarters support his going to court for the right to see his son, while four out of five say he should be in the Cabinet or top government ranks within two years.", "Most people do not sympathize with Mrs Quinn and believe Mr Blunkett has done a good job as home secretary.", "A second poll found that support for all political parties remains largely unchanged after the controversy."], "orca-mini:3b": [" The text reports on a poll that shows a majority of voters believe Prime Minister Tony Blair has been damaged by the David Blunkett row, with some 63% of respondents in a YouGov poll believing his former lover acted vindictively and almost a quarter saying he should return to the Cabinet if Labour wins the next election.", "The text also reports on another poll that found support for all political parties remained largely unchanged after the Blunkett controversy, with some 82% saying Mr Blunkett had set a good example by wanting to take responsibility for the child he says is his, but 42% backing his legal action compared to 45% who thought it was unbecoming."], "hermes3:3b": ["Blunkett row damages majority of voters (68%), believes PM damaged, but some support his return to cabinet if Labour wins next election."], "stablelm-zephyr:3b": ["A poll reveals that 68% of voters believe Prime Minister Tony Blair has been damaged by the row over David Blunkett's involvement in a visa application.", "Nearly half of those surveyed think Blunkett should return to Cabinet if Labour wins the next election, while 63% believed he was right to resign.", "Blunkett resigned after an email revealing a speeded-up visa application by his former lover, Kimberly Quinn, surfaced, and 21% said he should return to the Cabinet straight after the election.", "A majority (53%) of those polled said they had sympathy for Blunkett, while 43% thought he had done a good job as Home Secretary."], "chatgpt-4o-latest": ["A poll suggests that 68% of voters believe Prime Minister Tony Blair was damaged by the controversy over David Blunkett’s involvement in a visa application.", "Blunkett resigned as Home Secretary after an inquiry found his account of events was incorrect and that a visa application for his former lover Kimberly Quinn’s nanny had been expedited.", "Despite this, nearly half of those surveyed supported his return to the Cabinet if Labour won the next election, with 39% opposing a comeback.", "The poll also found that 63% believed Quinn acted vindictively, and 61% agreed with Blunkett’s resignation.", "Additionally, 75% supported his legal battle for access to Quinn’s son, whom he claims to have fathered.", "Public opinion on Blair and Chancellor Gordon Brown was mixed, with 32% viewing Blair as a good prime minister and 52% approving of Brown’s performance.", "A second poll indicated that the controversy had little impact on party support, with Labour maintaining a lead over the Conservatives.", "While 82% approved of Blunkett taking responsibility for the child, opinions were divided on his legal action, and 63% believed the affair did not undermine his trustworthiness as a minister."], "stablelm2:1.6b": ["A majority of voters believe that Prime Minister Tony Blair has been damaged by the row over David Blunkett's involvement in a visa application, according to a poll.", "However, nearly half those surveyed think Blunkett should return to Cabinet if Labour wins the next election.", "Some 2% of respondents in the Sunday Times poll thought Blunkett's former lover, Kimberly Quinn, acted vindictively and 2% that he had been right to resign.", "An online survey by YouGov found that almost a quarter (23%) of those polled for the Sunday Times said he should return to the Cabinet immediately after the election.", "One in four said he should be back in the government's top ranks within a year or two, while 2% opposed a comeback."], "granite3.1-dense:2b": ["A poll indicates that 68% of voters believe Prime Minister Tony Blair has been negatively impacted by the David Blunkett visa application scandal.", "Despite this, 47% support his potential return to the Cabinet if Labour wins the next election.", "The controversy centers around Mr. Blunkett's relationship with Kimberly Quinn, which was found to have influenced a visa application, leading to his resignation as Home Secretary after an inquiry revealed contradictions in his account.", "Key findings include:\n- 63% believe Mrs. Quinn acted vindictively and 61% that Mr. Blunkett should have resigned.", "- 53% of respondents sympathize with Mr. Blunkett, while 40% do not.", "- 43% view his tenure as Home Secretary positively, compared to 17% who disagree.", "- Labour leads over the Conservatives by 39% to 34%, and the Liberal Democrats hold 19%.", "A separate Independent on Sunday poll shows that political party support has remained largely stable following the Blunkett scandal:\n- Labour leads with 38%, Conservatives at 32%, and the Lib Dems at 16%.", "- A majority, 82%, think Mr. Blunkett set a good example by wanting to take responsibility for his alleged son.", "- 42% back his legal action, while 45% find it unbecoming; 30% doubt his trustworthiness as a minister, and 63% disagree."]}