{"raw_text": "New drink limit 'would cut toll'\n \n More lives than previously thought could be saved by cutting drink-drive limits by a third, a report says.\n \n University College London research claims cutting the limit from 80mg of alcohol per 100ml of blood to 50mg would save 65 lives a year. The findings are being published by the Parliamentary Advisory Council for Transport Safety as MPs are due to vote on the government's Road Safety Bill. The bill includes changes to speeding fines but not to the drink-drive limit. The research, carried out by transport expert professor Richard Allsop, says cutting the limit would also lead to 230 fewer serious injuries on the UK's roads compared with 2003. He estimates that this would save the country £119m a year.\n \n A previous estimate, contained in a 1998 Department of Transport Document, suggested such a move could save 50 lives a year. The findings are based on the assumption that drivers who currently keep below the legal limit would continue to do so were it to be lowered and that those who tend to exceed the limit slightly would also lower their drinking. Professor Allsop said: \"Reducing the limit from 80mg to 50mg can be expected to save around 65 lives a year or around half of those who die in accidents where the driver's BAC [blood alcohol content] is within 30mg of the current limit. \"Only about one in 50 of those driving during weekend evenings and nights will need to moderate their drinking to achieve this and fewer still at other times.\"\n \n Ministers do not support a lower limit, saying it is not clear it would have a major impact on drink drive casualties. They believe educating drivers is more important. The AA Motoring Trust said it was not sure what affect dropping the limit would have on drivers' attitudes to drink-driving. Road safety head Andrew Howard said: \"It remains to be seen whether the social disapproval of the drinking driver will stay at the current rate if the alcohol limit is cut.\n \n \"Parliamentarians need to consider this carefully. Britons police themselves by consensus much more effectively than they do by weight of enforcement alone.\" Liberal Democrat transport spokesman John Thurso said drink-driving remained a \"major killer\", with figures showing a worrying rise in the number of accidents involving drivers who had been drinking. He said there had been a 29% drop in the number of drivers being breathalysed since 1997, which he said the government needed to address if it wanted to reduce the danger caused by drink-driving. The Road Safety Bill, which gets its second reading on Tuesday, would allow the results of roadside breath tests to be used in court - currently a blood test is needed. It also includes plans for a staggered speeding fines and points system, penalising drivers who exceed limits by a wide margin more than those who are caught going just over. These have been criticised by road safety campaigners, including Labour backbencher Gwyneth Dunwoody, who says it will reduce the incentive for drivers to stay within the limits in residential areas, leading to more road casualties. In an article for the Times newspaper, Ms Dunwoody, who chairs the Transport Select Committee, says: \"Slight increases to low car speeds increase hugely the risks to pedestrians and cyclists. \"It is quite simple: if you hit someone at 30mph, they have a 50 per cent chance of survival. If you are going at 40mph, nine times out of ten they will die.\"\n", "llama3.2:1b": ["The UK government's proposed Road Safety Bill includes plans to cut the drink-drive limit from 80mg of alcohol in 100ml of blood to 50mg.", "A previous estimate suggested this could save around 50 lives a year.", "Research by University College London claims that cutting the limit would lead to 65 lives saved per year and 230 fewer serious injuries on UK roads, with £119m of savings annually.", "Ministers are opposed to the change, citing concerns it may not have a major impact on drink-driving casualties."], "llama3.2:3b": ["Cutting drink-drive limits from 80mg of alcohol per 100ml of blood to 50mg could save up to 65 lives and 230 serious injuries on UK roads each year, according to a report.", "The proposed limit is expected to save the country £119m a year."], "gemma2:2b": ["A University College London report suggests lowering the legal blood alcohol content limit from 80mg/100ml to 50mg could save 65 lives a year and reduce serious injuries on UK roads.", "While the government opposes this change, arguments for its implementation are based on its potential to reduce drink-driving fatalities and injuries, with estimated savings of £119m annually.", "However, ministers argue that education is more effective than enforcement alone, while others advocate for stricter enforcement measures."], "qwen2.5:0.5b": ["University College London research claims cutting the drink-drive limit from 80mg to 50mg would save around 65 lives a year by reducing 230 more injuries on the UK's roads.", "Dr Richard Allsop estimates that lowering the limit would save around 50 lives per year.", "Ministry of Transport officials do not support a lower limit, saying it is unlikely to have a major impact on drink-driving fatalities and argue education should be the focus.", "The Road Safety Bill includes plans for breath-alcohol testing in court and a points-based system with staggered speeding fines."], "qwen2.5:1.5b": ["University College London research claims cutting the UK's drink-drive limit from 80mg to 50mg could save up to 65 lives and reduce serious injuries on roads by 230 annually.", "This would cost £119m per year compared to 2003 levels, with about one in five drivers needing to cut their alcohol intake to achieve the lower limit.", "Ministers oppose lowering limits due to lack of evidence of major impact and concern over public attitude changes."], "qwen2.5:3b": ["New drink-drive limit could save up to 65 lives annually and reduce 230 serious injuries, according to University College London research.", "Cutting the current 80mg alcohol per 100ml limit to 50mg is projected to cost £119 million yearly in savings from fewer accidents.", "The proposal aims to prevent around half of those who die due to drink drive where BAC is within a 30mg range, affecting about one in 50 weekend drivers and less at other times.", "Despite some support for lowering the limit, including potential educational benefits, ministers argue that reducing fines may not significantly impact driver behavior or reduce drink-drive casualties.", "Critics of road safety measures suggest such changes could lead to more deaths due to increased speeding."], "opencoder:1.5b": ["New drink limit 'would cut toll' \n\nMore lives than previously thought could be saved by cutting the limit from 80mg to 50mg which would lead to 65 lives a year compared with 2003.", "The research has been published in the Parliamentary Advisory Council for Transport Safety, and MPs are due to vote on the government's Road Safety Bill.", "This bill includes changes to speeding fines but not to the drink-drive limit.", "The research by transport expert professor Richard Allsop also suggests that cutting the limit would lead to 230 fewer serious injuries on the UK's roads compared with 2003.", "The findings are based on the assumption that drivers who currently keep below the legal limit would continue to do so were it to be lowered and that those who tend to exceed the limit slightly would lower their drinking.", "Professor Allsop estimates that this would save the country £119m a year, as compared with 1998 Department of Transport Document’s estimate which was around half of those who die in accidents where the driver's BAC (blood alcohol content) is within 30mg of the current limit."], "smollm:1.7b": ["The summary should be concise and focus on the main ideas and key points from the original text.", "Here is an example:\n\nNew drink limit 'would cut toll'\nMore lives than previously thought could be saved by cutting drink-drive limits by a third, report says.", "A previous estimate suggested such a move would save around 50 lives a year or around half of those who die in accidents where the driver's BAC is within 30mg of the current limit.", "Only about one in 20 drivers will need to moderate their drinking to achieve this and fewer still at other times, according to transport experts.", "Ministers do not support a lower limit, saying it is not clear it would have a major impact on drink-driving casualties.", "Parliamentarians need to consider this carefully.", "Britons police themselves by consensus much more effectively than they do by weight of enforcement alone.", "The Road Safety Bill, which gets its second reading on Tuesday, would allow the results of roadside breath tests to be used in court - currently a blood test is needed.", "It also includes plans for a staggered speeding fines and points system, penalising drivers who exceed limits by a wide margin more than those who are caught going just over.", "These have been criticized by road safety campaigners, including Labour backbencher Gwyneth Dunwoody, who says it will reduce the incentive for drivers to stay within the limits in residential areas, leading to more road casualties.", "In an article for the Times newspaper, Ms Dunwoody, who chairs the Transport Select Committee, says: \"Slight increases to low car speeds increase hugely the risks to pedestrians and cyclists.", "It is quite simple: if you hit someone at 30mph, they have a 50 per cent chance of survival.", "If you are going at 40mph, nine times out of ten they will die.\""], "deepseek-r1:1.5b": ["Cutting the alcohol limit to reduce traffic risks could save 65 lives a year, as reported by transport experts at London's University College.", "A study found saving around half those dying in accidents where drivers' BAC is within 30mg of the current limit.", "It estimates £119 million in savings annually.", "The previous estimate was 50 lives saved per year from a 1998 document, but reduced to about 230 fewer serious injuries compared to 2003.", "Prof. Richard Allsop noted that lowering the limit would save around half those below current drinking levels and highlight assumptions about driver behavior.", "Minists oppose the change as it may not have a major impact on drink-driving casualties, while the AA Motoring Trust is unsure of its effects on drivers' attitudes.", "Andrew Howard suggests social disapproval remains unclear.", "The road safety bill allows breath tests for enforcement but penalizes wide margin violations more than speeding, potentially reducing risks in residential areas and leading to higher casualties.", "Drunk driving remains a major issue with increasing accident rates, so the government needs to address it."], "tinyllama:1.1b": ["In response to the proposed legislation by the UK government to lower the alcohol limit for drivers from 80mg/100ml blood to 50mg/100ml blood, a report published by transport expert Professor Richard Allsopp suggests that cutting the limit by three-quarters would save around 65 lives per year.", "The study also finds that cutting the limit for drivers by 30mg/100ml blood could save an additional 60 lives per year.", "This is based on the assumption that drivers who currently avoid exceeding the limit will do so further, as stated in a previous Department of Transport Document.", "While ministers do not support lowering the limit, the AA Motoring Trust believes there may be a negative impact on driver's attitudes to drink driving, while the Road Safety Bill includes plans for roadside breath tests and faster speeding fines.", "However, road safety campaigners such as Labour backbencher Gwyneth Dunwoody criticize proposed measures, including a staggered speeding fine system and points system, which they say will make drivers more likely to stay within the limits in residential areas."], "tinydolphin:1.1b": [" A new study has found that reducing the legal limit for alcohol in cars can potentially save thousands of lives a year and reduce driving accidents by half, according to a report.", "The research by Professor Richard Allsop, who is an expert on road safety at the University College London (UCL), claims cutting the limit from 80mg of alcohol per 100ml of blood to 50mg could save around 65 lives a year and reduce serious injuries by £119 million each year.", "The study, published in the Parliamentary Advisory Council on Transport Safety (PACTS) report, also estimates that cutting the limit would save the UK £119 million per year.", "According to Professor Allsop, this could be achieved by reducing the legal limit to 50mg from its current level of 80mg.", "The findings come as a surprise to many, who had previously believed there was no significant impact on drink-drive casualties if the limit was reduced to 30mg.", "Ministers for Transport have not yet made any public statements about the new findings."], "phi:2.7b": [" A new report suggests that lowering the drink-drive limit from 80mg to 50mg could save 65 lives a year and reduce serious injuries by 230, according to Professor Richard Allsop's research conducted by University College London.", "The findings are being published as MPs consider the government's Road Safety Bill, which does not include changes to the current drink-drive limit of 80mg per 100ml of blood.", "However, ministers do not support a lower limit and believe educating drivers is more effective than lowering the legal limit.", "The AA Motoring Trust is unsure about how dropping the limit would affect driver attitudes to drink-driving, while road safety head Andrew Howard believes it remains to be seen whether social disapproval of drinking and driving will decrease if the limit is lowered."], "orca-mini:3b": [" A report by University College London claims cutting the drink-drive limit from 80mg of alcohol per 100ml of blood to 50mg could save up to 65 lives a year and 230 fewer serious injuries.", "The government does not support a lower limit, saying it is not clear it would have a major impact on drink drive casualties.", "Ministers believe educating drivers is more important.", "The AA Motoring Trust says it's not sure what affect dropping the limit would have on drivers' attitudes to drink-driving.", "Road safety head Andrew Howard says the social disapproval of the drinking driver will stay at the current rate if the alcohol limit is cut.", "Liberal Democrat transport spokesman John Thurso says drink-driving remains a \"major killer\", with figures showing a worrying rise in the number of accidents involving drivers who had been drinking.", "The Road Safety Bill, which gets its second reading on Tuesday, would allow the results of roadside breath tests to be used in court - currently a blood test is needed.", "It also includes plans for a staggered speeding fines and points system, penalizing drivers who exceed limits by a wide margin more than those who are caught going just over.", "These have been criticised by road safety campaigners, including Labour backbencher Gwyneth Dunwoody, who says it will reduce the incentive for drivers to stay within the limits in residential areas, leading to more road casualties."], "hermes3:3b": ["Study finds cutting drink-drive limit from 80mg to 50mg could save 65 lives and 230 serious injuries yearly, potentially saving UK £119m annually."], "stablelm-zephyr:3b": ["A new report from University College London suggests that cutting the UK's drink-drive limit from 80mg of alcohol per 100ml of blood to 50mg could save 65 lives a year and lead to 230 fewer serious injuries on the roads compared to 2003.", "The findings, published by the Parliamentary Advisory Council for Transport Safety, are being considered by MPs as they vote on the government's Road Safety Bill.", "According to the report, only around one in 50 drivers driving during weekend evenings and nights would need to moderate their drinking to meet the new limit, while at other times fewer still would have to do so.", "Ministers do not support a lower limit but believe education of drivers is more important."], "chatgpt-4o-latest": ["A University College London study suggests that lowering the drink-drive limit from 80mg to 50mg of alcohol per 100ml of blood could save 65 lives and prevent 230 serious injuries annually, saving the UK £119m.", "The research, published by the Parliamentary Advisory Council for Transport Safety, comes as MPs vote on the Road Safety Bill, which does not include a lower drink-drive limit.", "Ministers oppose the change, arguing education is more effective.", "The AA Motoring Trust and some MPs question whether lowering the limit would change driver behavior.", "The bill also proposes using roadside breath tests in court and introducing a tiered speeding fines system, which critics argue could increase road casualties.", "Labour MP Gwyneth Dunwoody warns that even small speed increases significantly raise pedestrian and cyclist fatality risks."], "stablelm2:1.6b": ["New research from University College London reveals that cutting the drink-drive limit from 1.5mg of alcohol per 1ml of blood to 1.2mg could save around half of all drivers involved in fatal accidents each year.", "The findings are being published by the Parliamentary Advisory Council for Transport Safety, as MPs vote on the government's Road Safety Bill, which includes changes to speeding fines but not to the drink-drive limit.", "By reducing the limit, serious injuries would also decrease, saving the country around £1m a year according"], "granite3.1-dense:2b": ["A new study by University College London suggests that lowering the drink-drive limit from 80mg to 50mg of alcohol per 100ml of blood could prevent 65 annual lives and reduce 230 serious injuries on UK roads.", "This research, conducted by transport expert professor Richard Allsop, is being considered by MPs as part of the government's Road Safety Bill.", "The bill, currently under debate, includes changes to speeding fines but not to the drink-drive limit.", "The study assumes that drivers who currently stay below the legal limit would continue to do so at a lower threshold and those slightly exceeding it would reduce their consumption.", "Professor Allsop estimates this could save £119m annually.", "Previous estimates suggested 50 lives could be saved, but this new research projects around half of that figure.", "Ministers oppose the limit reduction, arguing its impact on drink-driving casualties is uncertain and prefer driver education over stricter enforcement.", "The AA Motoring Trust expressed uncertainty about how lowering the limit would affect drivers' attitudes towards drink-driving.", "Liberal Democrat transport spokesman John Thurso emphasized that reducing the alcohol limit remains crucial to addressing the growing number of accidents involving intoxicated drivers, noting a 29% decrease in breathalysed drivers since 1997.", "Critics, like Labour MP Gwyneth Dunwoody, warn that proposed staggered speeding fines could increase road risks for pedestrians and cyclists, as higher speeds significantly reduce survival chances for vulnerable road users.", "Road safety campaigners argue that small speed increases at lower car speeds pose substantial threats to these groups."]}