{"raw_text": "Bid to cut court witness stress\n \n New targets to reduce the stress to victims and witnesses giving evidence in courts in England and Wales have been announced by the lord chancellor.\n \n Lord Falconer wants all crown courts and 90% of magistrates' courts to have facilities to keep witnesses separate from defendants within four years. More video links will also be made available so that witnesses do not have to enter courtrooms. It is part of a five-year plan to help build confidence in the justice system.\n \n Ministers say the strategy is aimed at re-balancing the court system towards victims, and increasing the number of offenders brought to justice. Launching the Department for Constitutional Affairs' plan, Lord Falconer said: \"One of the top priorities will be a better deal for victims. \"The needs and safety of victims will be at the heart of the way trials are managed.\n \n \"Courts, judges, magistrates, prosecutors, police and victim support - all working together to ensure the rights of victims are put first, without compromising the rights of the defendant.\" He went on: \"Giving evidence is a nerve-wracking experience, especially when you're a victim. \"Yet with a will and with support it can be done.\" Lord Falconer told BBC Radio 4's Today programme it was impossible for some elderly people to go to court to give evidence. Other witnesses could be intimidated by sitting alongside defendants outside courts. \"You are never going to get rid of some element of the trauma of giving evidence,\" he said. \"But you can make people believe that the courts understand the problem, it's not some kind of alien place where they go where they are not thinking about them.\"\n \n The plan comes as the lord chancellor also considers allowing cameras into courts for the first time since 1925, as long as they were used for cases that did not involve witnesses. Another feature of the strategy is constitutional reform, with a government bill to set up a supreme court and a judicial appointments commission returning to the House of Lords on Tuesday. Ministers had proposed getting rid of the title of lord chancellor, but the Lords have over-ruled this. Lord Falconer said it was right for the highest court to be completely distinct from Parliament. The person in charge of the court system should not also be speaker of the House of Lords, he said, and should be the best person chosen from either House of Parliament. What they did, not what they were called, was the critical issue, he added.\n", "llama3.2:1b": ["Ministers have announced a five-year plan to reduce stress for victims and witnesses in court.", "The plan includes: \n\n* Providing separate facilities for defendants and witnesses in crown courts and magistrates' courts\n* Making more video links available for witnesses not required to enter the courtroom\n* Introducing cameras into courts for non-witness cases as long as they are used appropriately\n* Constitutional reforms, including a supreme court and judicial appointments commission."], "llama3.2:3b": ["Lord Falconer announces a five-year plan to reduce stress on victims and witnesses in courts by introducing separate facilities for them and increasing video links.", "The strategy aims to re-balance the court system towards victims and increase offenders being brought to justice.", "It also includes constitutional reform, including a supreme court and judicial appointments commission."], "gemma2:2b": ["The lord chancellor announced a five-year plan to reduce stress for victims and witnesses in English and Welsh courts.", "This includes separating witnesses and defendants and making video links available to help with testimony.", "The plan aims to rebalance the court system towards victims while also increasing the number of offenders brought to justice."], "qwen2.5:0.5b": ["Lord Falconer wants to cut stress for people in court who give evidence and witness their testimony.", "The plan will reduce \"tear\" caused by witnesses getting in line with defendants.", "Some 90% of magistrates' courts have video links, but not all are available right now.", "Witnesses can't go into the courtroom without a lawyer or judge; it would make them nervous to come in.", "The government wants to change some rules that make giving evidence stressful and make people more likely to turn up for court.", "It also plans to reform the legal system so a supreme court is completely separate from Parliament, not just chosen by both Houses of Parliament."], "qwen2.5:1.5b": ["The lord chancellor has announced new targets to reduce stress for victims and witnesses giving evidence in courts in England and Wales, aiming to make trials more victim-centered by having facilities separate defendants from witnesses within four years and providing more video links.", "This part of a five-year plan seeks to rebuild confidence in the justice system."], "qwen2.5:3b": ["New targets have been announced by the Lord Chancellor to reduce stress on victims and witnesses in English and Welsh courts.", "By 2023, all crown and 90% of magistrates' courts will offer facilities for separate witness areas within four years, and more video links will be available so witnesses do not need to enter courtrooms.", "This part of a five-year plan aims to rebuild confidence in the justice system by putting victims’ rights at the forefront.", "The strategy also includes allowing cameras into courts for non-witness-related cases, setting up a supreme court, and establishing a judicial appointments commission.", "Lord Falconer emphasizes that while giving evidence can be nerve-wracking, it is important for the courts to show they understand and support witnesses' needs.", "He also supports constitutional reforms including separating the highest court from Parliament."], "opencoder:1.5b": ["Bid to cut court witness stress\n\nNew targets to reduce the stress to victims and witnesses giving evidence in courts in England and Wales have been announced by Lord Falconer.", "He wants all crown courts and 90% of magistrates' courts to have facilities to keep witnesses separate from defendants within four years, along with more video links for viewing witnesses outside court rooms.", "The strategy aims at re-balancing the court system towards victims, and increasing the number of offenders brought to justice.", "It is part of a five-year plan to help build confidence in the justice system.", "Ministers stressed that the needs and safety of victims will be at the heart of the way trials are managed.", "However, with a will and with support it can be done.", "Lord Falconer told BBC Radio 4's Today programme he was impossible for elderly people to go to court to give evidence, as long as they were used for cases that did not involve witnesses."], "smollm:1.7b": ["The summary is concise and to the point, capturing the main ideas and key details of the text.", "It does not provide any explanations or justifications for the decisions made by the court system, nor does it include any additional information that would be useful in understanding the context of the text.", "The summary only focuses on the main points and key findings, without providing any analysis or interpretation."], "deepseek-r1:1.5b": ["Lord Falconer has announced targets to reduce witness stress for victims and witnesses in England and Wales, including requiring 90% of magistrates' courts to provide facilities to keep witnesses separate from defendants within four years.", "He also aims to make video links available online so witnesses don't need to enter the courtroom.", "This initiative is part of a five-year plan to build more confidence in the justice system.", "The strategy focuses on re-balancing the court system towards victims and offenders, aiming to ensure victims' rights are prioritized during trials.", "It involves collaboration between various stakeholders such as judges, magistrates, prosecutors, police, and victim support.", "The initiative addresses concerns about elderly people's awkward experiences while emphasizing that both victims and defendants should be treated equally.", "The document also outlines changes by the lord chancellor, including cameras into courts since 1925 for non-witness cases and constitutional reforms involving a supreme court and judicial appointments from the House of Lords.", "The title \"Lord Falconer\" is being considered but later ruled out due to its overreach in setting up the court system."], "tinyllama:1.1b": ["The lord chaçnoor, in his annual plan for building confidence in the justice system, has announced new targets to reduce court witness stress and video link facilities within four years.", "He aims to re-balance the court system towards victim safety, increase the number of offenders brought to justice, and better support victims by giving evidence.", "As part of this five-year strategy, the lord chaçnoor's department will ensure that victims are treated with empathy, and all courts, judges, magistrates, prosecutors, police, and victim support agencies work together to ensure their rights are respected.", "This includes allowing cameras into courts for the first time since 1925, as well as constitutional reform, including the creation of a supreme court and appointments commission returning to the House of Lords.", "The lord chaçnoor's speech highlights that the highest court should be separate from Parliament, not the other way around.", "He also advocates for giving evidence in a neutral environment."], "tinydolphin:1.1b": [" A five-year plan to improve the justice system in England and Wales has been announced by Lord Falconer, the lord chancellor.", "The strategy aims to reduce court witness stress while increasing the number of offenders brought to justice.", "Key elements include video link facilities for witnesses, more separation between defendants and victims within courts, and the possibility of using cameras in courts for the first time since 1925.", "This plan also includes constitutional reform with a bill to set up a supreme court and judicial appointments commission returning to the House of Lords on Tuesday."], "phi:2.7b": [" Lord Falconer announced a plan to reduce stress for victims and witnesses in England and Wales by implementing new facilities and increasing the use of video links in courts.", "The strategy aims to help build confidence in the justice system by re-balancing the court system towards victims and bringing more offenders to justice.", "Ministers want all crown courts and 90% of magistrates' courts to have separate facilities for witnesses within four years, while also expanding the use of video links so that they do not need to enter courtrooms.", "The plan is part of a five-year strategy to improve the overall quality of the justice system by prioritizing victims' rights and ensuring defendants' rights are respected.", "Lord Falconer believes giving evidence in court can be a traumatic experience, but with support and understanding from courts and other agencies, it can be done successfully.", "He also discussed allowing cameras into courts for cases involving witnesses, as long as they were used responsibly.", "In addition to these changes, the plan includes constitutional reform proposals such as creating a supreme court and judicial appointments commission in the House of Lords.", "Lord Falconer believes this will make the highest court completely distinct from Parliament while ensuring that the person in charge of the court system is chosen based on their ability rather than their title."], "orca-mini:3b": [" The lord chancellor wants to reduce stress in courts for victims and witnesses by providing separate facilities and video links.", "This plan involves 90% of magistrates' courts having such facilities within four years, with Crown Courts following suit soon after.", "Ministers want to ensure the rights of victims are prioritized while still ensuring the rights of defendants are not compromised.", "Lord Falconer said it is impossible for some elderly people to give evidence in court and that cameras would only be used for cases where there are no witnesses.", "The lord chancellor will also propose a bill to set up a supreme court and a judicial appointments commission, which the House of Lords has over-ruled."], "hermes3:3b": ["Reduce witness stress in courts\n- Separate facilities for witnesses in 90% of courts within 4 years\n- More video links to avoid entering courtrooms"], "stablelm-zephyr:3b": ["The lord chancellor, Lord Falconer, has announced plans to reduce witness stress in courts in England and Wales by creating facilities for witnesses to separate themselves from defendants and expanding video link options.", "The goal is part of a five-year plan aiming to help build confidence in the justice system and increase the number of offenders brought to justice while putting more focus on victims' needs and safety.", "The plans also include potential camera implementation, constitutional reform, and separating the roles of lord chancellor and speaker of the House of Lords."], "chatgpt-4o-latest": ["The lord chancellor, Lord Falconer, has announced new measures to reduce stress for victims and witnesses in courts in England and Wales.", "Within four years, all crown courts and 90% of magistrates' courts will have facilities to keep witnesses separate from defendants, and more video links will be introduced to prevent witnesses from entering courtrooms.", "This initiative is part of a five-year plan to boost confidence in the justice system and prioritize victims' needs while maintaining defendants' rights.", "Falconer emphasized the importance of making courts more supportive for witnesses, particularly the elderly and those who may feel intimidated.", "Additionally, the government is considering allowing cameras in courts for non-witness cases and pursuing constitutional reforms, including establishing a supreme court and a judicial appointments commission.", "While the Lords rejected a proposal to abolish the title of lord chancellor, Falconer stressed that the focus should be on the role's function rather than its title."], "stablelm2:1.6b": ["The lord chancellor has announced a plan to reduce witness stress in courts, aiming for facilities to keep witnesses separate from defendants within four years and more video links to prevent witnesses entering courtrooms.", "This strategy is part of a five-year plan aimed at building confidence in the justice system and balancing the court system towards victims.", "Lord Falconer says that courts, judges, magistrates, prosecutors, police, and victim support will work together to ensure the rights of victims are put first without compromising defendant rights.", "The implementation of constitutional reforms, such S.Ct., is another part of this strategy."], "granite3.1-dense:2b": ["Lord Falconer, the lord chancellor, has unveiled a five-year plan to reduce stress for victims and witnesses in England and Wales' courts.", "The initiative aims to have facilities separating witnesses from defendants in 90% of magistrates' courts within four years, along with more video links for remote testimony.", "This strategy prioritizes victims' needs and safety, enhancing confidence in the justice system by rebalancing court management towards them and increasing offender prosecutions.", "Lord Falconer emphasized that evidence-giving is a challenging experience for many, particularly the elderly or those who feel intimidated by defendants outside courts.", "Additionally, Lord Falconer proposes allowing cameras into courts for the first time since 1925, provided they do not involve witnesses.", "The plan also includes constitutional reform, as a government bill to establish a supreme court and a judicial appointments commission returns to the House of Lords.", "Previously, the proposal was to abolish the lord chancellor's title, but the Lords overruled this decision, asserting that the highest court should be distinct from Parliament, with an independent leader not affiliated with the House of Lords."]}