{"raw_text": "Lord Scarman, 93, dies peacefully\n \n Distinguished lawyer Lord Scarman, who conducted the inquiry into the 1981 Brixton riots, has died aged 93.\n \n The peer enjoyed a celebrated judicial career, serving as Law Commission chairman in its first seven years. He also chaired the 1969 tribunal set up to investigate civil disturbances in Northern Ireland. Paying tribute, the Lord Chancellor Lord Falconer said Lord Scarman was one of the \"great advocates of our generation\".\n \n \"His legacy from his decisions in the Lords and the Court of Appeal is substantial. \"His work in the wake of the Brixton riots and his commitment to the vulnerable and dispossessed was second to none.\n \n \"A great judge, a great lawyer and a great man.\" Lord Scarman's nephew George Ritchie said the peer, who passed away peacefully on Wednesday, would be \"sadly missed\".\n \n The Lord Chief Justice, Lord Woolf, who is the most senior judge in England and Wales, said it was Lord Scarman's \"pioneering work\" which paved the way for the Human Rights Act 1998. \"He was a lawyer and a judge who had a remarkable insight into human nature, and an exceptional sensitivity to the needs of a healthy society,\" he said. \"He was, personally, totally charming and he will be remembered with great affection and admiration by all who came into contact with him.\"\n \n Dame Elizabeth Butler-Sloss, the president of the Family Justice Division, said Lord Scarman was a \"good and humane judge\" and one of the greatest figures of the late 20th century. Lord Scarman will be remembered for the public inquiry he led into a string of race riots which began in Brixton when racial tensions rose after a police crackdown on street robbery. During the following three days of disturbances that spread to the Midlands, Merseyside, Bristol and Leeds, nearly 400 people were injured and buildings and vehicles were set alight.\n \n The inquiry famously settled on the so-called \"rotten apples\" theory, which argued that only a few police officers were racist, saying most were not. It spawned new law enforcement practices and led to the creation of the Police Complaints Authority. Trevor Phillips, chair of the Commission for Racial Equality, praised Lord Scarman's \"ability to listen\". He said: \"When Lord Scarman toured the streets of Brixton his presence was electrifying. \"A community which had been systematically ignored by everyone else was suddenly embraced by the epitome of the English establishment. \"His great quality was the ability to listen to young people of all backgrounds, many of whose language he could barely understand, genuinely to hear what they had to say and to talk to them as human beings. \"He never lost the special combination of wisdom, humanity and the spark of radicalism that marked his watershed report into the Brixton riots.\"\n", "llama3.2:1b": ["Lord Scarman, a 93-year-old lawyer and judge, has died peacefully after conducting an inquiry into the 1981 Brixton riots that led to widespread racial tensions.", "He had a distinguished judicial career, serving as chairman of the Law Commission and chairing a tribunal on civil disturbances in Northern Ireland.", "The Lord Chancellor paid tribute to his legacy, describing him as one of the \"great advocates of our generation\"."], "llama3.2:3b": ["Lord Scarman, 93, a celebrated lawyer and judge, has died peacefully.", "He chaired the Law Commission and was involved in several notable inquiries, including the 1981 Brixton riots investigation.", "Tributes praised him as a \"great advocate\", \"pioneering work\" behind the Human Rights Act 1998, and \"good and humane judge\"."], "gemma2:2b": ["Lord Scarman, a distinguished lawyer who chaired inquiries into civil disturbances in Northern Ireland and the 1981 Brixton riots, died at age 93.", "He was lauded for his judicial career, including leading the inquiry into the 1981 Brixton riots, which resulted in the \"rotten apples\" theory of police racism.", "He also chaired the Law Commission for seven years and is remembered for his dedication to social justice and human rights advocacy."], "qwen2.5:0.5b": ["Lord Scarman, a distinguished lawyer who conducted an investigation into the 1981 Brixton riots, has passed away peacefully at age 93.", "He served as chairman of the Law Commission and chaired the Northern Ireland Court of Appeal tribunal that investigated civil disturbances in Northern Ireland.", "Lord Scarman was known for his work on human rights legislation and advocacy, particularly for the Brixton riots and his role in creating the Police Complaints Authority.", "He was a devoted lawyer and judge who had a profound impact on law enforcement practices and systemic social reforms.", "His legacy will be remembered with \"great affection\" by those he inspired to be brave advocates for justice and equality."], "qwen2.5:1.5b": ["Distinguished lawyer Lord Scarman dies at 93; led public inquiry on 1981 Brixton riots, which settled on the \"rotten apples\" theory."], "qwen2.5:3b": ["Lord Scarman, 93, dies peacefully.", "A distinguished lawyer who conducted inquiries into civil disturbances in Northern Ireland and racial riots in Brixton, he served as Law Commission chairman for its first seven years.", "Lord Falconer praised him as a \"great advocate,\" noting his work on the Brixton inquiry that led to new law enforcement practices and the creation of the Police Complaints Authority.", "Scarman was also known for his insights into human nature and his exceptional sensitivity to societal needs.", "He will be remembered for his pioneering work leading to the Human Rights Act 1998, and his role as a \"good and humane judge\" who effectively listened to young people from diverse backgrounds."], "opencoder:1.5b": ["Distinguished lawyer Lord Scarman, who conducted the inquiry into the 1981 Brixton riots, has died aged 93.", "The peer enjoyed a celebrated judicial career, serving as Law Commission chairman in its first seven years.", "He also chaired the 19th tribunal set up to investigate civil disturbances in Northern Ireland.", "Paying tribute, Lord Falconer said, was one of Lord Scarman's great advocates of our generation.", "His legacy from his decisions in the Lords and the Court of Appeal is substantial.", "His work in the wake of the Brixton riots and his commitment to the vulnerable and dispossessed was second to none.", "\"His work in the wake of the Brixton riots and his commitment to the vulnerable and dispossessed was second to none, a great judge, a great lawyer and a great man.\"", "Lord Scarman's nephew George Ritchie said, he would be \"sadly missed\".", "The Lord Chief Justice, Lord Woolf, who is the most senior judge in England and Wales, said it was Lord Scarman's pioneering work which paved the way for the Human Rights Act 1998.", "He was a lawyer and a judge who had a remarkable insight into human nature, and an exceptional sensitivity to the needs of a healthy society.", "\"He was, personally, totally charming and he will be remembered with great affection and admiration by all who came into contact with him,\" he said.", "Dame Elizabeth Butler-Sloss, the president of the Family Justice Division, praised Lord Scarman's \"ability to listen\".", "He said: \"When Lord Scarman toured the streets of Brixton his presence was electrifying.", "A community which had been systematically ignored by everyone else was suddenly embraced by the epitome of the English establishment.\"", "Trevor Phillips, chair of the Commission for Racial Equality, praised Lord Scarman's \"ability to listen\".", "He said: \"When Lord Scarman toured the streets of Brixton his presence was electrifying.", "A community which had been systematically ignored by everyone else was suddenly embraced by the epitome of the English establishment.\"", "In conclusion, Lord Scarman served as the first and only judge who had a remarkable insight into human nature, and an exceptional sensitivity to the needs of a healthy society.", "He was a great lawyer and a great judge who had a remarkable insight into human nature, and an exceptional sensitivity to the needs of a healthy society."], "smollm:1.7b": ["Lord Scarman, who conducted an inquiry into the 1981 Brixton riots, has passed away at the age of 93.", "He was a distinguished lawyer, served as Law Commissioner in its first seven years and chaired the 1969 tribunal set up to investigate civil disturbances in Northern Ireland.", "His legacy from his decisions in the Lords and the Court of Appeal is substantial, paving the way for the Human Rights Act 1998.", "He was a great judge, a great lawyer and a great man."], "deepseek-r1:1.5b": ["Lord Scarman, 93, a distinguished lawyer and judge, has passed away peacefully.", "He served as the Law Commission chairman for seven years and chair of the 1969 Northern Ireland tribunal.", "His significant contributions include pioneering work in the Human Rights Act 1998 due to his innovative insights into human nature and societal needs.", "Lord Scarman will be remembered for his profound legacy, particularly from his pivotal role in a study of racial tensions following the Brixton riots.", "His efforts laid the foundation for new law enforcement practices and the establishment of the Police Complaints Authority."], "tinyllama:1.1b": ["Loord Scarman, a distinguished lawyer Lord who conducted the inquiry into the 1981 Brixton riots, has passed away peacefully at age 93.", "The peer's legacy is substantial from his decision in the Lord & Court of Appeal regarding civil disturbances in Northern Ireland.", "He was known for his commitment to the vulnerable and dispossessed and was respected by many for his work on the Human Rights Act 1998.", "His nephew, George Richtchee, expressed sympathy for the peer's passing, saying it was due to him being \"saa...lly missed\".", "He also praised his \"pioneering work\" and \"remarkable insight into human nature\", which led to the creation of new law enforcement practices.", "The family justice division president, Damé Elizabeth Butler-Sloss, remembered Lord Scarman as a kind and humane judge with an extraordinary sensitivity towards society's needs, while Trevor Phillips, chair of the Commission for Racial Equality, highlighted the peer's ability to listen to young people."], "tinydolphin:1.1b": [" The distinguished lawyer Lord Scarman, who conducted the inquiry into the 1981 Brixton riots, has passed away at the age of 93.", "Born in 1928, he was a trailblazing figure in his legal profession and served as the Law Commission chairman for the first seven years of his tenure.", "As a distinguished advocate, he gained extensive knowledge from his decisions in the Lords and the Court of Appeal.", "Undeniably, Lord Scarman's work during the Brixton riots inquiry was substantial and earned him the title of one of \"the great advocates of our generation.\"", "As a result, his legacy extends to significant contributions in the realms of human rights, legal reform, and social justice.", "Notably, he paved the way for the Human Rights Act 1998, which is regarded as one of the most significant legal reforms of this era.", "His nephew, George Ritchie, expressed his sorrow over Lord Scarman's passing in a statement, calling him a \"great judge, a great lawyer, and a great man.\"", "Furthermore, the Lord Chief Justice of the Supreme Court, Lord Woolf, described Lord Scarman as a pioneering work in legal history.", "Dame Elizabeth Butler-Sloss, who served as president of the Family Justice Division at the time, recalled his public inquiry into the Brixton riots and commended him for being a \"good and humane judge\" and a \"phenomenal figure.\"", "The distinguished advocate, Dame Elizabeth Butler-Sloss, emphasized that Lord Scarman was an example of a \"great and charming\" person who always put others first.", "She further highlighted the impact he had on society through his commitment to justice reform."], "phi:2.7b": [" Lord Scarman, a distinguished lawyer who conducted the inquiry into the Brixton riots in 1981, has passed away at age 93.", "He had a celebrated judicial career, serving as Law Commission chairman for seven years and chairing the tribunal set up to investigate civil disturbances in Northern Ireland.", "Paying tribute to his legacy from his decisions in the Lords and the Court of Appeal, Lord Falconer called him one of the \"great advocates\" of the generation.", "Lord Scarman's nephew said he was \"sadly missed.\"", "The Lord Chief Justice praised Lord Scarman's pioneering work in paving the way for the Human Rights Act of 1998.", "Dame Elizabeth Butler-Sloss, the president of the Family Justice Division, called him a \"good and humane judge\" who had a remarkable insight into human nature and would be remembered with great affection and admiration by all who knew him.", "Lord Scarman will always be remembered for the public inquiry he led into the Brixton riots, which settled on the theory that only a few police officers were racist, and led to new law enforcement practices."], "orca-mini:3b": [" Lord Scarman, a distinguished lawyer who conducted the inquiry into the 1981 Brixton riots, died at the age of 93.", "He enjoyed a celebrated judicial career serving as Law Commission chairman in its first seven years, and also chaired the 1969 tribunal set up to investigate civil disturbances in Northern Ireland.", "His legacy includes pioneering work that paved the way for the Human Rights Act 1998, which he was personally involved in shaping.", "Lord Scarman will be remembered as a good and humane judge, one of the greatest figures of the late 20th century.", "He was known for his ability to listen and his commitment to the vulnerable and dispossessed."], "hermes3:3b": ["Lord Scarman, 93, distinguished lawyer and former Law Commission chairman, passed away.", "Known for his work in wake of 1981 Brixton riots inquiry where he championed vulnerable and dispossessed people's rights, leading to \"rotten apples\" theory and new police practices."], "stablelm-zephyr:3b": ["Distinguished lawyer Lord Scarman, who conducted the inquiry into the 1981 Brixton riots, has passed away at 93.", "He served as Law Commission chairman and chaired a tribunal investigating civil disturbances in Northern Ireland.", "Lord Scarman was praised for his work with the vulnerable and dispossessed, his contribution to human rights, and his ability to listen to young people of all backgrounds.", "His legacy includes pioneering work that led to new law enforcement practices and the creation of the Police Complaints Authority."], "chatgpt-4o-latest": ["Lord Scarman, a distinguished lawyer and judge, has died peacefully at 93.", "He had a celebrated judicial career, serving as Law Commission chairman and leading inquiries into civil disturbances, including the 1981 Brixton riots.", "His work influenced the Human Rights Act 1998 and led to reforms in law enforcement, including the creation of the Police Complaints Authority.", "Tributes from legal figures, including Lord Chancellor Lord Falconer and Lord Chief Justice Lord Woolf, praised his advocacy, humanity, and commitment to justice.", "Trevor Phillips highlighted his ability to listen and engage with marginalized communities.", "Lord Scarman is remembered as a great judge, lawyer, and humanitarian."], "stablelm2:1.6b": ["Distinguished lawyer and judge Lord Scarman, who conducted the inquiry into the Brixton riots, has died at age 84.", "He served as Law Commission chairman and chaired the Northern Ireland tribunal investigating civil disturbances.", "His legacy includes pioneering work for the Human Rights Act and commitment to vulnerable people.", "Tributes praised his insights on human nature, exceptional sensitivity to society's needs, and ability to listen to young people of diverse backgrounds.", "Lord Scarman led a pivotal inquiry into race riots that sparked new law enforcement practices and led to the Police Complaints Authority."], "granite3.1-dense:2b": ["Lord Scarman, a renowned 93-year-old lawyer and former judge, passed away peacefully on Wednesday.", "Throughout his distinguished career, he served as Law Commission chairman for its first seven years and chaired the 1969 tribunal investigating Northern Ireland's civil disturbances.", "His most significant contribution was leading the Brixton riots inquiry (1981), where he famously proposed the \"rotten apples\" theory, attributing racial tensions to a few rogue police officers rather than systemic institutional racism.", "This inquiry led to new law enforcement practices and the establishment of the Police Complaints Authority.", "Lord Scarman was also celebrated for his commitment to the vulnerable and dispossessed, earning praise from various senior judges as a great judge, lawyer, and man.", "His nephew described him as \"sadly missed,\" emphasizing his charm and personal warmth.", "Senior figures, including Lord Chancellor Falconer, the Lord Chief Justice Woolf, Dame Elizabeth Butler-Sloss, and Trevor Phillips, all remembered him for his exceptional listening skills and ability to empathize with diverse communities."]}