{"raw_text": "NHS waiting time target is cut\n \n Hospital waiting times for patients in Wales are to be cut, but not to the same extent as those in England.\n \n Welsh Health Minister Jane Hutt said no patient would wait more than 12 months for an outpatient appointment by March 2006, against a current target of 18 months. But she said the target for an inpatient appointment would remain at 12 months for March 2006. The announcement came as new monthly waiting figures showed a drop. This current inpatient target was set when the assembly government extended its second offer guarantee scheme, which gives patients the option of having their treatment outside Wales.\n \n Details about funding to resource the new targets are expected in the New Year. In England, the current target for inpatients - seeing a consultant to having an operation - is six months. Dr Richard Lewis, Welsh secretary of the British Medical Association (BMA), welcomed the new targets \"to make further and faster progress on waiting lists\". \"However, much remains to be done on waiting lists and waiting times because Wales still lags a long way behind England,\" he said. \"Capacity must be built into the system with sustained investment to ensure that Welsh patients don't receive a worse service than patients over the border.\" Health analyst Tony Beddow, from the Welsh Institute for Health and Social Care, called the new targets \"reasonably impressive\".\n \n On Wednesday, Ms Hutt also announced £264m for health services will be spent reducing waiting times, improving key areas and modernising staff pay structures in Wales.\n \n Ms Hutt said major achievements had been made in cutting \"unacceptably long waits for treatment over the past year\". \"We are turning the corner on long waits in Wales. Now we need to see those reductions in long waiters being improved again,\" she said. She added the targets intended to ensure no-one waits more than a year for treatment or to see a consultant. \"But let us not forget two thirds of those waiting for treatment now are waiting less than six months, and these targets affect the small minority of patients in Wales that are waiting far too long.\" Rhodri Glyn Thomas, Plaid Cymru health spokesman said: \"It's exactly the same target she set in 1999, with the qualification that it's dependent on a second offer. It's a failed target, from a failed minister..with a failed policy.\" For the Welsh Liberal Democrats, Kirsty Williams called the new target \"hugely unambitious\". \"It leaves patients in Wales still waiting two years before they're treated.\" Conservative health spokesman Jonathan Morgan said: \"We're spending more money but waiting lists have gone through the roof. \"The Audit Commission has said that the money is not being spent efficiently or effectively, and that's quite a criticism.\" Meanwhile, the latest monthly waiting list figures showed the total number of people waiting more than 18 months as an inpatient in Wales has fallen by 9.8%. Statistics to the end of November showed a decline since October from 785 to 708. The number waiting over 12 months also fell from 7,613 to 6,630, or 12.9%. Ms Hutt said they were \"excellent figures\". There are 305,775 people on a waiting list of some kind, down from 311,764 last month.\n", "llama3.2:1b": ["NHS Wales is cutting hospital waiting times for patients by ending the current target of 18 months and introducing a new target of 12 months by March 2006.", "The Welsh Health Minister announced that no patient would wait more than 12 months for an outpatient appointment by March 2006, despite a current target of 18 months.", "The inpatient waiting time target remains at 12 months for the same date.", "Details about funding to resource the new targets are expected in the New Year.", "New monthly waiting figures showed a drop from 785 to 708, with a decline in numbers waiting over 12 months by 9.8%."], "llama3.2:3b": ["NHS waiting time target in Wales is being reduced to 12 months for outpatient appointments by March 2006, while the current inpatient target will remain unchanged at 12 months.", "Funding details are expected in the New Year.", "The announcement comes as monthly waiting figures show a drop, with the number of people waiting over 18 months decreasing."], "gemma2:2b": ["Wales's NHS target for inpatient appointments is to remain at 12 months by March 2006, while outpatient appointments will now have a maximum wait time of 12 months.", "The announcement follows a decrease in monthly waiting figures and £264 million funding has been allocated for these targets.", "However, the BMA welcomed the target but expressed concerns about Welsh healthcare's capacity and lagging behind England.", "While some politicians called the target \"unambitious,\" others highlighted improvements in reducing long waits."], "qwen2.5:0.5b": ["The NHS in Wales is set to cut waiting times for patients by one year, rather than the same amount as England.", "Inpatients receive a target of 12 months.", "The Welsh Health Minister Jane Hutt announced her target would be 18 months from March 2006, but this could change if funding sources are not in place or the government continues to delay its decision on the new targets.", "The number of people waiting more than one year for treatment is dropping as well, with a decline of 9.", "8% compared to the end of November.", "There were 7, 613 and 6, 630 patients in Wales over 12 months and 12 months respectively.", "The number of people waiting over 18 months has also decreased from last month's 7, 859 to 7, 493 this month.", "The audit commission states that the money is not being spent efficiently or effectively despite a failed target, leaving patients in Wales still waiting two years before they're treated.", "Meanwhile, Rhodri Glyn Thomas from Plaid Cymru health spokesman said: \"It's exactly the same target she set in 1999, with the qualification that it's dependent on a second offer.\""], "qwen2.5:1.5b": ["Welsh NHS targets for patient wait times reduced compared to England's six-month target, with improvements noted despite still lagging behind England in overall wait times.", "Funding and spending for health services have been announced, but criticism remains regarding the new waiting time goals and progress on reducing long waits."], "qwen2.5:3b": ["NHS waiting time target in Wales will be reduced to no more than 12 months for outpatient appointments by March 2006, maintaining the current 12-month target for inpatient appointments.", "This follows a decrease in monthly waiting figures and government funding of £264m towards reducing wait times.", "While welcomed by some, Dr Richard Lewis from BMA noted Wales still lags behind England on waiting lists, advocating for better investment to ensure service parity with the rest of the UK.", "Critics argue that despite reductions, many patients are still waiting far too long and question the new targets' ambition."], "opencoder:1.5b": ["The NHS waiting time target is cut for patients in Wales.", "The Health Minister Jane Hutt said no patient would wait more than 12 months for an outpatient appointment by March 2006.", "She agreed that the target for an inpatient appointment would remain at 12 months for March 2006.", "The announcement came as new monthly waiting figures showed a drop.", "This current inpatient target was set when the assembly government extended its second offer guarantee scheme, which gives patients the option of having their treatment outside Wales.", "Details about funding to resource the new targets are expected in the New Year.", "In England, the current target for inpatients - seeing a consultant to having an operation - is six months.", "Dr Richard Lewis, Welsh secretary of the British Medical Association (BMA), welcomed the new targets \"to make further and faster progress on waiting lists\".", "However, much remains to be done on waiting lists and waiting times because Wales still lags a long way behind England.", "Capacity must be built into the system with sustained investment to ensure that Welsh patients don't receive a worse service than patients over the border.", "Major achievements had been made in cutting \"unacceptably long waits for treatment over the past year\".", "Now we need to see those reductions in long waiters being improved again.", "But let us not forget two thirds of those waiting for treatment now are waiting less than six months, and these targets affect the small minority of patients in Wales that are waiting far too long.", "Rhodri Glyn Thomas, Plaid Cymru health spokesman said: \"It's exactly the same target she set in 1999, with the qualification that it's dependent on a second offer.", "It's a failed target, from a failed minister..with a failed policy.\"", "For the Welsh Liberal Democrats, Kirsty Williams called the new target \"hugely unambitious\".", "They left patients in Wales still waiting two years before they're treated.", "There are 305,775 people on a waiting list of some kind, down from 311,764 last month.", "Meanwhile, the latest monthly waiting list figures showed the total number of people waiting more than 18 months as an inpatient in Wales has fallen by 9.8%.", "Statistics to the end of November showed a decline since October from 785 to 708."], "smollm:1.7b": ["The NHS waiting time target is cut in Wales but not to the same extent as those in England."], "deepseek-r1:1.5b": ["NHS waiting times for inpatient appointments in Wales are being cut to 12 months by March 2006, compared to a target of 18 months.", "The current inpatient target was set when the second offer guarantee scheme was extended.", "Details about funding to improve these targets are expected this year.", "In England, the current target for inpatients is six months based on the second offer guarantee.", "The Welsh government aims to ensure Welsh patients aren't waiting longer than those outside their country.", "Health analyst Tony Beddow called the new targets \"reasonably impressive.\"", "On Wednesday, Hutt announced £264m for reducing waiting times across Wales.", "Previous monthly figures show significant declines in inpatient waiting lists, with numbers falling from 785 to 708 and from 7,613 to 6,630 over the past nine months."], "tinyllama:1.1b": ["The Welsh Health Minister Jane Huett announced that no patient will wait more than 12 months for an outpatient appointment by March 2006 against the current target of 18 months, according to HoSPH (Health & Social Services Public Health).", "The minister also announced a new monthly waiting figures showed a drop from 785 to 708 as of November, showing that the total number of patients waiting for inpatient treatment over the past year has decreased by 9.8%.", "The average waiting time for an outpatient appointment is six months, and for an inpatient appointment it is four months.", "The target for an inpatient appointment set during the second offer guarantee scheme is to be cut to a current target of six months.", "Welsh Health Secretary Richard Lewis welcomed the new targets, stating that \"making further and faster progress on waiting lists is a matter of national interest.\"", "Welsh Institute for Health and Social Care Senior Analyst Tony Beddow called the new targets \"reasonably impressive\" and noted that they have already achieved improvements in capacity building.", "The latest monthly waiting list figures showed that there are 305,775 patients on a waiting list of some kind, with 2,498 more than at this time last year."], "tinydolphin:1.1b": [" The Welsh Health Minister announced that no patient will have to wait longer than 12 months for an outpatient appointment by March 2006.", "This follows a decision to reduce the waiting time for inpatients to six months from April 2005.", "The new target is part of a £264m investment in health services, with other areas set to benefit such as improving key areas and staff pay.", "Major achievements have been made in reducing waits over the past year.", "In England, consultant-to-patient waiting times stand at 18 months.", "This new target will ensure that no-one is waiting longer than a year for treatment or to see a consultant.", "However, there are still two thirds of those currently waiting for treatment who are waiting less than six months.", "Plaid Cymru's health spokesman Rhodri Glyn Thomas criticized the new target as \"hugely unambitious\".", "The Liberal Democrats have called the new target \"unfortunately ambitious\", while the Conservatives have said they're not convinced it will make a significant difference to waiting lists."], "phi:2.7b": [" The Welsh Health Minister Jane Hutt announced that the target for outpatient appointments is to be cut to 12 months by March 2006, while inpatient appointments will remain at 12 months.", "This comes after new monthly figures show a drop in hospital waiting times.", "Details about funding are expected in the New Year, and Dr Richard Lewis of the British Medical Association welcomes the new targets.", "However, there is still room for improvement, according to Tony Beddow from the Welsh Institute for Health and Social Care.", "The government plans to spend £264m on reducing waiting times and improving health services by modernizing pay structures and key areas.", "While progress has been made in reducing long wait times over the past year, Plaid Cymru's Rhodri Glyn Thomas calls the new target unambitious while the Welsh Liberal Democrats' Kirsty Williams describes it as \"hugely unambitious\".", "Conservative health spokesman Jonathan Morgan also criticizes the government for spending more money without seeing a decrease in waiting lists.", "The latest monthly figures show that hospital waiting times have improved since October, with fewer patients waiting over 18 months and a significant decline in those waiting 12-18 months.", "Ms Hutt calls these figures \"excellent\" despite the fact that there are still 305,775 people on a waiting list of some kind."], "orca-mini:3b": [" The Welsh Health Minister has announced that the target for hospital waiting times for patients in Wales will be cut to 12 months for March 2006, but the target for outpatient appointments will remain at 12 months.", "No patient will have to wait more than 12 months for an appointment by March 2006.", "However, funding to resource the new targets is expected in the New Year, and in England, the current target for inpatients is six months.", "The Welsh Secretary of the BMA welcomed the new targets but called for sustained investment to ensure that Welsh patients do not receive a worse service than patients over the border.", "The Welsh Institute for Health and Social Care called the new targets \"reasonably impressive\"."], "hermes3:3b": ["NHS Wales cuts hospital waiting times targets, reducing inpatient wait to 12 months by March 2006."], "stablelm-zephyr:3b": ["Hospital waiting times for patients in Wales are set to be reduced, with outpatient appointments targeted at less than 12 months by March 2006, compared to the current 18-month target in England.", "Welsh Health Minister Jane Hutt announced plans to spend £264m on health services to improve and modernize staff pay structures in Wales.", "Despite these improvements, some have criticized the new targets as insufficient or relying on past achievements.", "Monthly waiting list figures showed a 9.8% decline in inpatient waiting times in Wales since October."], "chatgpt-4o-latest": ["Hospital waiting times in Wales will be reduced, with a new target ensuring no patient waits more than 12 months for an outpatient appointment by March 2006, down from 18 months.", "However, the inpatient target remains at 12 months, whereas in England, the target is six months.", "The announcement follows a decline in waiting list figures, with the number of inpatients waiting over 18 months dropping by 9.8% and those waiting over 12 months falling by 12.9%.", "Welsh Health Minister Jane Hutt highlighted progress in reducing long waits and announced £264m in funding to further improve services.", "Critics, including opposition politicians and medical professionals, argue that Wales still lags behind England and that more investment is needed.", "Some view the targets as unambitious, while others acknowledge improvements."], "stablelm2:1.6b": ["The NHS in Wales will reduce waiting times for patients awaiting outpatient appointments, but not to the same extent as England.", "Outpatient appointment wait times will be reduced to six months by March 2026 from current targets of one year.", "However, the target for inpatient appointments remains at one year by the same date.", "The announcement came with new monthly waiting figures showing a drop; however, some argue that this is not enough progress.", "Funding for increasing capacity and sustaining investment in Wales' health care system will be released soon.", "Welsh Health Minister Jane Hutt also announced a £m budget to improve healthcare services, cutting wait times, modernize staff pay structures, and reduce long waits for treatment."], "granite3.1-dense:2b": ["Welsh Health Minister Jane Hutt announced reduced hospital waiting times for patients in Wales, with no patient expected to wait more than 12 months for an outpatient appointment by March 2006, down from the previous target of 18 months.", "However, the target for inpatient appointments will remain at 12 months for March 2006, aligning with the current English target of six months.", "This decision comes as new monthly waiting figures indicate a decrease.", "Hutt also pledged £264 million to reduce waiting times, enhance key areas, and improve staff pay structures in Wales.", "Despite these improvements, critics argue that the targets remain unambitious, with some Plaid Cymru and Conservative politicians claiming they're similar to 1999 targets and not effectively addressing the issue.", "Meanwhile, the latest monthly waiting list data shows a 9.8% reduction in those waiting over 18 months as an inpatient and a 12.9% decrease for those waiting more than 12 months since October.", "The total number of people on waiting lists has declined to 305,775 from 311,764 last month."]}