{"raw_text": "Tories plan migrant health checks\n \n Non-European Union citizens wanting to work in the UK will have to undergo tests for Tuberculosis and HIV, under plans unveiled by the Conservatives.\n \n A positive test for TB would mean visa applications being turned down, while HIV would be dealt with case by case. Leader Michael Howard said the checks on new arrivals would help protect public health and the NHS. Labour said many tests were already done. The Lib Dems warned both parties against \"pandering to prejudice\".\n \n The proposals, which would be brought in if the Conservatives won the General Election, would not apply to people coming to the UK for less than six months unless they intended to work in health or childcare or teaching. Mr Howard said the plans were based on policies already in action in Canada, New Zealand and Australia. \"It's very important that we should safeguard the good standards of public health that Britain enjoys,\" he told BBC Radio 4's Today programme. Government figures suggest TB in England has increased by 25% over the past 10 years. \"Nearly two thirds of people with TB are born abroad,\" said Mr Howard.\n \n \"I don't think a responsible government can stand aside and do nothing in the face of this problem.\" But Mr Howard said the plans would not affect asylum applicants' claims. The proposals include:\n \n - People coming to the UK from outside the EU for between six and 12 months from a \"high incidence TB country\" will have to undergo a chest X-ray. \n  - People coming to settle in the UK permanently from outside the EU will have to \"demonstrate they have an acceptable standard of health\". \n  - They will also have to show they are unlikely to be a danger to public health and are unlikely to \"impose significant costs or demands\" on the NHS. \n  - The tests will include a health check, chest X-rays for TB (except for children and pregnant women) and tests for hepatitis and HIV for over 16-year-olds. Only the discovery of TB will mean people will be automatically denied a visa, other conditions will be dealt with on a \"case by case basis\".\n \n There is already some screening in place. Last year 185,000 people were tested for TB at Heathrow and Gatwick airports, only about 200 were found to be infected. And Dr John Moore-Gillon, of the British Lung Foundation, said: \"TB is not simply imported, we are seeing a rise in many sections of the UK-born population as well.\" The government says the Tories are \"a bit late\" to the issue. Immigration minister Des Browne quoted its five-year plan for immigration and asylum, as saying: \"We are implementing our existing powers by targeted health screening for TB in high-risk areas at the entry clearance stage. \"Those who are diagnosed would then need to seek treatment at home before being allowed to enter the UK.\" Meanwhile Mark Oaten, Liberal Democrat home affairs spokesman, said: \"This is another worrying step in the war of words over asylum and immigration between Labour and the Conservatives. \"Michael Howard knows perfectly well what bigger game he is playing, and history proves it is a very dangerous one.\" Lisa Power, head of policy at Aids charity the Terrence Higgins Trust said the policy was prejudice-based rather than evidence-based. \"In fact, it would be more likely to drive people with health conditions to falsify tests while others gain entry by simple dint of their EU status,\" she said.\n", "llama3.2:1b": ["Tories plan for migrant health checks in UK, which include:\n- Chest X-ray for TB from outside the EU for 6-12 months\n- Demonstrating an acceptable standard of health from outside the EU to settle permanently\n- Showing unlikely danger to public health and NHS costs\n- Screening for hepatitis and HIV for over 16-year-olds\n- Automatic denial of visa to people with positive TB results, case-by-case for HIV\n- Existing screening in place at Heathrow and Gatwick airports\n\nThe proposals aim to protect public health and the NHS, but critics argue they are \"prejudice-based\" rather than evidence-based."], "llama3.2:3b": ["Tories plan to require non-EU migrants wanting to work in UK to undergo TB and HIV tests, potentially leading to visa denials if TB is positive; the plans are based on policies in Canada, New Zealand, and Australia; Labour says many tests are already done; Lib Dems warn against \"pandering to prejudice\"; proposals also include health checks for permanent settlers from high-risk countries."], "gemma2:2b": ["The Conservative party plans to require non-EU citizens who want to work in the UK to undergo TB and HIV testing.", "Positive test results will result in visa rejection for TB, while cases are dealt with individually for HIV.", "The Conservatives argue this protects public health and the NHS.", "This plan is based on existing practices in other countries and would only apply to those coming to the UK for more than six months unless they intend to work in specific fields.", "Labour criticizes the plans as unnecessary and redundant, while the Lib Dems warn against prejudice."], "qwen2.5:0.5b": ["Tribunal: The UK plans to screen non-UK citizens for TB and HIV as part of the immigration decision-making process.", "Summary: Conservative proposals include a health check on non-UK citizens, with a focus on tuberculosis (TB) and HIV.", "This will result in visa denials due to tests that already have screening in place.", "Liberal Democrat concerns about discrimination against EU residents while protecting public health are echoed in Labour's position."], "qwen2.5:1.5b": ["The Conservatives announced plans to require non-EU migrants seeking work in the UK to undergo TB and HIV tests, aiming to protect public health and safeguard good standards of public health enjoyed by Britain.", "The proposals would apply only to those coming for more than six months unless they intend to work in healthcare or education fields.", "While Labour acknowledges existing screenings are done, the Lib Dems warn against \"pandering to prejudice.\"", "The UK has seen a rise in TB cases among both foreign and native-born individuals due to increased incidence rates worldwide, including within high-risk countries like Canada and Australia, which influence immigration policies."], "qwen2.5:3b": ["Tories propose non-EU migrants undergo TB and HIV tests for visa applications if they plan to work in the UK.", "Positive TB test results could lead to visa rejection, while HIV cases would be handled individually.", "The measures are aimed at safeguarding public health and protecting NHS resources.", "However, critics argue that such checks already exist elsewhere and may unfairly discriminate against migrants.", "Proposed tests include chest X-rays for those from high-TB incidence countries staying 6-12 months or longer planning to work in healthcare, teaching, childcare, or social care.", "The government claims these are based on existing policies in Canada, New Zealand, and Australia.", "Critics like Dr John Moore-Gillon suggest TB is not solely imported but also occurring within UK-born populations.", "Lisa Power of the Terrence Higgins Trust views this as a prejudice-based policy without evidence, potentially leading to false testing or denial of entry based on EU status."], "opencoder:1.5b": ["Tories plan migrant health checks\n\nNon-European Union citizens wanting to work in the UK will have to undergo tests for Tuberculosis and HIV, under plans unveiled by the Conservatives.", "A positive test for TB would mean visa applications being turned down; while a negative test can lead to death or permanent disability.", "The leader of the group, Michael Howard, is saying the checks on new arrivals could help protect public health and the NHS.", "Labour support his concerns about pandering to prejudice.", "The proposals, which will be brought in if the Conservatives win the General Election, would not apply to people coming to the UK for less than six months unless they intend to work in health or childcare or teaching.", "Mr Howard’s plans are based on existing policies that can protect good standards of public health enjoyed by Britain.", "As for government figures, TB incidence has increased significantly over the past decade.", "Almost two-thirds of people with TB have a baby born abroad.", "The BBC's Today programme also highlighted a very concerning situation about who is eligible to receive these tests in the UK and how they should be conducted.", "Nonetheless, Mr Howard's advice is sound.", "The plans would not affect asylum applicants' claims but he was suggesting the same on his own.", "The tests include:\n\n- People coming to the UK from outside the EU will have to undergo a chest X-ray.", "- They will also show they are unlikely to be at risk of TB and are unlikely to impose significant costs or demands on the NHS.", "- Last year 185,000 people were tested for TB at Heathrow and Gatwick airports.", "Only about 200 cases were identified as having TB.", "Dr John Moore-Gillon, British Lung Foundation's executive director said: \"TB is not simply imported, we are seeing a rise in many sections of the UK-born population as well.", "This shows a greater need for health screening, particularly in high-risk areas.\"", "The government says it is \"a bit late\" to discuss this issue."], "smollm:1.7b": ["The summary should include:\n* The main points from the original text, in a concise and clear manner.", "* Key ideas and details, without including unnecessary information or explanations.", "* No interpretation or analysis is necessary; simply present the facts as they are in the original text.", "Here's an example of how this summary could be written:\n\n\"The Tories plan migrant health checks for new arrivals to the UK, under plans unveiled by Labour leaders.", "The Lib Dems warned both parties against 'pandering to prejudice' and said the plans would not affect asylum applicants' claims.", "Mr Howard said the plans were based on policies already in action in Canada, New Zealand and Australia.", "\"I don't think a responsible government can stand aside and do nothing in the face of this problem.\"", "But Mr Howard said the plans would not affect asylum applicants' claims.", "\"I don't think a responsible government can stand aside and do nothing in the face of this problem.\"", "But Mr Howard said the plans would not affect asylum applicants' claims.", "\"I don't think a responsible government can stand aside and do nothing in the face of this problem.\"", "The plans include: - People coming to the UK from outside the EU for between six and 12 months from a \"high incidence TB country\" will have to undergo a chest X-ray.", "- People coming to settle in the UK permanently from outside the EU will have to demonstrate they are unlikely to be a danger to public health and are unlikely to \"impose significant costs or demands\" on the NHS.", "Only the discovery of TB would mean people will be automatically denied a visa, other conditions will be dealt with on a \"case by case basis.\"", "There is already some screening in place.", "Last year 185,000 people were tested for TB at Heathrow and Gatwick airports, only about 200 were found to be infected.", "And Dr John Moore-Gillon of the British Lung Foundation said: \"TB is not simply imported, we are seeing a rise in many sections of the UK-born population as well.\"", "The government says the Tories are \"a bit late\" to the issue.", "Michael Howard knows perfectly well what bigger game he is playing, and history proves it is a very dangerous one.", "Lisa Power, head of policy at Aids charity the Terrence Higgins Trust said the policy was prejudice-based rather than evidence-based.", "\"In fact, it would be more likely to drive people with health conditions to falsify tests while others gain entry by simple dint of their EU status,\" she said."], "deepseek-r1:1.5b": ["The Conservative government plans to implement TB and HIV screening tests on non-European Union citizens in the UK.", "This will prevent some visa applications from being turned down due to TB, while handling HIV cases individually.", "The increase in TB by 25% over 10 years highlights the need for such checks.", "Tests are only applied if people intend to work in health or childcare or teaching and will restrict screening for less than six months unless working.", "Public health standards are emphasized, with guidance on what to expect, including automatic denial of visas for TB discovers.", "Specific tests include chest X-rays for TB (excluding children) and hepatitis/hIV checks for over 16-year-olds."], "tinyllama:1.1b": ["The Conservative Party has proposed migrants undergo checks for TB and HIV as part of plans to deal with public health concerns, as well as Tuberculoziis and HIV.", "The tests will be carried out at Heathrow and Gaitswick airports, among other locations, but there is currently some screening in place.", "Immigration minister Des Brownlee stated that the five-year plan for immigration and asylum was already implemented, and the government plans to implement \"targeted health screenings\" of high-risk areas at the entry clearance stage.", "Labour and the Liberal Democrats both criticized the proposals for being based on policies already in place, and Aids charity Terrence Higgins Trust stated that prejudice-based rather than evidence-based."], "tinydolphin:1.1b": [" The Conservatives have announced plans to introduce migrant health checks for EU citizens in the UK.", "This move aims to protect public health and maintain the high standards of public health that Britain enjoys.", "Non-European Union citizens wishing to work in the UK will be required to undergo tests for Tuberculosis and HIV, as well as certain other conditions such as hepatitis and HIV.", "The tests would need to be completed within six months unless a preliminary test has already been carried out.", "A positive test for TB would mean that visa applications would be rejected, while those with HIV would have their cases handled case by case.", "Leader Michael Howard announced these plans on the eve of the UK's General Election.", "The proposals have been met with criticism from some quarters, with many claiming they are an attempt to \"pander to prejudice.\"", "Labour has expressed concerns about the impact of these new health checks on public health and the NHS."], "phi:2.7b": [" The text is about the Conservative Party's plans to require non-EU migrants seeking to work in the UK to undergo health checks for TB and HIV.", "The plan aims to protect public health and the NHS from potential health risks posed by these diseases.", "However, Labour and the Liberal Democrats have criticized the plan as prejudice-based and unnecessary, arguing that many tests are already in place.", "The proposals would not apply to migrants coming to the UK for less than six months unless they intend to work in certain sectors, such as healthcare or childcare.", "If the Conservatives win the General Election, these plans could be brought in."], "orca-mini:3b": [" The Conservatives plan to require non-European Union citizens applying for visas to undergo tuberculosis and HIV tests upon arrival in the UK, with only positive tests leading to visa applications being denied.", "The tests would be required for all non-EU immigrants who settle permanently in the country, and those over 16 years old.", "The tests would not apply to asylum applicants or those seeking temporary entry.", "The government is already conducting tuberculosis screening at airports but plans to expand it to all non-EEA immigrants.", "Tuberculosis is a growing concern in the UK, with rates increasing by 25% in the past decade.", "However, the Liberal Democrats warned against \"pandering to prejudice\" and called for evidence-based policies."], "hermes3:3b": ["Tories plan TB and HIV tests for non-EU migrants entering UK for work, if elected."], "stablelm-zephyr:3b": ["Non-EU citizens planning to work in the UK will need to undergo tests for tuberculosis (TB) and HIV, as announced by the Conservatives.", "Positive results for TB would lead to visa refusals, while HIV cases would be dealt with on a case-by-case basis.", "These plans, set to be implemented if the party wins the General Election, do not apply to individuals staying in the UK for less than six months unless they plan to work in healthcare or related fields.", "The ideas are based on policies already in place in Canada, New Zealand, and Australia, with TB incidence increasing by 25% in England over the past ten years.", "Critics argue that this policy is prejudiced and could lead to people with health conditions falsifying tests for entry purposes."], "chatgpt-4o-latest": ["The UK Conservative Party proposed mandatory health checks for non-EU migrants, including tests for TB and HIV, to protect public health and the NHS.", "A positive TB test would result in visa denial, while HIV cases would be assessed individually.", "The policy, inspired by Canada, New Zealand, and Australia, would apply to those staying over six months, except for certain professions.", "Labour noted existing screenings, while the Liberal Democrats criticized the plan as pandering to prejudice.", "Critics, including health experts and charities, argued the policy was not evidence-based and could encourage falsification of test results.", "The government claimed it was already implementing targeted TB screening."], "stablelm2:1.6b": ["The Conservatives plan for UK work visa applicants to undergo TB and HIV tests, including a chest X-ray for six-to-12-month visitors from \"high incidence TB countries.\"", "Positive results in TB or HIV would cause visa rejections.", "These measures will not affect asylum applicants but aim to safeguard public health standards.", "The proposal follows policies in Canada, New Zealand, and Australia; similar screening exists at Heathrow and Gatwick airports.", "Some argue the policy is prejudice-based rather than evidence-based, while others caution against pandering to \"prejudice.\""], "granite3.1-dense:2b": ["The Conservatives propose mandatory TB and HIV health checks for non-EU citizens seeking long-term employment in the UK, aiming to protect public health and the NHS.", "Positive TB results would disqualify visa applications, while HIV cases would be managed individually.", "This initiative is based on policies from Canada, New Zealand, and Australia, addressing increasing TB prevalence among EU nationals (25% growth over 10 years).", "Key measures include:\n- TB chest X-rays for those arriving temporarily from high-incidence TB countries (6-12 months)\n- Comprehensive health assessments, including TB tests for adults and hepatitis/HIV screenings\n- Demonstration of good health and no threat to public welfare or NHS resources\n\nCritics argue the policy is prejudice-based, with Labour stating many tests are already conducted.", "The Liberal Democrats warn against \"pandering to prejudice,\" while Aids charity THT believes it could incentivize falsified test results or EU status exploitation.", "Immigration Minister Des Browne counters that the government's existing five-year plan already includes targeted health screenings for TB at entry points."]}