{"raw_text": "MPs issued with Blackberry threat\n \n MPs will be thrown out of the Commons if they use Blackberries in the chamber Speaker Michael Martin has ruled.\n \n The £200 handheld computers can be used as a phone, pager or to send e-mails. The devices gained new prominence this week after Alastair Campbell used his to accidentally send an expletive-laden message to a Newsnight journalist. Mr Martin revealed some MPs had been using their Blackberries during debates and he also cautioned members against using hidden earpieces.\n \n The use of electronic devices in the Commons chamber has long been frowned on. The sound of a mobile phone or a pager can result in a strong rebuke from either the Speaker or his deputies. The Speaker chairs debates in the Commons and is charged with ensuring order in the chamber and enforcing rules and conventions of the House. He or she is always an MP chosen by colleagues who, once nominated, gives up all party political allegiances.\n", "llama3.2:1b": ["MPs will be thrown out of the Commons if they use Blackberries in the chamber, according to Speaker Michael Martin, due to their potential to disrupt order and cause strong rebukes from the speaker or his deputies."], "llama3.2:3b": ["MPs will be ejected from the Commons for using Blackberries during debates, according to Speaker Michael Martin, due to concerns over electronic device use disrupting the chamber."], "gemma2:2b": ["MPs are prohibited from using Blackberries in the House of Commons due to Speaker Michael Martin's ruling.", "This rule applies to devices used as phones, pagers, and email devices, following Alastair Campbell's use of his Blackberry to accidentally send an inappropriate message.", "Hidden earpieces are also forbidden due to concerns about order and decorum during debates."], "qwen2.5:0.5b": ["MPs will be suspended from the Commons if they use Blackberries during their debates.", "The device can be used for sending e-mails, phone calls, and sending messages.", "The Speaker of the House is concerned about MPs using hidden earpieces while in the chamber.", "He warned against it and cautioned them not to do so."], "qwen2.5:1.5b": ["Members of Parliament (MPs) may be removed from the Commons if they use Blackberry devices.", "The Speaker, Michael Martin, has banned their use due to concerns about communication during debates and hidden earpieces.", "MPs have previously been warned against using mobile phones or pagers in the chamber."], "qwen2.5:3b": ["MPs will be expelled from the Commons if they use Blackberries in the chamber.", "These £200 handheld devices can function as phones, pagers, or send emails.", "This came to light after Alastair Campbell accidentally sent an offensive message via his BlackBerry.", "Speaker Michael Martin warned MPs against hidden earpieces and that some were using their BlackBerrys during debates.", "Use of electronic devices has long been discouraged in the Commons chamber; mobile phones and pagers disrupt order, leading to rebukes from the Speaker or deputies.", "The Speaker is always a fellow MP who resigns party allegiances once appointed."], "opencoder:1.5b": ["MPs issued with Blackberry threats will be thrown out of the Commons if they use Blackberries in the chamber Speaker Michael Martin has ruled.", "The £200 handheld computers can be used as a phone, pager or to send e-mails.", "Alastair Campbell used his Blackberry to accidentally send an expletive-laden message to a Newsnight journalist.", "Mr Martin revealed some MPs had been using their Blackberries during debates and he also cautioned members against using hidden earpieces.", "The use of electronic devices in the Commons chamber has long been frowned on.", "The sound of a mobile phone or a pager can result in a strong rebuke from either the Speaker or his deputies.", "The Speaker chairs debates in the Commons and is charged with ensuring order in the chamber and enforcing rules and conventions of the House.", "He or she is always an MP chosen by colleagues who, once nominated, gives up all party political allegiances."], "smollm:1.7b": ["The MPs will be thrown out of the Commons if they use Blackberries in the chamber Speaker Michael Martin has ruled.", "MPs can use their Blackberries to send e-mail messages, pagers or as a phone.", "The devices gained new prominence this week after Alastair Campbell used his to accidentally send an expletive-laden message to a Newsnight journalist.", "Mr. Martin warned some MPs that they should not use their Blackberries during debates and cautioned them against using hidden earpieces.", "The use of electronic devices in the Commons chamber has long been frowned on.", "The sound of a mobile phone or pager can result in a strong rebuke from either the Speaker or his deputies.", "The Speaker chairs debates in the Commons and is charged with ensuring order in the chamber and enforcing rules and conventions of the House.", "He or she is always an MP chosen by colleagues who, once nominated, gives up all party political allegiances."], "deepseek-r1:1.5b": ["MPs are prohibited from using Blackberries in the Commons chamber.", "The speaker, Michael Martin, has ruled this out.", "£200 handheld computers can function as phones, pagers, or send emails.", "During debates, some MPs used Blackberries, and Mr Martin advised against hidden earpieces.", "The Commons are often uncooperative; mobile devices can cause strong rejections from the Speaker or deputies."], "tinyllama:1.1b": ["MPs are advised to avoid using Blackberries in the Commons chamber due to security risks and Speaker Michael Martin's ruling that these devices can be used as phones, pages or to send e-mails during debates.", "The use of electronic devices has long been frowned upon by MPs who are charged with upholding order in the House and enforcing convention rules.", "The Speaker chairing debates and adhering to party political allegiance resigns from his or her position if they violate these laws."], "tinydolphin:1.1b": [" MPs are being warned to avoid using Blackberries during debates and other proceedings in the Commons chamber.", "Speaker Michael Martin has issued a ruling, stating that MPs will be removed from the House of Commons if they use these devices indiscretly.", "The ban comes amidst growing concerns about the increasing use of electronic devices by Members of Parliament (MPs).", "In recent weeks, prominent figures like Alastair Campbell have been caught using Blackberries to communicate with reporters during live broadcasts on Newsnight.", "The Speaker, who has chosen to chair debates in the Commons chamber for the past decade, is concerned about the impact that these devices can have on the conduct of proceedings and the disruptive behavior they may engender.", "According to Mr. Martin, MPs should avoid using hidden earpieces or carrying them around with them during debates.", "Instead, he advises them to use handheld electronic devices that are securely stored out of sight to ensure a smooth and orderly proceeding.", "This ban on electronic devices in the Commons chamber represents a significant shift in parliamentary protocols.", "It is a reflection of increasing concerns about the potential for misconduct or disruptive behavior among MPs who use these devices indiscretiously.", "The Speaker's ruling has led to outrage among some MPs and critics argue that it goes too far in cracking down on misconduct.", "However, there is no guarantee that the ban will be enforced.", "Some MPs may attempt to circumvent the rule by using their Blackberries discreetly or by employing alternative methods of communication during debates.", "The ruling also does not address other electronic devices such as mobile phones and pagers, which are increasingly used by Members of Parliament in their personal lives.", "It is unclear whether these devices will be permitted on the House of Commons floor or if they will be subject to the same rules imposed on Blackberries."], "phi:2.7b": [" MPs are warned against using Blackberries in the Commons because they can be used as phones, pagers, and to send e-mails.", "The Speaker of the Commons has already stated that MPs will be thrown out if they use the devices during debates.", "Electronic devices can also lead to a rebuke from the Speaker or his deputies due to the sound of the device disrupting the debate."], "orca-mini:3b": [" MPs will be expelled from the Commons if they use Blackberries during debates.", "The devices can be used as phones, pagers, or to send emails.", "In the past few days, Alastair Campbell accidentally sent a profanity-laden message to a Newsnight journalist using his Blackberry.", "The Speaker warned members against using hidden earpieces and enforcing rules and conventions of the House."], "hermes3:3b": ["Blackberries banned in UK MPs' chambers; violation may result in expulsion."], "stablelm-zephyr:3b": ["MPs warned they'll be thrown out of the Commons if they use Blackberries during debates, after Speaker Michael Martin revealed some members had been using them during sessions.", "The handheld computers can also send emails and serve as phones or pagers.", "Electronic devices have long been discouraged in the chamber due to potential disruption caused by their sound."], "chatgpt-4o-latest": ["MPs will be expelled from the Commons if they use Blackberries in the chamber, Speaker Michael Martin has ruled.", "The handheld devices, which function as phones, pagers, and email senders, gained attention after Alastair Campbell accidentally sent an expletive-laden message.", "Martin warned that some MPs had been using Blackberries during debates and cautioned against hidden earpieces.", "The use of electronic devices in the chamber has long been discouraged, with mobile phone sounds often leading to reprimands.", "The Speaker, responsible for maintaining order, is an MP who relinquishes party ties upon nomination."], "stablelm2:1.6b": ["MPs could be expelled from the House if they use Blackberries during parliamentary debates, according to Speaker Michael Martin.", "The handheld devices can also function as phones, pagers, and emails; they gained prominence when former UK government chief press officer Alastair Campbell accidentally sent an expletive-filled message.", "The Commons disapproves of electronic device usage in the chamber, which can lead to rebukes from the Speaker or his deputies.", "Speaker Martin chairs parliamentary debates, enforces rules, and endorses conventions upheld by the House.", "MPs are elected representatives chosen for their commitment to party politics once nominated."], "granite3.1-dense:2b": ["Speaker Michael Martin has banned MPs from using Blackberries during Commons debates due to potential disruption, citing incidents like Alastair Campbell's inadvertent expletive-filled message to a journalist.", "The Speaker, who chairs debates and maintains order, previously warned against hidden earpieces as well.", "The use of electronic devices in the chamber is generally prohibited due to disturbances caused by their sounds."]}