{"raw_text": "UKIP candidate suspended\n \n Eurosceptic party UKIP have suspended a candidate for allegedly suggesting the criminally insane should be killed.\n \n John Houston, 54, was due to stand in the East Kilbride seat in Lanarkshire at the next election. But he was suspended after his reported views, including the return of the British Empire, were sent to two Scottish newspapers. UKIP spokesman Mark Croucher said those who selected Mr Houston knew nothing of his views. The episode comes at a difficult time for UKIP, soon after the high-profile departure of MEP Robert Kilroy-Silk. Mr Houston is alleged to have said that the organs of the criminally insane should be \"made available to law-abiding members of the community\" and proposed the legalisation of drugs and the sex trade. The document reportedly said: \"We're looking for the resurrection of the British Empire. \"The problems for the human race - environmental and others - can only be dealt with on a global scale, and that calls for a radical alliance of the English-speaking nations, which they are uniquely able to do.\" Mr Croucher said the main issue would be that Mr Houston's reported views had been presented as UKIP policy, which they were not. He said they might have been submissions to a committee working on the party's manifesto, but would not have been matched to Mr Houston when he was standing to become a candidate. He told BBC News: \"He appears to have said these things. We have suspended him as a member and as a candidate. \"By all accounts none of this was mentioned at his selection meeting. \"It is simply a distraction from the task in hand, the EU constitution, not individual idiocies.\" Mr Houston was quoted in the Herald newspaper saying: \"I feel UKIP have over-reacted and overshot the runway.\"\n \n Peter Nielson, who is UKIP Scotland chairman, said he had suspended Mr Houston on Friday night. \"He will remain suspended while the matter is being investigated and then we will decide if and what further action will be taken.\" He said that any evidence would be looked into and Mr Houston may be interviewed by the party. He added: \"I can't comment too much at the moment, I have one version from him but I haven't seen the papers yet.\"\n", "llama3.2:1b": ["UKIP candidate John Houston is suspended after allegedly suggesting to two Scottish newspapers that organs of the criminally insane should be made available to law-abiding members of the community.", "This comes after he proposed the legalisation of drugs and the sex trade, calling for the resurrection of the British Empire on a global scale.", "The suspension was made public by UKIP's spokesman Mark Croucher."], "llama3.2:3b": ["UKIP has suspended candidate John Houston over his reported views on the criminally insane, drug legalization, and sex trade, which were sent to Scottish newspapers.", "The party maintains that these views were not representative of their policy, but had been presented as submissions to a committee working on the manifesto."], "gemma2:2b": ["UKIP suspended candidate John Houston after his reported views on euthanasia of criminals, legalization of drugs and sex trade were leaked to newspapers.", "UKIP denies any connection between those views and their policy.", "The party says that Mr. Houston was not representing UKIP while seeking candidacy and will be investigated further before a decision is made about the next step."], "qwen2.5:0.5b": ["UKIP suspended John Houston as a candidate for the Lanarkshire seat after he reportedly suggested that the criminally insane should be killed.", "The UKIP spokesperson claimed those who selected him knew nothing of his views.", "This development comes at a time when UKIP is facing challenges following the departure of MEP Robert Kilroy-Silk."], "qwen2.5:1.5b": ["UKIP suspended John Houston, a candidate for East Kilbride seat in Lanarkshire, after he reportedly said criminally insane should be killed and advocated resurrecting British Empire.", "Houston's statements were sent to two Scottish newspapers, causing controversy for UKIP.", "The party spokesman stated the suspension is due to allegations that Houston's views misrepresented their policy."], "qwen2.5:3b": ["UKIP candidate John Houston, 54, suspended for allegedly suggesting the criminally insane should be killed and proposing legalisation of drugs and sex trade.", "The incident occurred during a difficult time for UKIP after Robert Kilroy-Silk's departure.", "Houston’s views were presented in a document titled \"The Resurrection of the British Empire,\" including environmental concerns requiring a global alliance.", "UKIP spokesman Mark Croucher confirmed these were not official party policies, but Mr. Houston appeared to have made the statements during selection meetings.", "UKIP Scotland chairman Peter Nielson announced suspension pending further investigation and potential additional action against Houston."], "opencoder:1.5b": ["The key idea in this summarization is the suspension of John Houston for his alleged views on a criminal orgy, including the resurrection of the British Empire.", "The episode of suspending Mr Houston highlights the difficulties UKIP faces after leaving MEP Robert Kilroy-Silk and its subsequent escalation into a major conflict.", "However, it also provides an indirect explanation of why these actions were necessary."], "smollm:1.7b": ["The UKIP candidate suspended for allegedly suggesting the criminally insane should be killed is a key idea in this text.", "The summary should preserve the main points and details of the original text while avoiding unnecessary information.", "Here's how you could do it:\n\n\"UKIP candidate suspended for alleged suggestions on criminally insane.\""], "deepseek-r1:1.5b": ["John Houston was suspended by UKIP due to allegations of suggesting the criminally insane should be killed.", "He was expected to run in East Kilbride's upcoming election but faced suspension after his views were mentioned in two Scottish newspapers.", "Croucher questioned whether these comments were party policy or from a committee working on the manifesto, not Houston himself.", "The documents criticized global issues and called for an English radical alliance.", "Nielson suspended Houston Friday night, saying evidence would be investigated and he might later be interviewed, dismissing his comments as distractions."], "tinyllama:1.1b": ["UKIP candidate John Houston was suspended after it was revealed that he reportedly suggested legalizing drugs and the sex trade to a Scottish newspaper.", "The party spokeman Mark Croucher said that those who selected Mr. Houston knew nothing of his views, and the document reportedly presented as UKIP policy was submitted as party policy but would not have been matched at his selection meeting.", "When he was standing to become a candidate, he appeared to have said these things without mentioning them at his selection meeting, which suggests that they were submissionson the party's manifestos.", "The suspension followed an internal investigation by UKIP Scotland chairman Peter Nielson, who reportedly found no evidence of misconduct.", "Any further action may be taken once more evidence is received and Mr. Houston is interviewed."], "tinydolphin:1.1b": [" The suspension of a UKIP candidate for suggesting that criminals should be killed was reported after John Houston made an alleged statement about returning the British Empire and making available organs to law-abiding members of society.", "Eurosceptic party UKIP is facing scrutiny after this incident, as it has faced several high-profile departures recently due to internal disagreements and controversies."], "phi:2.7b": [" UKIP suspended a candidate for suggesting criminals should be killed and promoting policies including the return of the British Empire.", "John Houston was due to stand in an upcoming election in East Kilbride.", "His views were reported to Scottish newspapers, leading to his suspension by party spokesman Mark Croucher.", "UKIP believes that Mr Houston's views have been presented as their policy, which they are not.", "The incident comes at a difficult time for the party after a high-profile departure of an MEP.", "Mr Croucher has said that the matter will be investigated and Mr Houston may face further action if his views are found to be UKIP policies.", "Peter Nielson, chairman of UKIP Scotland, has also suspended Mr Houston pending further investigation."], "orca-mini:3b": [" UKIP candidate suspended after reportedly suggesting the criminally insane should be killed and advocating for the legalization of drugs and sex trade."], "hermes3:3b": ["UKIP candidate John Houston suspended over claims he advocated killing criminally insane and returning British Empire."], "stablelm-zephyr:3b": ["UKIP candidate John Houston was suspended for allegedly suggesting that criminally insane people should be killed, and their organs should be available to law-abiding members of society.", "His views, including the return of the British Empire and legalization of drugs and the sex trade, were reportedly sent to two Scottish newspapers by unknown sources within UKIP.", "The party has suspended Houston as a member and candidate, claiming his reported views were not representative of their actual policy."], "chatgpt-4o-latest": ["UKIP has suspended candidate John Houston after reports surfaced that he advocated for the execution of the criminally insane and the return of the British Empire.", "Houston, who was set to stand in East Kilbride, allegedly suggested using the organs of the criminally insane for law-abiding citizens and proposed legalizing drugs and the sex trade.", "UKIP spokesman Mark Croucher stated that Houston's views were not party policy and were unknown at the time of his selection.", "The suspension comes amid internal challenges for UKIP, following the departure of MEP Robert Kilroy-Silk.", "UKIP Scotland chairman Peter Nielson confirmed Houston's suspension pending an investigation, stating that further action would be determined after reviewing the evidence.", "Houston criticized the party's response, calling it an overreaction."], "stablelm2:1.6b": ["UKIP candidate John Houston has been suspended after allegedly suggesting that mentally ill people should be killed and proposing drug legalization in a document sent to Scottish newspapers.", "The main issue is whether Houston's reported views were presented as UKIP policy, which they weren't.", "Houston claims UKIP overreacted and suspended him temporarily while the matter is being investigated with possible further action from the party."], "granite3.1-dense:2b": ["UKIP has suspended John Houston, a candidate for the East Kilbride seat in Lanarkshire, due to alleged controversial views.", "These views, circulated to Scottish newspapers by an unnamed source, included advocating for organ donation from the criminally insane and legalizing drugs and the sex trade.", "Houston also proposed reviving the British Empire for global problem-solving.", "UKIP spokesman Mark Croucher stated that those involved in selecting Houston were unaware of these views, which are not part of UKIP's official policy.", "The suspension comes amidst UKIP's recent challenges, following the departure of MEP Robert Kilroy-Silk.", "Houston has criticized UKIP for overreacting and wasting time on personal matters instead of focusing on the EU constitution.", "UKIP Scotland chairman Peter Nielson confirmed the suspension and stated that further action would be determined after an investigation into the evidence, including potential interviews with Houston."]}