{"raw_text": "UK helps raped Rwandan women\n \n Britain is to give a £4m grant to help women survivors of the Rwandan genocide who were raped and often deliberately infected with HIV/Aids.\n \n An estimated 25,000 girls and women were raped during the 1994 genocide. About 800,000 Tutsis and moderate Hutus were killed by Hutu militias after the assassination of an ethnic Hutu leader. The five-year Department for International Development funding will enable more survivors to have access to anti-retroviral treatment.\n \n The plight of the infected women was overshadowed for a long time. It was overshadowed by Rwanda's emergence from the 100 days of slaughter, during which time the mass killings took place, and the women's fate was largely a taboo subject. But many of the women were widowed and they now not only have their own children to care for but, in many cases, orphans too.\n \n As the women die, the number of Rwanda's orphans rises. Until recently, very few of the women have had access to anti-retroviral treatment. That is now starting to change. This funding is intended to make anti-retrovirals and other care available for some 2,500 women. Mary Kayitesi Blewitt, founder of the Survivors Fund (SURF), one of the organisations through which the funds are being channelled, said it was a recognition, before it was too late, that the survivors should be a priority for help.\n", "llama3.2:1b": ["The UK is providing £4m to support women survivors of the Rwandan genocide who were raped and infected with HIV/AIDS.", "The funding will enable access to anti-retroviral treatment for 2,500 women, including those who have orphans due to widows."], "llama3.2:3b": ["UK to give £4m grant to help Rwandan women raped during genocide, provide anti-retroviral treatment and care."], "gemma2:2b": ["The UK will provide a £4 million grant to support Rwandan women who were raped during the 1994 genocide and infected with HIV/AIDS.", "This funding will improve access to anti-retroviral treatment for approximately 2,500 women.", "This assistance comes after years of limited attention to the plight of these women, as they face multiple challenges including orphanhood."], "qwen2.5:0.5b": ["A £4m grant is to be given by Britain to help women who were raped during the Rwandan genocide and are now widowed.", "The fund will provide anti-retroviral treatment to many of these women who have lost their own children and/or orphans.", "Mary Kayitesi Blewitt, founder of the Survivors Fund (SURF), said that the funding is a recognition that the survivors should be a priority for help."], "qwen2.5:1.5b": ["Britain to provide £4m grant to aid Rwandan rape survivors infected with HIV/AIDS.", "This funding aims to increase access to anti-retroviral treatment and care for about 2,500 women raped during the genocide, many of whom have become orphans due to loss of their husbands/fathers.", "The initiative recognizes that these women's needs were previously overlooked and highlights the urgency in providing support after so much has been lost."], "qwen2.5:3b": ["UK provides £4m grant to assist Rwandan women raped during genocide, many infected with HIV/AIDS.", "Around 25,000 girls and women were raped in 1994 Rwandan genocide; about 800,000 people died.", "The funding aims to provide anti-retroviral treatment for approximately 2,500 survivors, focusing on those who are widowed with orphans.", "Despite initial taboo surrounding the issue, access to HIV/AIDS treatments is now improving but remains limited.", "Mary Kayitesi Blewitt of SURF views this as a timely recognition that these survivors should receive priority aid."], "opencoder:1.5b": ["UK helps raped Rwandan women\n\nBritish government has announced a grant to help women survivors from the Rwandan genocide who were raped and often infected with HIV/Aids.", "The 1994 genocide marked an unprecedented shift in the state of Rwanda, where women's lives and their families' prosperity are crucial.", "The Hutu (Hutu military) used a combination of weapons including semi-automatic handgun shots to assassinate a Hutu ethnic leader who had betrayed her.", "This marked a turning point in Rwanda's history, as the country emerged from its slaughter in 100 days.", "The women were rescued by non-Ghanaiwomen and were widowed or widowers.", "They now have children for care, and often orphaned ones too.", "The government's funding aim is to make anti-retroviral treatment available to these women who are dying of the virus they infected with AIDS.", "In this context, it wasn't just about access to treatment but about their future, as there were fears that many of the survivors might choose not to receive such treatment due to complications.", "The government’s Survivors Fund aims to increase access for those who have the means and resources to pay for treatment.", "Mary Kayitesi Blewitt, who founded SURF, recognized that the survivors should be made a priority in terms of providing help.", "Despite the initial delay, it has been clear that the survivors need better treatment, whether through traditional or alternative forms such as anti-retroviral drugs.", "The government is committed to advancing this cause, making treatments more accessible and improving overall health."], "smollm:1.7b": ["The UK is to give a £4m grant to help women survivors of the Rwandan genocide who were raped and often deliberately infected with HIV/Aids.", "The estimated 25,000 girls and women were raped during the 1994 genocide.", "About 800,000 Tutsis and moderate Hutus were killed by Hutu militias after the assassination of an ethnic Hutu leader.", "The five-year Department for International Development funding will enable more survivors to have access to anti-retroviral treatment.", "The plight of the infected women was overshadowed for a long time.", "It was overshadowed by Rwanda's emergence from the 100 days of slaughter, during which time the mass killings took place, and the women's fate was largely a taboo subject.", "But many of the women were widows and they now not only have their own children to care for but, in many cases, orphans too.", "As the women die, the number of Rwanda's orphans rises.", "Until recently, very few of the women have had access to anti-retroviral treatment.", "That is now starting to change.", "This funding is intended to make anti-retrovirals and other care available for some 2,500 women.", "Mary Kayitesi Blewitt, founder of the Survivors Fund (SURF), one of the organisations through which the funds are being channelled, said it was a recognition, before it was too late, that the survivors should be a priority for help."], "deepseek-r1:1.5b": ["UK has provided a £4m grant to help survivors of the Rwandan genocide receive anti-retroviral treatment.", "Around 25,000 women were killed by Hutus during the genocide in 1994, many of whom became widows and now have children but also face orphanages with high rates of child deaths each year.", "However, much progress has been made toward accessing medical care for survivors through initiatives like the Survivors Fund (SURF)."], "tinyllama:1.1b": ["UK helps women raped in Rwandan genocide to survive and access treatment for HIV/AIDS after overshadowed by their plight, according to an estimated 25,000 girls and women who were raped during the 1994 mass killing.", "The five-year Department for International Development funding will enable more survivors to have access to anti-retrovials treatment.", "The aid agency will help over 2,500 women survivoers who have orphaned children and some are widowed.", "The women's situation has been largely taboo until recently, but with the funding, they will receive treatment for their HIV/AIDS infections.", "This is a recognition before it was too late that rape survivors should be prioritized for help, as stated by the founder of the Survivors Fund, Mary Kayitesi Blewiett."], "tinydolphin:1.1b": [" Britain is to provide £4 million in aid to assist women who were raped during the Rwandan genocide and subsequently infected with HIV/AIDS.", "This funding aims to support the survivors' access to anti-retroviral treatment, which can significantly prolong their lives and help manage their health conditions.", "Overcoming the stigma surrounding women who are infected with HIV will also contribute to raising awareness of the global epidemic among communities worldwide.", "The funding is expected to benefit an estimated 25,000 survivors in total, providing a much-needed source of support and treatment for many."], "phi:2.7b": [" Britain is giving £4 million to help women who were raped and infected with HIV/AIDS during the Rwandan genocide.", "The funding will provide access to anti-retroviral treatment for 2,500 women.", "Many of these women are now widowed and have children to care for, including orphans."], "orca-mini:3b": [" The UK is providing £4m in aid to aid raped Rwandan women during the 1994 genocide.", "Over 25,000 girls and women were raped, and many of them were infected with HIV/AIDS.", "Despite being overshadowed by the aftermath of the genocide, the plight of these women has gained attention, and now they will have access to anti-retroviral treatment through a program funded by the UK Department for International Development.", "The funding aims to provide care for 2,500 women who were raped during the genocide.", "Mary Kayitesi Blewitt, founder of the Survivors Fund (SURF), praised the recognition of these survivors as a priority for aid."], "hermes3:3b": ["UK provides $4m grant for raped Rwandan women affected by HIV/Aids, improving access to anti-retroviral treatment for survivors."], "stablelm-zephyr:3b": ["The UK will provide £4m in funding over five years to support Rwandan women survivors of the 1994 genocide who were raped and often infected with HIV/AIDS.", "Approximately 25,000 girls and women were raped during this time, resulting in 800,000 Tutsis and moderate Hutus being killed.", "Many widowed women now care for orphans, while only a few have access to anti-retroviral treatment.", "This funding will enable more survivors to receive necessary medical care."], "chatgpt-4o-latest": ["Britain is providing a £4m grant to support Rwandan women who survived the 1994 genocide and were raped, often deliberately infected with HIV/AIDS.", "An estimated 25,000 women were raped during the genocide, which saw 800,000 Tutsis and moderate Hutus killed.", "For years, the plight of these women was overshadowed, but many are now widows caring for their own children and orphans.", "As they die, the number of orphans increases.", "Until recently, few had access to anti-retroviral treatment, but the UK funding will help provide care for around 2,500 women.", "Mary Kayitesi Blewitt, founder of the Survivors Fund (SURF), emphasized the urgency of prioritizing support for these survivors."], "stablelm2:1.6b": ["Britain will provide £4m in funding to support women survivors of the Rwandan genocide who were raped and infected with HIV/Aids.", "Approximately 80% of the estimated 500,0 S0 girls and women were raped during the four-year genocide.", "This new funding by the Department for International Development will enable access to anti-retroviral treatment for more survivors.", "The plight of the infected women was taboo until recently, with very few receiving treatment; this funding aims to provide care for around 2,000 women."], "granite3.1-dense:2b": ["Britain will provide £4 million over five years to assist Rwandan women who survived the 1994 genocide and were victims of widespread rape, many of whom also contracted HIV/AIDS through these attacks.", "An estimated 25,000 girls and women were raped during the genocide, leading to a significant increase in Rwanda's orphan population due to widowhood and the care of infected orphans.", "Until recently, few survivors had access to anti-retroviral treatment.", "This funding aims to reach approximately 2,500 women with crucial medical care, recognizing their urgent needs before it was too late.", "The initiative is being managed through organizations like the Survivors Fund (SURF), founded by Mary Kayitesi Blewitt."]}