{"raw_text": "Howard denies split over ID cards\n \n Michael Howard has denied his shadow cabinet was split over its decision to back controversial Labour plans to introduce ID cards.\n \n The Tory leader said his front bench team had reached a \"collective view\" after holding a \"good discussion\", but admitted it was \"not an easy issue\". He had decided to support the plans as the police said they would help fight terror, crime and illegal immigration. The Lib Dems have pledged to oppose the bill when it is debated next Monday.\n \n Tory sources say senior party figures had argued vociferously against the ID card scheme. Among those reported to have serious reservations over the strategy were senior shadow cabinet members David Davis, Oliver Letwin and Tim Yeo. But Mr Howard denied Mr Yeo, his transport and environment spokesman, said the plans \"stink\". He also said he was confident shadow home secretary Mr Davis would \"set out the position very clearly\" when he stands up to debate the matter next week. Mr Howard said the police had said ID cards could \"help them foil a terror bomb plot in which people could lose their lives\". He added: \"When the police say that you have to take them seriously\".\n \n He acknowledged there were \"good libertarian arguments\" against the cards, but said the shadow Cabinet had weighed up all the \"conflicting interests\" before reaching its decision. \"I don't pretend that it is an easy decision but at the end of the day a decision has to be taken.\" He also denied he was afraid of looking \"soft\" on the issue, compared to Labour. The Conservatives announced their support for the government plans on Monday evening.\n \n Sources within the party told the BBC Mr Howard had always been in favour of ID cards, and tried to introduce them when he was Home Secretary. But the Tories insisted they would hold ministers to account over the precise purpose of the scheme.\n \n They said they would also press Labour over whether objectives could be met and whether the Home Office would be able to deliver them. And they pledged to assess the cost effectiveness of ID cards and whether people's privacy would be properly protected. \"It is important to remember that this bill will take a decade to come into full effect,\" a spokesman said. Lib Dem home affairs spokesman Mark Oaten has branded the ID scheme a waste of money and \"deeply flawed\". He said: \"This has all the signs of Michael Howard overruling colleagues' concerns over ID cards.\"\n \n The chairman of the Bar Council, Guy Mansfield QC warned there was a real risk that people on the \"margins of society\" would be driven into the hands of extremists. \"What is going to happen to young Asian men when there has been a bomb gone off somewhere? They are going to be stopped. If they haven't [ID cards] they are going to be detained.\" Tory ex-minister Douglas Hogg said he opposed the plans for ID cards branding them a \"regressive\" step which would intrude into the lives of ordinary citizens without any counterbalancing benefits. He predicted ultimately carrying the cards would become compulsory and that would lead to large numbers of Britain's ethnic minorities being stopped by police.\n", "llama3.2:1b": ["Michael Howard denies his shadow cabinet split over introducing ID cards, with sources suggesting senior figures had argued vociferously against the plan but he ultimately agreed to support it due to the police wanting to help fight terror, crime, and immigration.", "Howard acknowledged there were libertarian arguments against the scheme, but stated that the Conservative front bench team \"weighed up all the conflicting interests\" before making a decision.", "He denied being afraid of looking soft on ID cards compared to Labour, and emphasized that the decision was made with input from police and officials.", "The Conservatives will support the government's plans for ID cards, which include assessing their cost-effectiveness and ensuring people's privacy is protected.", "However, opposition comes from Liberal Democrat MP Mark Oaten who brands the scheme a waste of money and \"deeply flawed\"."], "llama3.2:3b": ["Michael Howard denies his shadow cabinet was split over its decision to back Labour plans for ID cards, saying they reached a \"collective view\" after discussing the issue.", "However, senior party figures like David Davis and Oliver Letwin reportedly voiced serious reservations about the scheme.", "The Tories will scrutinize the bill's purpose, cost effectiveness, and impact on privacy, with Lib Dem criticism that the plan is flawed and a waste of money."], "gemma2:2b": ["Michael Howard maintains his shadow cabinet supported the government's proposal for ID cards despite dissent from some senior members.", "He cites the police's assurance about their effectiveness in combating terrorism and crime as justification, emphasizing the \"collective view\" reached after weighing various interests.", "Opposition is voiced by the Liberal Democrats, with Mark Oaten labeling it a waste of money and potentially infringing on privacy.", "Critics warn of increased surveillance and potential harm to marginalized groups."], "qwen2.5:0.5b": ["Howard denies split over ID card plans.", "Tory leader Michael Howard denied his shadow cabinet was divided over a controversial Labour proposal for a new ID card system, but admitted it could help fight crime and terrorism while also addressing the concerns about how well it works.", "The Conservative Party pledged to support the bill if passed next week, with Liberal Democrats backing the government's stance on ID cards.", "A party source said senior party figures had argued against the ID scheme and that they would not be in favor of a \"soft\" approach.", "The Conservatives announced their support for the government plans on Monday evening, while Lib Dems pledged to assess costs, privacy protections, and the effects on the \"margins of society.\""], "qwen2.5:1.5b": ["Michael Howard denies split in his shadow cabinet over support for Labour plans to introduce ID cards, maintaining it was a collective decision reached after discussion.", "The Tories promised to scrutinize the bill's objectives and costs effectiveness while expressing reservations about privacy protection.", "Lib Dems oppose the scheme, accusing it of being ineffective and regressive.", "Guy Mansfield warns of potential increased surveillance for marginalized groups without safeguards."], "qwen2.5:3b": ["Howard denies split over ID cards, stating his shadow cabinet reached a \"collective view\" after a discussion supporting Labour plans due to their benefit in fighting terror, crime, and illegal immigration.", "While some senior figures expressed reservations, Howard insists the decision was well-reasoned.", "He acknowledges libertarian arguments against but emphasizes weighing conflicting interests led to support.", "Tory sources claim there were disagreements within the party on ID cards; however, Howard maintains his initial stance as Home Secretary and remains confident in the police's assessment.", "Lib Dems oppose the bill, criticizing it as a waste of money and flawed.", "Bar Council chairman warns about marginal society risks, while Douglas Hogg opposes the plans, viewing them as intrusive without benefits."], "opencoder:1.5b": ["Howard, Michael Howard has denied his shadow cabinet split over its decision to back controversial Labour plans to introduce ID cards.", "Tory leader Tomasz Kral decides to support the plans when it is debated next Monday.", "He said his front bench team held a \"good discussion\" after deciding to support it as the police say they would help fight terrorist attacks, illegal immigration and terrorism.", "Sources within the party reported senior party figures had argued vociferously against the ID card scheme, among those who had serious reservations over the strategy were Mr Davis, Oliver Letwin and Tim Yeo.", "However, Mr Howard denied Mr Yeo, his transport and environment spokesman said he was confident that the plans \"stink\".", "He also said he was confident that Mr Davis would set out the position very clearly when he stands up to debate the matter next week.", "In their defense, they added: \"When the police say that you have to take them seriously.", "When the police say that you have to take them seriously.\"", "The Conservatives announced support for the government plans on Monday evening and pressed Labour over the government plans to introduce ID cards.", "However, they insisted that the Home Office would be able to deliver these cards and assess their cost effectiveness.", "Lib Dems and BBC host Mark Oaten branded the ID card scheme a \"waste of money\" and marked it as \"deeply flawed\".", "They also criticized the idea of carrying ID cards on the \"margins of society,\" making them think people would be driven into the hands of extremists.", "However, they insisted that people carry these cards and not others because the Home Office could deliver them for free."], "smollm:1.7b": ["The summary is:\n\n* Howard denies split over ID cards\n* Tory leaders had argued vociferously against ID card scheme\n* Tory sources say senior shadow cabinet members had serious reservations about ID cards\n* Michael Howard denied he was afraid of looking \"soft\" on the issue compared to Labour\n* The Conservatives announced their support for ID cards when they were Home Secretary\n* Sources within the party told the BBC that Mr Howard had always been in favor of ID cards and tried to introduce them when he was Home Secretary\n* They said they would also press Labour over whether objectives could be met and whether the Home Office would be able to deliver them.", "And they pledged to assess the cost effectiveness of ID cards and whether people's privacy would be properly protected.", "* The chairman of the Bar Council warned there was a real risk that people on the \"margins of society\" would be driven into the hands of extremists if they had been stopped by an ID card."], "deepseek-r1:1.5b": ["Michael Howard denied his shadow cabinet being divided over the ID cards debate.", "The front bench reached a collective view after a good discussion but deemed it difficult.", "Lib Dems opposed the bill, which aimed to help police fight terror, crime, and illegal immigration.", "Howard said senior members were against it but didn't speak with Tim Yeo.", "He confirmed plans will be discussed by Shadow Home Secretary next week.", "Lib Dems plan to check objectives and privacy while ensuring cost-effectiveness.", "Tory ex-minister Douglas Hogg opposed the plan as regressive, expecting stricter controls on ID cards.", "Conservatives announced support for the bill.", "Sources within the party warned Lib Dems that some societal groups at society's margins could end up with ID cards, as the bill would take 10 years to fully implement."], "tinyllama:1.1b": ["In a recent interview, Howard denies split over ID cards in the Conservative Party, claiming his front-bench team has unanimously come to an \"acceptable position\" after discussing the issue for several hours during their weekly meeting.", "While acknowledging there are some \"conflicting interests\", he also argues that the decision was taken after weighing up all arguments and considering the impact on society, including people's privacy being protected.", "The Lib Dem party members have pleaded to take a more critical look at the ID card plan, citing concerns about cost-effectiveness and privacy breaches.", "Liberal Democrats home affairs spokesperson Mark Oaten has also warned of the risks of such a scheme, urging the government to assess its overall effectiveness before deciding how to implement it."], "tinydolphin:1.1b": [" A summary is given for the text, stating that Michael Howard denied a decision on ID cards was made by his shadow cabinet, and claimed it wasn't an easy issue.", "He also admitted it wasn't easy to agree with the plans and there were \"good libertarian arguments\" against them."], "phi:2.7b": [" Michael Howard, despite initial opposition from some within his shadow cabinet, has decided to support controversial Labour plans for ID cards due to concerns raised by the police about their effectiveness in fighting terrorism, crime, and illegal immigration.", "However, there are still concerns among senior Tory figures, including Tim Yeo, David Davis, and Oliver Letwin, who have raised objections to the scheme.", "The Liberal Democrats have committed to opposing the bill during its debate next week.", "Howard claims that his front bench team had reached a \"collective view\" after discussing the issue thoroughly.", "While there are libertarian arguments against ID cards, they believe that all conflicting interests were considered and ultimately, the decision was made despite it being an difficult one.", "The police's support for the scheme has also played a role in Howard's decision.", "Despite some opposition within his party, Howard is confident in defending the plan during the debate next week.", "He argues that ID cards could help prevent a terrorist attack where people could lose their lives.", "However, there are still concerns about the cost-effectiveness and privacy protections of the scheme.", "The Conservatives' support for the government's plans was announced on Monday evening.", "They have also stated they will hold ministers accountable over the purpose and implementation of the ID cards.", "In contrast, the Liberal Democrats oppose the plan, deeming it a waste of money with deep flaws.", "The Tories are pushing Labour to provide evidence that their objectives can be met and that the Home Office is capable of delivering them.", "They want to assess the cost-effectiveness of the scheme and ensure people's privacy is protected.", "The bill will not come into full effect for ten years, and it remains to be seen how it will play out.", "While Howard has always been in favor of ID cards, he acknowledges that his party needs to hold him accountable over their precise purpose.", "They also plan to press the government on achieving specific objectives and cost-effectiveness.", "The Bar Council chairman warns that the scheme could cause more harm than good by pushing vulnerable people towards extremist views.", "Conservative ex-minister Douglas Hogg argues that ID cards are a \"regressive\" step that will infringe on citizens' privacy without providing any benefits.", "He predicts that they will eventually become compulsory, leading to many ethnic minorities being stopped by police."], "orca-mini:3b": [" Michael Howard has denied his shadow cabinet was split over its decision to back controversial Labour plans to introduce ID cards.", "The Tory leader said his front bench team had reached a \"collective view\" after holding a \"good discussion\", but admitted it was \"not an easy issue\".", "He had decided to support the plans as the police said they would help fight terror, crime and illegal immigration.", "The Lib Dems have pledged to oppose the bill when it is debated next Monday.", "Tory sources say senior party figures had argued vociferously against the ID card scheme.", "Among those reported to have serious reservations over the strategy were senior shadow cabinet members David Davis, Oliver Letwin and Tim Yeo.", "But Mr Howard denied this, saying he was confident shadow home secretary Mr Davis would \"set out the position very clearly\" when he stands up to debate the matter next week.", "He also denied he was afraid of looking \"soft\" on the issue, compared to Labour.", "The Conservatives announced their support for the government plans on Monday evening."], "hermes3:3b": ["Michael Howard denies Tory shadow cabinet split over ID card decision, despite senior members like David Davis, Oliver Letwin, and Tim Yeo expressing reservations."], "stablelm-zephyr:3b": ["Michael Howard denied that his shadow cabinet was split over backing Labour's plans for ID cards, stating that after a good discussion, they reached a collective view.", "He supported the plans because the police said ID cards would help fight terror, crime, and illegal immigration.", "Tory sources reported senior party figures had reservations about the ID card scheme, but Howard insisted the police took the issue seriously.", "The Conservatives announced their support for the government plans on Monday evening.", "The Lib Dems pledged to oppose the bill when debated next Monday."], "chatgpt-4o-latest": ["Michael Howard denied that his shadow cabinet was divided over supporting Labour's ID card plans, stating they reached a \"collective view\" after discussion.", "He backed the scheme based on police claims that it would help combat terrorism, crime, and illegal immigration.", "However, senior Tory figures, including David Davis, Oliver Letwin, and Tim Yeo, reportedly had reservations.", "Howard dismissed claims that Yeo called the plans \"stink\" and expressed confidence in Davis presenting the party's stance.", "He acknowledged libertarian concerns but emphasized the need for a decision.", "While the Tories supported the bill, they vowed to scrutinize its objectives, cost-effectiveness, and privacy implications.", "Lib Dems opposed the scheme, calling it flawed and wasteful.", "Critics, including Bar Council chairman Guy Mansfield and ex-Tory minister Douglas Hogg, warned of potential discrimination and civil liberties erosion, predicting ID cards would eventually become mandatory."], "stablelm2:1.6b": ["Tory leader Michael Howard denies split among his cabinet over support for Labour's ID card plans, claiming his team reached a \"collective view\" after discussing the issue.", "However, the Lib Dems oppose the bill when it comes up for debate.", "Senior party figures reportedly had serious reservations about the ID card strategy but Howard denied Letwin's comments.", "Police argue that ID cards will help prevent terror attacks and crime.", "Critics, including Lib Dem Mark Oaten, argue that ID cards are a waste of money and could infringe on privacy.", "Tory ex-minister Douglas Hogg opposes the plans as a \"regressive\" measure that would infringe upon citizens' rights without benefits."], "granite3.1-dense:2b": ["Tory leader Michael Howard has dismissed reports suggesting his shadow cabinet was divided over ID card support for Labour's proposal.", "He asserts the front bench reached a unified stance after discussion, emphasizing the police's claim that ID cards would aid in preventing terrorist attacks, crime, and illegal immigration.", "Despite reservations from senior shadow cabinet members like David Davis, Oliver Letwin, and Tim Yeo, Howard insists he was confident they would clearly articulate their opposition during the upcoming debate.", "The Conservatives have announced backing for the ID card plan, pledging to hold ministers accountable for implementing objectives, cost-effectiveness, and privacy protections.", "Opponents, including the Lib Dems and several ex-ministers, argue that the scheme is unnecessary, costly, invasive of civil liberties, and risks driving vulnerable groups into extremist hands."]}