{"raw_text": "Malik rejects all-black MP lists\n \n A call for ethnic minority shortlists to boost the number of black and Asian MPs has been rejected by one of Labour's most senior Asians.\n \n Shahid Malik, who is on Labour's ruling NEC, accepted people's frustration but said there should be targets not lists to boost representation of minorities. Just 13 of Britain's 659 MPs are from ethnic minority groups, he added. Commission for racial equality chief Trevor Phillips argued on Sunday the time had come for such shortlists. That came after it emerged that one of Britain's most ethnically diverse constituency, West Ham, was to get a women-only shortlist for the next election following an NEC ruling.\n \n Mr Phillips said changes to the race relations legislation might allow political parties to reserve seats for under-represented groups. For example in West Ham, this might allow only women and minorities to seek to be candidates. \"If we get to the other side of the general election and find that minorities are not represented, we have to say that after 20 or 30 years of talking about this, we cannot go on the same way,\" he said. He added: \"It would be terribly disappointing if in the least white constituency [West Ham] in the whole of Europe we didn't have a minority candidate.\" Appearing on BBC Radio 4's Today programme, Mr Malik, who is himself running for the seat of Dewsbury, acknowledged that so far women-only shortlists had failed to deliver a boost in the number of ethnic minority candidates.\n \n But he argued: \"I do think that there currently things that parties can do and which they aren't doing... for example setting targets to ensure that existing democratic structures are more reflective.\" Labour MP Diane Abbot, who backs Mr Phillips' proposal of shortlists, said she had been elected along with three other ethnic minority MPs - Keith Vaz, Paul Boateng and Bernie Grant - in 1987 but it took another 10 years before another black woman was able to win a seat. That was a rate of progress Ms Abbott described as \"painful\". \"I am a little older than Shahid and served on the National Executive Committee in the 1990s - I was the first black person on the NEC ... crossing our fingers and hoping we are going to get more black and Asian MP hasn't worked,\" she said. \"The shortlist strategy works for women and I believe that it can be made to work for black and Asian people.\" On Tuesday Labour chairman Ian McCartney said his party was \"ambitious\" to improve black and Asian representation. \"We haven't ruled out all-black shortlists and welcome a debate in the party about this,\" he said.\n", "llama3.2:1b": ["Labour's Shahid Malik rejects an ethnic minority shortlist for the upcoming election, arguing that targets should be set rather than lists of candidates.", "He cites the example of West Ham constituency as needing to have a minority candidate due to its low representation of ethnic minorities.", "Labour MP Diane Abbot also supports setting targets to improve diversity, citing it took 10 years after being elected in 1987 for another black woman to win a seat."], "llama3.2:3b": ["Shahid Malik rejects ethnic minority shortlists, but suggests setting targets to boost representation of underrepresented groups; Trevor Phillips argues that changes to race relations legislation could allow reserved seats for minorities; some Labour MPs support shortlist strategy with mixed results."], "gemma2:2b": ["Shahid Malik, a member of Labour's ruling NEC, disagrees with proposals for ethnic minority shortlists.", "He argues that targets for increasing representation are more effective than direct quotas.", "While acknowledging the failure of women-only shortlists to boost diversity, he suggests parties should set targets to improve existing structures.", "Diane Abbot supports this approach and cites her own long struggle for a seat after joining Parliament with other MPs of colour.", "Labour chairman Ian McCartney says the party is open to discussing all methods."], "qwen2.5:0.5b": ["Malik rejects all-black MP lists, saying it's time for more targets rather than mere lists, and Labour is considering a race relations bill that might allow political parties to reserve seats for minority groups."], "qwen2.5:1.5b": ["Shahid Malik, an Asian Labour NEC member, rejects ethnic minority MP lists but supports setting targets for political parties to increase representation of minorities, citing low current numbers (13 of 659 MPs) among ethnic minorities.", "Trevor Phillips suggests changing race relations laws could allow political parties to reserve seats for under-represented groups, such as women and minorities in West Ham.", "Malik argues that while shortlists have failed so far, setting targets could increase minority representation.", "Labour MP Diane Abbott criticizes the 10-year delay for another ethnic minority woman's seat following her first election with other ethnic MPs in 1987."], "qwen2.5:3b": ["Malik rejects ethnic minority shortlists proposed by Trevor Phillips, citing existing targets within parties as insufficient.", "He argues for setting targets to ensure more diverse representation within democratic structures.", "While accepting that women-only shortlists have not boosted diversity, Malik supports the idea of ethnic minority shortlists, which Phillips advocates should reserve seats for underrepresented groups like women and minorities.", "This stance is in line with Labour's ambition to improve black and Asian representation, though they haven't ruled out all-black shortlists as a strategy."], "opencoder:1.5b": ["Malik rejects all-black MP lists\n\nA call for ethnic minority shortlists to boost the number of black and Asian MPs has been rejected by one of Labour's most senior Asians.", "Shahid Malik, who is on Labour's ruling NEC, accepted people's frustration but said there should be targets not lists to boost representation of minorities.", "Just 13 of Britain's 659 MPs are from ethnic minority groups, he added.", "Commission for racial equality chief Trevor Phillips argued on Sunday the time had come for such shortlists.", "That came after it emerged that one of Britain's most ethnically diverse constituency, West Ham, was to get a women-only shortlist for the next election following an NEC ruling.", "Mr Phillips said changes to the race relations legislation might allow political parties to reserve seats for under-represented groups.", "For example in West Ham, this might allow only women and minorities to seek to be candidates.", "\"If we get to the other side of the general election and find that minorities are not represented, we have to say that after 20 or 30 years of talking about this, we cannot go on the same way,\" he said.", "He added: \"It would be terribly disappointing if in the least white constituency [West Ham] in the whole of Europe we didn't have a minority candidate.\"", "Appearing on BBC Radio 4's Today programme, Mr Malik, who is himself running for the seat of Dewsbury, acknowledged that so far women-only shortlists had failed to deliver a boost in the number of ethnic minority candidates.", "But he argued: \"I do think that there currently things that parties can do and which they aren't doing... for example setting targets to ensure that existing democratic structures are more reflective.\"", "Labour MP Diane Abbot, who backs Mr Phillips' proposal of shortlists, said she had been elected along with three other ethnic minority MPs - Keith Vaz, Paul Boateng and Bernie Grant - in 1987 but it took another 10 years before another black woman was able to win a seat.", "That was a rate of progress Ms Abbott described as \"painful\".", "\"I am a little older than Shahid and served on the National Executive Committee in the 19th century - I was the first black person on the NEC ... crossing our fingers and hoping we are going to get more black and Asian MP hasn't worked,\" she said.", "\"The shortlist strategy works for women and I believe that it can be made to work for black and Asian people.\"", "On Tuesday Labour chairman Ian McCartney said his party was \"ambitious\" to improve black and Asian representation.", "\"We haven't ruled out all-black shortlists and welcome a debate in the party about this,\" he said."], "smollm:1.7b": ["Malik rejects all-black MP lists, accepts ethnic minority shortlists as a way to boost representation of minorities in Parliament, and argues that there should be targets for parties to increase the number of ethnic minority MPs."], "deepseek-r1:1.5b": ["Malik rejects traditional all-black shortlists for ethnic minorities.", "He argues that shortlists should target underrepresented groups, not lists, to boost representation.", "With only 13 ethnic minority MPs in the UK out of 659, he warns potential disappointment if these shortlists fail to produce candidates.", "West Ham's women-only shortlist was announced post-Neon, and he fears it won't yield a minority candidate.", "He compares this situation to traditional shortlists for ethnic minorities and highlights progress with black women but cautions against systemic issues.", "Diane Abbot supports his proposal, who was elected alongside ethnic minority MPs but faced slower progress than expected.", "Ian McCartney at Labour's chairmanship expressed optimism, noting their ambitious plan to improve racial representation, including all-black shortlists."], "tinyllama:1.1b": ["The statement summarizes that Malik, one of Labour's most senior Asians, rejected calls for ethnic minority shortlists to boost representation of these groups on the party's National Executive Committee (NEC).", "The politician argued for targets and not lists, stating that minorities should be given an opportunity to stand in under-represented constituencies.", "He also mentioned that it was \"painful\" for minority women to win seats, which took several years before another one did.", "Despite this, Mr. Phillips proposed changes to the race relations legislation to allow political parties to reserve seats for ethnic minorities.", "Ms. Abbott, who supports Mr. Phillips' proposal, stressed that the party has been \"ambitious\" in promoting black and Asian representation but acknowledged setbacks such as the absence of women and minority MPs in the past.", "The article also mentioned that Labour chairman Ian McCartney was \"welcoming\" to debates about all-black or targeted shortlists, but did not give further details on what measures were being considered."], "tinydolphin:1.1b": [" In response to the decision of a senior Labour Asians NEC member, Malik rejects all-black MP lists, claiming that the issue should not be reduced to a matter of minority representation but should instead focus on increasing the number of ethnic minority MPs from existing democratic structures.", "The rejection of shortlists by Shahid Malik is a direct result of the Commission for Racial Equality's (CRE) recommendation, which suggests using targeted lists rather than exclusively all-black candidates to boost representation of ethnic minorities in British politics.", "This has led some political observers to question whether the NEC's rejection of such a proposal is indicative of long-term policy changes that would allow more minority candidates to contest elections."], "phi:2.7b": [" Shahid Malik, a senior member of Labour's NEC, rejected all-black MP lists, stating that there should be targets instead.", "Just 13% of Britain's MPs are from ethnic minority groups.", "Trevor Phillips, the Commission for Racial Equality chief, believes that political parties should reserve seats for underrepresented groups after 20 or 30 years of talking about representation.", "West Ham, the UK's most ethnically diverse constituency, will have a women-only shortlist for the next election, but Mr Malik acknowledged that such efforts had been unsuccessful so far in boosting the number of ethnic minority candidates.", "Diane Abbott, another Labour MP, believes that all-women shortlists could be effective and supported Ms Phillips' proposal.", "However, Mr Blair is not convinced and sees a risk of excluding white males from the political arena if targets are imposed."], "orca-mini:3b": [" Shahid Malik rejected all-black MP lists but supports women-only shortlists to boost the number of black and Asian MPs.", "He accepted that existing democratic structures are not reflective of ethnic minorities, and suggested that targets could be set to ensure representation.", "Labour MP Diane Abbot backed the proposal of shortlists to boost diversity in parliament."], "hermes3:3b": ["Shahid Malik rejects calls for all-black MP shortlists, preferring targets instead to boost ethnic minority representation in Labour Party.", "Only 13 out of 659 MPs are from ethnic minorities."], "stablelm-zephyr:3b": ["Shahid Malik, a senior Labour member, has rejected calls for ethnic minority candidate lists aimed at boosting the number of black and Asian MPs in the UK.", "Only 13% of Britain's 659 MPs are from underrepresented groups.", "Trevor Phillips, CEO of the Commission for Racial Equality, argues that changes to race relations legislation could allow political parties to reserve seats for underrepresented groups like minorities and women in diverse constituencies such as West Ham.", "However, Malik states there should be targets instead of lists to ensure existing democratic structures are more reflective.", "Labour is open to discussing all-black shortlists but not ruled out the possibility entirely."], "chatgpt-4o-latest": ["Shahid Malik, a senior Labour figure, rejected calls for ethnic minority shortlists to increase black and Asian MPs, advocating for targets instead.", "He acknowledged frustration over underrepresentation, with only 13 out of 659 MPs from ethnic minorities.", "Trevor Phillips, head of the Commission for Racial Equality, suggested legislative changes to allow reserved seats for minorities, citing West Ham as an example.", "Diane Abbott supported shortlists, arguing progress had been slow.", "Malik countered that parties should set targets to improve representation.", "Labour chairman Ian McCartney stated the party was open to debate on all-black shortlists but had not ruled them out."], "stablelm2:1.6b": ["Shahid Malik, a member of Labour's ruling NEC and ethnic minority representative, rejected a call for ethnic minority shortlists to boost MP representation.", "He argued that targets should be set instead, but acknowledged previous attempts at women-only shortlists had failed to deliver more ethnic minority candidates.", "Labour Chairman Ian McCartney stated the party was \"ambitious\" to improve black and Asian representation, although he did not rule out all-black MP lists.", "Currently, only 1% of UK MPs are from ethnic minority groups."], "granite3.1-dense:2b": ["Shahid Malik, a senior Labour figure on the National Executive Committee (NEC), opposes ethnic minority shortlists to increase the number of black and Asian MPs.", "He prefers setting targets over lists, citing that existing measures have not yielded significant progress in the past.", "Labour chairman Ian McCartney acknowledges the party's ambition to improve representation but has not ruled out all-black shortlists.", "Commission for Racial Equality chief Trevor Phillips supports the idea, arguing that changes to race relations legislation could enable parties to reserve seats for underrepresented groups, such as women and minorities.", "He emphasizes the need for representation in constituencies like West Ham, one of Europe's most ethnically diverse, to prevent further delays after decades of discussion.", "Malik acknowledges the slow progress, noting it took 10 years for another black woman to win a seat following his election to the NEC in the 1990s.", "Labour MP Diane Abbott backs Phillips' proposal, highlighting that women-only shortlists have sped up representation and advocates for similar strategies for ethnic minorities."]}