{"raw_text": "MP attacked by muggers in Kenya\n \n An MP has had more than £600 and his passport stolen after being mugged by six men in a park in Kenya.\n \n Quentin Davies, the MP for Grantham and Stamford, was attacked in a notoriously dangerous park in the capital, Nairobi. He was not hurt in the mugging on Saturday evening. Several people are being questioned over the attack. He was in Kenya before travelling to Sudan with the Parliamentary committee. Local police were said to be \"surprised\" he was in the area. Mr Davies, 60, said the mugging occurred 100 yards from the Nairobi Serena Hotel and equally close to the Anglican Cathedral in the centre of the city at dusk.\n \n He said in a statement: \"It was a frightening experience. \"Six men managed to steal up on me and grab me from behind. \"I knew I had to stay very calm and passive - you cannot fight six men\". He had to spend an extra 24 hours in Nairobi before rejoining the rest of the House of Commons International Development Committee in Dafur after the mugging. \"Naturally, I was afraid they would use a knife or gun, though they never produced any weapon,\" he said. \"Two of them held me from behind and two others held my legs and another one expertly rifled all my pockets.\"\n", "llama3.2:1b": ["MP Quentin Davies was attacked by six men in Kenya's Nairobi park, where he had been traveling with a Parliamentary committee before the attack.", "He claims to have been mugged at 100 yards from the hotel and Anglican Cathedral."], "llama3.2:3b": ["An MP was attacked by six men in Nairobi's park while visiting Kenya, with over £600 and his passport stolen.", "The attack occurred near the Nairobi Serena Hotel at dusk, leaving him shaken but uninjured."], "gemma2:2b": ["MP Quentin Davies was robbed by six men in Nairobi, Kenya, having his belongings stolen including £600 and his passport.", "He experienced a frightening attack while in the notoriously dangerous park near the city centre.", "He was unharmed and spent an extra 24 hours in Nairobi before continuing with his parliamentary work."], "qwen2.5:0.5b": ["MP Quentin Davies attacked by muggers in Nairobi while travelling with the Parliamentary Committee.", "He had more than £600 stolen after being caught by six men in a park on Saturday evening.", "He was reportedly 60 years old."], "qwen2.5:1.5b": ["An MP in Kenya had his £600 stolen and passport taken after being mugged by six men in a dangerous park at night."], "qwen2.5:3b": ["An MP was mugged in Nairobi's dangerous park by six men who stole £600 and his passport.", "Quentin Davies, the MP for Grantham and Stamford, experienced a frightening attack but remained calm to avoid provoking further aggression.", "The incident occurred near the Nairobi Serena Hotel and the Anglican Cathedral at dusk.", "He had to stay an extra day in Nairobi before continuing with his parliamentary duties in Sudan.", "Local police were surprised to find him there."], "opencoder:1.5b": ["An MP has had more than £600 and his passport have been stolen after being mugged by six men in a park in Kenya.", "Quentin Davies, the MP for Grantham and Stamford, was attacked in a notoriously dangerous park in Nairobi.", "He was in Kenya before travelling to Sudan with the parliamentary committee.", "Mr Davies, 60, said the mugging occurred 100 yards from the Nairobi Serena Hotel and equally close to the Anglican Cathedral in the centre of the city at dusk.", "He said he was a terrifying experience \"Six men managed to steal up on me and grab me from behind\".", "During that time, he had spent an extra 24 hours in Nairobi before rejoining the rest of the House of Commons International Development Committee in Dafur after the mugging.", "The attack made people question over the incident."], "smollm:1.7b": ["The MP for Grantham and Stamford was attacked in a park in Kenya by six men who stole his passport and mugged him, leaving him with no injuries.", "The MP also reported that several people were questioned over the attack.", "He was not hurt during the attack because he had been warned about the area beforehand.", "The MP said that the mugging occurred 100 yards from the Nairobi Serena Hotel and equally close to the Anglican Cathedral in the centre of the city at dusk.", "The MP also reported that he had to spend an extra 24 hours in Nairobi before rejoining the rest of the House of Commons International Development Committee in Dafur after the mugging, because they were afraid that the attackers would use a knife or gun and that two of them held him from behind and two others held his legs and another one expertly rifled all his pockets."], "deepseek-r1:1.5b": ["The MP was attacked in Nairobi Park due to a series of six muggers who stole him and grabbed him from behind.", "He wasn't injured, yet several police were questioned about the attack.", "The Parliament was traveling to Sudan while he was in Nairobi, and they stayed overnight there before departing.", "He said it was a terrifying experience near both a parliamentary office and an Anglican cathedral.", "After escaping his hotel, they spent over 24 hours in Nairobi, not necessarily being in the area at the time of the mugging.", "He remained calm and passed the test without any weapons."], "tinyllama:1.1b": ["MP attacked by muggers in Kenya\n\nAn MP has had more than £600 and his passport stolen after being mugged by six men in a notorious park in Nairobi.", "The attack occurred near the Nairobi Serena Hotel and Anglican Cathedral, where the Parliamentary committee is staying at night.", "The MP, who was not injured during the attack but was caught up in Kenya before traveling to Sudan with a parliamentary delegation, called his security after he felt \"surprised\" by the muggiing on Saturday evening.", "Local police were surprised that he was in the area near the hotel and cathecral when he returned to Parliament two days later."], "tinydolphin:1.1b": [" The MP Quentin Davies was in Kenya when his passport and other personal belongings were stolen by six men who attacked him in a park, prompting a massive search for the culprits.", "He suffered bruises and cuts but managed to recover and return to his constituency after an additional 24 hours in Nairobi."], "phi:2.7b": [" MP's passport and £600 stolen in mugging by six men in park in Nairobi, Kenya.", "He was not hurt but spent an extra 24 hours in the city before rejoining the Parliamentary committee in Sudan."], "orca-mini:3b": [" An MP was attacked by muggers in Kenya, with his passport and more than £600 stolen.", "The attack occurred in a notoriously dangerous park in Nairobi, and the MP was not hurt but had to spend an extra day in the country after the incident."], "hermes3:3b": ["MP mugged, $600 and passport stolen in Kenya park."], "stablelm-zephyr:3b": ["MP Quentin Davies was mugged by six men in a dangerous Nairobi park, resulting in £600 and his passport being stolen.", "He remained unharmed and expressed fear they may have used weapons.", "Davies had been in Kenya prior to traveling to Sudan with the Parliamentary committee and returned home 24 hours later."], "chatgpt-4o-latest": ["MP Quentin Davies was mugged by six men in a dangerous park in Nairobi, Kenya, losing over £600 and his passport.", "He was not injured, and several people are being questioned.", "Davies, in Kenya before traveling to Sudan with a Parliamentary committee, was surprised by the attack near the Nairobi Serena Hotel and Anglican Cathedral.", "He described the experience as frightening, stating he remained calm as the attackers restrained him and searched his pockets.", "The incident delayed his travel by 24 hours before he rejoined his committee in Darfur."], "stablelm2:1.6b": ["MP Quentin Davies was attacked by six men in a park in Nairobi while on vacation before traveling to Sudan with his Parliamentary committee.", "Over £1,0 Ls and his passport were stolen during the incident, occurring yards from two high-risk locations - the Nairobi Serena Hotel and the Anglican Cathedral.", "Davies narrowly escaped injury and now faces questioning regarding the assault."], "granite3.1-dense:2b": ["MP Quentin Davies, representing Grantham and Stamford, was mugged in a dangerous Nairobi park by six men, resulting in the loss of over £600 and his passport.", "The incident occurred near the Serena Hotel and Anglican Cathedral at dusk on Saturday.", "Davies, who was unharmed, described it as a frightening experience, stating that the attackers moved quickly and he had to remain calm to avoid provoking violence.", "No weapons were used during the robbery.", "Due to the mugging, Davies spent an extra day in Nairobi before joining his Parliamentary committee in Darfur.", "Several individuals are under investigation for the attack."]}