{"raw_text": "Labour accused of broken pledge\n \n Labour has already broken its pre-election promise on immigration before the ink has dried on its new pledge card, the Tories have claimed.\n \n Home Secretary Charles Clarke has been quoted as telling Labour members he wants more migrants to come to the UK. Tory co-chairman Liam Fox said the comments were at odds with Tony Blair's prediction of a net cut in immigration. But Mr Clarke accused him of trying to score \"cheap political points\" by muddling immigration with asylum.\n \n London's Evening Standard quoted Mr Clarke telling Labour activists at a question and answer session in Gateshead that he wanted Britain to offer refuge for those fleeing tyranny. \"That's not only a moral duty and a legal duty, but something which is part of the essence of this country,\" he said.\n \n \"We want more migration, more people come to study and to work. \"We want more people coming to look for refuge.\" Mr Blair's was asked last Wednesday if the government's new immigration plans, including a point system for economic migrants, would reduce net migration. The prime minister told MPs: \"The abusers will be weeded out, and as a result of the end of chain migration [where families have an automatic right to settle], the numbers will probably fall.\"\n \n On Monday, Dr Fox told reporters: \"The prime minister has broken his word so many times in the past but now his promises do not even last a week. \"The Labour Party election pledges, even when they are so incredibly vague, do not even last four days.\"\n \n The Tories want quotas for economic migrants and refugees and on Tuesday will outline more details of their plans for health checks on migrants. Mr Clarke dismissed the latest Tory attack. \"This is simply a scurrilous attempt by the Tories to score cheap political points,\" he said. \"The Tories are purposely mixing together two separate issues of immigration and asylum.\"\n \n Mr Clarke said he had made clear the UK would welcome genuine economic migrants for key jobs on a strict points based system. And only asylum seekers genuinely fleeing death or persecution would be admitted. \"Under our plans we expect unfounded applications to continue to fall,\" he added. Earlier, Dr Fox accused Mr Blair and other Cabinet ministers of telling lies about Tory policies and then attacking the lies. He told BBC Radio: \"If you are willing to lie about the reasons for going to war, I guess you are going to lie about anything at all.\" The latest pre-election spats come after Mr Blair told Labour members the Tories offered a \"hard right agenda\" which would take Britain backwards. Lib Dem leader Charles Kennedy accelerating Lib Dem election preparations this week as he visits Manchester, Liverpool, Leicester, Somerset, Basingstoke, Shrewsbury, Dorset and Torbay.\n", "llama3.2:1b": ["Labour's immigration pledge has been broken by Home Secretary Charles Clarke after the Tories claimed his comments on the issue were at odds with Tony Blair's previous prediction of a net cut in immigration.", "Clarke stated that Britain should offer refuge for those fleeing tyranny and provide more migrants to study and work, while also reducing net migration."], "llama3.2:3b": ["Labour accused of breaking pre-election promise on immigration after Home Secretary Charles Clarke expressed desire for more migrants to come to the UK, contradicting Tony Blair's previous prediction of a net cut in immigration."], "gemma2:2b": ["Labour has been accused of breaking its pre-election promise on immigration.", "Home Secretary Charles Clarke stated his desire for increased migration, including refuge seekers, while Prime Minister Tony Blair predicted a net reduction in immigration due to new plans.", "Tories criticize Labour's promises as being vague and claim they have broken their word before.", "The Conservatives are pushing for quotas, stricter health checks on migrants, and a more defined system for economic migrants."], "qwen2.5:0.5b": ["The Conservatives are trying to beat Labour with promises about more migrants, but they're not doing a good job."], "qwen2.5:1.5b": ["The Conservatives accused Labour of breaking its promise on immigration during a debate over migration policies.", "Key points:\n- The Conservatives claimed the Labour Party had broken pre-election promises.", "- Home Secretary Charles Clarke said he wants more migrants to come to Britain for study and work.", "- Blair's statement about new immigration plans was criticized as misleading, with some calling it \"scurrilous\" and questioning its motives.", "- Dr. Liam Fox accused Prime Minister Tony Blair of lying about Conservative policies in the past and then attacking those lies during an election debate.", "- The Conservatives' plan includes quotas for economic migrants and refugees while focusing on strict asylum checks only for genuine cases fleeing death or persecution."], "qwen2.5:3b": ["Labour has already broken its pre-election pledge on immigration before finalizing it.", "Home Secretary Charles Clarke is quoted supporting more migrants, including refugees, while Tony Blair predicted a net reduction in migration.", "This contrasts with Tory claims that Labour’s new pledges last only a week.", "Tories propose quotas for economic migrants and asylum seekers and are planning health checks on migrants.", "Both sides accuse each other of misrepresenting policies and scoring political points.", "Lib Dem leader Charles Kennedy is preparing for the election by visiting various regions."], "opencoder:1.5b": ["Labour accused of broken pledge\n\nLabour has already broken its pre-election promise on immigration before the ink has dried on its new pledge card.", "The Tories have claimed.", "Home Secretary Charles Clarke has been quoted as telling Labour members he wants more migrants to come to the UK.", "Tory co-chairman Liam Fox said the comments were at odds with Tony Blair's prediction of a net cut in immigration.", "But Mr Clarke accused him of trying to score \"cheap political points\" by muddling Immigration with asylum.", "London's Evening Standard quoted Mr Clarke telling Labour activists at a question and answer session in Gateshead that he wanted Britain to offer refuge for those fleeing tyranny.", "The key point was a moral duty and a legal duty, something which is part of the essence of this country, and a fundamental part of this country's plan.", "Mr Blair's was asked last Wednesday if the government’s new immigration plans including a point system for economic migrants, does not reduce net migration.", "The prime minister told MPs: \"The abusers will be weeded out, and as a result of the end of chain migration, the numbers will probably fall.\"", "On Monday, Dr Fox told reporters: \"The prime minister has broken his word so many times in the past but now his promises do not even last a week.", "The Labour Party election pledges, even when they are so incredibly vague, do not even last four days.\"", "The Tories want quotas for economic migrants and refugees and on Tuesday will outline more details of their plans for health checks on migrants.", "Mr Clarke dismissed the latest Tory attack.", "The key point here is a scurrilous attempt by the Tories to score cheap political points.", "The Tories are purposely mixing together two separate issues of Immigration and Asylum.", "Mr Clarke said he had made clear the UK would welcome genuine economic migrants for key jobs on a strict points based system.", "And only asylum seekers genuinely fleeing death or persecution would be admitted.", "\"Under our plans we expect unfounded applications to continue to fall,\" he added.", "Earlier, Dr Fox accused Mr Blair and other Cabinet ministers of telling lies about Tory policies and then attacking the lies.", "He told BBC Radio: \"If you are willing to lie about the reasons for going to war, I guess you are going to lie about anything at all.\"", "The latest pre-election spats come after Mr Blair told Labour members the Tories offered a \"hard right agenda\" which would take Britain backwards.", "Lib Dem leader Charles Kennedy accelerating Lib Dem election preparations this week as he visits Manchester, Liverpool, Leicester, Somerset, Basingstoke, Shrewsbury, Dorset and Torbay."], "smollm:1.7b": ["The Labour Party has broken its pre-election promise on immigration before the ink has dried on its new pledge card, according to sources.", "The Tories have accused Labour members of trying to score cheap political points by muddling immigration with asylum.", "Home Secretary Charles Clarke has been quoted as telling Labour members he wants more migrants to come to the UK.", "Tory co-chairman Liam Fox said the comments were at odds with Tony Blair's prediction of a net cut in immigration.", "But Mr Clarke accused him of trying to score \"cheap political points\" by muddling immigration with asylum.", "The Labour Party has already broken its pre-election promise on immigration before the ink has dried on its new pledge card, according to sources.", "The Tories have accused Labour members of offering more migrants to come to the UK and breaking their commitment to a hard right agenda.", "Home Secretary Charles Clarke has been quoted as telling Labour members he wants more migrants to come to the UK.", "Tory co-chairman Liam Fox has been quoted as telling Labour members he wants more people coming to look for refuge.", "The prime minister told MPs: \"We want more migration, more people come to look for refuge.\"", "On Monday, Dr Fox told reporters: \"The prime minister has broken his word so many times in the past but now his promises do not even last a week.", "\"The Labour Party election pledges, even when they are so incredibly vague, do not even last four days.\"", "Mr Clarke denied the latest Tory attack and said he had made clear the UK would welcome genuine economic migrants for key jobs on a strict points based system.", "And only asylum seekers genuinely fleeing death or persecution would be admitted.", "\"Under our plans we expect unfounded applications to continue to fall,\" he added.", "Dr Fox accused Mr Blair and other Cabinet ministers of telling lies about Tory policies and then attacking the lies.", "He told BBC Radio: \"If you are willing to lie about the reasons for going to war, I guess you are going to lie about anything at all.\"", "The latest pre-election spats come after Mr Blair told Labour members the Tories offered a \"hard right agenda\" which would take Britain backwards.", "Lib Dem leader Charles Kennedy accelerating LibDem election preparations this week as he visits Manchester, Liverpool, Leicester, Basingstoke, Shrewsbury, Dorset and Torbay."], "deepseek-r1:1.5b": ["Labour has already broken its pre-election promise on immigration before the UK election cards dry up.", "The Tories have claimed their new plan has \"broken its pre-election pledge,\" referring to their promise of more migrants attending the election before Election Day.", "Home Secretary Charles Clarke has been quoted as telling Labour members he wants more migrants to come to the UK, but this was at odds with Tony Blair's prediction of a net cut in immigration.", "Clarke accused him of trying to \"score 'cheap political points' by muddling immigration with asylum.", "London's Evening Standard quotes Clarke saying he wanted Britain to offer refuge for those fleeing tyranny and stressing the country's duty to both provide refuge and implement its policies legally.", "Labour is now setting out more details of their plans for health checks on migrants, aiming to attract a larger proportion of economic migrants with genuine job opportunities under a strict points system.", "The Tories want quotas for economic migrants and refugees but are dismissed as mixing immigration and asylum.", "Earlier, Dr Fox accused Blair and other ministers of lying about policies but later criticized Lieven's pre-election claims.", "The Labour Party is preparing its integration plans for migrants by targeting more people with genuine job offers."], "tinyllama:1.1b": ["Labour has broken a promise on immigration before the ink dries on its new pledges card, claiming Home Secretary Charles Clark as he accused him of playing \"cheap political points\" by muddling immigration with refugee migration.", "The London Evening Standard quoted him saying that he wanted Britain to offer more asylum seekers and economically migrants for economic reasons, but not those fleeing tyranny.", "The prime minister, meanwhile, broke his word on breaking the promises of the past, causing frustration among Labour's members who have been campaigning since last week for the party to prioritize economic migration and refugee resettlement.", "The latest attacks come amid pre-electional spats between Labour and the Lib Dems over their election plans, as the party accelerates its preparations by visiting Manchester, Liverpool, Leicester, Shrewsbury, Dorset, and Torbay."], "tinydolphin:1.1b": [" The Labour party has accused the government of breaking its promise on immigration before they even finished writing their pledge card.", "Home Secretary Charles Clarke claims that the Tories are trying to score cheap political points by muddling the issue of immigration with asylum.", "Speaking at a question and answer session in Gateshead, he said that if they were offering more people work or study, then they would need to be able to identify those who come to this country with no intention of settling.", "In response, Dr Fox accused the Tories of breaking their promises and now trying to score political points by muddling immigration with asylum.", "The Labour party has said that they want more migrants coming to study and to work.", "They have also called for a new point system where only genuine economic migrants will be admitted, and only those who need the job will be given permission to stay in the UK."], "phi:2.7b": [" The article discusses how Labour has already broken its pre-election promise on immigration before the ink has dried on their new pledge card, while Tory co-chairman Liam Fox claims that comments made by Home Secretary Charles Clarke are at odds with Tony Blair's prediction of a net cut in immigration.", "Mr Clarke accused Mr Fox of trying to score political points and defended his statement that Britain should offer refuge for those fleeing tyranny.", "On the other hand, Dr Fox criticized both Labour and Tory officials for lying about their policies and attacking lies.", "The Tories' latest attack is on Labour's pledge card, while the Tories want quotas for economic migrants and refugees.", "Mr Clarke rejected the latest attack by the Tories and stated that he wanted to weed out abusers in terms of immigration."], "orca-mini:3b": [" Labour accused of breaking pre-election pledge on immigration before ink dries on new pledge card.", "Home Secretary Charles Clarke wants more migrants to come to UK, but Tony Blair predicted net cut in immigration.", "Liam Fox accused him of muddling immigration with asylum.", "Mr Clarke said Britain should offer refuge for those fleeing tyranny.", "Tories want quotas for economic migrants and refugees.", "On Monday, Dr Fox outlined more details of Tory plans for health checks on migrants.", "Mr Clarke dismissed Tory attack as scurrilous."], "hermes3:3b": ["Labour accused of breaking pre-election immigration pledge promise before even making new one.", "Tories claim Home Secretary Charles Clarke wants more migrants despite Tony Blair's prediction of net cut in immigration."], "stablelm-zephyr:3b": ["Labour has broken its pre-election promise on immigration before even writing the pledge card, according to the Tories.", "Home Secretary Charles Clarke said he wants more migrants coming to the UK for refuge from tyranny.", "Tory co-chairman Liam Fox claimed this was at odds with Tony Blair's prediction of a net cut in immigration.", "The Tories want quotas for economic migrants and refugees and are outlining plans for health checks on migrants.", "Clarke dismissed the accusations as a cheap political move, stating that the UK will welcome genuine economic migrants on a strict points-based system and only asylum seekers fleeing death or persecution will be admitted."], "chatgpt-4o-latest": ["The Tories have accused Labour of breaking its pre-election immigration pledge, citing Home Secretary Charles Clarke's comments supporting increased migration.", "Clarke defended his stance, distinguishing between immigration and asylum, and emphasizing Britain's duty to offer refuge.", "Prime Minister Tony Blair had previously suggested net migration would decrease under new policies.", "Tory co-chairman Liam Fox criticized Blair for failing to uphold his promises, while Clarke dismissed the Tory attack as political point-scoring.", "The Conservatives advocate for migration quotas and stricter health checks.", "Meanwhile, Lib Dem leader Charles Kennedy is intensifying election preparations."], "stablelm2:1.6b": ["Labour has broken their immigration pledge before signing a new one, according to the Conservatives.", "Home Secretary Charles Clarke wants more migrants to UK, contrary to Tony Blair's prediction of net cuts.", "Prime Minister Tony Blair stated that refugees would be welcomed and net migration numbers should fall due to an end of chain migration.", "The Tories propose point-based systems for both economic migrants and refugees with quotas.", "They will outline health checks on migrants next week.", "Clarke dismissed the accusations saying, \"This is simply a scurrilous attempt by the Tories to score cheap political points.\""], "granite3.1-dense:2b": ["Home Secretary Charles Clarke has been quoted suggesting Labour should increase immigration for studying, work, and refugee purposes, contrasting with Prime Minister Tony Blair's claim of a net reduction in immigration through new plans, including a points-based system for economic migrants.", "The Conservatives accuse Labour of breaking pre-election promises on immigration, labeling the situation as \"scurrilous\" and an attempt to score political points.", "Tory co-chairman Liam Fox dismissed Blair's assurance, claiming it was a \"lie about anything at all.\"", "Clarke maintains that only genuine economic migrants for essential jobs and asylum seekers fleeing persecution will be admitted under their proposed policies.", "The Conservatives plan to unveil further details on health checks for migrants, while Labour's pledges are deemed vague and short-living by the opposition."]}