{"raw_text": "Labour trio 'had vote-rig factory'\n \n Three Labour councillors in Birmingham were caught operating a \"vote-rigging factory\", an Election Court has heard.\n \n Police found the trio handling unsealed postal ballots in a deserted warehouse in the city during a late-night raid in June 2004, the hearing was told. The votes were later counted towards that month's English local elections. The men, elected to the Aston ward, deny collecting votes fraudulently. The judge presiding has indicated the whole postal voting system is under scrutiny. Deputy High Court Judge Richard Mawrey, QC told the hearing at the Birmingham and Midlands Institute the case could have potentially serious consequences for any forthcoming General Election.\n \n The special Election Court, the first in living memory to hear allegations of vote-rigging, opened in Birmingham last month. The case against Muhammad Afzal, Mohammed Islam and Mohammed Kazi is being brought by local Liberal Democrat supporters. They claim the trio benefited from the widespread misuse of postal votes during the 10 June election. Ravi Sukul, counsel for the petitioners, accused the three men of being \"deeply involved\" in illegal practices. Witnesses saw them carrying several bags from their campaign office, which the men drove to a warehouse on an industrial estate off Birch Road East, the court was told.\n \n The police were alerted and called to the premises. Mr Sukul said: \"When (the officers) arrived there, in the middle of the night, they saw a large room with a 10ft long table and six Asian men present. \"Hundreds of documents and unsealed envelopes were scattered all over the table.\" The police officers left the warehouse, but were later ordered back to seize the documents. \"When the officers left, all the envelopes and papers were scattered,\" Mr Sukul said.\n \n \"(When they went) back to make the seizure, every one of these 275 yellow ballot papers were placed neatly in envelope A and sealed. The house was in order.\" Interrupting Mr Sukul in his opening, Mr Mawrey said: \"What you are saying is, these men were operating a vote-forging factory on an industrial estate.\" The court heard how documents were taken by police to the elections office next morning, where they were mixed in with other ballots. The case against the men follows a hearing into postal fraud allegations made against three other Birmingham councillors in the Bordesley Green ward, claims which are denied. Mr Mawrey is due to deliver a judgment in their case once the Aston petition has been heard. Mr Afzal, Mr Islam and Mr Kazi deny conspiring to commit election fraud to deceive the returning officer. The case continues.\n", "llama3.2:1b": ["Labour councillors Muhammad Afzal, Mohammed Islam, and Mohammed Kazi were caught operating a \"vote-rigging factory\" in Birmingham where they handled unsealed postal ballots at a deserted warehouse in June 2004.", "The trio denied collecting votes fraudulently but the Election Court is considering the case due to concerns about the widespread misuse of postal votes during the English local election."], "llama3.2:3b": ["Three Labour councillors in Birmingham were caught handling unsealed postal ballots at a deserted warehouse during an Election Court hearing.", "The men denied collecting votes fraudulently, but police found hundreds of documents and envelopes scattered on a table.", "They claim the trio benefited from widespread misuse of postal votes during the English local elections held in June 2004."], "gemma2:2b": ["Three Labour councillors were accused of operating a vote-rigging factory, handling unsealed postal ballots during the 2004 English local elections in Birmingham.", "Police found evidence of this activity in a deserted warehouse and later, ballots were counted towards that election.", "The allegations, brought by local Liberal Democrat supporters, claim the men benefited from widespread misuse of postal votes.", "The case is being heard in an Election Court for the first time in living memory."], "qwen2.5:0.5b": ["Three Birmingham councillors were caught operating a \"vote-rigging factory\" during an Election Court hearing.", "A judge ruled they may face serious consequences for their actions if those accusations are proven true, but no details about their alleged voting practices or the extent of their involvement in vote-forging have been revealed."], "qwen2.5:1.5b": ["Three Labour councillors from Birmingham were caught operating a \"vote-rigging factory\" that delivered manipulated ballots for June's local elections.", "The investigation led to charges against Muhammad Afzal, Mohammed Islam, and Mohammed Kazi, who have denied involvement in fraud.", "The hearing has raised concerns about the integrity of the postal voting system leading up to upcoming General Elections."], "qwen2.5:3b": ["Three Labour councillors in Birmingham were caught operating what was described as a \"vote-rigging factory\" during the 2004 English local elections.", "Police found them handling unsealed postal ballots at a warehouse, which they later counted towards the election results.", "The trio denies any wrongdoing and faces scrutiny of the entire postal voting system by Deputy High Court Judge Richard Mawrey.", "A special Election Court in Birmingham heard allegations from Liberal Democrats who claim the councillors were involved in illegal practices using postal votes.", "Police raided their campaign office late at night, where they discovered hundreds of unsealed documents and ballots.", "The case is significant as it marks the first time such allegations have been brought to court in living memory, potentially affecting future elections."], "opencoder:1.5b": ["\"Three Labour councillors in Birmingham were caught operating a 'vote-rigging factory' during an election fraud case.\""], "smollm:1.7b": ["The Labour trio allegedly operated a vote-rigging factory during the 2004 English local elections.", "They were caught handling unsealed postal ballots in a deserted warehouse, which they then used to cast votes for that month's election.", "The police found the ballots and sealed envelopes in a warehouse on an industrial estate off Birch Road East.", "The three men denied collecting votes fraudulently, but the judge presiding at the hearing indicated that the whole postal voting system is under scrutiny.", "Deputy High Court Judge Richard Mawrey, QC told the hearing at the Birmingham and Midlands Institute that the case could have potentially serious consequences for any forthcoming General Election.", "The special Election Court opened in Birmingham last month to hear allegations of vote-rigging.", "The case against Muhammad Afzal, Mohammed Islam and Mohammed Kazi is being brought by local Liberal Democrat supporters.", "They claim the trio benefited from the widespread misuse of postal votes during the 10 June election.", "Ravi Sukul, counsel for the petitioners, accused the three men of being \"deeply involved\" in illegal practices.", "Witnesses saw them carrying several bags from their campaign office, which the men drove to a warehouse on an industrial estate off Birch Road East.", "The police were alerted and called to the premises.", "Mr Sukul said: \"When (the officers) arrived there, in the middle of the night, they saw a large room with a 10ft long table and six Asian men present.\"", "Hundreds of documents and unsealed envelopes were scattered all over the table.", "The police officers left the warehouse, but were later ordered back to seize the documents.", "\"What you are saying is, these men were operating a vote-rigging factory on an industrial estate,\" Mr Mawrey said.", "The court heard how documents were taken by police to the elections office next morning, where they were mixed in with other ballots.", "The case against the three men follows a hearing into postal fraud allegations made against three other Birmingham councillors in the Bordesley Green ward, claims which are denied.", "Mr Afzal, Mr Islam and Mr Kazi deny conspiring to commit election fraud to deceive the returning officer.", "The case continues"], "deepseek-r1:1.5b": ["Three Labour councillors in Birmingham were found operating a \"vote-rigging factory\" after an unsealed postal vote raid, leading to legal challenges.", "The case revealed they manipulated post office votes during an election and are charged with fraud.", "Witnesses saw them carrying bags to campaign offices and driving them to a warehouse.", "Police took hundreds of ballots but left scattered.", "The judge ruled that the system could have serious consequences for future elections."], "tinyllama:1.1b": ["The Labour councillor in Birmingham who operated a vote-rigging factory during the English local elections in June 2004 has been cautioned by police following a raid on their wareroom, which was later used for postal ballot counting.", "The Electon Court presiding judge, Richard Mawrrey QC, stated that the whole postal voting system may be under scrutiny and that the case against three Labour councillor (Afzael, Islam, Kazi) could have potentially serious consequences, given the allegations of vote-rigging.", "Witnesses reported seeing three Asian men operating a \"vote-forging factory\" at an industrial estate in Birlingham on June 10th, during the English local elections.", "The police arrived and issued the three councillor's with warnings before departing.", "The court has heard that documents were taken from their campaign office to the elections office next morning, where they were mixed in with other ballots.", "The case against the three men follows a hearing into postal fraud allegations made by the other Birmingham Labour councillor, who deny conspiring to commit election fraud."], "tinydolphin:1.1b": [" This text discusses an investigation into illegal vote-rigging in Birmingham's Aston ward during the 2004 local elections.", "Three Labour councillors were caught operating a \"vote-rigging factory\" within a deserted warehouse, with unsealed postal ballots being later counted towards the election.", "The allegations are seen as significant due to the potential consequences for future elections."], "phi:2.7b": [" Three Labour councillors in Birmingham were caught handling unsealed postal ballots in a deserted warehouse during a late-night raid in June 2004, which were then used for the 10 June local elections.", "There are allegations that they could have benefited from the widespread misuse of postal votes during this election.", "A special Election Court has been opened to hear these allegations and the case could have serious consequences for any future General Election.", "The three men denied committing illegal practices but are being investigated by police."], "orca-mini:3b": [" Three Labour councillors in Birmingham were caught operating a \"vote-rigging factory\" during the 2004 English local elections, according to a hearing at the Birmingham and Midlands Institute.", "Police found them handling unsealed postal ballots in a warehouse in the city during a raid in June 2004.", "The votes were later counted towards the election.", "The men, elected to the Aston ward, deny collecting votes fraudulently.", "The judge presiding has indicated that the whole postal voting system is under scrutiny.", "The case may have potentially serious consequences for any forthcoming General Election.", "The three councillors are being sued by local Liberal Democrat supporters who claim they benefited from the widespread misuse of postal votes during the election."], "hermes3:3b": ["Labour councillors caught running 'vote-rigging factory' in Birmingham warehouse during police raid."], "stablelm-zephyr:3b": ["Three Labour councillors in Birmingham were caught operating a \"vote-rigging factory\" during an election raid in 2004.", "Police found them handling unsealed postal ballots in a deserted warehouse.", "The votes were later counted towards the English local elections that month.", "The men, elected to the Aston ward, deny collecting votes fraudulently.", "The judge presiding over the case has indicated that the entire postal voting system is under scrutiny.", "Local Liberal Democrat supporters have brought the case against Muhammad Afzal, Mohammed Islam and Mohammed Kazi, claiming they benefited from widespread misuse of postal votes during the election.", "The case continues, with the judge due to deliver a judgment after the Aston petition has been heard."], "chatgpt-4o-latest": ["Three Labour councillors in Birmingham were accused of operating a \"vote-rigging factory\" during the 2004 local elections, an Election Court heard.", "Police discovered them handling unsealed postal ballots in a warehouse during a late-night raid.", "The case, brought by Liberal Democrat supporters, alleges the trio benefited from widespread postal vote misuse.", "Witnesses saw them transporting ballot papers to the warehouse, where police later found hundreds of unsealed documents.", "When officers returned, the ballots had been neatly sealed.", "The judge suggested the case could have serious implications for future elections.", "The accused deny any wrongdoing, and the case continues."], "stablelm2:1.6b": ["Three Labour councillors in Birmingham were caught operating a \"vote-rigging factory\" during a late-night raid in June, handling unsealed postal ballots which later participated in the month's English local elections.", "The three men deny collecting votes fraudulently and the judge presiding may scrutinize the entire postal voting system for possible serious consequences in any forthcoming General Election.", "The case opened last month as the first special Election Court to hear allegations of vote-rigging in Birmingham, with potential legal consequences for future elections."], "granite3.1-dense:2b": ["Three Labour councillors from Birmingham's Aston ward—Muhammad Afzal, Mohammed Islam, and Mohammed Kazi—were found operating a \"vote-rigging factory\" by police during a late-night raid in June 2004.", "They were caught handling unsealed postal ballots at a deserted warehouse on an industrial estate.", "The men deny fraudulently collecting votes, but the court case has significant implications for any forthcoming General Election, according to Deputy High Court Judge Richard Mawrey, QC.", "This is the first special Election Court in living memory to hear allegations of vote-rigging.", "The charges against these three councillors follow a separate hearing into postal fraud claims made against three other Birmingham councillors from the Bordesley Green ward, which they also deny."]}