{"raw_text": "Minister defends hunting ban law\n \n The law banning hunting with dogs in England and Wales is enforceable and \"very clear\", Alun Michael has said.\n \n The rural affairs minister said it would become obvious if people flouted the law, which came into force on Friday, and pretended they were not. Some 270 hunts met legally on Saturday killing a total of 91 foxes - only four were accidentally killed by hounds. But anti-hunt campaigners said there had been widespread intimidation of activists monitoring hunts. Countryside Alliance chairman John Jackson said that Saturday had been a \"massive demonstration by the rural community of support for hunting\". People had turned out \"to show en masse that the Hunting Act was a bad law\", he said adding that foxes and other animals had been killed \"legally\" as far as he was aware.\n \n Although hunting with dogs is now a criminal offence, exercising hounds, chasing a scent trail and flushing out foxes to be shot are still legal. Addressing claims that the new law was unenforceable, Mr Michael told BBC Radio 4's Today Programme: \"There has been a lot of spin about this by those that support hunting. \"The reality is that the law is very clear. You can't chase wild mammals with a pack of dogs, whether the wild mammal is a fox or a deer. \"If people do so and pretend they're not it's going to become very clear. You can't hunt accidentally.\" Mr Michael also denied the hunting ban had led to a breakdown of trust between the government and rural communities. He said most people living in the countryside were more concerned with issues like the economy, the health service and their children's future than hunting.\n \n But the League Against Cruel Sports claimed the new act had been broken even though the numbers of foxes killed had fallen. Thousands of hunt supporters turned out at 270 hunts across England and Wales on the first day of the ban, with anti-hunt groups sending out 100 monitors to check the law was not being broken. There were only four arrests - over alleged hunting of hares in Wiltshire - although it was not clear whether they were made under the Hunting Act.\n \n They have been released on bail but police say they may face prosecution under new poaching laws. But Penny Little, who monitored the Bicester Hunt in Oxfordshire, said she had witnessed \"gratuitous, spiteful killing of foxes\". If people tried to \"run circles around this law\" the only outcome would be that it was tightened up, she said. Mike Hobday, from the League Against Cruel Sports, said video evidence of the law being broken would be passed onto police. He said intimidation seemed to have been widespread and called on hunts to do more to stop their supporters intimidating anti-hunt activists videoing hunts. But Mr Jackson, who had been at the Bicester Hunt in Oxfordshire, denied there was any intimidation.\n", "llama3.2:1b": ["Minister defends hunting ban law; claims it is enforceable and \"very clear\".", "The law banning hunting with dogs in England and Wales comes into force on Friday.", "Despite this, some 270 hunts were met legally, killing a total of 91 foxes, four of which were accidentally killed by hounds.", "Anti-hunt campaigners say the law is unenforceable due to intimidation against activists monitoring hunts.", "Hunting with dogs is now a criminal offence, but exercising hounds and flushing out animals are still legal.", "The rural affairs minister says people will become aware of the law if they attempt to hunt illegally, while anti-hunt groups claim that hunting has been allowed \"legally\" despite being banned under the new law."], "llama3.2:3b": ["Alun Michael defends hunting ban law as enforceable and \"very clear\", saying it would be obvious if people flouted it.", "Anti-hunt campaigners claim widespread intimidation of activists monitoring hunts despite only four arrests made under the law.", "The League Against Cruel Sports says the numbers of foxes killed have fallen, but witnesses report \"gratuitous, spiteful killing\" of foxes by hunters."], "gemma2:2b": ["The Hunting Act banned hunting with dogs, but some hunts continued killing foxes, despite being illegal.", "Anti-hunt groups monitor hunts and claim they witnessed breaking of the law.", "The government defends the act's enforceability and argues it is clear, while accusing anti-hunters of manipulating the situation and spreading fear through intimidation."], "qwen2.5:0.5b": ["The law banning hunting dogs with wild animals is enforceable and clear.", "Some 270 hunting events occurred on Saturday, killing a total of 91 foxes - only four were accidentally killed by hounds.", "Anti-hunt campaigners claim the new law has led to widespread intimidation of activists monitoring hunts.", "The new law has some limitations but will be enforced, while anti-hunt groups are raising concerns that it could lead to increased hunting and wildlife poaching."], "qwen2.5:1.5b": ["Minister defends hunting ban law by stating it is enforceable and very clear.", "Some 91 foxes were killed legally on Saturday during 270 hunts.", "Anti-hunt campaigners claim widespread intimidation of activists monitoring hunts.", "Although hunting with dogs remains legal, the new law criminalizes chasing wild mammals with a pack of dogs.", "The League Against Cruel Sports denies the ban has led to a breakdown in trust between government and rural communities."], "qwen2.5:3b": ["Minister Alun Michael defended the Hunting Act 2004 banning hunting with dogs as enforceable and clear, despite fox culling continuing under new laws.", "Anti-hunt campaigners reported widespread intimidation of activists monitoring hunts, while supporters saw it as a demonstration of support for hunting.", "The law prohibits chasing wild mammals with dog packs but allows other methods like flushing out prey.", "Despite fewer foxes being killed than expected, the League Against Cruel Sports claimed violations and calls for stricter enforcement if hunters try to evade legal action.", "Anti-hunt activists reported instances of gratuitous killing during hunts, leading to concerns about harassment of monitors."], "opencoder:1.5b": ["Minister defends hunting ban law\n\nThe law banning hunting with dogs in England and Wales is enforceable and \"very clear\", Alun Michael has said.", "Rural affairs minister said it would become obvious if people flouted the law, which came into force on Friday, and pretended they were not.", "Some 270 hunts met legally on Saturday killing a total of 91 foxes - only four were accidentally killed by hounds.", "But anti-hunt campaigners said there had been widespread intimidation of activists monitoring hunts.", "Countryside Alliance chairman John Jackson said that Saturday had been a \"massive demonstration by the rural community of support for hunting\".", "People had turned out \"to show en masse that the Hunting Act was a bad law\", he said adding that foxes and other animals had been killed \"legally\" as far as he was aware.", "Although hunting with dogs is now a criminal offence, exercising hounds, chasing a scent trail and flushing out foxes to be shot are still legal.", "Addressing claims that the new law was unenforceable, Mr Michael told BBC Radio 4's Today Programme: \"There has been a lot of spin about this by those that support hunting.", "\"The reality is that the law is very clear.", "You can't chase wild mammals with a pack of dogs, whether the wild mammal is a fox or a deer.", "\"If people do so and pretend they're not it's going to become very clear.", "You can't hunt accidentally.\"", "Mr Michael also denied the hunting ban had led to a breakdown of trust between the government and rural communities.", "He said most people living in the countryside were more concerned with issues like the economy, the health service and their children's future than hunting.", "But the League Against Cruel Sports claimed the new act had been broken even though the numbers of foxes killed had fallen.", "Thousands of hunt supporters turned out at 270 hunts across England and Wales on the first day of the ban, with anti-hunt groups sending out 100 monitors to check the law was not being broken.", "There were only four arrests - over alleged hunting of hares in Wiltshire - although it was not clear whether they were made under the Hunting Act.", "They have been released on bail but police say they may face prosecution under new poaching laws.", "But Penny Little, who monitored the Bicester Hunt in Oxfordshire, said she had witnessed \"gratuitous, spiteful killing of foxes\".", "If people tried to \"run circles around this law\" the only outcome would be that it was tightened up, she said.", "Mike Hobday, from the League Against Cruel Sports, said video evidence of the law being broken would be passed onto police.", "He said intimidation seemed to have been widespread and called on hunts to do more to stop their supporters intimidating anti-hunt activists videoing hunts.", "But Mr Jackson, who had been at the Bicester Hunt in Oxfordshire, denied there was any intimidation.", "The law banning hunting with dogs in England and Wales is enforceable and \"very clear\", Alun Michael has said."], "smollm:1.7b": ["The law banning hunting with dogs in England and Wales is enforceable and \"very clear\", Alun Michael has said.", "The rural affairs minister said it would become obvious if people flouted the law, which came into force on Friday, and pretended they were not.", "Some 270 hunts met legally killing 91 foxes - only four were accidentally killed by hounds.", "But anti-hunt campaigners said there had been widespread intimidation of activists monitoring hunts.", "Countryside Alliance chairman John Jackson said that Saturday had been a \"massive demonstration by the rural community of support for hunting\".", "People had turned out \"to show en masse that the Hunting Act was a bad law\", he said adding that foxes and other animals had been killed \"legally\" as far as he was aware."], "deepseek-r1:1.5b": ["The minister defended a law banning hunting with dogs in England and Wales.", "He emphasized that while hunting with dogs is now criminal, it remains legal for people to use hounds to chase scent trails or flush out foxes.", "Data showed 270 hunts on Saturday killed 91 foxes, with only four accidentally shot.", "Anti-hunt groups pointed out widespread intimidation by rural communities.", "The League Against Cruel Sports argued that despite fewer deaths, thousands attended the first day of the ban and faced potential prosecution under new poaching laws.", "Specific quotes from activists showed shocking instances of \"greedy killing.\"", "Mike Hobday of MACS called for more support from hunters, while Jackson denied intimidation, noting rural focus on economic and health issues.", "Penny Little, a monitor, highlighted the \"gratuitous killing\" claim."], "tinyllama:1.1b": ["The Minister for Rural Affairs and the Environment Alun Michael defended a hunting ban law that became enforceable on Friday as he said the law is \"very clear\" and many hunts met legally during the first day of enforcement.", "However, some activists were accused of engaging in \"gratuitous, spiteful killing of foxes\" at several hunt venues, and there was widespread intimiation towards anti-hunting campaigners who had been monitoring hunts since Saturday.", "Despite this, the Minister maintained that people could still exercise their right to hunt legally, and police have stated that witnessing \"grauatous, spiteful killing of foxes\" would be passed on if such activity is reported."], "tinydolphin:1.1b": [" The English Hunting Act has come into effect on Friday.", "It outlaws hunting with dogs and legally kills foxes.", "However, some people argue that it's not being strictly enforced, and that the foxes were killed accidentally.", "The rural affairs minister Alun Michael defended this ban by stating that the law is very clear.", "The Minister mentioned that most people in the countryside trust the government and authorities, and therefore did not break the new Hunting Act.", "He also argued that this new law is a good thing for wildlife and animals, as it would make foxes more safe from predators."], "phi:2.7b": [" The ban on hunting with dogs in England and Wales came into force on Friday and is enforceable, according to Rural Affairs Minister Alun Michael.", "Despite this, anti-hunt campaigners claim that hunting supporters have resorted to intimidation tactics during Saturday's hunts.", "Countryside Alliance Chairman John Jackson stated that the rural community supports hunting and accused people of breaking the law by pretending they are not flouting it.", "Although exercising hounds and chasing scent trails is still legal, hunting wild mammals with a pack of dogs is prohibited.", "Mr Michael denied that there was a breakdown of trust between the government and rural communities and claimed that most people living in the countryside were more concerned about issues such as the economy and healthcare than hunting.", "However, the League Against Cruel Sports claims that the new law has been broken despite a decrease in the number of foxes killed during the ban.", "Police have issued four arrests for alleged illegal hunting of hares but it is not clear whether they will be prosecuted under new poaching laws.", "While anti-hunt activists monitored hunts across England and Wales, Countryside Alliance Chairman John Jackson denied any intimidation tactics were used by hunt supporters.", "Mike Hobday from the League Against Cruel Sports called on hunts to do more to prevent their supporters from intimidating anti-hunt activists."], "orca-mini:3b": [" Minister defends hunting ban law as enforceable and clear, banning hunting with dogs in England and Wales.", "Some 270 hunts met legally on Saturday killing a total of 91 foxes, only four were accidentally killed by hounds.", "Anti-hunt campaigners claimed widespread intimidation of activists monitoring hunts.", "The law is enforceable and the Hunting Act is a bad law, said Alun Michael.", "Most people living in the countryside are more concerned with issues like the economy, health service and their children's future than hunting.", "League Against Cruel Sports claimed the new act had been broken, even though the numbers of foxes killed fell.", "There were only four arrests - over alleged hunting of hares in Wiltshire - although it was not clear whether they were made under the Hunting Act."], "hermes3:3b": ["Law banning hunting with dogs enforceable and clear, says Alun Michael; opposes claims of law being unenforceable and broken due to reduced fox killings."], "stablelm-zephyr:3b": ["Rural affairs minister Alun Michael has defended the law banning hunting with dogs in England and Wales, stating it is enforceable and \"very clear\".", "He added that people would soon realize if they were flouting the law, which came into force on Friday.", "According to the minister, only four foxes were accidentally killed by hounds during 270 legal hunts on Saturday.", "Anti-hunt campaigners claimed there had been widespread intimidation of activists monitoring hunts, but countryside Alliance chairman John Jackson argued that Saturday's events showed support for hunting among rural communities.", "Despite the new law making hunting with dogs a criminal offense, exercising hounds and chasing scent trails remain legal, as long as foxes are not being hunted intentionally.", "The League Against Cruel Sports accused the government of breaking the new act despite falling fox kill numbers, while some arrests were made under new poaching laws."], "chatgpt-4o-latest": ["Minister Alun Michael defended the hunting ban in England and Wales, stating it is clear and enforceable.", "Despite claims that the law is difficult to uphold, he asserted that illegal hunting would be obvious.", "On the first day of the ban, 270 hunts took place legally, killing 91 foxes, with only four accidental deaths.", "Anti-hunt activists reported intimidation, while hunt supporters demonstrated against the law.", "The League Against Cruel Sports alleged violations and pledged to provide video evidence to the police.", "Four arrests were made over alleged hare hunting, though it was unclear if they were under the Hunting Act.", "Michael dismissed concerns of a rural-urban divide, emphasizing broader rural issues."], "stablelm2:1.6b": ["Rural affairs minister Alun Michael defends the enforceable hunting ban law that became effective on Friday, stating it would become clear if people flouted the law and pretended they weren..", "Despite some instances of unintentional killing of foxes during the first day of the ban, the League Against Cruel Sports claims the new act has been broken.", "Anti-hunt groups have sent out monitors to check for any violations, but there were only four arrests - all over alleged hunting of hares.", "Anti-hunt campaigners argue that anti-hunt activists are being intimidated while some claim that the Hunting Act is unenforceable due to potential loopholes in the law.", "However, Countryside Alliance chairman John Jackson claims that people have attended significant numbers to demonstrate support for the Hunting Act, stating there was no widespread intimidation of anti-hunt activists."], "granite3.1-dense:2b": ["Minister Alun Michael asserts that the new English and Welsh law banning hunting with dogs is enforceable and unambiguous, emphasizing that violations would be immediately apparent.", "On the first day of the ban, 270 hunts were observed, killing 91 foxes (four accidentally), with anti-hunt campaigners reporting widespread intimidation of activists monitoring these events.", "Despite this, Michael denies that the law has eroded trust between the government and rural communities, stating most countryside residents prioritize economic, healthcare, and educational issues over hunting.", "The Countryside Alliance's chairman, John Jackson, portrayed Saturday as a \"massive demonstration of support for hunting\" by the rural community.", "However, animal welfare groups like the League Against Cruel Sports claim the ban was broken, citing video evidence of alleged illegal hunting activities and widespread intimidation of anti-hunt activists.", "They have provided such footage to police for potential prosecution under new poaching laws.", "The hunting with dogs remains legal only for exercising hounds, chasing scent trails, and flushing out foxes to be shot.", "Although 470 people attended these hunts, resulting in 91 foxes being killed, anti-hunt activists reported minimal arrests due to the alleged violations.", "Intimidation of protesters by hunt supporters was a significant concern raised by those monitoring the events."]}