{"raw_text": "Howard unveils election platform\n \n The Conservatives would stand up for the \"forgotten majority\", Michael Howard pledged as he unveiled the first part of the Tory election manifesto.\n \n The Tory leader argued there was a mass of people whom he says feel let down by Tony Blair and who share Tory values. In the foreword to the manifesto, he promises to focus on restoring order, trying to lower taxes and giving power back to the people. Labour says the document offers only a return to a \"failed Tory past\". The Liberal Democrats say the Conservatives cannot win what they predict will be a three-party contest.\n \n Campaigning activity is accelerating ahead of the general election, which is widely tipped for May but could be any time before June 2006. Labour on Monday postponed a launch of election posters because of the Asian tsunami disaster. Mr Howard published the introduction to the Tory manifesto. Other chapters will follow in coming weeks.\n \n In a speech in Northamptonshire, he said the \"forgotten majority\" made up the backbone of Britain. They were people who were saving for their first home or their retirement, working hard and accepting their responsibilities. He says in the manifesto foreword: \"They have been forgotten, neglected and taken for granted by Mr Blair.\"\n \n Saying Britain must change direction, Mr Howard argues government is too big and cannot continue \"down the path of ever rising taxes\". He promises to ensure frontline professionals, parents and patients make the key decisions rather than Whitehall \"bureaucrats\". And he says the Tories would get a grip on crime, immigration and disorder. \"The decline of responsibility and the proliferation of so-called 'human rights' have left us in a moral quagmire, unable to get a grip on rising crime and disorder,\" he says.\n \n Mr Howard says he will produce a Timetable for Action so people can hold him to account but on issues like taxation he has so far only published options, not specific plans. Mr Howard told BBC News: \"I'm determined to lower taxes but I'm also determined not to make any promises I can't keep.\" The Tories were unveiling material months ahead of the expected election because they needed time to make voters aware of their policies, he said. He was asked if Tory support for the government on Iraq and identity cards had given the Lib Dems the chance to portray themselves as the opposition to Labour. Mr Howard argued the only test for his policies was whether they were best for Britain. It had nothing to do with putting \"clear blue water\" between himself and his opponents.\n \n Labour's election slogan will be: \"Britain's working, don't let the Tories wreck it again\". Campaign coordinator Alan Milburn accused the Tories of \"launching Thatcherism in instalments\" while Labour helped the hard working majority of families. Lib Dem president Simon Hughes said his party had set out its election stance in September. \"The Liberal Democrats will ask the British people for support this year as the party with the policies best able to deliver freedom and fairness and to restore trust,\" he said.\n", "llama3.2:1b": ["Howard unveils Conservative election platform focusing on restoring order, lowering taxes, and giving power back to the people.", "Conservatives promise to address issues such as crime, immigration, and disorder through tackling these problems directly rather than relying on bureaucracy.", "The party has unveiled a manifestos first chapter, which will be followed by more chapters in coming weeks.", "Labour criticises the Conservatives' platform, saying it offers only a return to \"a failed Tory past\".", "Liberal Democrats say they cannot win the election due to their predicted three-party contest with Labour and the Conservatives."], "llama3.2:3b": ["Michael Howard unveils Conservative election manifesto, promising to stand up for the \"forgotten majority\", focusing on restoring order, tax cuts and giving power back to the people.", "The Tory leader argues Britain must change direction, citing a decline in responsibility and rising crime, while Labour calls it a return to a \"failed Tory past\" and predicts a three-party contest."], "gemma2:2b": ["Michael Howard unveiled part of the Conservative Party's election platform, focusing on a \"forgotten majority\" who feel neglected by Tony Blair.", "He aims to lower taxes, empower citizens, tackle crime, immigration, and disorder, arguing for less government involvement.", "Howard promises a \"Timetable for Action\" but has yet to specify concrete plans on taxation.", "The Conservatives are releasing their platform early due to the need for voters' awareness.", "Labour accuses Tories of returning to a failed past.", "Liberal Democrats have already outlined their stance."], "qwen2.5:0.5b": ["The Conservative Party is proposing an election manifesto that focuses on restoring order, lower taxes, giving power back to the people, and addressing issues like crime, immigration, and disorder.", "The candidate emphasizes that Britain's \"forgotten majority\" has been neglected for a long time, working hard and accepting their responsibilities.", "He argues that government must change direction from ever rising taxes to ensuring frontline professionals make key decisions rather than Whitehall bureaucrats.", "The candidate also wants to raise taxes on certain groups like parents, and he says the Tories should get a grip on crime, immigration, and disorder."], "qwen2.5:1.5b": ["Conservative leader Michael Howard unveils an election manifesto that aims to appeal to a \"forgotten majority\" of working-class voters, promising lower taxes, reducing government size, and restoring moral values in light of Labour's poor performance.", "The Tories are expected to launch more chapters shortly following the first part unveiled by Howard."], "qwen2.5:3b": ["Conservative leader Michael Howard unveiled his party's election platform, focusing on a group of voters he calls the \"forgotten majority.\"", "He promised to address issues like tax cuts, restoring order, and giving more power back to individuals against Labour's criticism that it offers only a return to a failed past.", "Campaigning is intensifying ahead of the general election likely set for May 2006 but could be delayed until June.", "Howard argued government was too large and should focus on frontline professionals making decisions, with plans to lower taxes and tackle crime and immigration.", "He also introduced his \"Timetable for Action\" to hold himself accountable, while Labour's slogan is \"Britain's working, don't let the Tories wreck it again.\""], "opencoder:1.5b": ["Howard unveiled an election platform that argued there was a mass of people who feel let down by Tony Blair and who share Tory values.", "The Conservatives promise to focus on restoring order, trying to lower taxes and giving power back to the people.", "Labour insists the document offers only a failed Tory past.", "The Liberal Democrats believe the Conservatives cannot win what they predict will be a three-party contest.", "Campaigning activity is accelerating ahead of the general election.", "Speaking in Northamptonshire, Mr Howard says they were forgotten, neglected and taken for granted by Mr Blair.", "He emphasizes that they have been saved by tough decisions made by politicians like him who are struggling to get their place back in power.", "Mr Howard insists government is too big and cannot continue down the path of ever rising taxes.", "He promises to ensure frontline professionals, parents and patients make the key decisions rather than becoming bureaucrats.", "The Tories promise a grip on crime, immigration and disorder.", "They argue that they have been forgotten, neglected and taken for granted by Mr Blair.", "Mr Howard says he will produce a Timetable for Action so people can hold him to account but on issues like taxation he has only published options, not specific plans.", "Mr Howard told BBC News: \"I'm determined to lower taxes but I'm also determined not to make any promises I can't keep.\"", "The Tories were unveiling material months ahead of the expected election because they needed time to make voters aware of their policies.", "Labour's election slogan is: \"Britain’s working, don’t let the Tories wreck it again\".", "Labour’s announcement by campaign coordinator Alan Milburn helped the hard working majority of families."], "smollm:1.7b": ["The Conservatives would stand up for the \"forgotten majority\", Michael Howard pledged as he unveiled the first part of the Tory election manifesto.", "The Tory leader argued there was a mass of people whom he says feel let down by Tony Blair and who share Tory values.", "In the foreword to the manifesto, he promises to focus on restoring order, trying to lower taxes and giving power back to the people.", "Labour says the document offers only a return to a \"failed Tory past\".", "The Liberal Democrats say the Conservatives cannot win what they predict will be a three-party contest.", "In a speech in Northamptonshire, he said the \"forgotten majority\" made up the backbone of Britain.", "They were people who were saving for their first home or their retirement, working hard and accepting their responsibilities.", "He says in the manifesto foreword: \"They have been forgotten, neglected and taken for granted by Mr Blair.\"", "Mr Howard promises to get a grip on crime, immigration and disorder, but he does not specify what policies would be put in place.", "The Tories were unveiling material months ahead of the expected election because they needed time to make voters aware of their policies, he said.", "He was asked if Tory support for the government on Iraq and identity cards had given the Lib Dems the chance to portray themselves as the opposition to Labour.", "Mr Howard argued the only test for his policies was whether they were best for Britain.", "It had nothing to do with putting \"clear blue water\" between himself and his opponents.", "Labour's election slogan will be: \"Britain's working, don't let the Tories wreck it again\".", "Campaign coordinator Alan Milburn accused the Tories of \"launching Thatcherism in instalments\" while Labour helped the hard working majority of families.", "Lib Dem president Simon Hughes said the party had set out its election stance in September.", "\"The Liberal Democrats will ask the British people for support this year as the party with the policies best able to deliver freedom and fairness and to restore trust,\" he said."], "deepseek-r1:1.5b": ["Howard Unveils Election Platform  \nMichael Howard announced the first part of the Tory election manifesto, calling for a focus on restoring order, lowering taxes, and addressing issues like crime and immigration.", "Labour supports this approach while criticizing government policies that may worsen problems.", "The manifesto aims to restore Britain's working class by appealing to those saving for their futures, with campaign delays and specific policies yet to be finalized."], "tinyllama:1.1b": ["The Conservatives have unveiled their election platform, promising to focus on restoring order, trying to lower taxes, and giving power back to the people while also pledging to reduce crime and immigration, improve frontline professional services, and address disorder.", "They have also promised to publish a Timetable for Action so voters can hold them accountable, but their manifesto offers no specific plans for taxation.", "The Conservatives argue that they will lower taxes, making it easier for the hardworking majority to make key decisions such as frontline professional services and disorder, and promising to restore fairness and trust in their policies by asking the British people to support them this year."], "tinydolphin:1.1b": [" The Conservatives announced their first part of the Tory election manifesto, focusing on restoring order and empowering local communities.", "Michael Howard promises to focus on lowering taxes and giving power back to the people, while the party aims to reduce crime, improve immigration policies, and tackle disorder.", "The Labour party has postponed plans for their election posters because of the Asian tsunami.", "Conservative Party launches first part of Tory election manifesto in Northamptonshire"], "phi:2.7b": [" The Conservatives' manifesto, called 'Tory Values' pledges to focus on restoring order, reducing taxes and giving power back to the people.", "Michael Howard argues that there is a mass of people who feel let down by Tony Blair, sharing Tory values and forming the 'forgotten majority'.", "Labour says the document offers only a return to a 'failed Tory past', while the Liberal Democrats say the Conservatives cannot win what they predict will be a three-party contest.", "The Tories are releasing the manifesto early as campaigning activity is accelerating ahead of the general election, which is widely tipped for May but could be any time before June 2006.", "Labour postponed a launch of election posters to allow more time for donations made in response to the Asian tsunami disaster."], "orca-mini:3b": [" Howard unveils election platform, promising to focus on restoring order, lowering taxes and giving power back to the people.", "He argues there is a mass of people whom he says feel let down by Tony Blair and shares Tory values.", "The Tory leader promised to stand up for the \"forgotten majority\" in the general election.", "The manifesto foreword contains a commitment to focus on restoring order, trying to lower taxes, and giving power back to the people.", "The Conservatives vow to get a grip on crime, immigration and disorder.", "Although they have not yet released specific plans, Mr. Howard promised to lower taxes but argued he could not promise everything he could do.", "He told BBC News that the Tories were unveiling material months ahead of the expected election because they needed time to make voters aware of their policies.", "The Labour slogan will be \"Britain's working, don't let the Tories wreck it again.\"", "The Lib Dem president Simon Hughes said his party had set out its election stance in September and vowed to ask the British people for support this year as the party with the policies best able to deliver freedom and fairness and to restore trust."], "hermes3:3b": ["Howard unveils Tory election manifesto focusing on restoring order, cutting taxes and giving power back to people for forgotten majority."], "stablelm-zephyr:3b": ["Conservative leader Michael Howard unveiled the first part of the Tory election manifesto, focusing on restoring order, lowering taxes, and giving power back to the people.", "The \"forgotten majority\" includes those who save for their first home or retirement, work hard, and accept responsibilities.", "Howard argues that government is too big and that crime, immigration, and disorder need to be addressed.", "He promises a Timetable for Action but acknowledges he has not yet published specific plans on taxation.", "Other parties predict a three-party contest and accuse the Conservatives of trying to win back support they lost under Tony Blair."], "chatgpt-4o-latest": ["Michael Howard launched the first part of the Conservative election manifesto, pledging to stand up for the \"forgotten majority\" who feel let down by Tony Blair.", "He promised to restore order, lower taxes, and return power to the people, criticizing Labour for neglecting hardworking citizens.", "Howard argued for reducing government size, tackling crime and immigration, and ensuring key decisions are made by professionals rather than bureaucrats.", "He committed to a Timetable for Action but did not provide specific tax plans.", "Labour dismissed the manifesto as a return to failed Tory policies, while the Liberal Democrats positioned themselves as the true opposition.", "With the election expected in May, campaigning is intensifying, and Howard emphasized that his policies were based on what was best for Britain, not political positioning."], "stablelm2:1.6b": ["Conservative leader Michael Howard unveiled a manifesto promising to focus on restoring order, lowering taxes, and giving power back to the people ahead of the general election expected in May or earlier.", "Labour criticized the document as offering only a return to a \"failed Tory past.\"", "The Liberal Democrats argue that Conservatives cannot win a three-party contest.", "Howard claimed that the forgotten majority make up the backbone of Britain and argued that government size leads to \"down the path of ever-rising taxes.\"", "However, he has not yet revealed specific plans on taxation issues."], "granite3.1-dense:2b": ["Michael Howard, leading the Conservatives, launched the first segment of their election manifesto, focusing on supporting the \"forgotten majority\"—hardworking individuals saving for homes or retirement who feel overlooked by Tony Blair's government.", "The party vows to reduce taxes, empower local decision-makers, and tackle crime and disorder.", "Howard argues that Britain's oversized government cannot sustain high taxes and promises a Timetable for Action to ensure accountability on key issues.", "Labour counters this with their slogan, \"Britain's working, don't let the Tories wreck it again,\" claiming the Conservatives are reintroducing Thatcherism in parts while they've been more supportive of working families.", "The Liberal Democrats have already outlined their stance, emphasizing freedom and fairness to restore public trust.", "Campaigns are intensifying for an expected general election in May or June 2006, with Howard's speech marking the start of this extensive policy disclosure."]}