{"raw_text": "Lawyer attacks anti-terror laws\n \n A senior barrister who has resigned in protest over the government's anti-terror laws says the current system is giving Britain a bad name.\n \n Ian MacDonald QC quit when the government failed to recognise a House of Lords ruling that detaining terror suspects indefinitely is unlawful. He was part of a 19-strong panel who have special security clearance to act for suspected terrorists. Five more barristers are now reported to be threatening to resign.\n \n Mr MacDonald told BBC News: \"The reason why I am resigning is because I fundamentally disagree with locking people up without any trial for an indefinite period on reasonable suspicion. \"The current legal system is certainly having a very adverse effect on the Muslim community in Britain and the whole Asian community. \"I think it is giving Britain a bad name internationally\".\n \n Under the Anti-Terrorism, Crime and Security Act introduced by the government in 2001 in response to the 11 September attacks, foreign nationals suspected of involvement in terrorism who cannot be deported can be held indefinitely without trial. But Mr MacDonald believes that detainees currently being held should be entitled to a trial by jury. \"My own view is we need to have a full return to trial by jury, a proper criminal trial with proper accusations. \"As far as I'm concerned, the government have to start all over again and rethink their whole strategy for dealing with this.\" he added.\n \n The Attorney General Lord Goldsmith will receive a letter of resignation from Mr MacDonald on Monday. According to the Independent, his resignation is expected to be followed by those of five other barristers - Nicholas Blake QC, Andrew Nicol QC, Manjit Singh Gill QC, Rick Scannell and Tom de la Mare. They are all believed to be carefully considering their positions on the panel of Special Advocates who represent detainees before the Special Immigration Appeals Commission (SIAC) - a secure court without a jury, which tries terror suspects. Mr MacDonald said he had \"no idea\" whether further resignations would follow. But Barry Hugill, a spokesman for the campaign group Liberty, told Radio 4's Today programme that more lawyers may go. \"I can assure that there is a distinct possibilty that more lawyers may be resigning,\" he said. \"They are now in a situation where everything they have been trained to believe in, the right to trial by jury, has been abandoned and that is what gives some of them sleepless nights.\"\n \n Helena Kennedy, a Labour peer and a human rights lawyer, said the Special Advocates' main concern was that once they had seen any special intelligence they were not allowed to speak to the detainees. \"When this whole procedure was being considered immediately after 11 September there was a great deal of argument particularly in the House of Lords about whether there really was a process that could be considered a judicial review,\" she said. \"Without that you are having detention with no habeus corpus and really a blot, as Ian McDonald has said, on our legal landscape, something really quite shocking with regard to the rule of the law.\"\n", "llama3.2:1b": ["A senior barrister who represents suspects suspected of terrorism, Ian MacDonald QC, has resigned in protest over Britain's anti-terror laws.", "He believes that indefinite detention without trial is unlawful and gives Britain a bad name internationally.", "The government's current system allows for special security clearance to act on suspicion, but MacDonald thinks detainees should be entitled to a full return to trial by jury.", "Resignations of five other barristers following MacDonald's comments are reported."], "llama3.2:3b": ["Senior barrister Ian MacDonald QC quits over anti-terror laws, citing indefinite detentions without trial.", "He joins five more barristers in considering resignation due to concerns about the system's impact on Britain's international reputation.", "MacDonald advocates for full return to trial by jury and calls for a rethink of government strategy on dealing with terror suspects."], "gemma2:2b": ["A senior barrister, Ian MacDonald QC, resigned in protest against the UK's anti-terror laws, arguing that indefinite detention without trial is unlawful.", "Five other barristers are also reportedly considering resigning from a special panel representing suspected terrorists.", "Mr. MacDonald believes Britain's legal system lacks due process and harms its international reputation.", "He demands the right to trial by jury for detainees held under the Anti-Terrorism Act."], "qwen2.5:0.5b": ["A senior barrister named Ian MacDonald quit because he disagreed with a new government rule about detaining people indefinitely without trial.", "He thinks this is bad for Britain and Muslims in Asia.", "Some other lawyers are also thinking they need to change their minds, even though it might mean less money and more time for the special courts they represent."], "qwen2.5:1.5b": ["A barrister resigns over government anti-terror laws, criticizing indefinite detention without trial and advocating for jury trials.", "Other lawyers threaten resignation in response.", "The UK's legal system is seen as inadequate by some due to its lack of safeguards against unlawful detentions."], "qwen2.5:3b": ["A senior barrister, Ian MacDonald QC, resigned over government anti-terror laws, arguing they allow indefinite detention without trial.", "He believes this is damaging Britain's international reputation and suggests detainees should be entitled to a jury trial.", "The Attorney General Lord Goldsmith received his letter of resignation on Monday; five other barristers are reportedly considering resigning as well.", "Concerns include the ban on speaking with detained suspects, abandoning the right to trial by jury, and an adverse effect on British Muslims.", "Helena Kennedy from Liberty says Special Advocates' main concern is not being able to discuss intelligence with detainees, suggesting this blights their legal landscape."], "opencoder:1.5b": ["A senior barrister who has resigned due to anti-terror laws claims the current system is giving Britain a bad name.", "Ian MacDonald QC quits when the government fails to recognise a House of Lords ruling that detains terror suspects indefinitely, but his own view disagrees.", "It is a fundamentally adverse impact on the Muslim community in Britain and the whole Asian community, as he points out.", "The government has to rethink its whole strategy for dealing with this.", "According to the Independent, his resignation is expected to be followed by those of five other barristers - Nicholas Blake QC, Andrew Nicol QC, Manjit Singh Gill QC, Rick Scannell and Tom de la Mare.", "He added that they are all concerned about their positions on a panel of Special Advocates who represent detainees before the SIAC - a secure court without a jury, which tries suspected terrorists' cases.", "The Attorney General Lord Goldsmith will receive a letter of resignation Monday."], "smollm:1.7b": ["The summary is:\nLawyer attacks anti-terror laws"], "deepseek-r1:1.5b": ["Summarized text:\nA senior barrister, Ian MacDonald QC, quit when the government failed to recognize indefinite detention of terror suspects as illegal.", "He had special security clearance and is now threatening further resignations, concerned that he should be entitled to a trial by jury.", "The government's Anti-Terrorism, Crime and Security Act (2001) legal system has negatively affected Muslim communities internationally.", "More lawyers may follow MacDonald's actions due to concerns over accountability issues after the 11 September attacks."], "tinyllama:1.1b": ["The senior barrister Ian MacDonald QC has resigned in protest over the government's anti-terror laws, citing the current system as allowing for an indefinite detention without trial of suspects.", "The Attorney General Lord Goldsmith and five more lawyers are expected to resign from the Special Immigrations Appeals Commission (SIAC), which deals with terror suspects, following their decision to join the campaign group Liberty in calling for a return to trial by jury.", "The government has not yet made any decisions regarding the future of these barristers or whether other lawyers may follow suit.", "Helen Kennedy, a Labour peer and human rights lawyer, also believes that Special Advocacies should have access to detained suspects' special intelligence."], "tinydolphin:1.1b": [" Attorney General Lord Goldsmith will receive a letter of resignation from Ian MacDonald QC on Monday.", "According to the Independent, his resignation is expected to be followed by those of five other barristers - Nicholas Blake QC, Andrew Nicol QC, Manjit Singh Gill QC, Rick Scannell and Tom de la Mare - who are believed to be carefully considering their positions on the panel of Special Advocates representing detainees before the Special Immigration Appeals Commission (SIAC).", "Mr. MacDonald said he had \"no idea\" whether further resignations would follow.", "Barry Hugill, a spokesman for the campaign group Liberty, told Radio 4's Today programme that more lawyers may go.", "\"I can assure that there is a distinct possibility that more lawyers may be resigning,\" he said.", "\"They are now in a situation where everything they have been trained to believe in, the right to trial by jury, has been abandoned and that gives some of them sleepless nights.\""], "phi:2.7b": [" Senior barrister resigns in protest over anti-terror laws, believing the current system is giving Britain a bad name and affecting the Muslim community.", "Lawyer believes detainees should have access to trial by jury.", "Five more barristers have threatened to quit.", "Attorney General will receive letter of resignation from Ian MacDonald.", "Lawyers on panel may follow suit due to lack of access to special intelligence about detainees."], "orca-mini:3b": [" The text summarizes the key ideas and details about a senior barrister's resignation from a government anti-terror law due to his disagreement with detaining terror suspects indefinitely without trial.", "The resignation is expected to be followed by the resignations of five other barristers who represent detainees before a secure court without a jury that tries terror suspects.", "The text also mentions the potential for further resignations, and quotes human rights lawyer Helena Kennedy in support of the Special Advocates' concerns about the lack of legal protections and habeus corpus."], "hermes3:3b": ["Lawyer resigns over indefinite terror suspect detentions, claiming current system gives Britain a bad name."], "stablelm-zephyr:3b": ["A lawyer named Ian MacDonald resigned because he didn't agree with keeping people in jail without a trial.", "This happened because of anti-terror laws that were made after some bad events happened in 2001.", "Ian thinks everyone should get a trial by jury, like how we have them for normal crimes.", "Some other lawyers might also resign because they feel the same way about these laws.", "They are trying to protect the idea of a fair and just legal system."], "chatgpt-4o-latest": ["Senior barrister Ian MacDonald QC resigned in protest against the UK government's anti-terror laws, arguing that indefinite detention without trial damages Britain's reputation and disproportionately affects the Muslim and Asian communities.", "His resignation follows the government's refusal to recognize a House of Lords ruling deeming such detentions unlawful.", "Five other barristers are also considering resigning.", "Under the 2001 Anti-Terrorism, Crime and Security Act, foreign nationals suspected of terrorism who cannot be deported can be held indefinitely without trial.", "MacDonald advocates for a return to jury trials and a complete overhaul of the government's strategy.", "Other legal professionals, including Labour peer Helena Kennedy, criticize the system for denying detainees proper legal representation and judicial review, calling it a serious violation of legal principles."], "stablelm2:1.6b": ["Senior barrister Ian MacDonald resigned in protest over the UK government's anti-terror laws after a House of Lords ruling deemed indefinite detention of terror suspects without trial is unlawful.", "Five more barristers are reportedly threatening to quit, while MacDonald believes detainees should have access to a proper criminal trial with accusations.", "The Anti-Terrorism, Crime and Security Act introduced by the government following the 9/11 attacks allows for indefinite detention without trial for suspected terrorists.", "However, MacDonald argues that those currently being held should have access to a full trial by jury, as his view is that the government must rethink their strategy on dealing with terrorism cases."], "granite3.1-dense:2b": ["Senior barrister Ian MacDonald QC resigned from his position due to disagreement with indefinite detention of terror suspects without trial.", "As part of a 19-member panel with special security clearance, he believes this practice is harming Britain's reputation and adversely impacting the Muslim and Asian communities.", "MacDonald advocates for returning to trial by jury for these detainees.", "His resignation is expected to be followed by five other barristers.", "The Special Advocates' group, representing terror suspects in the Secure Court (SIAC), faces similar concerns about being restricted from discussing intelligence with their clients after reviewing it.", "This detention policy, introduced post-9/11, has raised human rights issues and is under scrutiny, with more lawyers potentially resigning due to its violation of the right to trial by jury."]}