{"raw_text": "Protect whistleblowers, TUC says\n \n The government should change the law to give more protection to employees who raise health and safety concerns about their workplaces, the TUC has said.\n \n It said data from employment tribunals suggested 1,500 \"safety whistleblowers\" had lost their jobs since 1999. Some firms found it cheaper to sack a worker than to improve buildings or change working conditions, it said. The Health and Safety Executive said it was trying to get workers more involved in helping to make workplaces safer. The TUC figures were drawn from unfair dismissal cases at tribunals were health and safety were the main issue.\n \n Safety representatives were often ignored when raising concerns because there was no legal duty to respond, claimed the union organisation. General secretary Brendan Barber said: \"It shouldn't be a firing offence to object to unsafe work. \"Workers should not be placed in the situation where they are forced to choose between risking their job or risking their personal health and safety.\" Mr Barber, who said the \"problem is far worse than official statistics show\", called for a legal system that \"protects safety whistleblowers\". He added that workers who are not in a union, as well as casual and migrant workers, \"stand little chance of redress.\"\n \n Rory O' Neill, editor of union-backed Hazards magazine, which conducted the research, said: \"Giving union safety reps more rights in more workplaces is the ultimate win-win. \"Death and injuries at work increased last year, for the second time since the turn of the century. \"It would be a fatal mistake not to take full advantage of the union safety effect.\" The TUC has called on the government to appoint \"roving\" safety reps and to increase spending on health and safety work inspections. The Health and Safety Executive had said that it had launched an initiative to make factories and offices safer, with more worker involvement.\n", "llama3.2:1b": ["The TUC is calling for the government to change the law to give employees who raise health and safety concerns in their workplaces greater protection.", "Data from employment tribunals suggests 1,500 safety whistleblowers have lost their jobs since 1999.", "Safety representatives are often ignored when raising concerns due to a lack of legal duty to respond.", "The TUC wants workers not to be forced to choose between risking their job and personal health and safety.", "A union-backed study found giving union safety reps more rights in workplaces would lead to increased death and injury rates at work, potentially fatal."], "llama3.2:3b": ["The TUC recommends changing the law to protect employees who raise health and safety concerns, citing 1,500 cases of workers losing their jobs since 1999.", "The union argues for a legal system that protects \"safety whistleblowers\" and provides redress for non-union workers, including casual and migrant staff."], "gemma2:2b": ["The Trades Union Congress (TUC) advocates for stronger legal protection for employees who report health and safety concerns at their workplaces.", "Data suggests a significant number of whistleblowers have been dismissed due to such reporting, making it difficult for workers to raise legitimate issues without jeopardizing their employment.", "The TUC argues that current laws don't adequately protect safety whistleblowers, especially considering the consequences are often more severe than financial costs.", "They recommend increased government funding for workplace health and safety initiatives and empower union safety representatives with greater legal protections."], "qwen2.5:0.5b": ["The Health and Safety Executive and the United Trade Union Confederation (TUC) advocate for stronger protection of whistleblowers, which can result in greater legal rights and redress for safety concerns.", "This includes giving union representatives more powers within workplaces and investing in safer working conditions."], "qwen2.5:1.5b": ["The TUC calls for stronger protection of workplace whistleblowers, citing data showing 1,500 workers lost jobs since 1999 due to safety concerns unresolved by employers.", "The union argues many firms prefer firing employees over improving conditions and believes there should be a legal duty to respond to health and safety issues raised by safety representatives."], "qwen2.5:3b": ["The TUC advocates for changes in law to provide greater protection to employees who raise workplace health and safety concerns.", "Data from employment tribunals indicate that over 1,500 \"safety whistleblowers\" have lost their jobs since 1999 due to employers opting to sack workers rather than improve conditions.", "The TUC claims the Health and Safety Executive is insufficient in getting workers more involved in workplace safety improvements.", "It highlights unions like the TUC as crucial for safety representatives, often ignored by firms when raising concerns.", "Brendan Barber of the TUC argues that objecting to unsafe work should not be a firing offense, emphasizing the need for legal protection for whistleblowers and increased spending on health and safety inspections.", "Rory O'Neil suggests more rights for union safety reps could lead to safer workplaces."], "opencoder:1.5b": ["Protect whistleblowers, TUC says \n\nThe government should change the law to give more protection to employees who raise concerns about workplace safety, the TUC has said.", "It said data from employment tribunals suggested 1,500 \"safety whistleblowers\" had lost jobs since 1999.", "Some firms found it cheaper to sack a worker than to improve buildings or change working conditions.", "The Health and Safety Executive said it was trying to get workers more involved in making workplaces safer.", "The TUC figures were drawn from unfair dismissal cases at tribunals where health and safety were the main issue.", "Safety representatives were often ignored when raising concerns because there was no legal duty to respond.", "The union organisation claimed the \"problem is far worse than official statistics show\".", "Workers who are not in a union, as well as casual and migrant workers, stand little chance of redress."], "smollm:1.7b": ["The summary should be:\nProtect whistleblowers by giving them more protection from unfair dismissal claims.", "Give more power to trade unions to help workers raise safety concerns about their workplaces.", "Make the law stronger so that employers are legally required to respond to safety concerns raised by employees.", "Give more support to safety reps who work in smaller firms or for less well-known companies.", "This summary captures the main ideas and key details of the original text, while avoiding unnecessary information and explanations."], "deepseek-r1:1.5b": ["The TUC has called for the government to change laws to protect employees who raise health and safety concerns.", "They noted that 1,500 \"safety whistleblowers\" lost their jobs since 1999, finding it cheaper for firms to fire workers than to improve buildings or conditions.", "The HSRC aimed to involve workers in making workplaces safer but faced criticism, calling firing an object an offense and emphasizing the need for a better system.", "They emphasized that safety reps were often ignored due to no legal duty to respond.", "General Secretary Brendan Barber called for a system protecting whistleblowers and highlighted the urgent need for full exploitation of union safety effects.", "The TUC's concern is that many workplace deaths doubled since 1900, urging the government to adopt more vigilance and inspections."], "tinyllama:1.1b": ["The government should change the law to give more protection to employees who raise concerns about their working environment, according to a report by the TUC.", "The union organisation said that data from employment tribunal cases suggested that approximately 1,500 employees have lost their jobs since 1999 due to health and safety concerns raised at workplace.", "According to the union, this issue should be considered in the context of unfair dismissal cases.", "The TUC is urging the government to appoint \"roving\" safety representatives and increase spend on health and safety work inspections.", "The HSE has launched an initiative aimed at improving working environments for all."], "tinydolphin:1.1b": [" The TUC has called for the government to appoint \"roving\" safety reps and increase spending on health and safety work inspections as part of a strategy aimed at improving workers' safety in the workplace.", "While employers have been reluctant to address safety concerns, whistleblowers are often forced to choose between their job and their personal health and safety.", "This issue is particularly significant for non-unionized workers and migrant workers, who may not have the legal right to raise concerns about unsafe working conditions.", "By giving union safety reps more rights in more workplaces, this approach could help ensure that workers receive the support they need to protect themselves and their colleagues from danger."], "phi:2.7b": [" The TUC wants to protect employees who speak out about workplace hazards by changing the law.", "A study showed 1,500 safety whistleblowers lost their jobs since 1999.", "Union bosses called for safety reps to have more legal rights in workplaces.", "They believe it would be a mistake not to take advantage of union's role in making workplaces safer."], "orca-mini:3b": [" The TUC recommends changing the law to give more protection to employees who raise health and safety concerns about their workplaces.", "This would involve making roving safety reps and increasing spending on health and safety work inspections.", "There are concerns that some firms find it cheaper to sack a worker than to improve buildings or change working conditions, which is why the TUC suggests protecting safety whistleblowers.", "The government should take full advantage of the union safety effect, according to the TUC."], "hermes3:3b": ["TUC recommends changing law to protect employees who raise health and safety concerns in workplaces, as many have lost their jobs since 1999."], "stablelm-zephyr:3b": ["The Trades Union Congress (TUC) has called on the UK government to amend legislation to provide additional protections for employees raising health and safety concerns about their workplaces.", "They argue that data from employment tribunals indicates 1,500 \"safety whistleblowers\" lost their jobs between 1999 and 2019; some employers chose to dismiss workers rather than improve workplace conditions or invest in building upgrades.", "The TUC's figures are based on unfair dismissal cases where health and safety was the main issue.", "Safety representatives often face ignoring when raising concerns due to a lack of legal duty to respond, putting workers in a choice between risking their job or personal health and safety.", "Hazards magazine editor Rory O' Neill supports the TUC's call for increased rights for union safety reps and more spending on health and safety inspections, aiming to improve workplace safety through greater worker involvement."], "chatgpt-4o-latest": ["The TUC has urged the government to strengthen legal protections for employees who raise workplace health and safety concerns, citing data suggesting 1,500 whistleblowers have lost their jobs since 1999.", "Some companies prefer to dismiss workers rather than improve conditions.", "The TUC argues that safety representatives are often ignored due to a lack of legal obligation to respond.", "General Secretary Brendan Barber emphasized that workers should not have to choose between job security and personal safety.", "The union-backed Hazards magazine highlighted rising workplace injuries and deaths, advocating for stronger union safety rights.", "The TUC called for \"roving\" safety representatives and increased funding for inspections, while the Health and Safety Executive has launched initiatives to enhance workplace safety with greater worker involvement."], "stablelm2:1.6b": ["The TUC urges the government to change the law to protect employees who raise health and safety concerns in their workplaces.", "This would involve creating a legal duty for companies to respond to such concerns, rather than dismissing them as a firing offense.", "The union organization notes that some firms find it cheaper to fire workers than to improve conditions or buildings.", "The Health and Safety Executive is trying to increase worker involvement in making workplaces safer.", "The TUC research shows that safety representatives are often ignored when raising health and safety concerns due to no legal duty to respond.", "They advocate for a system that protects safety whistleblowers and calls for increased spending on health and safety inspections, with roving safety reps appointed by the government."], "granite3.1-dense:2b": ["The Trades Union Congress (TUC) advocates for law changes to safeguard employees who expose health and safety issues in their workplaces, citing evidence from employment tribunals showing 1,500 such \"safety whistleblowers\" lost their jobs between 1999 and 2023.", "The Health and Safety Executive (HSE) is working to engage workers in enhancing workplace safety.", "However, the TUC reports that safety representatives are often disregarded due to a lack of legal obligation for employers to respond to their concerns.", "General secretary Brendan Barber emphasizes that objecting to unsafe conditions shouldn't lead to job loss and urges a legal framework protecting whistleblowers.", "He warns that non-union workers, casual laborers, and migrants face little recourse for addressing workplace dangers.", "Union-backed research indicates that workplace fatalities and injuries have risen for the second consecutive year since 2000.", "The TUC proposes appointing \"roving\" safety representatives and boosting inspection spending to improve worker safety, while acknowledging the HSE's ongoing initiative to involve employees in safety enhancements."]}