{"raw_text": "Police urge pub closure power\n \n New powers are needed to close disorderly pubs, bars and clubs for up to a week or even permanently, police chiefs have told MPs.\n \n Association of Chief Police Officers president Chris Fox said the current 24-hour closure power did not have enough impact on bad landlords. Mr Fox's comments follow the controversy over plans to allow pubs to open around the clock. He rejected critics' calls for the law change to be delayed. Instead, the new Licensing Act could help reduce drunken disorder - but only if it was properly planned, he argued.\n \n Acpo made its call for stronger closure powers in a paper for the Commons home affairs select committee. After the meeting, Mr Fox said being able to close premises for only 24 hours did not necessarily make an impact. \"If it's 12.30 on a Saturday morning and you close for 24 hours there's not a lot of pain for the premises because they probably wouldn't open on Sunday anyway.\n \n \"This is about getting through to the management that they can't run a disorderly house without facing some immediate sanctions.\" Under Acpo's proposal, the closure orders would be used only with the agreement of the local licensing authority. The new licensing laws will give police greater powers to close pubs and clubs - but only for 24-hour periods.\n \n Mr Fox said the drinks industry was currently not regulating itself. \"It's making money at the cost of human misery and the public purse, and the strategic planning process has been less than useless,\" he said. Mr Fox said the new laws, due to start being phased in next month, could help if food outlets, public transport and public toilets could cope with late-night drinkers. \"Staggering it (closing hours) will be a solution if the infrastructure is there, if the premises are properly managed and people aren't being served rolling drunk and underage and then tossed out into the street,\" he said. \"We have the problem from 11pm to 2am in any event. We have to get a grip on the underlying causes of this.\"\n \n Acpo wants pubs and clubs which cause extra work for police and hospitals to have to pay towards the costs. Home Secretary Charles Clarke is currently looking at the idea of a levy on the drinks industry to pay for the cost of extra policing. The licensing changes have sparked concern among some MPs, councils and some senior police officers who fear they could exacerbate drinking problems. Culture Secretary Tessa Jowell on Tuesday said it was not her job to bow to the campaign against the changes. It was the status quo, not the new laws, which were causing current binge drinking problems, she told BBC Two's Newsnight. Leaked documents have suggested ex-Home Secretary David Blunkett branded new opening hours as a \"leap in the dark\". But Ms Jowell insisted his concerns had been met. The police's job against alcohol-related crime would be made easier if all pubs did not close at the same time, she added.\n", "llama3.2:1b": ["Police chiefs are urging MPs to grant them new powers to close disorderly pubs and clubs for up to a week or permanently, citing the need to address binge drinking problems.", "The Association of Chief Police Officers (Acpo) is proposing that police should be able to close premises with the agreement of the local licensing authority and only after 24 hours.", "Acpo president Chris Fox argues that current 24-hour closure power is not effective in addressing the issue, as it does not impact landlords who may choose to operate at night anyway.", "The government plans to introduce new laws giving police greater powers to close pubs and clubs for 24-hour periods."], "llama3.2:3b": ["Police chiefs urge stronger closure powers for up to a week or permanently to address disorderly pubs and bars, arguing current 24-hour closure power is insufficient; new Licensing Act could help reduce drunken disorder if properly planned; Acpo proposal includes using closure orders with local licensing authority agreement; some MPs and councils express concern the changes may exacerbate drinking problems."], "gemma2:2b": ["Police chiefs are requesting new powers to permanently or temporarily close disorderly pubs for up to a week, arguing that current 24-hour closure powers are ineffective.", "They believe these new powers, outlined in the upcoming Licensing Act, can reduce drunken disorder if implemented effectively with local licensing authorities' consent.", "The police argue the current drinks industry does not regulate itself and is financially benefiting from causing public misery and burdening public services.", "They suggest staggered closing hours and stricter regulations for alcohol serving and underage drinking could help address the problem."], "qwen2.5:0.5b": ["Police advise closing bars and clubs for up to 72 hours or permanently.", "Licensing Act could help with more severe cases, but it needs proper planning.", "Alcohol industry still regulating itself.", "Might help with late night drinking costs.", "Might help if food outlets, public transport and toilet systems can cope."], "qwen2.5:1.5b": ["Police call for stronger closure powers over disorderly pubs and clubs.", "Acpo proposes 24-hour closures only with local licensing authority approval.", "New laws aim to reduce drunken disorder but need better infrastructure and management plans.", "The drinks industry is criticized for causing public harm, while some MPs fear the changes could worsen drinking problems."], "qwen2.5:3b": ["New powers to close disorderly pubs, bars and clubs for up to a week are needed by police chiefs, who argue current 24-hour closure power is insufficient.", "This proposal comes in response to criticism of plans allowing pubs to stay open all night.", "ACPo suggests using stronger closure orders with local licensing authority agreement to combat drunken disorder.", "Critics fear new laws could worsen drinking problems but supporters argue they can help if infrastructure and management are in place.", "There's concern about the impact on food outlets, public transport and late-night drinkers, as well as a potential levy on the drinks industry to cover extra policing costs."], "opencoder:1.5b": ["The text provides an overview of the situation surrounding the closure of disorderly public places (pubs, bars, clubs) in a public place by police authorities over a period of one week or even indefinitely, while also highlighting a proposal to modify the existing licensing laws.", "It then suggests a new way for these facilities to reopen after the closure period."], "smollm:1.7b": ["The summary is concise and to the point.", "It captures the main ideas of the text without including unnecessary details or explanations.", "The key points are:\n\n1.", "Police urge pub closure powers\n2.", "New powers could help reduce drunken disorder - but only if they were properly planned\n3.", "Acpo made its call for stronger closure powers in a paper for the Commons home affairs select committee\n4.", "Mr Fox said being able to close premises for only 24 hours did not necessarily make an impact\n5.", "The new licensing laws will give police greater powers to close pubs and clubs - but only for 24-hour periods\n6.", "Mr Fox said the drinks industry was currently not regulating itself\n7.", "Staggering it (closing hours) would be a solution if the infrastructure is there, if the premises are properly managed and people aren't being served rolling drunk and underage and then tossed out into the street\n8.", "We have the problem from 11pm to 2am in any event - we have to get a grip on the underlying causes of this"], "deepseek-r1:1.5b": ["Police force has urged pub closures to remain longer or permanently due to concerns over bad landlords.", "Chief Police Officers president Chris Fox criticized the current 24-hour closure policy and suggested better planning is needed.", "A new Licensing Act could support reducing drunken disorder if properly managed, but only for 24 hours.", "The drinks industry hasn't regulated itself well, causing human misery.", "Proper infrastructure can help close pubs all night to reduce problems.", "MPs are concerned this might worsen issues."], "tinyllama:1.1b": ["The Police Chiefs of England urged a review of the current 24-hour closure power for disorderly pubs, bars and clubs, following criticism from MPs over plans to allow them to remain open around the clock.", "Acpo president Chris Fox said the new Licensing Act could help reduce drunken disorder, but only if it was well planned, insisting that closures must be based on local authorities' agreement and taking into account the management of premises and the public's welfare.", "The current 24-hour closure power did not have enough impact on bad landlords, he argued, with the new law only applying if it was used properly.", "Acpo wants pubs and clubs to be responsible for their own costs in addition to paying a licensing levy to fund extra policing.", "The proposals sparked concerns among some MPs, councils, and police officers, with Culture Secretary Tessa Jowell defending the current status quo and stating that it was not her job to \"bow to campaign against\" them.", "Leaked documents have suggested that former Home Secretary David Blunkett branded opening hours for alcohol-related crime as a \"leaep in the dark\", but Ms Jowell insisted the police's job would be made easier if all pubs did not close at the same time."], "tinydolphin:1.1b": [" This statement is about the current licensing laws for pubs and clubs in the UK.", "It discusses how some people think that the current system allows bad landlords to continue running disorderly establishments and not face consequences.", "To address this issue, the AI assistant suggests a change in closing times for these businesses.", "The new legislation would only be applied for 24 hours at first, but after the committee's meeting, the powers could be extended for more hours if needed.", "The goal is to reduce drunken disorder and improve public safety."], "phi:2.7b": [" Police chiefs are calling for stronger powers to temporarily or permanently close disorderly pubs and clubs under the new Licensing Act.", "They argue that the current 24-hour closure power is ineffective in preventing bad landlords from running disorderly premises.", "The Acpo paper for the Commons home affairs select committee recommends using closure orders only with the agreement of local licensing authorities, which could help reduce drunken disorder.", "The drinks industry currently lacks self-regulation and causes problems for the public and the police.", "The new laws will give police greater powers to close pubs and clubs, but only for 24-hour periods.", "Acpo also wants businesses that cause extra work for the police and hospitals to pay towards the costs.", "Some MPs and senior officers fear the changes could exacerbate drinking problems, but Home Secretary Charles Clarke is looking at a levy on the drinks industry to fund the cost of increased policing.", "Critics of the new opening hours are concerned about the status quo causing current binge drinking problems, but Tessa Jowell insists that David Blunkett's concerns have been met and that it will be easier for the police if all pubs do not close at the same time."], "orca-mini:3b": [" New laws could help reduce drunken disorder but only if premises are properly managed and people aren't served rolling drunk and underage, says a police chief.", "Association of Chief Police Officers president Chris Fox wants stronger closure powers for pubs and clubs causing extra work for police and hospitals to pay towards the costs.", "The Licensing Act could help reduce drunken disorder but only if it is properly planned, he argues."], "hermes3:3b": ["Police urge stronger powers to close disorderly pubs for up to a week or permanently, to counter bad landlords' impact on drunken disorder."], "stablelm-zephyr:3b": ["Police chiefs have advocated for new powers to close disorderly pubs and clubs for up to a week or permanently, arguing that 24-hour closure currently does not have enough impact on bad landlords.", "The Association of Chief Police Officers (Acpo) has proposed using closure orders with the agreement of local licensing authorities.", "Home Secretary Charles Clarke is considering a levy on the drinks industry to pay for extra policing resulting from the new laws and changes.", "Critics fear these measures will exacerbate drinking problems; Culture Secretary Tessa Jowell maintains that it's the status quo, not the new laws themselves, that is causing current binge drinking issues."], "chatgpt-4o-latest": ["Police chiefs are calling for stronger powers to close disorderly pubs, bars, and clubs for up to a week or permanently, arguing that the current 24-hour closure rule is ineffective.", "Association of Chief Police Officers (Acpo) president Chris Fox stated that bad landlords face little consequence under existing laws.", "While some critics want a delay in new licensing laws allowing 24-hour pub openings, Fox believes they could help reduce drunken disorder if properly managed.", "Acpo proposed that closure orders should require local licensing authority approval.", "Fox criticized the drinks industry for failing to regulate itself and suggested that businesses causing extra strain on police and hospitals should contribute to costs.", "Home Secretary Charles Clarke is considering a levy on the industry to fund additional policing.", "Some MPs and officials fear the new laws could worsen drinking problems, but Culture Secretary Tessa Jowell defended them, arguing that the current system is the real issue.", "She also noted that staggered closing times could help police manage alcohol-related crime more effectively."], "stablelm2:1.6b": ["Police propose stronger closure powers for disorderly venues.", "Police Chiefs Chris Fox and ACPO advocate for a new Licensing Act which could help reduce drunken disorder in bars and clubs.", "The current hour-long closure power does not impact bad landlords, according to Fox.", "Under the proposed act, local licensing authorities will agree to closure orders; however, pubs may be closed only during 1-hour periods.", "Critics argue that the industry should regulate itself rather than rely on police intervention.", "Home Secretary Charles Clarke is considering a drinks levy to cover extra policing costs.", "The new laws could help address the underlying causes of late-night drinking and provide better infrastructure for managing public areas served by late-night establishments.", "ACPO wants pubs that cause extra work for police and hospitals to contribute towards the costs associated with these issues."], "granite3.1-dense:2b": ["Police chiefs urge MPs for stronger closure powers to address disorderly pubs, bars, and clubs, advocating for 24-hour or even permanent closures.", "Association of Chief Police Officers (Acpo) president Chris Fox argues that the current 24-hour closure power is insufficient in deterring bad landlords.", "He believes new Licensing Act provisions, when properly implemented with local licensing authorities, could reduce drunken disorder and alleviate strain on emergency services.", "Acpo emphasizes that the drinks industry needs to regulate itself more effectively, as it currently generates revenue at the expense of public safety and infrastructure costs.", "The new laws are set to phase in next month, enabling police to close premises for 24-hour periods upon agreement with local authorities.", "Acpo proposes that disorderly establishments should contribute towards the costs of extra policing.", "Culture Secretary Tessa Jowell defends the changes, stating they aim to address binge drinking problems caused by the status quo rather than the new laws themselves.", "Leaked documents suggest former Home Secretary David Blunkett expressed concerns about the proposed opening hours but maintains these issues have been addressed."]}