{"raw_text": "Tories pledge free sports lessons\n \n Children would be offered two hours' free sports training a week by a future Tory government, the party has said.\n \n The Club2School policy would provide up to £250m yearly for local sports clubs in the UK to deliver after-school sport. The extra coaching would be funded by the National Lottery and would come on top of the two hours of sport a week children are supposed to get in school. Shadow home secretary David Davis said five million children were being denied adequate sporting opportunities.\n \n The plans would help tackle the \"fastest growing rate of obesity in the developed world\", he said. Shadow sports minister Lord Moynihan said the policy would empower local clubs and create a lasting legacy. \"We aim to shift the emphasis on after-school sport provision away from our overstretched teachers and schools directly in to the 151,000 sports clubs in the UK.\" The Tories say Labour's plans to give all children two hours of sports lessons a week in schools have failed. Government figures show that in England in 2002 only a third of schools at Key Stages 1, 3 and 4 and two-fifths of schools at Key Stage 2, met that target. The Tories also claim that of the £750m the prime minister pledged in 2000 to invest on school sports facilities, only £41m had been spent. But the Big Lottery Fund has said that complex capital projects are involved - and it was confident the money would all be allocated by next year as intended.\n", "llama3.2:1b": ["Tories plan to provide free after-school sports training for children under 18 in a future government, offering up to £250m yearly for local sports clubs.", "This policy is part of their Club2School initiative, which aims to help tackle obesity and improve physical fitness.", "The plans would fund after-school sport training through the National Lottery, on top of existing school provision."], "llama3.2:3b": ["Tories pledge two hours of free sports training per week for UK children, funded by National Lottery, to tackle rising obesity rates.", "Shadow home secretary David Davis says five million children miss out on sporting opportunities.", "The policy aims to shift focus from schools to 151,000 local sports clubs and surpass Labour's 2002 target of one-third of schools meeting the two-hour sports lesson requirement."], "gemma2:2b": ["The Conservative Party plans to offer two hours of free sports training per week for children through their \"Club2School\" policy, funded by the National Lottery.", "This aims to combat childhood obesity, empower local clubs, and replace teacher-led programs.", "The plan acknowledges past failures in meeting school sport targets and promises efficient allocation of funds allocated by the Big Lottery Fund."], "qwen2.5:0.5b": ["The Tories plan free sports lessons for children aged 5-16 in schools across England.", "The policy aims to provide up to £250,000 per year for local sports clubs to offer after-school sports sessions.", "The initiative is seen as crucial for tackling obesity rates and empowering sports clubs in the UK.", "However, Labour's plans to extend after-school sports lessons to all children have not succeeded."], "qwen2.5:1.5b": ["The Conservatives have announced plans for a free two-hour weekly sports program in schools called Club2School, providing additional funding from the National Lottery to help local clubs deliver after-school sport.", "This initiative aims to address the high rate of obesity and underachievement in children's sporting opportunities compared to their peers in other developed countries."], "qwen2.5:3b": ["Tories propose free weekly sports lessons for children through Club2School policy funded by National Lottery, aiming to address UK's rising obesity rate.", "The initiative would replace school-provided two-hour weekly sport sessions with extra coaching from local sports clubs.", "Shadow home secretary David Davis and shadow sports minister Lord Moynihan support the plan, claiming it will empower clubs and provide lasting benefits compared to Labour’s previous proposals that failed to meet targets.", "Tories argue that less than a third of schools in England met 2002 target for two-hour weekly school sport sessions, with only £41m out of £750m pledged by then-Prime Minister Tony Blair spent on sports facilities as intended by the Big Lottery Fund."], "opencoder:1.5b": ["The goal of offering two hours' free sports lessons for children is to promote after-school sport in schools, in the hope that it will provide additional opportunities for growth.", "By doing so, the government aims to create a lasting legacy and emphasize after-school sport provision."], "smollm:1.7b": ["The summary should preserve key ideas and details:\n\n1.", "The Tories pledge free sports lessons for children in the future.", "2.", "Children would be offered two hours' free sports training a week by a future Tory government, the party has said.", "3.", "The Club2School policy would provide up to £250m yearly for local sports clubs in the UK to deliver after-school sport.", "4.", "The extra coaching would come on top of the two hours of sport a week children are supposed to get in school.", "5.", "Shadow home secretary David Davis said five million children were being denied adequate sporting opportunities.", "6.", "The plans would help tackle the \"fastest growing rate of obesity in the developed world\", he said.", "7.", "Shadow sports minister Lord Moynihan said the policy would empower local clubs and create a lasting legacy.", "8.", "The Tories say Labour's plans to give all children two hours of sports lessons a week in schools have failed.", "9.", "Government figures show that in England in 2002 only a third of schools at Key Stages 1, 3 and 4 and two-fifths of schools at Key Stage 2 met that target.", "10.", "The Tories also claim that of the £750m the prime minister pledged in 2000 to invest on school sports facilities, only £41m had been spent.", "11.", "But the Big Lottery Fund has said complex capital projects are involved - and it was confident the money would all be allocated by next year as intended."], "deepseek-r1:1.5b": ["The Tories aim to offer two hours of free sports training weekly by a future Tory government.", "They plan a Club2School policy funding up to £250 million annually for local clubs, with additional National Lottery money on top.", "The goal is to tackle rapid growth in obesity among developed countries.", "They say previous plans have failed, and only 30% of schools in England met targets.", "The Fund notes complex projects but expects confidence next year's allocation."], "tinyllama:1.1b": ["The Tories propose to give children two hours of free sports training a week by offering up to £250m annually from the National Lottery and from their policy, \"Tories pledgge free sports lessons\".", "The initiative will help tackle obesity rates by empowering local clubs and creating a lasting legacy.", "The plans aim to shift the focus away from overstretched teachers and schools directly in favor of 151,000 sports clubs in the UK.", "The Tories also claim that only two-fifths of schools met the government's target for after-school sport provision.", "However, the party has claimed that only £41m out of the £750m they pleaded for investing on school sports facilities had been spent."], "tinydolphin:1.1b": [" A summary of this text might look like this: The Tories plan to offer children two hours of free sports training each week, starting with future Tory governments.", "Local sports clubs will receive funding from the National Lottery and the extra coaching would come on top of the two hours a week children should be getting in school.", "The policy is aimed at addressing the growing issue of obesity among young people and empowering local clubs to create a lasting legacy.", "Together with Labour, the Tories claim that their plans have fallen short of meeting a target for two-hour sports lessons for all students at Key Stages 1, 3, and 4 in England.", "The government has pledged £750 million for school sports facilities but only £41 million had been spent as of October 2006."], "phi:2.7b": [" The Tories plan to give two hours of free sports training a week to children in local clubs with funding from the National Lottery, aiming to tackle increasing rates of childhood obesity.", "They argue that Labour's two hours of school-based sport lessons have not been effective and claim the government has only spent a small percentage of promised sports facility investment."], "orca-mini:3b": [" The Tory party has announced that children would receive two hours of free sports training per week, funded by National Lottery money and delivered by local sports clubs through the Club2School policy.", "This policy aims to provide adequate sporting opportunities for five million children who are not currently receiving enough sports lessons in schools.", "However, the Tories claim that Labour's plans to give all children two hours of sports lessons a week in schools have failed, and only £41m has been spent out of a promised £750m."], "hermes3:3b": ["Tories: Free sports lessons for children (2hrs/week, ~$250m yearly)."], "stablelm-zephyr:3b": ["A future Tory government pledges free two-hour sports training for children per week, funded by the National Lottery and on top of the existing school sport hours.", "The Club2School policy aims to shift after-school sport provision from teachers and schools directly to local clubs, aiming to combat obesity and create lasting legacies.", "This announcement follows claims that Labour's plans to provide two hours of sports lessons a week for all children have failed, with only a third of UK schools meeting the target in 2002.", "The Tories also criticize the £750m pledged by the prime minister in 2000 for school sports facilities, stating that only £41m has been spent."], "chatgpt-4o-latest": ["The Conservative Party has pledged to offer children two hours of free sports training per week through its Club2School policy, funded by the National Lottery with up to £250 million annually.", "This initiative aims to supplement the existing two hours of school sports and address rising childhood obesity.", "Shadow home secretary David Davis criticized the lack of adequate sporting opportunities for five million children, while shadow sports minister Lord Moynihan emphasized shifting after-school sports provision to local clubs.", "The Tories argue that Labour's efforts to provide two hours of school sports have failed, citing government data showing many schools did not meet the target.", "They also claim that only £41 million of the £750 million pledged for school sports facilities in 2000 has been spent, though the Big Lottery Fund insists the funds will be fully allocated by next year."], "stablelm2:1.6b": ["The Conservative Party proposes a future government will offer free two-hour weekly sports lessons to children, with an additional £1 million yearly fund for local sports clubs in the UK.", "This would provide extra coaching compared to school hours, aiming to tackle obesity rates and empower local clubs in improving after-school sporting opportunities.", "The Tory's claims Labour's plans have failed; however, government figures show only a third of schools met Key Stage 4 sports targets, and £1 million out of £1pm pledged was spent on school sports facilities."], "granite3.1-dense:2b": ["A future Conservative government plans to offer two hours of free sports training per week to children through a policy called Club2School, costing up to £250 million annually.", "This initiative aims to supplement the current school-provided two hours of sports and would be funded by the National Lottery.", "Shadow home secretary David Davis and shadow sports minister Lord Moynihan assert that this policy would address the insufficient sporting opportunities for five million children, helping combat the highest obesity rate among developed nations.", "The Tories criticize Labour's school-based sports plans as ineffective, citing low implementation rates and underspending on pledged funds.", "They believe this approach would empower local sports clubs, creating a lasting impact, with the Big Lottery Fund assuring allocation of the allocated £41 million by next year."]}