{"raw_text": "Ministers lose slopping out case\n \n The Scottish Executive has lost an appeal against an inmate's compensation for being forced to slop out in prison.\n \n Armed robber Robert Napier, 25, won £2,450 after he claimed he suffered an outbreak of the skin complaint, eczema, when slopping out at Barlinnie Prison. Napier said that the practice, where prisoners use buckets in their cells as toilets, breached his human rights. On Thursday, the Court of Session threw out a move by the executive to apply a more rigorous standard of proof.\n \n The executive faces more than 1,000 similar claims for damages from prisoners and former inmates. More than 310 actions have already been raised in the Court of Session and sheriff courts in Scotland. An executive spokesman said: \"We will study this judgement in detail. Much has changed to address the issues raised in the Napier case, for example, slopping out has ended at Barlinnie and work in other prisons is being accelerated. \"Today's judgement does not affect the outcome of other cases.\" Napier, a remand prisoner at the time, raised a legal challenge in 2001 under the European Convention on Human Rights, in which he sought £5,000. He was awarded compensation last April after winning his case.\n \n Executive ministers raised an appeal arguing that the standard of proof to be applied in cases alleging a breach of the European Convention on Human Rights through degrading and inhumane treatment should \"be beyond reasonable doubt\". This is the standard normally applied in criminal trials in Scotland. However, civil litigation is settled on the test of \"a balance of probabilities\". Judge Lord Cullen, sitting with Lord Osborne and Lord Hamilton, ruled that alleged human rights breaches involving degrading treatment should be dealt with on the normal civil standard. Napier's lawyer Tony Kelly believes the action will soon be followed by others. Mr Kelly said: \"There are hundreds of people still undergoing slopping out, overcrowding and poor regime and those people will certainly be heartened by today's judgement.\" Scottish National Party Justice Minister Kenny MacAskill said that the slopping out case had been \"a fiasco from start to finish\". He said: \"Ministers were fully aware of the state of Scotland's jails. Funds were available but they chose to ignore the problem and after this ruling I suspect we will be faced with even more claims and no doubt more payouts. \"A short term executive saving has resulted in a long term public cost.\"\n", "llama3.2:1b": ["Scottish Executive loses appeal against inmate compensation for being forced to slop out in prison, Court of Session rules that standard of proof is settled on civil test (balance of probabilities).", "Napier, 25, won £2,450 after claiming he suffered skin complaints from using a bucket as toilet at Barlinnie Prison.", "Over 1,000 similar claims and 310 actions are being raised in the Court of Session and sheriff courts in Scotland."], "llama3.2:3b": ["Scottish Executive loses appeal against inmate Robert Napier, who was awarded £2,450 for suffering from eczema caused by being forced to slop out in prison; more than 1,000 similar claims are expected."], "gemma2:2b": ["The Scottish Executive lost an appeal regarding Robert Napier's compensation for suffering eczema from slopping out in prison.", "He won £2,450 after claiming the practice breached his human rights.", "The court upheld a more rigorous standard of proof for claims alleging breaches of the European Convention on Human Rights, meaning cases will now proceed as expected in civil litigation.", "The ruling is seen as positive by those who have faced similar treatment and could lead to more lawsuits."], "qwen2.5:0.5b": ["Executives lost an appeal against a slooping out case.", "The executive faces more than 1,000 similar claims for damages from prisoners and former inmates.", "A remand prisoner at Barlinnie Prison won £2,450 after he claimed the practice breached his human rights.", "An executive spokesman said civil litigation is settled on \"a balance of probabilities.\""], "qwen2.5:1.5b": ["The Scottish Executive has lost an appeal against compensation for inmates forced to slop out at Barlinnie Prison, leading hundreds of similar cases to face the same civil standard of proof as criminal trials.", "The court ruled that alleged human rights breaches involving degrading treatment should be settled on the balance of probabilities rather than beyond reasonable doubt."], "qwen2.5:3b": ["The Scottish Executive lost an appeal against an inmate's compensation for being forced to slop out in prison, where inmates use buckets as toilets.", "Robert Napier won £2,450 after claiming he suffered eczema from the practice, which breached his human rights under the European Convention on Human Rights.", "The executive faces over 1,000 similar claims.", "A judge ruled that civil litigation regarding alleged human rights breaches should be settled on a \"balance of probabilities,\" not beyond reasonable doubt as in criminal trials.", "This judgement may lead to more compensation claims from other prisoners and former inmates undergoing the same conditions.", "Scottish National Party Justice Minister Kenny MacAskill criticized the slopping out system, stating it had been an ongoing problem for many years and that ignoring it resulted in future costs."], "opencoder:1.5b": ["The Scottish Executive lost an appeal against Robert Napier's compensation for slopping out in Barlinnie Prison.", "An appeals judge ruled that the standard of proof needed to be reviewed, considering degrading and inhumane treatment.", "The Supreme Court in its attempt to review this case has now upheld it, as it was set by a balance of probabilities.", "Today, the amount paid is above the sum allocated for compensation, which was previously announced.", "It's also important to note that the amount of compensation has increased due to the rise of other similar cases involving degrading treatment and overcrowding in other prisons."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details while omitting non-essential information.", "The main points are:\n\n1.", "Ministers lose slopping out case: The Scottish Executive loses an appeal against an inmate's compensation for being forced to slop out in prison.", "2.", "Armed robber wins £2,450: A 25-year-old man named Robert Napier won £2,450 after he claimed he suffered an outbreak of eczema when slopping out at Barlinnie Prison.", "3.", "More than 1,000 similar claims: The Court of Session has already been appealed by more than 1,000 other cases involving alleged human rights breaches through degrading and inhumane treatment.", "4.", "Executive faces more than 1,000 similar cases: The executive faces more than 1,000 similar cases involving alleged human rights breaches through degrading and inhumane treatment.", "5.", "Study this judgement in detail: The executive will study the judgement in detail to understand its implications for future cases.", "6.", "Much has changed since Napier's case: The executive faces a new set of challenges as it tries to address the issues raised in Napier's case, including slopping out and overcrowding in prisons.", "7.", "Appeal against slopping out standard: The executive is appealing against the standard of proof used in cases alleging human rights breaches through degrading and inhumane treatment.", "8.", "Judge rules for Napier: A judge ruled that alleged human rights breaches involving degrading and inhumane treatment should be dealt with on the normal civil standard.", "9.", "Slopping out case was a fiasco from start to finish: The slopping out case was widely criticized by campaigners, who said it was a \"fiasco\" from the start.", "10.", "Short-term saving leads to long-term cost: The short-term savings made in slopping out cases were likely to be offset by the long-term costs of dealing with the underlying issues and providing better care for prisoners."], "deepseek-r1:1.5b": ["The Scottish Executive has lost an appeal for Robert Napier's compensation for being forced to slop out in prison.", "Napier won £2,450 after claiming he suffered skin and eczema complaints during his escape.", "The executive faces more than 1,000 similar claims from prisoners and others, with court actions ongoing.", "A judge ruled that human rights breaches should be handled under the normal civil standard of proof, while Napier's case is pending but now being heard again."], "tinyllama:1.1b": ["As per an article published in the Scottish Express, the Scottish Executive has lost their appeal against an inmate's compensation for slopping out in prison.", "The court ruling means that alleged human rights breaches involving degrading treatment should be dealt with on the standard of proof used in civil litigation in Scotland.", "This decision could have significant implications for thousands of other prisoners and former inmates who have been seeking justice for their injuries suffered while being forced to use bucket-like toilets in prison cells.", "The appeal had raised a legal challenge under the European Convention on Human Rights, but this ruling means that claims can proceed now under the higher standard set by civil litigation.", "This decision is expected to result in more payments for injured prisoners and will likely be challenged again as more cases are raised."], "tinydolphin:1.1b": [" The Ministry of Justice announced it would not apply a higher standard of proof in its cases regarding slopping out at Barlinnie Prison, after the Court of Session threw out an attempt to apply a more rigorous standard.", "In a statement, a ministry spokesperson emphasized that they will study the judgement carefully and look into implementing changes as necessary.", "Napier's lawyer has stated that the decision is expected to have a significant impact on many other similar claims.", "The spokesman said that the Scottish government recognizes that these cases are serious and will be resolved in accordance with the law, regardless of whether they are resolved through civil or criminal litigation."], "phi:2.7b": [" Scottish Executive lost an appeal over compensation for a prisoner who claimed he suffered from eczema as a result of being forced to slop out at prison, and the court ruled that this should be dealt with on the \"balance of probabilities\" standard rather than beyond reasonable doubt.", "The executive has faced more than 1,000 similar claims."], "orca-mini:3b": [" Ministers lost an appeal against compensation for an inmate's claim of being forced to slop out in prison.", "The court ruled that the standard of proof to be applied in cases alleging a breach of human rights through degrading treatment should be dealt with on the normal civil standard, not the higher test of \"beyond reasonable doubt\" used in criminal trials in Scotland.", "Overcrowding and poor regimes are still issues in Scottish jails."], "hermes3:3b": ["Ministers lose appeal over inmate compensation for slopping out in prison, where prisoner used buckets as toilets, violating human rights; over 1000 similar claims expected."], "stablelm-zephyr:3b": ["The Scottish Executive lost an appeal against an inmate's compensation claim for being forced to slopping out in prison.", "Robert Napier, an armed robber, claimed he suffered skin complaints due to this practice and won £2,450.", "The Court of Session threw out the executive's attempt to apply a stricter standard of proof.", "This case is among over 1,000 similar claims seeking damages from prisoners and former inmates in Scotland.", "An executive spokesman stated that the judgement would be studied and addressed in other cases, but also mentioned changes made to address issues like ending slopping at Barlinnie prison and accelerating work in others.", "Napier's lawyer expects more claims to follow.", "Scottish National Party Justice Minister Kenny MacAskill criticized the initial handling of the case, stating it was a \"fiasco\" and suggesting that future claims will result in increased costs for the public."], "chatgpt-4o-latest": ["The Scottish Executive lost an appeal against compensating inmate Robert Napier, who was awarded £2,450 after claiming that slopping out at Barlinnie Prison caused his eczema and violated his human rights.", "The Court of Session rejected the executive's attempt to impose a stricter standard of proof.", "Over 1,000 similar claims are pending, with more than 310 already filed.", "The executive stated that slopping out at Barlinnie has ended and improvements are ongoing in other prisons.", "The court ruled that human rights breaches should be judged on the civil standard of \"balance of probabilities\" rather than the criminal standard of \"beyond reasonable doubt.\"", "Napier's lawyer expects more claims to follow.", "SNP Justice Minister Kenny MacAskill criticized the executive for ignoring prison conditions, leading to costly legal consequences."], "stablelm2:1.6b": ["Scottish ministers lose case over inmate slopping out in prison, as armed robber Robert Napier wins £2k compensation for forced toilet usage in Barlinnie Prison.", "The Court of Session overturned the executive's attempt to apply a more rigorous standard of proof, with the executive facing over 1,0..\nOf similar claims from prisoners and former inmates for damages.", "More than 1,000 actions have already been raised in Scottish courts.", "The executive will study this judgement, noting changes made to address issues raised by Napier's case."], "granite3.1-dense:2b": ["The Scottish Executive lost an appeal regarding compensation for prisoners who suffered from skin conditions while using buckets as toilets, known as slopping out.", "Robert Napier, a 25-year-old armed robber, won £2,450 after claiming his eczema was exacerbated by this practice at Barlinnie Prison, violating his human rights.", "The Court of Session upheld the earlier ruling that settled Napier's case, applying the lower civil standard of \"balance of probabilities\" rather than the higher \"beyond reasonable doubt\" standard usually required in criminal trials.", "This decision affects over 1,000 similar claims from prisoners and former inmates.", "The executive has already faced more than 310 such cases in Scottish courts.", "Napier's lawyer predicts this judgment will encourage additional claims.", "Scottish Justice Minister Kenny MacAskill described the slopping out issue as a \"fiasco,\" citing that ministers had known about the poor prison conditions but chose to neglect them, expecting the ruling would lead to more payouts and increased public costs."]}