{"raw_text": "Plaid MP's cottage arson claim\n \n A Plaid Cymru MP believes UK security services were involved in some arson attacks blamed on Welsh extremists.\n \n It is 25 years since the start of 12 years of fire-bombings, attributed to a shadowy group known as Meibion Glyndwr. Plaid Cymru's Elfyn Llwyd has suggested the security services could have been involved, with the intention of discrediting the nationalist vote. Ex-Welsh Office Minister Lord Roberts of Conwy denied security services were involved. In March this year, North Wales Police reopened the case, saying materials kept during their investigations would be examined to find whether it would yield DNA evidence.\n \n Meibion Glyndwr - which means \"sons of Glyndwr\" - began burning property in December 1979 in protest at homes in rural Wales being sold as holiday cottages to people from England. The group was linked to most of the 220 or so fire-bombing incidents stretching from the Llyn Peninsula to Pembrokeshire. The campaign continued until the early 1990s. Police were accused in some quarters of targeting anyone who was a nationalist. Although one man, Sion Aubrey Roberts, was convicted in 1993 of sending letter bombs in the post, the arson cases remain unsolved.\n \n As a solicitor, Elfyn Llwyd represented Welsh singer Bryn F&#244;n when he was arrested on suspicion of being involved in the arson campaign. F&#244;n was released without charge . But now, as MP for Merionnydd Nant Conwy and Plaid Cymru's Parliamentary Leader, Mr Llwyd has argued that some of the terror attacks may have had the involvement of the security services and not Meibion Glyndwr. He believes that elements of the British security services may have carried out renegade actions in order to discredit Plaid Cymru and the nationalist vote ahead of elections. The claim is made in an interview for BBC Wales' Maniffesto programme to be shown on S4C on Sunday.\n \n Mr Llwyd said that the sophistication of many of the devices used in the attacks compared to the crude nature of many others, suggests a degree of professionalism which could only have come from individuals who knew exactly what they were doing. He said: \"What I'm saying is that the role that they took wasn't the appropriate one, i.e. like an\n \n agent provocateur\n \n and perhaps interfering and creating a situation where it looked like it was the nationalists that were responsible.\" The programme also heard from Lord Roberts of Conwy, who was a Welsh Office minister at the time. He denied that the security services played any improper role. Mr Llwyd's theory has also been questioned by Plaid Cymru's former President, Dafydd Wigley. He accepted that the fires damaged Plaid Cymru's public image but believed that the security services had their hands full at the time with the IRA and animal rights activists.\n \n \n  - Maniffesto can be seen on S4C on Sunday, 12 December, at 1200 GMT.\n", "llama3.2:1b": ["Plaid MP Elfyn Llwyd suggests UK security services were involved in arson attacks blamed on Welsh extremists.", "Security services deny involvement but materials kept by police may lead to DNA evidence being found.", "Meibion Glyndwr was linked to the fire-bombing incidents from 1979 to early 1990s, sparking accusations of targeting nationalists.", "Llwyd represents a singer convicted of sending letter bombs and believes security services may have carried out renegade actions to discredit Plaid Cymru."], "llama3.2:3b": ["Elfyn Llwyd, Plaid Cymru MP, suggests UK security services may have been involved in some arson attacks attributed to Welsh extremists, Meibion Glyndwr, as part of a discrediting campaign ahead of elections.", "He points to the sophistication of devices used and argues that elements of the British security services carried out renegade actions to discredit Plaid Cymru and nationalist vote."], "gemma2:2b": ["Elfyn Llwyd, Plaid Cymru MP, alleges UK security services might have been involved in arson attacks attributed to nationalist group Meibion Glyndwr.", "He believes the British security services may have acted as agents provocateur to discredit the nationalist vote and suggests their actions were more sophisticated than those of the group themselves.", "Llwyd's claim is contested by Lord Roberts of Conwy, who denies any involvement and Dafydd Wigley, Plaid Cymru's former president, who believes that the security services were occupied with other threats like the IRA and animal rights activists."], "qwen2.5:0.5b": ["Plaid MP Elfyn Llwyd argues that some of the arson attacks in Wales may have been carried out by British security services to discredit Plaid Cymru and the nationalist vote ahead of elections."], "qwen2.5:1.5b": ["An MP for Plaid Cymru claims security services were involved in some arson attacks blamed on Welsh extremists, suggesting they targeted nationalists ahead of elections to discredit the party and vote.", "The claim is being investigated by North Wales Police, but Lord Roberts denies involvement and Plaid Cymru's former President questions its validity."], "qwen2.5:3b": ["A Plaid Cymru MP claims UK security services were involved in arson attacks blamed on Welsh nationalist group Meibion Glyndwr in the early 1980s.", "Elfyn Llwyd suggests security services may have used the attacks to discredit the party, with some devices suggesting professional involvement beyond what nationalists would typically use.", "Lord Roberts denies any improper role of security services and former Plaid Cymru leader Dafydd Wigley questions whether security services had time for such activities given other issues at hand.", "North Wales Police recently reopened the case to examine old evidence for DNA matches."], "opencoder:1.5b": ["A summary of the provided text is:\n\nPlaid Cymru believes that UK security services were involved in some arson attacks from a shadowy group known as Meibion Glyndwr.", "The claim is made in an interview for BBC Wales' Maniffesto programme to be shown on S4C on Sunday."], "smollm:1.7b": ["The summary is concise and to the point, preserving key ideas and details from the original text.", "The main points are:\n\n1.", "Plaid Cymru MP Elfyn Llwyd believes that some arson attacks were carried out by security services rather than Meibion Glyndwr.", "2.", "He argues that this could have been done to discredit Plaid Cymru and the nationalist vote ahead of elections.", "3.", "The claim is made in an interview for BBC Wales' Maniffesto programme on S4C on Sunday, 12 December, at 1200 GMT."], "deepseek-r1:1.5b": ["A Plaid Cymru MP suggests the security services were involved in some arson claims linked to Welsh extremists, Meibion Glyndwr.", "25 years ago, Meibion Glyndwr was linked to the first 12 years of fire-bombings.", "Lord Roberts denied involvement but supported Mr. Elfyn Llwyd's claim that security services could have been involved, targeting nationalist groups ahead of elections.", "Elfyn Llwyd argued sophisticated devices hinted at appropriate roles, while Plaid Cymru's President Dafydd Wigley questioned the claim, acknowledging fires damaged Plaid's image but noting security services were busy with IRA and animal rights groups.", "The case was reopened in March with police examining materials for DNA evidence.", "Mr. Llwyd argued that Meibion Glyndwr wasn't responsible but instead had security involvement targeting nationalist groups.", "The Maniffesto will air on S4C on Dec 12, 2023."], "tinyllama:1.1b": ["As a solicitor, Elfyn Llwyd represents Welsh singer Bryn F&#244;n when he is arrested on suspicion of being involved in arson campaigns.", "In an interview for BBC Wales' Maniffesto program to be shown on S4C on Sunday, Llwyd suggests that some of the terror attacks may have had the involvement of British security services and not Meibion Glyndwr, a shadowy group known as the \"extremists.\"", "He argues that the actions of some of the devices used in these incidents could suggest a professional expertise that came from individuals who knew exactly what they were doing.", "Llwyd's theory has been questioned by Plaid Cymru former President, Dafoyd Wigley, who believes that the security services had their hands full at the time with other issues like the IRA and animal rights activists.", "The program can be seen on S4C on Sunday, December 12, at 1200 GMT."], "tinydolphin:1.1b": [" In summary, Plaid MP Elfyn Llwyd claims that UK security services were involved in some arson attacks blamed on Welsh extremists.", "He suggests that the security services may have targeted nationalist voters to weaken their support before elections.", "The claim is made in a BBC Wales Manifesto programme, which will be broadcast on S4C on December 12th at 1200 GMT."], "phi:2.7b": [" The Plaid Cymru MP Elfyn Llwyd believes that UK security services were involved in some arson attacks blamed on Welsh extremists.", "He suggests that the attacks were part of a campaign to discredit the nationalist vote ahead of elections.", "However, Lord Roberts of Conwy denied any involvement by the security services.", "In March this year, North Wales Police reopened the case and said they would examine materials from previous investigations for DNA evidence.", "The arson attacks began in December 1979 and continued until the early 1990s.", "Many of the devices used were sophisticated, leading to speculation that individuals involved had knowledge about their actions.", "However, Lord Roberts denies any improper involvement by the security services."], "orca-mini:3b": [" The Plaid Cymru MP Elfyn Llwyd suggests that the UK security services may have been involved in some arson attacks blamed on Welsh extremists, and that their role was not appropriate.", "He claims that the sophistication of many of the devices used in the attacks compared to the crude nature of many others, suggesting a degree of professionalism which could only come from individuals who knew exactly what they were doing.", "Lord Roberts of Conwy denies this claim, while Dafydd Wigley accepts that the fires damaged Plaid Cymru's public image but believes that the security services had their hands full at the time with the IRA and animal rights activists."], "hermes3:3b": ["Plaid Cymru MP claims UK security services might have been involved in arson attacks blamed on Welsh extremists group Meibion Glyndwr."], "stablelm-zephyr:3b": ["A Plaid Cymru MP, Elfyn Llwyd, has suggested that UK security services may have been involved in arson attacks blamed on Welsh extremists, Meibion Glyndwr, 25 years ago.", "Llwyd believes the intention was to discredit the nationalist vote ahead of elections.", "However, ex-Welsh Office Minister Lord Roberts of Conwy denied security services' involvement.", "In March, North Wales Police reopened the case and are examining materials from their investigations for potential DNA evidence.", "The arson attacks began in 1979 as a protest against rural Welsh homes being sold as holiday cottages to English people.", "One man was convicted for sending letter bombs, but the unsolved arson cases remain a subject of debate between Llwyd and Lord Roberts."], "chatgpt-4o-latest": ["Plaid Cymru MP Elfyn Llwyd claims that UK security services may have been involved in arson attacks attributed to Welsh nationalist group Meibion Glyndwr to discredit the nationalist vote.", "The fire-bombings, which targeted holiday homes in Wales from 1979 to the early 1990s, remain largely unsolved.", "While one man was convicted of sending letter bombs, no one was convicted for the arson attacks.", "Llwyd argues that the sophistication of some devices suggests professional involvement beyond Meibion Glyndwr.", "Former Welsh Office Minister Lord Roberts of Conwy and Plaid Cymru's former President Dafydd Wigley dismissed the theory, with Wigley suggesting security services were preoccupied with other threats.", "North Wales Police have reopened the case to examine potential DNA evidence."], "stablelm2:1.6b": ["Plaid Cymru MP Elfyn Llwyd suggests UK security services could have been involved in arson attacks attributed to Welsh extremists, possibly discrediting nationalist vote ahead of elections.", "North Wales Police are examining evidence from previous investigations.", "Some suspects were accused of targeting nationalists, but a convicted letter bomber remains unresolved.", "Llwyd's theory is questioned by ex-president Dafydd Wigley and security services denied involvement.", "The case may have been handled like an agent provocateur to create confusion."], "granite3.1-dense:2b": ["Plaid Cymru MP Elfyn Llwyd suggests UK security services may have been involved in arson attacks attributed to the Welsh extremist group Meibion Glyndwr (Sons of Glyndwr) during a 12-year campaign from 1979 to the early 1990s.", "The group burned property in rural Wales as protest against English homebuyers turning local areas into holiday cottels.", "Llwyd, who once represented Bryn Fôn, an accused arsonist, argues that the sophistication of some devices indicates professional involvement, possibly from agents provocateurs aiming to discredit Plaid Cymru and undermine the nationalist vote ahead of elections.", "This theory is countered by Lord Roberts of Conwy, a former Welsh Office minister, who denies any improper security service role.", "Plaid Cymru's former President, Dafydd Wigley, also dismisses the claim, citing the security services' prior focus on the IRA and animal rights activists.", "North Wales Police have reopened the case to examine potential DNA evidence from unsolved materials gathered during earlier investigations.", "The interview with Llwyd will air on BBC Wales' Maniffesto programme, scheduled for Sunday, December 12, at 1200 GMT."]}