{"raw_text": "Former NI minister Scott dies\n \n Former Northern Ireland minister Sir Nicholas Scott has died at a London hospice, his family has announced.\n \n The former Conservative MP for Kensington and Chelsea, died after a long illness diagnosed as Alzheimer's. The 71-year-old served in Northern Ireland from 1981 to 1987 during the premiership of Margaret Thatcher. As a Northern Ireland minister he dealt with education and later security where he rode out the mass IRA escape from the Maze in 1983.\n \n In education, he encountered criticism over school closures and the future of the Catholic training colleges. He also merged the New University of Ulster and the Ulster Polytechnic to create the University of Ulster. Sir Nicholas was a strong defender of the Anglo-Irish Agreement and was held in esteem in Dublin government and SDLP circles. But he experienced hostility from unionists some of whom dubbed him \"Minister of Discord\". After leaving Northern Ireland in a reshuffle, he became a UK disability minister. Sir Nicholas was replaced as the member for Kensington and Chelsea by the flamboyant Alan Clark, after being deselected by his constituency in December 1996. His deselection followed a series of scandals including being found slumped in the street by police during the Tory Party conference in Bournemouth and taken back to his hotel.\n \n Sir Nicholas claimed strong painkillers he was taking for a back problem had reacted badly with a small amount of alcohol. After his sacking, he bitterly said that despite the support of Cabinet ministers and Tory backbenchers, the Eurosceptics in his constituency were \"absolutely determined to get rid of me\". His colourful career also included a very public disagreement with daughter Victoria over civil rights for the disabled. Sir Nicholas admitted he misled MPs when he denied his department had been involved in wrecking tactics designed to kill the Disability Bill in 1994. Victoria, a lobbyist for disabled rights, denounced her father's actions and heaped insult on injury when she joined the calls for him to resign. He joined the backbenches two months later.\n", "llama3.2:1b": ["Former Northern Ireland minister Sir Nicholas Scott died at a London hospice after a long illness diagnosed as Alzheimer's at 71 years old.", "He was a Conservative MP for Kensington and Chelsea from 1981-87, serving in Northern Ireland during Margaret Thatcher's premiership.", "Scott clashed with unionists due to criticisms of school closures and the Catholic training colleges' future, earning him hostility from some."], "llama3.2:3b": ["Sir Nicholas Scott, former Northern Ireland minister and Conservative MP, died at a London hospice due to complications from Alzheimer's disease aged 71.", "He served as education minister and security minister in Northern Ireland during Margaret Thatcher's premiership and was replaced after a series of scandals."], "gemma2:2b": ["Sir Nicholas Scott, former Northern Ireland minister who served under Margaret Thatcher, died of Alzheimer's disease at age 71.", "He was known for his role in education and security during a tumultuous time in Northern Ireland.", "After leaving Northern Ireland he became a UK disability minister and faced criticism from unionists before becoming a backbencher after being deselected from his constituency due to scandals.", "His career included a public disagreement with his daughter about disability rights."], "qwen2.5:0.5b": ["Sir Nicholas Scott, a former Conservative MP from Kensington and Chelsea who served in Northern Ireland during Margaret Thatcher's premiership, died at his London hospice.", "He was 71 years old.", "Scott suffered from Alzheimer's disease after a long illness diagnosed as Alzheimer's.", "Scott had been the Minister for Education (Education) of Northern Ireland under Margaret Thatcher's administration.", "In education, he dealt with issues such as school closures and the future of Catholic training colleges.", "He also merged the New University of Ulster and the Ulster Polytechnic to form the University of Ulster.", "Scott was a strong defender of the Anglo-Irish Agreement, held in esteem by Dublin government and SDLP circles but faced hostility from unionists who dubbed him \"Minister of Discord\".", "He resigned as Minister for Education after leaving Northern Ireland with the reshuffle.", "Scott claimed that he had taken painkillers prescribed for back problems, which were supposed to be bad with a small amount of alcohol.", "After his sacking, he said he experienced great bitterness about being dumped by Cabinet ministers and Tory backbenchers.", "He also had a public disagreement with Victoria Clark over civil rights for the disabled.", "His career included disagreements with her daughter and the UK disability minister.", "Scott joined the Back Benches two months later."], "qwen2.5:1.5b": ["Former Northern Ireland Minister Sir Nicholas Scott died at age 71 after Alzheimer's disease; served under Margaret Thatcher in 1981-1987, dealt with education and security issues, merged universities, supported Anglo-Irish Agreement, criticized school closures and Catholic training colleges, faced hostility from unionists, resigned to become UK disability minister, had scandalous relationship with his daughter over civil rights for the disabled."], "qwen2.5:3b": ["Former Northern Ireland minister Sir Nicholas Scott died at age 71 after a long illness diagnosed as Alzheimer's.", "He served from 1981 to 1987 under Margaret Thatcher, focusing on education and security, including handling the IRA escape in 1983.", "Known for his support of the Anglo-Irish Agreement, he was disliked by some unionists and referred to as \"Minister of Discord.\"", "After leaving Northern Ireland, he became a UK disability minister.", "He faced controversies within his constituency, including scandals involving alcohol use during a political conference.", "His daughter Victoria criticized him publicly, leading to his joining the backbenches in 1996."], "opencoder:1.5b": ["Former NI minister Scott dies.", "Former Northern Ireland minister Sir Nicholas Scott has died at a London hospice, his family has announced.", "The former Conservative MP for Kensington and Chelsea, died after a long illness diagnosed as Alzheimer's.", "The 71-year-old served in Northern Ireland from 1981 to 1987 during the premiership of Margaret Thatcher.", "As a Northern Ireland minister he dealt with education and later security where he rode out the mass IRA escape from the Maze in 1983.", "In education, he encountered criticism over school closures and the future of the Catholic training colleges.", "He also merged the New University of Ulster and the Ulster Polytechnic to create the University of Ulster.", "Sir Nicholas was a strong defender of the Anglo-Irish Agreement and was held in esteem in Dublin government and SDLP circles.", "But he experienced hostility from unionists some of whom dubbed him \"Minister of Discord\".", "After leaving Northern Ireland in a reshuffle, he became a UK disability minister.", "Sir Nicholas was replaced as the member for Kensington and Chelsea by the flamboyant Alan Clark, after being deselected by his constituency in December 1996.", "His deselection followed a series of scandals including being found slumped in the street by police during the Tory Party conference in Bournemouth and taken back to his hotel.", "Sir Nicholas claimed strong painkillers he was taking for a back problem had reacted badly with a small amount of alcohol.", "After his sacking, he bitterly said that despite the support of Cabinet ministers and Tory backbenchers, the Eurosceptics in his constituency were \"absolutely determined to get rid of me\".", "His colourful career also included a very public disagreement with daughter Victoria over civil rights for the disabled.", "Sir Nicholas admitted he misled MPs when he denied his department had been involved in wrecking tactics designed to kill the Disability Bill in 1994.", "Victoria, a lobbyist for disabled rights, denounced her father's actions and heaped insult on injury when she joined the calls for him to resign.", "He joined the backbenches two months later."], "smollm:1.7b": ["Former Northern Ireland minister Sir Nicholas Scott has died at a London hospice after a long illness diagnosed as Alzheimer's disease.", "The 71-year-old served in Northern Ireland from 1981 to 1987 during the premiership of Margaret Thatcher.", "As a Northern Ireland minister he dealt with education and later security where he rode out the mass IRA escape from the Maze in 1983.", "In education, Sir Nicholas encountered criticism over school closures and the future of the Catholic training colleges.", "He also merged the New University of Ulster and the Ulster Polytechnic to create the University of Ulster.", "Sir Nicholas was a strong defender of the Anglo-Irish Agreement and was held in esteem in Dublin government and SDLP circles.", "But he experienced hostility from unionists some of whom dubbed him \"Minister of Discord\".", "After leaving Northern Ireland in a reshuffle, he became a UK disability minister.", "Sir Nicholas claimed strong painkillers he was taking for a back problem had reacted badly with a small amount of alcohol.", "After his sacking, he bitterly said that despite the support of Cabinet ministers and Tory backbenchers, the Eurosceptics in his constituency were \"absolutely determined to get rid of me\".", "His colourful career also included a very public disagreement with daughter Victoria over civil rights for the disabled.", "Sir Nicholas admitted he misled MPs when he denied his department had been involved in wrecking tactics designed to kill the Disability Bill in 1994.", "Victoria, a lobbyist for disabled rights, denounced her father's actions and sheaped insult on injury when she joined the calls for him to resign.", "She joined the backbenches two months later."], "deepseek-r1:1.5b": ["Sir Nicholas Scott, a former Northern Ireland minister who served as a Conservative MP from Kensington and Chelsea, passed away at a London hospice after an illness diagnosed as Alzheimer's.", "He was in office during Margaret Thatcher's Premises of 1981-1987 while dealing with the IRA escape from the Maze in 1983.", "Sir Nicholas claimed to take strong painkillers but faced an unexpected reaction when he consumed a small amount of alcohol.", "His career led him to become a UK disability minister, replacing Alan Clark after being deselected by his constituency in December 1996.", "Sir Nicholas faced some scandals, including being found slumped in the street during a Tory Party conference, which prompted his return.", "He also had a public disagreement with Victoria, his daughter, over civil rights for disabled individuals."], "tinyllama:1.1b": ["Former Northern Ireland minister Sir Nicholas Scott passed away at a London hospice, his family announced.", "Before being appointed as the member for Kensington and Chelsea in the 1996 general election, Sir Nicholas served in Northern Ireland from 1981 to 1987 during the premiership of Margaret Thatcher.", "During his time in office, he dealt with education, healthcare, and security where he encountered criticism over school closures and the future of the Catholic Training College.", "Despite receiving praise from unionists after being replaced as the member for Kensington and Chelsea by Alan Clark in 1996, his reshuffle was criticized, including his alleged use of painkillers.", "Sir Nicholas's colorful career also included a public disagreement with his daughter over civil rights for the disabled, as well as an admission that he misled MPs about civil rights being involved in wrrecting tactics to kill the Disability Bill."], "tinydolphin:1.1b": [" Former Northern Ireland minister Sir Nicholas Scott has died at a London hospice, his family announced.", "The former Conservative MP for Kensington and Chelsea, who served in Northern Ireland from 1981 to 1987 during the premiership of Margaret Thatcher, dealt with education and later security, where he rode out the mass IRA escape from the Maze in 1983.", "In education, he encountered criticism over school closures and the future of the Catholic training colleges.", "He also merged the New University of Ulster and the Ulster Polytechnic to create the University of Ulster.", "Sir Nicholas was a strong defender of the Anglo-Irish Agreement and was held in esteem in Dublin government and SDLP circles.", "But he experienced hostility from unionists some of whom dubbed him \"Minister of Discord\".", "After leaving Northern Ireland, Sir Nicholas was UK disability minister."], "phi:2.7b": [" Former Northern Ireland Minister Sir Nicholas Scott died at a hospice in London after battling Alzheimer's disease.", "He served as a Conservative MP from 1981 to 1999, dealing with education and security issues during Margaret Thatcher's premiership.", "He faced criticism over school closures and was involved in the Anglo-Irish Agreement.", "After leaving Northern Ireland, he became a UK disability minister but was eventually deselected by his constituency due to scandals.", "He claimed strong painkillers caused him to have an alcohol reaction.", "Victoria, his daughter who was a disabled rights activist, criticized her father for misleading MPs over the fate of the Disability Bill in"], "orca-mini:3b": [" Nicholas Scott, the former Northern Ireland minister under Margaret Thatcher, died in a London hospice after a long illness diagnosed as Alzheimer's.", "He dealt with education and security during his tenure in Northern Ireland and was held in esteem by Dublin government and SDLP circles.", "However, he faced criticism over school closures and the future of Catholic training colleges and merged the New University of Ulster and the Ulster Polytechnic to create the University of Ulster.", "Sir Nicholas was reshuffed from his post as the member for Kensington and Chelsea after being found slumped in the street by police during the Tory Party conference in Bournemouth and taken back to his hotel.", "He was replaced by Alan Clark, who faced a series of scandals including being found slumped in the street by police during the Tory Party conference in Bournemouth and taken back to his hotel."], "hermes3:3b": ["Former Northern Ireland minister Sir Nicholas Scott died, 71, after long illness (Alzheimers).", "Served as education minister (1981-87) during Thatcher's govt, then UK disability minister.", "Known for merging New University of Ulster and Ulster Polytechnic to create University of Ulster, defending Anglo-Irish Agreement, but faced criticism and unionist hostility."], "stablelm-zephyr:3b": ["Former Northern Ireland minister Sir Nicholas Scott has passed away at a London hospice after a long illness diagnosed as Alzheimer's.", "The 71-year-old served in Northern Ireland from 1981 to 1987 during Margaret Thatcher's premiership, dealing with education and security issues.", "He faced criticism over school closures and the future of Catholic training colleges, merging the New University of Ulster and the Ulster Polytechnic to create the University of Ulster.", "After leaving Northern Ireland, he became a UK disability minister and faced hostility from unionists.", "Sir Nicholas claimed his painkillers reacting badly with alcohol had misled him in denying his department's involvement in wrecking tactics to kill the Disability Bill in 1994."], "chatgpt-4o-latest": ["Former Northern Ireland minister Sir Nicholas Scott has died at 71 in a London hospice after a long battle with Alzheimer's.", "A former Conservative MP for Kensington and Chelsea, he served as a Northern Ireland minister from 1981 to 1987 under Margaret Thatcher, handling education and later security, including the 1983 IRA escape from the Maze.", "He faced criticism over school closures and Catholic training colleges but played a key role in merging institutions to form the University of Ulster.", "A strong defender of the Anglo-Irish Agreement, he was respected in Dublin and SDLP circles but faced hostility from unionists.", "After leaving Northern Ireland, he became a UK disability minister but was deselected in 1996 following scandals, including being found slumped in the street during a Tory conference.", "He blamed painkillers and alcohol for the incident and accused Eurosceptics of ousting him.", "His career also included a public dispute with his daughter Victoria over disability rights, and he admitted misleading MPs about efforts to block the Disability Bill in 1994.", "He resigned to the backbenches two months later."], "stablelm2:1.6b": ["Former Northern Ireland minister Sir Nicholas Scott has passed away at a London hospice due to Alzheimer's disease after serving in the region from 1975-1983 under Margaret Thatcher's premiership.", "He held positions such as Conservative MP for Kensington and Chelsea, dealing with education and security issues involving the IRA.", "His career also included a disagreement with daughter Victoria over civil rights for disabled individuals, admitting to misleading MPs regarding his department's involvement in tactics to kill the Disability Bill in 1984."], "granite3.1-dense:2b": ["Former Northern Ireland Minister Sir Nicholas Scott, a Conservative MP for Kensington and Chelsea, died at 71 after battling Alzheimer's disease.", "He served in Northern Ireland from 1981 to 1987 under Margaret Thatcher, handling education and security matters.", "In education, he faced criticism over school closures and the future of Catholic training colleges but successfully merged the New University of Ulster and Ulster Polytechnic into the University of Ulster.", "Sir Nicholas was a proponent of the Anglo-Irish Agreement, respected in Dublin and SDLP circles, yet faced hostility from some unionists who dubbed him \"Minister of Discord.\"", "Post-Northern Ireland, he became UK Disability Minister.", "His political career took a downturn after being deselected by his constituency in 1996 due to scandals, including a public incident at the Tory Party conference where he was found unconscious.", "He claimed his painkillers had reacted negatively with alcohol.", "After sacking, Sir Nicholas faced severe criticism from daughter Victoria over misleading Parliament about his department's role in undermining the Disability Bill in 1994.", "This led to her joining calls for his resignation, and he joined the backbenches two months later."]}