{"raw_text": "Police probe BNP mosque leaflet\n \n Police are investigating a British National Party leaflet posted to homes in south Wales opposing plans for a new mosque.\n \n Anti-racism campaigners in Swansea have handed copies to South Wales Police. Swansea's Muslim community is raising money to open a new mosque and community centre in the former St Andrews United Reform Church. The building on George Street has been derelict since the 1980s.\n \n Taha Idris, director of the Swansea Bay Race Equality Council, said his organisation contacted police after receiving complaints from the public. \"I'm quite shocked to see this sort of leaflet by the BNP in Swansea,\" he said.\n \n \"The BNP has tried in the past to get into Swansea and this is another example of them trying again. \"I am in no doubt that the BNP are not needed and not wanted here.\" A South Wales Police spokeswoman confirmed that they were looking at the contents of the leaflet. According to the BNP's website, they have been posted to homes in the Castle ward. The BNP website carries a photograph of party leader Nick Griffin - who lives near Welshpool, mid Wales - delivering the leaflet. The BNP has denied it is trying to stir up hatred of any race or religion, but argues that they should be able to debate this without fear of arrest. Swansea Unite Against Fascism (UAF) is meeting this week to plan a campaign. Following the death earlier this year of Kalan Kawa Karim, an Iraqi Kurd living in Swansea, it organised an anti-racism march in the city that was supported by more than 1,000 people. It is planning its own mail shot campaign and may launch a petition in support of the plans for the mosque.\n \n Andy Richards, of Swansea UAF, said the leaflet was exactly what he had come to expect from the BNP.\n \n \"The people of Swansea will not put up with this.\" Swansea's Muslim community bought the former church, just across the road from the existing mosque on St Helen's Road, in the late 1990s. Mr Idris said the community was now raising money to renovate the building. \"It is a landmark building in Swansea and would otherwise just crumble,\" he said. \"It is the ideal opportunity for the building to be restored and used in the proper manner. \"It will be a Muslim community centre. It's a holistic place used for education, weddings, deaths and births.\" He said space was limited in the current mosque and on some occasions Muslims had to travel to Llanelli for cultural events.\n", "llama3.2:1b": ["The Swansea police are investigating a British National Party (BNP) leaflet posted to homes opposing plans for a new mosque in the city.", "Anti-racism campaigners have handed copies to South Wales Police, who are looking at the contents and considering possible charges against the BNP.", "The BNP website carries a photograph of party leader Nick Griffin delivering the leaflet, which the police say may be an attempt to stir up hatred.", "A meeting is planned in Swansea for anti-fascism groups to discuss plans to oppose the mosque development."], "llama3.2:3b": ["Police are investigating leaflets distributed by the BNP opposing plans for a new mosque in south Wales.", "The leaflets were posted to homes in Swansea's Castle ward.", "Anti-racism campaigners, including the Swansea Bay Race Equality Council and Swansea Unite Against Fascism, have expressed outrage over the distribution of the leaflet."], "gemma2:2b": ["The BNP distributed leaflets opposing a new mosque in Swansea, Wales.", "Anti-racism groups have complained and are investigating.", "The community has bought the former church building to be renovated as a mosque and community center.", "They will raise money to renovate the building."], "qwen2.5:0.5b": ["In recent weeks, Swansea has been under investigation after a leaflet promoting a new mosque from the British National Party was found at homes in the area.", "Anti-racism campaigners have handed copies of the leaflet to South Wales Police, who are looking into its contents.", "The BNP has argued that it is not a threat due to their efforts to build a new mosque and community center.", "Swansea's Muslim community is raising funds for the building and renovation project.", "Additionally, there are plans to hold an anti-racism march in Swansea this week."], "qwen2.5:1.5b": ["British National Party leaflet opposing new mosque posted to homes in south Wales; police investigating; Swansea Muslim community plans to build a mosque with funding from donations, calling for peaceful anti-racism campaign while BNP denies trying to stir up racial hatred."], "qwen2.5:3b": ["Police are investigating a British National Party (BNP) leaflet opposing plans for a new mosque in Swansea.", "Anti-racism campaigners handed copies to South Wales Police.", "The BNP has tried to gain a foothold in Swansea, as seen by this leaflet.", "Taha Idris, the director of Swansea Bay Race Equality Council, confirmed they contacted police after receiving complaints from the public.", "A campaign is planned against the leaflet and plans for the mosque.", "The former St Andrews United Reform Church building on George Street has been derelict since the 1980s; a mosque and community center are to be built there by Swansea's Muslim community, who have already raised money for this purpose."], "opencoder:1.5b": ["The text you provided summarizes information about a British National Party leaflet that is posted by police forces in South Wales.", "The focus here is on anti-racism campaigns, a dispute between different religious groups in the city of Swansea.", "The BNP have been trying to influence people's opinion and raise money for the creation of a new mosque.", "The building has also been derelict since the 1980s.", "The discussion between Taha Idris, director of the Swansea Bay Race Equality Council and another South Wales police official explains that the BNP are not needed or wanted in this case."], "smollm:1.7b": ["The police are investigating a British National Party (BNP) leaflet posted to homes in south Wales opposing plans for a new mosque.", "The leaflet has been handed out by anti-racism campaigners in Swansea, who have raised money to open a new mosque and community centre in the former St Andrews United Reform Church building on George Street.", "The building on George Street has been derelict since the 1980s.", "Taha Idris, director of the Swansea Bay Race Equality Council, said his organization contacted police after receiving complaints from the public.", "\"I'm quite shocked to see this sort of leaflet by the BNP in Swansea,\" he said.", "\"I am in no doubt that the BNP are not needed and not wanted here.\"", "A South Wales Police spokeswoman confirmed that they were looking at the contents of the leaflet.", "According to the BNP's website, the leaflet has been posted to homes in the Castle ward.", "The BNP website carries a photograph of party leader Nick Griffin - who lives near Welshpool, mid Wales - delivering the leaflet.", "The BNP has denied it is trying to stir up hatred of any race or religion, but argues that they should be able to debate this without fear of arrest.", "Swansea Unite Against Fascism (UAF) is meeting this week to plan a campaign.", "Following the death earlier this year of Kalan Kawa Karim, an Iraqi Kurd living in Swansea, it organised an anti-racism march in the city that was supported by more than 1,000 people.", "It is planning its own mail shot campaign and may launch a petition in support of the plans for the mosque."], "deepseek-r1:1.5b": ["Police are investigating a British National Party leaflet posted by anti-racism campaigners in Swansea against plans for a new mosque.", "Swansea's former St Andrews United Reform Church has been transformed into a new mosque and community centre, funded by the Muslim community."], "tinyllama:1.1b": ["Police are investigating a British National Party leaflet posted to homes in South Wales opposing plans for a new mosque.", "Anti-racism campaigners have handed out copies to residents, while the BNP has been accused of stirring up hatred and attempts to get into Swansea.", "Following the death of an Iraqi Kurd during a march in support of the plans, UAF members are planning their own mailshot campaign to support the mosque plan.", "The former church, just across the road from the existing mosque on St Helen's Road, is now being renovated for use as a community centre and education space.", "The Muslim community is raising funds to renovate and use the building while others have access to cultural events in Llanellli."], "tinydolphin:1.1b": [" In South Wales, an investigation has begun into whether anti-racism campaigners have received a leaflet from the British National Party (BNP).", "The leaflet opposes plans for a new mosque in Swansea and was sent to homes by the BNP.", "The leaflet carries a photograph of Nick Griffin, leader of the BNP, who lives near Welshpool, mid Wales.", "The leaflet has sparked controversy as it is the second time in as many years that the BNP has tried to enter Swansea and this time, they are again reportedly trying to stir up hatred of any race or religion."], "phi:2.7b": [" The British National Party has distributed leaflets opposing a new mosque being built in Swansea.", "Anti-racism campaigners have handed them over to the police.", "Swansea' Muslim community is raising money to build a mosque in an old church building in George Street.", "The BNP has posted leaflets in Swansea, including one of party leader Nick Griffin.", "Swansea Unite Against Fascism has planned a campaign against this kind of behaviour and may launch a petition in support of the mosque plans."], "orca-mini:3b": [" The text reports on a British National Party leaflet that has been posted to homes in south Wales opposing plans for a new mosque.", "Anti-racism campaigners in Swansea have handed copies to South Wales Police, and the BNP has tried to get into Swansea.", "The Muslim community is raising money to open a new mosque and community centre in the former St Andrews United Reform Church, which has been derelict since the 1980s.", "The text also mentions that the BNP website carried a photograph of party leader Nick Griffin delivering the leaflet, and that UAF Swansea plans a campaign following the death earlier this year of Kalan Kawa Karim, an Iraqi Kurd living in Swansea."], "hermes3:3b": ["Police investigating BNP leaflet opposing mosque in south Wales, after anti-racism campaigners reported complaints from public.", "BNP denies trying to stir up hatred."], "stablelm-zephyr:3b": ["Police are investigating a British National Party (BNP) leaflet opposing plans for a new mosque in south Wales.", "Anti-racism campaigners handed copies of the leaflet to South Wales Police after receiving complaints from the public.", "The Swansea Muslim community bought the former church to renovate and use as a community center and school, intending for it to replace a smaller mosque nearby."], "chatgpt-4o-latest": ["Police in south Wales are investigating a British National Party (BNP) leaflet opposing plans for a new mosque in Swansea.", "Anti-racism campaigners have reported the leaflet to authorities, and the Swansea Bay Race Equality Council has received public complaints.", "The BNP denies inciting hatred but insists on the right to debate the issue.", "Swansea Unite Against Fascism (UAF) is planning a campaign in response.", "The Muslim community in Swansea is raising funds to renovate a derelict former church into a mosque and community center, citing space limitations in the existing mosque."], "stablelm2:1.6b": ["Police are investigating a BNP leaflet sent to homes in south Wales that opposes plans for a new mosque.", "The Swansea Bay Race Equality Council contacted police after receiving complaints from the public, while the BNP has denied attempting to stir up hatred.", "A campaign by Swansea UAF is planned against the BNP's message.", "The Muslim community in Swansea bought the derelict church and aims to renovate it as a community center for Islamic activities."], "granite3.1-dense:2b": ["South Wales Police are investigating a British National Party (BNP) leaflet distributed in Swansea, opposing plans for a new mosque and community center at the former St Andrews United Reform Church on George Street.", "The Muslim community purchased this building in the late 1990s to renovate and transform into a holistic facility.", "Anti-racism groups, including Swansea's Race Equality Council and Unite Against Fascism (UAF), have condemned the leaflet and plan campaigns against racial prejudice.", "The BNP denies inciting hatred but asserts its right to debate without fear of arrest.", "Public response is expected to be strong, with Swansea UAF organizing a potential petition in support of the mosque project."]}