{"raw_text": "Jowell confirms casino climbdown\n \n Tessa Jowell has announced plans to limit the number of new casinos in the UK to 24, in a move branded a \"humiliating retreat\" by the Tories.\n \n It puts an end to plans for up to 40 super casinos, originally outlined in the government's Gambling Bill. Instead there will be a cap of eight new casinos in each size category - small, medium and large. The Culture Secretary said the move showed she listened to critics who feared an explosion in gambling.\n \n But Conservative shadow culture secretary John Whittingdale said the way the government had handled the bill was a \"shambles\". \"This announcement is a further humiliating retreat by the government. \"Instead of the initial intention of the gambling bill, to liberalise the rules governing gambling, the bill now imposes a more restrictive regime than exists at present.\" Shares in British casino operators London Clubs International, Rank Group and Stanley Leisure, who had been hoping the bill would pave the way for a big expansion in smaller casinos, fell by between 10 and 25% following the announcement. Ms Jowell's deputy, Richard Caborn, said the government had adopted a cautious approach to the issue, and responded to the concerns raised. \"Limiting the number of regional casinos to eight in the first phase is a cautious move that will allow us to test the impact of a new kind of casino on the levels of problem gambling,\" he said. \"We also believe it's right to apply this same level of caution to small and large casinos.\"\n \n He added that local authorities would still be able to stop new casinos coming to their areas. Church groups welcomed the limit on the number of casinos. Salvation Army spokesman Jonathan Lomax said: \"The proliferation of these casinos on high streets across the country was a real concern and the [three year] trial period, which we think should last at least five years, will enable research into the potentially severe social consequences of an increase in hard and addictive forms of gambling.\" But British British Casino Association Chairman Penny Cobham said her members were \"outraged\" by the decision, which followed a campaign in the Daily Mail newspaper. \"There was never going to be a massive explosion of casinos. Talk of a casino on every High Street was just a scaring tactic.\"\n", "llama3.2:1b": ["Tessa Jowell has announced plans to limit new casinos in the UK to 24, down from an initial 40, in response to criticism that her previous proposal would lead to an \"explosion in gambling\".", "The Culture Secretary's decision comes after the Conservatives criticized her handling of a related bill."], "llama3.2:3b": ["Tessa Jowell has announced plans to limit the number of new casinos in the UK to 24, with eight new casinos per size category.", "The move comes after critics expressed concerns about an \"explosion\" in gambling and follows a government bill that initially aimed to liberalize casino rules."], "gemma2:2b": ["Tessa Jowell will limit new casinos in the UK to 24, instead of the initial plan for up to 40 super casinos.", "This move is seen by the Tories as a retreat and negatively affects companies hoping for expansion.", "The government plans a three-year trial period to assess the impact on problem gambling.", "Church groups welcome the cap but casino operators express outrage."], "qwen2.5:0.5b": ["The Conservative party has announced plans for 24 new casinos in the UK, instead of up to 40 currently planned by the government's Gambling Bill.", "The Culture Secretary stressed that this move shows she listened to critics who feared an explosion in gambling and is cautious about its impact on small and large casinos.", "However, Conservative shadow culture secretary John Whittingdale criticized the government's handling of the bill as a \"shambles\" and called for it to liberalise rather than restrict.", "The decision will affect local authorities' ability to stop new casino arrivals.", "Other stakeholders welcomed the move, while British Casino Association Chairman Penny Cobham expressed outrage at the announced number and claimed there was never going to be a major increase in casinos on High Streets."], "qwen2.5:1.5b": ["Tessa Jowell announces plans to limit new casinos in the UK to 24, following Conservative opposition to original gambling bill and concerns over potential increase in problem gambling.", "This move results in falls for British casino operators' shares.", "The Culture Secretary says this is a cautious approach, allowing time to test impacts on smaller casinos and still permits local authorities to halt any new developments."], "qwen2.5:3b": ["Jowell has confirmed plans to limit UK new casinos to 24, down from up to 40 originally proposed in the government's Gambling Bill.", "This move caps eight new casinos per size category - small, medium and large - and is seen as a retreat by Conservatives.", "British casino operators' shares fell significantly due to these changes.", "The Culture Secretary argues this cautious approach allows for testing potential problems with casinos and applies caution to all sizes of establishments.", "Church groups welcome the limit but oppose further expansion of casinos on high streets, which they see as problematic.", "British Casino Association Chairman counters, stating her members are outraged by the decision following media campaigning."], "opencoder:1.5b": ["Jowell confirms casino climbdown\n\nTessa Jowell has announced plans to limit the number of new casinos in the UK to 24, in a move branded a \"humiliating retreat\" by the Tories.", "It puts an end to plans for up to 40 super casinos, originally outlined in the government's Gambling Bill.", "Instead there will be a cap of eight new casinos in each size category - small, medium and large.", "The Culture Secretary said the move showed she listened to critics who fearsed an explosion in gambling.", "But Conservative shadow culture secretary John Whittingdale said the way the government had handled the bill was a \"shambles\".", "Instead of the initial intention of the gambling bill, the new rules impose more restrictive regulations than they currently exist.", "British British Casino Association Chairman Penny Cobham said her members were \"outraged\" by the decision."], "smollm:1.7b": ["The summary is concise and conveys the main ideas:\n\n1.", "The UK government has announced plans to limit the number of new casinos in the country, with 24 allowed per size category.", "2.", "This move is seen as a \"humiliating retreat\" by the Tories, who had initially proposed an unlimited expansion of gambling.", "3.", "Instead, there will be a cap of 8 new casinos in each size category, which is smaller than the initial plan.", "4.", "The Culture Secretary confirmed that this was a \"shambles\" and that the government's handling of the bill was inadequate.", "5.", "However, Conservative shadow culture secretary John Whittingdale said the way the government had handled the bill was a \"shambles\".", "6.", "The move is seen as a \"conservative retreat\" by the government, which had initially proposed an unlimited expansion of gambling.", "7.", "Local authorities would still be able to stop new casinos coming to their areas, and there will be no longer be a three-year trial period for new casinos.", "8.", "Church groups welcomed the limit on the number of casinos, but British British Casino Association chairman Penny Cobham said her members were \"outraged\" by the decision."], "deepseek-r1:1.5b": ["Jowell confirms the UK will have only 24 casinos, cutting plans from up to 40.", "Shadow Culture Secretary John Whittingdale criticized the move as a shambles compared to existing regulations, stating it \"refused to listen\" due to concerns over gambling harm.", "Share prices for operators fell by 10-25%.", "Church groups welcomed the limit but dismissed it as fear of problem gambling rather than expansion.", "The Salvation Army acknowledged the concerns and suggested a trial period with at least five years.", "British Casino Association members were \"outraged\" by the decision, criticizing no major expansion planned despite claims of increased gambling issues."], "tinyllama:1.1b": ["Jowell confirms that the government will limit the number of new regional casinos to eight, as originally proposed in the Gambling Bill.", "This retreat by the Conservative shadow culture secretary John Whittingdale is called \"shaambles\" by industry insiders, and has seen shares in British casino operators London Clubs International (LCI), Rank Group, and Stanley Leisure Plc fall by between 10%-25%.", "LCI, which operates the Genting Casino chain, welcomes the limit on new regional casinos, while the British British Casino Association expresses outrage at the government's decision."], "tinydolphin:1.1b": [" Jowell confirmed plans to limit the number of new casinos in the UK to 24, and introduced an eight-to-four mandate for small casinos.", "This move has been met with criticism by opponents who argue that it is a humiliating retreat from the original 40 super casino proposal.", "Conservative shadow culture secretary John Whittingdale criticized the government's handling of the bill, stating that it was more restrictive than what existed currently.", "Shares in British casino operators London Clubs International, Rank Group, and Stanley Leisure fell by a significant percentage following this announcement.", "Local authorities can still block new casinos from coming to their areas if they wish, while the government allows for small and large casinos to be built in certain regions."], "phi:2.7b": [" Tessa Jowell has announced plans to limit the number of new casinos in the UK to 24, putting an end to the Conservatives' original plan for up to 40 super casinos.", "There will now be a cap of eight new casinos per size category - small, medium and large.", "Ms Jowell said she listened to critics who were concerned about an increase in problem gambling.", "However, Conservative shadow culture secretary John Whittingdale criticized the government's handling of the bill as \"a shambles\" and expressed disappointment that the bill did not liberalize gambling rules.", "Shares in casino operators fell following the announcement, with some industry leaders calling for a cautious approach to limit future expansion.", "Church groups welcomed the new restrictions on casinos, while British Casino Association Chairman Penny Cobham was outraged by the decision, claiming it was based on scare tactics."], "orca-mini:3b": [" Jowell announces plans to limit the number of new casinos in the UK to 24, originally planned to have up to 40 super casinos, in a move labeled as a \"humiliating retreat\" by the Tories.", "The Culture Secretary said the move showed she listened to critics who feared an explosion in gambling.", "However, the announcement disappointed small and large casino operators who had been hoping for a big expansion in their businesses.", "Local authorities will still be able to stop new casinos coming to their areas, while Church groups welcomed the limit on the number of casinos."], "hermes3:3b": ["Tessa Jowell limits UK casino numbers to 24, ending plans for up to 40 super casinos."], "stablelm-zephyr:3b": ["Tessa Jowell plans to limit new UK casinos to 24, ending up to 40 super casinos and replacing the original government proposal with a cap of 8 new casinos in each size category: small, medium, and large.", "The move comes after concerns from critics who feared an explosion in gambling.", "Shares in British casino operators fell by 10-25% following the announcement.", "Church groups welcomed the limit on casinos, calling for a trial period to study potential social consequences of increased hard and addictive forms of gambling."], "chatgpt-4o-latest": ["Tessa Jowell announced a cap of 24 new casinos in the UK, reversing earlier plans for up to 40 super casinos.", "The decision, aimed at addressing concerns over gambling expansion, limits new casinos to eight in each size category—small, medium, and large.", "Conservatives criticized the move as a \"humiliating retreat,\" arguing it imposes stricter regulations than before.", "Casino operators saw share prices drop following the announcement.", "The government defended the cautious approach, allowing local authorities to block new casinos and introducing a trial period to assess social impacts.", "Church groups welcomed the limit, while the British Casino Association condemned it as an overreaction influenced by media pressure."], "stablelm2:1.6b": ["Tessa Jowell announces plans to limit UK new casino locations to eight per size category after previous government's Gambling Bill, ending plans for up to 20 super casinos; there will now be a cap of eight new casinos in each size category.", "Casino operator shares fell following the announcement.", "The cautious approach aims to test the impact on levels of problem gambling while local authorities can still stop new casinos from their areas.", "Church groups and some casino operators welcomed the limit, but others were outraged."], "granite3.1-dense:2b": ["Tessa Jowell, UK Culture Secretary, announced plans to limit the construction of new casinos to 24, as part of the Gambling Bill.", "This caps eight casinos in each size category: small, medium, and large.", "The move aims to address concerns about potential gambling problems, but Conservative MP John Whittingdale criticized it as a \"shambles,\" arguing it imposes stricter regulations than current laws.", "Casino operators' shares dropped due to the announcement.", "Jowell's deputy, Richard Caborn, emphasized a cautious approach, citing concerns about problem gambling and allowing local authorities to veto new casinos.", "Church groups welcomed the restriction, while the British Casino Association expressed outrage, dismissing fears of widespread casino expansion as \"scare tactics.\""]}