{"raw_text": "Tories attack EU asylum moves\n \n David Blunkett has been accused of using the \"politics of confusion\" to disguise new EU immigration measures.\n \n Tory spokesman David Davis told MPs the UK was losing its power of veto over who was allowed to come to Britain. The EU has opted to adopt qualified majority voting in this area - previously measures needed unanimous agreement from all member states. Mr Blunkett told MPs the UK would still be able to reject proposals on immigration it did not agree with.\n \n He argued closer co-operation with Europe over asylum and immigration was crucial to controlling the flow of people into the UK. \"If we don't like what other EU countries do on immigration and nationality we have the right to opt-in or out to suit the British people,\" he said. The home secretary was responding to an emergency question from his Tory opposite number Mr Davis. \"The government is employing the politics of confusion - I think, deliberately,\" argued Mr Davis. \"By confusing the country it hopes no one will notice the disappearance of the asylum and immigration veto.\" On Monday Tony Blair insisted closer co-operation did not mean losing control of British borders. He said an enlarged 25-member EU needs a streamlined decision making process. Mr Davis said once Britain had opted into policies then it could not opt out - leaving the UK open to unfavourable interpretations of what those policies actually meant.\n \n He accused the government of being \"pathetic\" when it came to its efforts over immigration and asylum and of \"surrendering\" on the issue. And he asked why the government was agreeing to the measure on asylum and immigration now when the whole issue was part of the EU constitution, which voters in the UK had been promised a referendum over. Mr Blair told his monthly news conference Britain had the \"best of both worlds\" and would keep the veto. \"There is no question of Britain giving up our veto on our border controls,\" he said. \"With the Treaty of Amsterdam seven years ago, we secured the absolute right to opt in to any of the asylum and immigration provisions that we wanted to in Europe.\" Mr Blunkett met his EU counterparts in Luxembourg on Monday to consider proposals aimed at streamlining decision making on the issue.\n \n The 25 member-states are expected to scrap the requirement for unanimous agreement on immigration policy, in favour of the qualified majority voting (QMV) system. Under this scheme larger states such as Britain are expected to have more power than the smaller EU states. Britain is expected to retain an \"opt-in\" right which will allow it to ignore any measures it disagrees with. Liberal Democrat spokesman Mark Oaten called the change pragmatic and argued it gave a better chance of producing a European asylum solution. \"If we don't work together it means some countries can ignore their responsibilities at the expense of their neighbours,\" said Mr Oaten. \"The Liberal Democrats have long argued that Britain should be a safe haven for asylum seekers but it's right that we don't do this in isolation.\"\n", "llama3.2:1b": ["Tory spokesman David Davis accused UK Home Secretary David Blunkett of using the \"politics of confusion\" to disguise EU immigration measures, which he claimed would lose the UK's power of veto on who is allowed into Britain.", "The UK has opted for qualified majority voting on asylum and immigration policy, instead of a unanimous agreement from all member states.", "Tory spokesman David Davis argued that this means the UK can no longer opt out of proposals it disagrees with, but will still be able to reject them if they do not agree with its position.", "Tony Blair insisted closer cooperation between the EU and the UK did not mean losing control over British borders, while also saying an enlarged 25-member EU requires a streamlined decision-making process."], "llama3.2:3b": ["Tory spokesman David Davis accuses Home Secretary David Blunkett of using \"politics of confusion\" to disguise EU immigration measures, claiming the UK will lose its veto power.", "The EU has adopted qualified majority voting, and Blunkett argues Britain can still reject proposals it disagrees with.", "Blair insists Britain retains its veto on border controls."], "gemma2:2b": ["David Davis accuses David Blunkett of using confusing tactics to disguise changes to EU immigration and asylum policies that will shift power away from the UK.", "Blunkett maintains the UK retains control over its borders through an \"opt-in\" system, while Davis argues this will ultimately weaken Britain's ability to influence policy decisions on immigration.", "Tony Blair emphasizes the need for a streamlined decision process within the EU and claims the UK still maintains its veto on border controls.", "Despite these assurances from Tony Blair, other political parties, including the Liberal Democrats, argue for greater cooperation and a more pragmatic approach towards finding effective solutions for asylum seekers across Europe."], "qwen2.5:0.5b": ["Tories attack EU immigration measures by accusing Blunkett of using politics of confusion to weaken UK veto on immigration."], "qwen2.5:1.5b": ["Tories accuse David Blunkett of using politics to hide EU immigration changes, arguing the UK will lose veto power over asylum and immigration measures.", "Ministers claim closer cooperation is essential for controlling migration flow into Britain.", "Tories criticize government's handling of immigration issue as \"pathetic\" and \"surrendering.\"", "EU plans to adopt qualified majority voting on immigration and asylum, maintaining UK ability to reject policies it doesn't agree with but leaving the option open for opt-in/out on future measures.", "Ministers insist the veto remains unchanged despite EU reforms, while some liberal Democrats support a more integrated Europe that would improve asylum procedures."], "qwen2.5:3b": ["Tories accuse David Blunkett and the government of using \"politics of confusion\" to disguise EU immigration measures, which now adopt qualified majority voting.", "Despite this, UK will still have veto power over immigration proposals it disagrees with.", "Home Secretary argues closer European cooperation crucial for controlling migration.", "Critics argue this loss of control could lead to unfavourable interpretations.", "Liberal Democrats support change as more pragmatic and beneficial for addressing asylum issues collectively."], "opencoder:1.5b": ["Tories attack EU asylum moves\n\nDavid Blunkett has been accused of using the politics of confusion to disguise new EU immigration measures.", "He told MPs the UK was losing its power of veto over who was allowed to come to Britain.", "The EU has opted to adopt a qualified majority voting in this area - previously measures needed unanimous agreement from all member states.", "Mr Blunkett told MPs the UK would still be able to reject proposals on immigration it did not agree with.", "He argued closer cooperation with Europe over asylum and Immigration was crucial to controlling the flow of people into the UK.", "If we don't like what other EU countries do on immigration and nationality, we have the right to opt-in or out to suit the British people.", "The home secretary was responding to an emergency question from his Tory opposition number Mr Davis.", "He said once Britain had opted into policies then it could not opt out - leaving the UK open to unfavourable interpretations of what those policies actually meant.", "He accused the government of being \"pathetic\" and asked why the government was agreeing to the measure on asylum and Immigration now when the whole issue was part of the EU constitution, which voters in the UK had been promised a referendum over.", "Tony Blair insisted closer cooperation did not mean losing control of British borders.", "Mr Davis said once Britain had opted into policies then it could not opt out - leaving the UK open to unfavourable interpretations of what those policies actually meant.", "He asked why the government was agreeing to the measure on asylum and Immigration now when the whole issue was part of the EU constitution, which voters in the UK had been promised a referendum over.", "Mr Blunkett met his EU counterparts in Luxembourg on Monday to consider proposals aimed at streamlining decision making on the issue.", "The 25 member-states are expected to scrap the requirement for unanimous agreement on immigration policy, in favour of the QMV system.", "Under this scheme larger states such as Britain are expected to have more power than the smaller EU states.", "They're expected to retain an \"opt-in\" right which will allow them to ignore any measures they disagree with.", "Liberal Democrat spokesman Mark Oaten called the change pragmatic and argued it gave a better chance of producing a European asylum solution.", "\"The Liberal Democrats have long argued that Britain should be a safe haven for asylum seekers but it's right that we don't do this in isolation,\" said Mr Oaten.", "\"The Liberal Democrats have long argued that Britain should be a safe haven for asylum seekers but it's right that we don't do this in isolation.\""], "smollm:1.7b": ["Summarize the text concisely, preserving key ideas and details:\n\nTories attack EU asylum moves by David Blunkett to disguise new EU immigration measures.", "Tory spokesman David Davis told MPs the UK was losing its power of veto over who was allowed to come to Britain.", "The EU has opted for qualified majority voting in this area - previously measures needed unanimous agreement from all member states.", "Mr Blunkett told MPs the UK would still be able to reject proposals on immigration it did not agree with.", "The government is employing the politics of confusion - I think, deliberately - by confusing the country it hopes no one will notice the disappearance of the asylum and immigration veto.", "On Monday Tony Blair insisted closer co-operation does not mean losing control of British borders.", "He said an enlarged 25-member EU needs a streamlined decision making process.", "Mr Blunkett accused the government of being \"pathetic\" when it came to its efforts over immigration and asylum and of \"surrendering\" on the issue.", "Mr Blair told his monthly news conference Britain had the \"best of both worlds\" and would keep the veto.", "With the Treaty of Amsterdam seven years ago, we secured the absolute right to opt in to any of the asylum and immigration provisions that we wanted to in Europe.", "Mr Blunkett met his EU counterparts in Luxembourg on Monday to consider proposals aimed at streamlining decision making on the issue.", "The 25 member-states are expected to scrap the requirement for unanimous agreement on immigration policy, in favor of the qualified majority voting (QMV) system.", "Under this scheme larger states such as Britain are expected to have more power than the smaller EU states.", "Britain is expected to retain an \"opt-in\" right which will allow it to ignore any measures it disagrees with.", "Liberal Democrat spokesman Mark Oaten called the change pragmatic and argued it gave a better chance of producing a European asylum solution.", "Summarize the text concisely, preserving key ideas and details:\n\nTories attack EU asylum moves by David Blunkett to disguise new EU immigration measures.", "Tory spokesman David Davis told MPs the UK was losing its power of veto over who was allowed to come to Britain.", "The EU has opted for qualified majority voting in this area - previously measures needed unanimous agreement from all member states.", "Mr Blunkett told MPs the UK would still be able to reject proposals on immigration it did not agree with.", "The government is employing the politics of confusion - I think, deliberately - by confusing the country it hopes no one will notice the disappearance of the asylum and immigration veto.", "On Monday Tony Blair insisted closer co-operation does not mean losing control of British borders.", "He said an enlarged 25-member EU needs a streamlined decision making process.", "Mr Blunkett accused the government of being \"pathetic\" when it came to its efforts over immigration and asylum, and of \"surrendering\" on the issue.", "Mr Blair told his monthly news conference Britain had the \"best of both worlds\" and would keep the veto.", "With the Treaty of Amsterdam seven years ago, we secured the absolute right to opt in to any of the asylum and immigration provisions that we wanted to in Europe.", "Mr Blunkett met his EU counterparts in Luxembourg on Monday to consider proposals aimed at streamlining decision making on the issue.", "The 25 member-states are expected to scrap the requirement for unanimous agreement on immigration policy, in favor of the qualified majority voting (QMV) system - previously measures needed unanimous agreement from all member states.", "Mr Blunkett told MPs the UK was losing its power of veto over who was allowed to come to Britain.", "The EU has opted for qualified majority voting in this area - previously measures needed unanimous agreement from all member states.", "Mr Blunkett accused the government of being \"pathetic\" when it came to its efforts over immigration and asylum, and of \"surrendering\" on the issue."], "deepseek-r1:1.5b": ["David Blunkett is accused of using \"politics of confusion\" to bypass strict majority votes, despite having a qualified majority system.", "The UK would still lose its veto power but could reject EU proposals, while closer co-operation between Europe and the UK is vital for asylum control.", "He questions the UK's role as a safe haven for asylum seekers and criticizes the government for agreeing on immigration policies when they're part of the EU constitution.", "Blair previously explained secure border controls from the Treaty of Amsterdam seven years ago.", "The 25 EU countries are considering QMV, allowing larger nations like Britain more influence, potentially affecting their asylum measures."], "tinyllama:1.1b": ["Summary: The UK is expected to adopt qualified majority voting (QMV) on immigration measures, in order to improve cooperation with other EU countries.", "The move came after David Blunkett used the \"politics of confusion\" to prevent the UK from exercising its right to opt-out or to control borders.", "Liberal Democrats criticized the change as a better alternative for producing a European asylum solution."], "tinydolphin:1.1b": [" The UK has been criticized for attacking the EU for implementing a new immigration system, which allows member states to opt out of certain provisions.", "Tory spokesman David Davis has argued against this by stating that the UK would still have the right to reject measures it did not agree with.", "This new system is designed to improve control over who can come to Britain for protection, and is part of the EU's constitution.", "Despite this criticism, the UK maintains its position as a member of the EU, and has agreed to adopt new measures aimed at streamlining decision-making on immigration policy."], "phi:2.7b": [" The text discusses a potential change to EU immigration policy, which would allow qualified majority voting instead of unanimous agreement among member states.", "David Blunkett argues that the UK will still have the power to reject proposals it disagrees with and emphasizes the importance of working together to control the flow of people into Britain.", "However, David Davis accuses the government of \"employing the politics of confusion\" and warns about the loss of the UK's asylum and immigration veto.", "Tony Blair defends the move as necessary for a streamlined decision-making process while retaining the right to opt in.", "Liberal Democrat Mark Oaten supports the change as pragmatic but argues that countries should not ignore their responsibilities at the expense of others."], "orca-mini:3b": [" The UK is opposed to EU measures on immigration and asylum, which will be decided by qualified majority voting instead of unanimous agreement.", "The government hopes to keep control of borders despite opting into the new policies.", "Tony Blair insists Britain can still veto decisions on asylum and immigration.", "David Blunkett argues that co-operation with Europe is crucial to controlling migration.", "The Lib Dems support the change, but argue that Britain should be a safe haven for asylum seekers."], "hermes3:3b": ["Tories criticise EU asylum moves and accuse David Blunkett of using politics of confusion to hide loss of UK veto on immigration, arguing UK can no longer reject proposals they disagree with."], "stablelm-zephyr:3b": ["Tory spokesman David Davis accused UK Home Secretary David Blunkett of using the \"politics of confusion\" to hide new EU immigration measures, stating that the UK was losing its veto power over who could enter Britain.", "Blunkett argued that closer collaboration with Europe on asylum and immigration issues would help control the flow of people into the UK.", "While Tony Blair insisted that the UK would still retain control over British borders, despite the adoption of qualified majority voting in this area.", "The change means larger states like Britain are expected to have more influence than smaller EU member states."], "chatgpt-4o-latest": ["The UK government is facing criticism from the Conservative Party over new EU immigration measures that replace unanimous agreement with qualified majority voting (QMV).", "Tory spokesman David Davis accused Home Secretary David Blunkett of using \"politics of confusion\" to obscure the loss of Britain's veto on asylum and immigration policies.", "Blunkett argued that closer EU cooperation was necessary for controlling migration and that the UK retained the right to opt in or out of policies.", "Prime Minister Tony Blair insisted Britain would not lose control of its borders and maintained the ability to opt into EU asylum provisions selectively.", "Davis countered that once Britain opted in, it could not opt out, leaving it vulnerable to unfavorable policy interpretations.", "He also questioned why the government was agreeing to these changes before a promised referendum on the EU constitution.", "Liberal Democrat spokesman Mark Oaten supported the shift, calling it pragmatic and essential for a collective European asylum solution.", "The 25 EU member states are expected to adopt QMV, with Britain retaining an opt-in right, giving it flexibility in immigration decisions."], "stablelm2:1.6b": ["Tories criticize EU immigration policies, with David Davis accusing the UK of losing its ability to veto proposals on immigration.", "Home Secretary David Blunkett argues that the UK will still have the right to reject proposals if they don't agree, while Tony Blair insists that closer cooperation does not mean giving up control over borders.", "The EU plans to adopt qualified majority voting for immigration and asylum issues, allowing larger states like Britain to have more power than smaller ones.", "This move has been criticized by Liberal Democrat Mark Oaten as it provides a better chance of producing a European asylum solution while ensuring no country ignores their responsibilities towards their neighbors."], "granite3.1-dense:2b": ["Tory MP David Davis criticized the UK government's approach to new EU immigration measures, accusing them of employing \"politics of confusion\" to hide the loss of the veto power over immigration.", "The EU is shifting from unanimous decision-making to a qualified majority voting system (QMV), which will potentially give larger member states more influence.", "Home Secretary David Blunkett defended this shift, arguing that Britain can still opt in or out of EU policies based on its national interests and maintaining control over borders.", "Tony Blair emphasized that Britain retains its veto power, securing it with the Treaty of Amsterdam seven years ago.", "The government's EU counterparts are expected to grant Britain an \"opt-in\" right under QMV, allowing it to refuse unfavorable policies.", "Liberal Democrat Mark Oaten supported this change, believing it fosters a more collaborative European asylum solution and prevents countries from neglecting their responsibilities at the expense of others."]}