{"raw_text": "Tsunami 'won't divert Africa aid'\n \n UK aid to help the victims of the Asian tsunami disaster will not take much needed relief from Africa, Prime Minister Tony Blair has promised.\n \n Mr Blair told the BBC's Breakfast with Frost show the money spent on the tsunami would not \"invade\" the money Britain wanted to spend on Africa. Questioned about the disaster, he said his faith in God had not been shaken. He added he would give new figures on the number of tsunami-related British deaths to the Commons on Monday. Foreign Secretary Jack Straw said on Friday that about 440 Britons were either dead or missing in the disaster.\n \n Mr Blair told Sunday's programme: \"Since Jack Straw gave those figures a couple of days ago they haven't moved a great deal, which should give us some hope that we are beginning to reach the peak of the numbers. But we just can't be sure. \"It is just an immensely difficult job to get absolutely accurate figures, all countries are struggling with this.\"\n \n He said the £50 million originally allocated from the Department for International Development was now \"well on the way\" to being spent. But the exact allocation could not be clarified until the World Bank had completed its assessment of the needs of the countries affected. Within the next few weeks a clearer picture would emerge of the long-term costs of reconstruction, he added. But he pledged that Africa - which sees a \"preventable\" tsunami-size death toll every month from conflict, disease and poverty - would not be neglected. As Britain takes up its presidency of the G8 group of leading nations, Mr Blair said ministers had a big agenda for Africa. \"For the first time we have a plan that won't just deal with aid and debt but will also deal on issues of governance within African countries and conflict resolution,\" he said. \"A lot of the problems in Africa come from conflict, that again are preventable, but only with the right systems in place.\"\n", "llama3.2:1b": ["UK aid for tsunami relief in Asia will not divert money to help Africa due to concerns over accuracy.", "The UK has allocated £50 million originally and is \"well on the way\" to spending it.", "However, final allocation details will take time.", "Despite these challenges, Prime Minister Tony Blair and Foreign Secretary Jack Straw have reaffirmed that British interests in Africa are being protected and that African countries will not be neglected during Britain's presidency of the G8 group."], "llama3.2:3b": ["UK aid to tsunami victims won't divert funds meant for Africa; £50m allocated for Asian disaster, with a clearer picture emerging on long-term costs within weeks; Africa plans include governance and conflict resolution issues."], "gemma2:2b": ["Prime Minister Blair pledged that UK aid for tsunami victims would not divert funds intended for African aid.", "He confirmed over 400 British people were either dead or missing in the disaster and noted challenges in obtaining accurate figures.", "Despite this, he assured continued support for Africa while emphasizing a new G8 plan to address governance issues and conflict resolution."], "qwen2.5:0.5b": ["UK pledges to help disaster victims while Africa's aid is not affected by a tsunami caused by a different earthquake."], "qwen2.5:1.5b": ["UK aid to tsunami victims not diverted for Africa; faith not shaken despite disaster tolls."], "qwen2.5:3b": ["UK aid to victims of Asian tsunami disaster will not affect funding for Africa, Prime Minister Tony Blair assured.", "Blair pledged that Britain would continue its commitment to Africa despite the disaster, stating that \"preventable\" death toll from conflict, disease and poverty occurs there monthly.", "He also announced new figures on British deaths related to the tsunami would be provided to Commons soon.", "Blair mentioned £50 million originally allocated from Department for International Development is almost spent, but exact allocation can't be clarified until World Bank assesses needs of affected countries.", "Blair pledged to continue plans for Africa presidency focusing on governance and conflict resolution."], "opencoder:1.5b": ["Tsunami 'won't divert Africa aid'\nUK aid to help the victims of the Asian tsunami disaster will not take much needed relief from Africa, Prime Minister Tony Blair has promised.", "Mr Blair told the BBC's Breakfast with Frost show the money spent on the tsunami would not \"invade\" the money Britain wanted to spend on Africa.", "Questioned about the disaster, he said his faith in God had not been shaken.", "He added he would give new figures on the number of tsunami-related British deaths to the Commons on Monday.", "Foreign Secretary Jack Straw said on Friday that about 440 Britons were either dead or missing in the disaster.", "Mr Blair told Sunday's programme: \"Since Jack Straw gave those figures a couple of days ago they haven't moved a great deal, which should give us some hope that we are beginning to reach the peak of the numbers.", "But we just can't be sure.", "It is just an immensely difficult job to get absolutely accurate figures, all countries are struggling with this.\"", "He said the £50 million originally allocated from the Department for International Development was now \"well on the way\" to being spent.", "But the exact allocation could not be clarified until the World Bank had completed its assessment of the needs of the countries affected.", "Within the next few weeks a clearer picture would emerge of the long-term costs of reconstruction, he added.", "But he pledged that Africa - which sees a \"preventable\" tsunami-size death toll every month from conflict, disease and poverty - would not be neglected.", "As Britain takes up its presidency of the G8 group of leading nations, Mr Blair said ministers had a big agenda for Africa.", "\"The first time we have a plan that won't just deal with aid and debt but will also deal on issues of governance within African countries and conflict resolution,\" he said.", "\"A lot of the problems in Africa come from conflict, that again are preventable, but only with the right systems in place.\""], "smollm:1.7b": ["The summary is concise and to the point, preserving key ideas and details while omitting unnecessary information.", "It captures the main points of the text, including the statement that UK aid will not divert African aid, the Prime Minister's assurance that the money won't take away from other relief efforts in Africa, and the promise to give new figures on the number of tsunami-related British deaths to the Commons on Monday."], "deepseek-r1:1.5b": ["The UK is investing more on their own aid than intended for Africa.", "Mr. Blair asserts faith in God, stating his faith isn't shaken but plans to provide new numbers to the Commons.", "He mentions difficulties in getting accurate figures from the World Bank and plans for future funding that includes governance and conflict resolution, acknowledging Africa's challenges like conflict which can be preventable with right systems."], "tinyllama:1.1b": ["The Prime Minister, Tony Blair, has reiterated that Britain's aid to help victims of the Asian tsunami will not be diverted to other African countries, stating that funds spent on relief efforts would not \"invade\" money he wanted to spend in Africa.", "In response to a question about the disaster from a BBC reporter, Blair said he believed the UK would get new figures on British deaths and missing from the Commonwealth on Monday.", "He added that the original allocation of £50 million from DfID was \"well on its way\" to being spent, and that Africa would not be neglected as the group takes up its presidency in June.", "The Prime Minister emphasized his commitment to ensuring Africa gets priority in the group's agenda for long-term reforms and governance issues."], "tinydolphin:1.1b": [" The tsunami, which hit Asia a few months ago, is expected to cause significant loss of life and damage to infrastructure across the region.", "Although it may have diverted some aid funding from Africa, Tony Blair has assured that Britain will still provide assistance through the European Union's recovery plan.", "However, new figures on British deaths in the disaster are not expected until next Monday.", "This issue is still under investigation and remains a complex task for both the international community and governments in Africa."], "phi:2.7b": [" The summary of the text is:\n\nThe UK Prime Minister has assured that his country's aid for the Asian tsunami victims will not affect its commitment to Africa, which faces a constant threat of death and poverty.", "He said he would update the House on the number of British casualties and pledged to help African countries with peace, governance, and development."], "orca-mini:3b": [" The tsunami disaster did not divert aid intended for Africa, despite promises made by UK Prime Minister Tony Blair.", "While the £50 million originally allocated from the Department for International Development was spent, the exact allocation could not be clarified until the World Bank had completed its assessment of the needs of the countries affected.", "The Prime Minister pledged that Africa would not be neglected, as Britain takes up its presidency of the G8 group of leading nations.", "Ministers have a big agenda for Africa, which includes dealing with issues of governance within African countries and conflict resolution."], "hermes3:3b": ["Tsunami aid won't divert UK funds from Africa, says Tony Blair."], "stablelm-zephyr:3b": ["The UK Prime Minister promised that UK aid funds for the Asian tsunami disaster would not take needed relief away from Africa.", "Mr. Blair stated that £50 million allocated from the Department for International Development was being spent and mentioned that a clearer picture of long-term reconstruction costs would emerge soon.", "He assured that Africa, which suffers from preventable deaths due to conflict, disease, and poverty, would not be neglected as Britain's G8 presidency focuses on African governance and conflict resolution issues."], "chatgpt-4o-latest": ["UK Prime Minister Tony Blair assured that aid for Asian tsunami victims would not divert funds from Africa.", "He stated that the £50 million allocated for tsunami relief was being spent, but final allocations depended on a World Bank assessment.", "Blair emphasized that Africa, which faces ongoing crises, would remain a priority as the UK leads the G8, with plans addressing aid, debt, governance, and conflict resolution.", "He also noted that the number of British tsunami victims stood at around 440 and that updated figures would be presented to Parliament."], "stablelm2:1.6b": ["UK Prime Minister Tony Blair has announced that aid for the Asian tsunami victims will not be diverted from Africa.", "The money allocated by the Department for International Development is on track to be spent; however, the exact allocation until assessed by the World Bank.", "African countries won't be neglected during Britain's presidency of the G8 group.", "Instead, efforts will focus on governance within African countries and conflict resolution."], "granite3.1-dense:2b": ["UK Prime Minister Tony Blair assured that £50 million allocated for Asian tsunami relief will not compromise Britain's commitment to African aid.", "He stated that the initial figure is \"well on its way\" to being spent, with further details to emerge once the World Bank assesses the affected countries' needs.", "Blair expressed hope that the death toll from the disaster might peak soon but emphasized the difficulty in obtaining accurate figures due to global struggles.", "Despite this, he pledged continued support for Africa during Britain's G8 presidency, focusing on issues like governance and conflict resolution, given Africa's regular vulnerability to preventable conflicts from disease, disease, and poverty."]}