{"raw_text": "Police chief backs drinking move\n \n A chief constable has backed the introduction of 24-drinking, saying police had a responsibility to ensure people could benefit from a law change.\n \n However, Norfolk police chief Andy Hayman also warned that a great deal of preparatory work was still needed. \"I don't subscribe to the views of some of my colleagues who are coming out and objecting to it,\" he said. His comments come after the Liberal Democrats backed Tory demands that the government's plans be put on hold. Andy Hayman said he did not agree with politicians and senior police officers who have objected to the plans, which come into force on 7 February. \"I feel that is a premature position to be taking,\" he said. Among those who have criticised the plans are the UK's top policeman Sir John Stevens.\n \n The Metropolitan police chief said last week that the plans for 24-hour drinking should be re-examined because of a binge drinking \"epidemic\". However, Mr Hayman said: \"It would be totally unacceptable in my view for a chief constable to say, 'I'm very sorry'. He said that police should make sure that responsible people who wanted a change could benefit from more liberal legislation. \"My view is that I have got a responsibility to create an environment where that can happen, \" he said. However, he believes a lot of preparatory work is still needed to be done by police, local authorities and the drinks industry before the nation was ready for 24-hour drinking. But he is confident problems in the early days can be \"ironed out\". He believed the majority of people favoured this law change and \"we have to accept that lifestyles are changing\". But aspects such as transport, and basic things such as making sure public toilets are open all night had to be taken into account.\n \n Prime Minister Tony Blair has defended the Licensing Act, saying it is wrong to deny people the relaxed hours enjoyed elsewhere in Europe because of a \"tiny minority\" of violent binge drinkers. A six-month transitional period starts on 7 February during which time venues can apply for extended licences. The Conservatives have called for 24-hour drinking to be shelved until the problems of binge drinking are solved. On Monday, the Lib Dems also called for a delay. Lib Dem Home Affairs spokesman Mark Oaten said: \"It would clearly be prudent to allow the police and local authorities more time to prepare for flexible drinking hours.\" Chief constable Mr Hayman acknowledged that binge drinking did cause problems. \"If you come to Norwich on a Friday or Saturday night you will see things going on that will you make you feel ashamed. \"However, I want industry to succeed in Norwich and I want Norwich to be the recognised nightspot of East Anglia. \"There is no way I want to say we cannot manage it or police it. We can.\"\n", "llama3.2:1b": ["Police chief Andy Hayman has backed the introduction of 24-hour drinking laws, stating that his department's responsibility is to ensure people can benefit from the change.", "However, he acknowledged that a lot of preparatory work is needed before the law takes effect on February 7.", "He believes responsible individuals will find ways to drink responsibly and that police should support this by allowing them to do so.", "Despite concerns from some politicians and industry groups, Hayman expressed confidence that problems in the early days can be ironed out."], "llama3.2:3b": ["Police chief Andy Hayman backs 24-drinking law change citing responsibility to ensure people benefit, while warning of need for preparatory work and acknowledging binge drinking causes problems."], "gemma2:2b": ["Norfolk Police Chief Andy Hayman supports the introduction of 24-hour drinking hours as a matter of public benefit, acknowledging the concerns about potential issues but believing the majority support this change.", "He emphasizes that police will prepare for implementation and handle early challenges, while also urging others to recognize that societal norms are shifting."], "qwen2.5:0.5b": ["The Liberal Democrats opposed the introduction of 24-hour drinking restrictions, calling them premature.", "Andy Hayman said he did not agree with politicians and senior police officers who had objected to plans, saying that the government's own plans should be examined first.", "He believed many problems in early days could be \"ironed out\" but felt it was necessary for people to enjoy 24-hour drinking.", "The Prime Minister called for a transitional period during which drinks were allowed to last until the problems of binge-drinking were addressed."], "qwen2.5:1.5b": ["A chief constable has supported plans for 24-hour drinking, arguing that responsible people should benefit from liberal legislation but noted preparatory work remains necessary before the change becomes widely accepted."], "qwen2.5:3b": ["A chief constable supports 24-hour drinking laws, emphasizing police's responsibility to ensure responsible people benefit from changes.", "However, he warns that substantial preparatory work remains necessary due to concerns about binge drinking.", "Despite criticism from some colleagues and a prominent chief inspector, Andy Hayman believes the law change should be implemented, arguing it can create an environment where responsible drinkers can enjoy more liberal legislation.", "He acknowledges that aspects such as transport and public toilets need to be considered but is confident problems can be mitigated in the early days.", "While Prime Minister Tony Blair supports the Licensing Act, parties like the Conservatives and Lib Dems have called for a delay until binge drinking issues are addressed."], "opencoder:1.5b": ["A chief constable has backed the introduction of 24-hour drinking plans, which involves responsible individuals to benefit from more liberal legislation.", "He also stressed that a large part of preparatory work remains needed before the new law can be implemented.", "The chief constable also argued that the industry's health and safety concerns should not be ignored as they are now being addressed.", "A significant aspect to consider is the transportation infrastructure, which must be improved for more flexible drinking hours.", "Moreover, the public toilet needs to be open all night long, thus ensuring a healthy environment.", "In terms of employment concerns, the constable acknowledged that the majority of people in Norwich have preferred this change and has made it a \"certain duty\".", "However, his concerns about transport are yet to be addressed, as they still face challenges.", "He also expressed concern over the industry's health and safety issues.", "The government should continue working on these fronts to ensure the successful implementation of 24-hour drinking laws."], "smollm:1.7b": ["The key ideas in this text are:\n\n1.", "The chief constable has backed the introduction of 24-drinking, saying that police had a responsibility to ensure people could benefit from a law change.", "2.", "However, Norfolk police chief Andy Hayman also warned that a great deal of preparatory work was still needed.", "\"I don't subscribe to the views of some of my colleagues who are coming out and objecting to the plans,\" he said.", "His comments come after the Liberal Democrats backed Tory demands that the government's plans be put on hold.", "3.", "Andy Hayman believes that a lot of preparatory work is still needed to be done by police, local authorities and the drinks industry before the nation was ready for 24-hour drinking.", "However, he believes that the majority of people would support this law change because it allows people to enjoy more relaxed hours at home or in public places.", "4.", "The key idea here is that police chief Andy Hayman has backed the introduction of 24-drinking, saying that police had a responsibility to ensure people could benefit from a law change.", "However, he believes that there are still many problems to be solved before this can happen."], "deepseek-r1:1.5b": ["Police Chief Andy Hayman backs the introduction of 24-hour drinking, emphasizing responsible individuals can benefit from a law change.", "However, officials in Norfolk believe significant preparation is needed before full implementation on February 7th.", "Lib Dems and Conservatives oppose this move, calling for delays, while Mike Penny QC and Sir John Stevens criticize it as causing significant problems, particularly through potential restrictions on alcohol availability.", "The Licensing Act's stance is defended by Prime Minister Tony Blair, who argues that extended hours are necessary to address the issue of binge drinking among a small minority."], "tinyllama:1.1b": ["The Norfolk Police Chief supports the introduction of 24-hour drinking, as he believes that people have the right to enjoy the benefits of this law change during a transition period.", "The chief is concerned about the \"tiny minority\" of violent binge driner and wants to make sure public toilets are open all night.", "He emphasizes that preparatory work needs to be done before the nation is ready for extended hours, but he believes that there are no significant problems with binge drinking in Norfolk.", "The chief also stated his support for a delay in extending licenses for venues applying for extended licences, and called for an additional period of transition."], "tinydolphin:1.1b": [" The Met Police Chief Andy Hayman has backed the introduction of 24-hour drinking, stating that he does not subscribe to the views of some of his colleagues who are coming out against it.", "He believes there is a need for a comprehensive approach to ensure people can benefit from the new law change.", "However, Sir John Stevens, the UK's top policeman, expressed concerns about the plans and recommended re-examination.", "The plan will come into effect on 7 February, with a six-month transitional period allowing venues to apply for extended licences."], "phi:2.7b": [" Police chief Andy Hayman supports the introduction of 24-hour drinking, believing that the police have a responsibility to ensure people can benefit from the law change.", "However, he acknowledges that there is still much preparatory work to be done by local authorities and the drinks industry before the nation is ready for 24-hour drinking.", "He believes that the majority of people favour this law change and that problems in the early days can be ironed out with proper planning.", "Prime Minister Tony Blair has defended the Licensing Act, saying it is wrong to deny people relaxed hours elsewhere because of a \"tiny minority\" of violent binge drinkers.", "A six-month transitional period starts on 7 February during which time venues can apply for extended licences.", "However, there are calls from both the Conservatives and Liberal Democrats for 24-hour drinking to be shelved until the problems of binge drinking are solved."], "orca-mini:3b": [" The police chief supports the introduction of 24-hour drinking, saying police have a responsibility to ensure people can benefit from the law change.", "However, he warned that a lot of preparatory work is still needed.", "He believes responsible people who want a change can benefit from more liberal legislation, but worries about basic things like public toilets and transportation.", "Prime Minister Tony Blair defends the Licensing Act, saying it's wrong to deny people relaxed hours enjoyed elsewhere in Europe because of a \"tiny minority\" of violent binge drinkers.", "The Conservatives and Lib Dems both call for 24-hour drinking to be shelved until the problems of binge drinking are solved.", "However, the Met Police Chief supports the law change and wants the industry to succeed in Norwich."], "hermes3:3b": ["Police chief supports 24-hour drinking introduction, but acknowledges need for preparatory work before implementation."], "stablelm-zephyr:3b": ["A police chief supports 24-hour drinking, believing that people should benefit from a law change.", "Norfolk's Chief Andy Hayman warns that extensive preparation is required before the nation is ready for 24-hour drinking, but he believes the majority of people favor this change and that issues can be managed over time.", "The Licensing Act has been defended by Prime Minister Tony Blair, who argues against denying people relaxed hours enjoyed in other European countries due to violent binge drinkers.", "A six-month transitional period starts on February 7th with venues able to apply for extended licenses."], "chatgpt-4o-latest": ["Norfolk police chief Andy Hayman supports the introduction of 24-hour drinking, arguing that police have a duty to ensure responsible people benefit from the law change.", "However, he acknowledges that significant preparatory work is needed by police, local authorities, and the drinks industry.", "His stance contrasts with other senior officers, including Metropolitan police chief Sir John Stevens, who warns of a binge drinking \"epidemic.\"", "Prime Minister Tony Blair defends the Licensing Act, arguing that a \"tiny minority\" of violent drinkers should not prevent relaxed hours.", "The Conservatives and Liberal Democrats have called for a delay to allow more preparation.", "Hayman admits binge drinking is an issue but believes it can be managed and supports Norwich becoming a key nightlife destination."], "stablelm2:1.6b": ["Norfolk Police Chief Andy Hayman supports the introduction of 24-hour drinking, stating that police have a responsibility in ensuring responsible people benefit from new legislation.", "He does not agree with those who object to the plans and believes work is needed by police, local authorities, and drinks industry before widespread adoption.", "PM Tony Blair defends the Licensing Act, saying it's wrong to deny people relaxed hours enjoyed elsewhere due to a \"tiny minority\" of violent binge drinkers.", "A six-month transitional period begins on 7 February during which venues can apply for extended licenses; Conservatives want 24-hour drinking delayed until problems with binge drinking are solved."], "granite3.1-dense:2b": ["Norfolk Police Chief Andy Hayman supports the implementation of 24-hour drinking, emphasizing the responsibility of law enforcement to enable a positive outcome from this change.", "He disagrees with some senior police officers and UK's top policeman, Sir John Stevens, who oppose the plan due to the binge drinking epidemic.", "Hayman believes that with proper preparations by police, local authorities, and the drinks industry, Norwich can become a thriving nightlife destination without exacerbating binge drinking issues.", "He acknowledges existing problems but remains confident in addressing them during a six-month transitional period starting February 7.", "Prime Minister Tony Blair defends the Licensing Act, arguing that denying relaxed hours is unfair to the majority of people who favor this lifestyle change.", "The Liberal Democrats and Conservatives have called for a delay in implementing 24-hour drinking until binge drinking concerns are resolved."]}