{"raw_text": "New foot and mouth action urged\n \n A senior Tory MP has criticised agriculture department Defra's \"lackadaisical\" approach to planning for a future foot and mouth outbreak.\n \n Public accounts committee chairman Edward Leigh was giving his reaction to a report by a government watchdog on lessons to be learnt from the crisis. The National Audit Office said Defra had improved its capacity to deal with future livestock disease outbreaks. But Mr Leigh said the department was \"dragging its heels\".\n \n That comment referred to the setting up of a scheme to share any future compensation costs with industry. He also said Defra had been \"dreadfully slow\" in paying some of its bills dating from the foot and mouth crisis.\n \n The outbreak, which began in 2001, led to the slaughter of 6.5 million animals, devastated many farms and rural businesses, and is estimated to have cost the UK up to £8bn. \"Four years after the outbreak, Defra is yet to begin its planned review of some of its contractors' costs, and £40m of invoices remain unpaid,\" Mr Leigh said. Mr Leigh also pointed out that the introduction of an IT system to help control future outbreaks had been delayed. In November it emerged European Commission compensation amounted to just over a third of the money the UK government had hoped to get as reimbursement for the billions lost through the foot and mouth crisis.\n \n Ministers had hoped to get £900m from the European Union Vet Fund to help with animal slaughter and other costs but in the end was granted £349m. That was because the UK had valued the culled animals at between \"two and three times\" the commission's assessment of their likely market value. National Audit Office chief Sir John Bourn said a new compensation scheme was now being looked at. On the issue of the unpaid invoices, Sir John said Defra had paid 97% of the £1.3bn submitted by contractors since 2001, \"but has not agreed a final settlement with 57 contractors pending the results of its investigations\".\n \n Mr Leigh said being \"better prepared\" would also help avoid the need for \"mass funeral pyres which provided an unsettling images of the 2001 outbreak\". A Defra spokesman said: \"We welcome the report. It acknowledges the progress the department has made since 2001 - particularly on contingency planning and our improved capacity and preparedness for combating another major disease outbreak. \"However, the department is aware that there are some areas requiring further work and we are working to resolve them as soon as is practicable.\"\n", "llama3.2:1b": ["A senior Tory MP, Edward Leigh, criticized Defra's lackadaisical approach to planning for a future foot and mouth outbreak.", "The National Audit Office report found that Defra had improved its capacity, but was \"dragging its heels\" on sharing compensation costs with industry.", "Leigh also pointed out delays in paying bills dating back four years and the delayed introduction of an IT system to control outbreaks.", "A new compensation scheme is now being considered."], "llama3.2:3b": ["A senior Tory MP criticized Defra's approach to planning for future foot and mouth outbreaks, calling it \"lackadaisical\", and highlighting delays in paying contractors' bills and introducing an IT system.", "The National Audit Office report noted progress but identified areas requiring further work, including a new compensation scheme and resolving outstanding invoices."], "gemma2:2b": ["A senior Tory MP criticizes Defra's slow response to planning for a future foot and mouth outbreak.", "He highlights their delayed payments to contractors, lack of progress on reviewing costs, and the delay in implementing an IT system for disease control.", "While acknowledging improvements since 2001, he urges swift action to prevent similar disaster in the future."], "qwen2.5:0.5b": ["A senior Tory MP criticizes Defra's inadequate response to a planned future foot and mouth outbreak, while the government has promised new compensation plans for farmers."], "qwen2.5:1.5b": ["A senior Conservative MP criticized Defra's slow response to future foot-and-mouth disease plans following a report on lessons learned from the 2001 outbreak.", "Leigh called for improved compensation schemes, delayed IT system implementation, and unpaid invoices totaling £40m.", "The National Audit Office noted Defra had improved its ability to deal with livestock diseases but was criticized for dragging its feet in implementing future contingency planning and paying outstanding bills."], "qwen2.5:3b": ["A senior Tory MP criticizes Defra's slow response to future foot and mouth outbreaks and unpaid invoices from the 2001 crisis.", "The Public Accounts Committee chairman, Edward Leigh, highlights issues such as a delayed IT system for disease control, failure to review contractor costs since the outbreak, and insufficient EU compensation.", "Sir John Bourn of the National Audit Office notes that Defra has paid 97% of submitted invoices but has not settled with 57 contractors pending investigations.", "The UK government received only £349m from Vet Fund for animal slaughter costs instead of hoped-for £900m, partly due to overvaluation by the UK.", "Mr Leigh calls for better preparedness to avoid mass animal slaughters like those seen in 2001.", "Defra agrees with progress but acknowledges areas needing improvement."], "opencoder:1.5b": ["This text does not contain key ideas or details required in a summarization task.", "The only information contained within the text is the comment made by a senior Tory MP, which seems to be about Defra's approach to managing an outbreak of cattle disease.", "However, it is important to understand that these comments do not provide additional context or information related to the situation at hand."], "smollm:1.7b": ["The summary should be:\nNew foot and mouth action urged\nA senior Tory MP has criticized agriculture department Defra's \"lackadaisical\" approach to planning for a future foot and mouth outbreak.", "Public accounts committee chairman Edward Leigh was giving his reaction to a report by a government watchdog on lessons to be learnt from the crisis.", "The National Audit Office said Defra had improved its capacity to deal with future livestock disease outbreaks.", "But Mr Leigh said the department was \"dragging its heels\".", "That comment referred to the setting up of a scheme to share any future compensation costs with industry.", "He also said Defra had been \"dreadfully slow\" in paying some of its bills dating from the foot and mouth crisis.", "The outbreak, which began in 2001, led to the slaughter of 6.5 million animals, devastated many farms and rural businesses, and is estimated to have cost the UK up to £8bn.", "\"Four years after the outbreak, Defra is yet to begin its planned review of some of its contractors' costs,\" Mr Leigh said.", "Mr Leigh also pointed out that the introduction of an IT system to help control future outbreaks had been delayed.", "In November it emerged European Commission compensation amounting to just over a third of the money the UK government had hoped to get as reimbursement for the billions lost through the foot and mouth crisis.", "That was because the UK had valued the culled animals at between \"two and three times\" the commission's assessment of their likely market value.", "National Audit Office chief Sir John Bourn said a new compensation scheme is now being looked at.", "On the issue of the unpaid invoices, Mr Leigh said Defra has paid 97% of the £1.3bn submitted by contractors since 2001 - but has not agreed a final settlement with 57 contractors pending the results of its investigations.", "Mr Leigh said being \"better prepared\" would also help avoid the need for \"mass funeral pyres which provided an unsettling images of the 2001 outbreak\".", "A Defra spokesman said: \"We welcome the report.", "It acknowledges the progress the department has made since 2001 - particularly on contingency planning and our improved capacity and preparedness for combating another major disease outbreak.", "\"However, the department is aware that there are some areas requiring further work and we are working to resolve them as soon as is practicable.\""], "deepseek-r1:1.5b": ["The senior Tory MP criticized Defra's lackadaisical approach to future foot and mouth outbreak planning, noting delays in paying some bills and unresolved unpaid invoices totaling £1.3 billion since 2001.", "He highlighted that despite progress in contingency planning and improved preparedness, there are still areas needing further work, aiming to avoid \"mass funeral pyres.\"", "The UK government seeks reimbursement through the EU Vet Fund, but costs were underestimated due to price adjustments."], "tinyllama:1.1b": ["According to a senior Torr MP, Defra's lackadaisical approach to planning for a future foot-and-mouth outbreak has resulted in the department dragging its heels and delaying payments for up to £40 million of unpaid invoices.", "The National Audit Office (NAO) report also highlighted concerns over the department's ability to prepare for similar events and provided a timeline for a new compensation scheme, which was first proposed during the foot-and-mouth crisis.", "Addressing questions from the media, the Defra spokesperson said they were \"better prepared\" after the 2001 outbreak but acknowledged that images of funeral pyres provided an unsettling image and warned against mass funeral pyres in future.", "The department is aware of areas requiring further work and has plans to resolve them as soon as possible, according to Defra's speaker."], "tinydolphin:1.1b": [" The National Audit Office has reported that the UK government's contingency plans for a future foot-and-mouth (F&M) outbreak were inadequate.", "The report criticizes Defra, the agriculture department, for dragging its feet when it comes to sharing costs with industry following the 2001 crisis.", "The spokesman for Defra stated that they are committed to improving their preparedness for future outbreaks and further refining their contingency plans."], "phi:2.7b": [" The text discusses criticism of Defra's response to a potential foot and mouth outbreak, with concerns about their slow payment of bills from the crisis and delayed introduction of an IT system.", "However, it also acknowledges that they have made improvements in contingency planning and preparedness for future disease outbreaks.", "The summary is: \nTory MP criticises Defra's response to a potential foot and mouth outbreak, particularly their slow payment of bills and delayed introduction of an IT system, but acknowledges progress in contingency planning."], "orca-mini:3b": [" A senior Tory MP criticized Defra's \"lackadaisical\" approach to planning for a future foot and mouth outbreak, while acknowledging the department's improved capacity to deal with livestock disease outbreaks.", "However, the MP also noted that Defra was \"dreadfully slow\" in paying some of its bills dating from the 2001 outbreak and had been \"dreadfully slow\" in introducing an IT system to help control future outbreaks.", "The European Commission had granted £349m to the UK government as reimbursement for the billions lost through the foot and mouth crisis, but the UK had valued the culled animals at between \"two and three times\" their market value, and a new compensation scheme was now being looked at.", "Ministers had hoped to get £900m from the Vet Fund to help with animal slaughter and other costs, but only £349m had been granted and a final settlement with 57 contractors was pending investigation."], "hermes3:3b": ["Foot and mouth report criticizes Defra's lackadaisical approach, slow payments, and IT system delays regarding future outbreak preparation."], "stablelm-zephyr:3b": ["A senior Tory MP criticized Defra's \"lackadaisical\" approach to planning for future foot and mouth outbreaks.", "Public Accounts Committee chairman Edward Leigh mentioned the setting up of a scheme to share compensation costs with industry, Defra's slow progress in paying outstanding bills from the 2001 outbreak, and the delayed introduction of an IT system to control future outbreaks.", "The National Audit Office reported that Defra had improved its capacity for dealing with livestock disease outbreaks but acknowledged areas requiring further work."], "chatgpt-4o-latest": ["Senior Tory MP Edward Leigh criticized Defra for its slow response in preparing for future foot and mouth outbreaks, despite improvements noted by the National Audit Office.", "He highlighted delays in setting up a compensation-sharing scheme, unpaid crisis-related bills, and a postponed IT system for outbreak control.", "The 2001 outbreak led to the slaughter of 6.5 million animals and cost the UK up to £8bn.", "The UK received only £349m in EU compensation, far less than the £900m expected.", "Defra acknowledged progress but admitted further work was needed."], "stablelm2:1.6b": ["A senior Tory MP criticizes Defra's lackadaisical approach towards planning for a future foot and mouth outbreak.", "Despite improvements in capacity, Defra has been criticized for being \"dreadfully slow\" in paying bills and not implementing the planned review of contractor costs.", "The report also noted that an IT system to help control outbreaks was delayed.", "European Commission compensation amounted to only 30% of the UK government's hoped-for reimbursement from the EU Vet Fund.", "A new compensation scheme is now being considered for unpaid invoices, while better preparedness would help avoid mass funeral scenarios during future outbreaks."], "granite3.1-dense:2b": ["Senior Tory MP Edward Leigh criticized Defra's slow response in addressing future foot and mouth compensation costs and unpaid bills from the 2001 outbreak.", "The crisis, which resulted in the slaughter of 6.5 million animals and an estimated £8bn cost to the UK, is still impacting Defra's ability to conduct a planned review of contractors' costs and pay outstanding £40m invoices.", "Leigh also noted that the department had delayed introducing an IT system for outbreak control and received only about a third of the expected reimbursement from the European Union Vet Fund due to overvaluing culled animals.", "Despite these issues, Defra acknowledged progress in contingency planning and improved capacity for future disease management.", "The department is working to resolve remaining challenges as quickly as possible."]}