{"raw_text": "Tutu's Guantanamo release call\n \n Archbishop Desmond Tutu has called for the release of the remaining inmates at Guantanamo Bay and terror suspects detained without trial in the UK.\n \n His comments follow news that all four Britons held by the US in the Cuban camp will be freed within weeks. The South African archbishop said detentions without trial were \"unacceptable\" and \"distressing\". Twelve foreign nationals are being held indefinitely without trial in the UK under anti-terror laws. Referring to the detentions in Cuba, Archbishop Tutu told BBC News: \"It is utterly unacceptable. \"The rule of law is in order to ensure that those who have power don't use their power arbitrarily and every person retains their human rights until you have proven conclusively that so-and-so is in fact guilty.\"\n \n Moazzam Begg, from Birmingham, and Martin Mubanga, Richard Belmar and Feroz Abbasi, from London, have been held by the US at Guantanamo Bay for almost three years. On Tuesday Foreign Secretary Jack Straw told the Commons that the US had agreed to release the four after \"intensive and complex discussions\" over security. The Britons were detained as part of the US-led \"war on terror\". The archbishop added: \"Whilst we are saying thank you that these have been released, what is happening to those left behind? \"We in South Africa used to have a dispensation that detained people without trial and the world quite rightly condemned that as unacceptable.\n \n \"Now if it was unacceptable then how come it can be acceptable to Britain and the United States. It is so, so deeply distressing.\" Following Mr Straw's announcement, lawyer Louise Christian, who represents Mr Abbasi and Mr Mubanga, said the government should have acted sooner. Foreign nationals detained in the UK are being held at Belmarsh and Woodhill prisons. In December the House of Lords, the UK's highest court, ruled that the anti-terror measures broke human rights laws. But the men are still behind bars.\n \n Archbishop Tutu criticised the measures, saying: \"I am opposed to any arbitrary detention that is happening, even in Britain.\" Shami Chakrabarti, director of civil rights group Liberty, has called on the government to \"practise what it preaches\" and either free or charge the detained men. But the Home Office defended the measures. A spokesman said: \"These individuals cannot currently be prosecuted because some evidence, such as that provided by third parties, cannot safely be disclosed in criminal proceedings without putting others at risk. \"It is also currently the case that intelligence gained from covert intercepts cannot be used in a court of law.\"\n", "llama3.2:1b": ["Archbishop Desmond Tutu has called for the release of Guantanamo Bay detainees held by the US in the UK, citing their detention as \"unacceptable\" and \"distressing\".", "The archbishop was joined by others who had been detained without trial, including 12 foreign nationals.", "Foreign Secretary Jack Straw said he had agreed to release them after \"intensive and complex discussions\", but Archbishop Tutu questioned whether it was acceptable for the UK government to detain people without trial while the US still held those in Guantanamo Bay."], "llama3.2:3b": ["Archbishop Desmond Tutu has called for the release of Guantanamo Bay detainees and those held without trial in the UK, criticizing detentions as \"unacceptable\" and \"distressing\".", "The US will release four British detainees, while 12 foreign nationals remain in UK prisons under anti-terror laws."], "gemma2:2b": ["Archbishop Desmond Tutu calls for the release of all detainees held indefinitely without trial at Guantanamo Bay and in the UK, arguing that arbitrary detention violates human rights.", "The Archbishop criticizes Britain's continued detention of foreign nationals under anti-terror laws despite a House of Lords ruling that these measures violate human rights.", "The Home Office defends the measures, citing concerns about evidence safety and the limitations of using intelligence gained through covert intercepts in court."], "qwen2.5:0.5b": ["Archbishop Desmond Tutu calls for the release of four British men and foreign nationals detained by the US under anti-terror laws, emphasizing human rights and the rule of law.", "He criticizes the US' decision to release them after intensive discussions with the government.", "However, some argue that this is acceptable given the circumstances and a dispensation previously granted to detained individuals in the UK."], "qwen2.5:1.5b": ["Archbishop Desmond Tutu calls for Guantanamo Bay inmates and UK terror suspects to be released as unacceptable detentions without trial persist, emphasizing rule of law rights and criticizing Britain's stance on similar practices."], "qwen2.5:3b": ["Archbishop Desmond Tutu has called for the release of Guantanamo Bay detainees and UK terror suspects held without trial.", "All four Britons detained by the US at Guantanamo Bay will soon be freed, following \"intensive and complex discussions\" over security.", "Tutu describes detentions as \"unacceptable\" and violates the rule of law, citing South Africa's past practice which led to global condemnation.", "He questions why Britain and America can tolerate such practices while South Africa cannot.", "The UK government has defended its detention measures, claiming evidence risks endangering others if disclosed in criminal proceedings, and intelligence from covert intercepts is not admissible in court.", "Tutu opposes arbitrary detention and calls for the release or charges of those held indefinitely without trial."], "opencoder:1.5b": ["Tutu's Guantanamo release call: \n\nArchbishop Desmond Tutu has called for the release of the remaining inmates at Guantanamo Bay and Terror suspects detained without trial in the UK.", "His comments follow news that all four Britons held by the US in the Cuban camp will be freed within weeks.", "The South African archbishop said detentions without trial were \"unacceptable\" and \"distressing\".", "Twelve foreign nationals are being held indefinitely without trial in the UK under anti-terror laws.", "Referring to the detentions in Cuba, Archbishop Tutu told BBC News: \"It is utterly unacceptable.", "The rule of law is in order to ensure that those who have power don't use their power arbitrarily and every person retains their human rights until you have proved conclusively that so-and-so is in fact guilty.\"", "Following Mr Straw's announcement, lawyer Louise Christian, who represents Mr Abbasi and Mr Mubanga, said the government should have acted sooner.", "Foreign nationals detained in the UK are being held at Belmarsh and Woodhill prisons."], "smollm:1.7b": ["The summary should include the following key points:\n\n1.", "The release of the remaining inmates at Guantanamo Bay, including four Britons detained without trial.", "2.", "Archbishop Desmond Tutu's call for the release of the remaining inmates at Guantanamo Bay and terror suspects detained without trial in the UK.", "3.", "His comments follow news that all four Britons held by the US in the Cuban camp will be freed within weeks.", "4.", "Referring to the detentions in Cuba, Archbishop Tutu said detentions without trial were \"unacceptable\" and \"distressing\".", "5.", "Twelve foreign nationals are being held indefinitely without trial in the UK under anti-terror laws.", "6.", "The archbishop added that the detention of the four Britons was unacceptable and disturbing.", "7.", "Referring to the detention of the remaining 12 foreigners, Archbishop Tutu said: \"Whilst we are saying thank you that these have been released, what is happening to those left behind?", "\"We in South Africa used to have a dispensation that detained people without trial and the world quite rightly condemned that as unacceptable.", "8.", "The archbishop added that the UK government should have acted sooner.", "9.", "Referring to the detainees, Archbishop Tutu said: \"I am opposed to any arbitrary detention that is happening, even in Britain.\"", "10.", "Shami Chakrabarti, director of civil rights group Liberty, has called on the government to \"practice what it preaches\" and either free or charge the detained men.", "11.", "But the Home Office defended the measures, saying: \"These individuals cannot currently be prosecuted because some evidence, such as that provided by third parties, cannot safely be disclosed in criminal proceedings without putting others at risk.\""], "deepseek-r1:1.5b": ["Archbishop Desmond Tutu called for the release of remaining prisoners at Guantanamo Bay and the indefinite detention of individuals without trial in the UK, noting that these actions are unacceptable and distressing due to human rights violations.", "The British government agreed to release the four Cuban detenees after extensive discussions over security, while the US-led \"war on terror\" includes them in its forces.", "Tutu criticized these measures for being against justice, emphasizing the need for human rights safeguards."], "tinyllama:1.1b": ["The following text is a summary of the article titled \"Archbishop calls for Guantanamo Bay release, terror suspect detentions to end,\" published on BBC News.", "The article states that Archbishop Desmond TuTu has called for the releases of four Britons held in the US and terror suspects detained without trial in the UK under anti-terror laws.", "The archbishop claims that the detention measures are \"unacceptable\" and \"distressing,\" as well as violating human rights laws.", "He suggests the government should act sooner to free or charge the detained men, stating that liberties should be practiced.", "Meanwhile, Home Office officials state that some evidence cannot safely be disclosed in criminal proceedings and intelligence gained from covert intercepts cannot be used in a court of law."], "tinydolphin:1.1b": [" Tutu's Guantanamo release call: Archbishop Desmond Tutu calls for the release of the remaining inmates and terror suspects detained without trial in the UK.", "The four Britons held by the US will be freed within weeks after the South African archbishop referred to detentions as \"unacceptable.\""], "phi:2.7b": [" Archbishop Desmond Tutu called for the release of detainees held without trial in Guantanamo Bay and the UK.", "12 foreign nationals are being held indefinitely in the UK under anti-terror laws, which the archbishop described as unacceptable.", "The four Britons detained by the US will soon be released after discussions with the Foreign Secretary, but Archbishop Tutu expressed concern over those still detained.", "He criticized arbitrary detention and called for Britain to follow the same rules it condemns in others."], "orca-mini:3b": [" Archbishop Desmond Tutu has called for the release of the remaining inmates at Guantanamo Bay and terror suspects detained without trial in the UK, following news that all four Britons held by the US will be freed within weeks.", "The archbishop expressed concern over detentions without trial and criticized the use of anti-terror laws as \"unacceptable\".", "He added that the government should have acted sooner to release foreign nationals held in the UK, calling detention a \"distressing\" experience for those held indefinitely without trial.", "Shami Chakrabarti, director of civil rights group Liberty, has called for the detained men to be freed or charged, and the Home Office defended the measures, saying some evidence cannot be used in court due to safety concerns."], "hermes3:3b": ["Desmond Tutu calls for release of Guantanamo inmates and UK terror suspects held without trial."], "stablelm-zephyr:3b": ["Archbishop Desmond Tutu called for the release of remaining detainees at Guantanamo Bay and terror suspects detained without trial in the UK, following news that all four Britons held in the camp will be freed within weeks.", "He stated that detentions without trial are \"unacceptable\" and \"distressing,\" adding that it is so deeply distressing because countries like Britain and the United States have been condemned for similar practices in the past.", "Twelve foreign nationals are being held indefinitely without trial in the UK under anti-terror laws, despite December's ruling by the House of Lords that these measures broke human rights laws.", "Tutu criticized these arbitrary detentions and called on governments to either free or charge detained individuals, while the Home Office defended the measures citing safety concerns and limitations on using intelligence gathered from covert intercepts in court proceedings."], "chatgpt-4o-latest": ["Archbishop Desmond Tutu has called for the release of Guantanamo Bay detainees and terror suspects held without trial in the UK, condemning such detentions as \"unacceptable\" and \"distressing.\"", "His remarks follow the announcement that four Britons held at Guantanamo for nearly three years—Moazzam Begg, Martin Mubanga, Richard Belmar, and Feroz Abbasi—will be released after discussions between the UK and US.", "Tutu criticized the UK and US for practices similar to those once condemned in apartheid-era South Africa.", "Despite a UK court ruling that anti-terror detentions violate human rights, foreign nationals remain imprisoned.", "Civil rights advocates, including Shami Chakrabarti, urge the UK government to either charge or release the detainees, while the Home Office defends the measures, citing security concerns."], "stablelm2:1.6b": ["Archbishop Desmond Tutu calls for the release of remaining inmates at Guantanamo Bay and UK terror suspects held without trial.", "He condemns detentions as \"unacceptable\" and \"distressing,\" noting that foreign nationals in the UK are being detained under anti-terror laws.", "Four Britons detained by the US in Cuba will be released within weeks, but Archbishop Tutu questions what happens to those left behind.", "Lawyers criticize government's handling of anti-terror measures, with civil rights group Liberty urging them to practice what they preach.", "The Home Office defends the measures as necessary for national security and safety concerns."], "granite3.1-dense:2b": ["Archbishop Desmond Tutu has urged for the release of the remaining detainees, both at Guantanamo Bay and those held indefinitely without trial in the UK under anti-terror laws.", "He described such detentions as \"unacceptable\" and \"distressing,\" emphasizing that they violate the rule of law and human rights.", "Tutu highlighted that the rule of law exists to prevent arbitrary use of power, ensuring individuals retain their rights until proven guilty.", "The UK's Foreign Secretary announced that four British detainees—Moazzam Begg, Martin Mubanga, Richard Belmar, and Feroz Abbasi—would soon be released from Guantanamo Bay after extensive discussions with the US over security concerns.", "These men had been detained for nearly three years as part of the \"war on terror.\"", "Tutu expressed deep concern about those still held in the UK, criticizing arbitrary detention and calling on Britain to uphold its commitment to human rights, which it once denounced.", "Lawyer Louise Christian echoed this view, stating that the government should have acted sooner to free or charge these detainees.", "Shami Chakrabarti of Liberty advocated for either releasing or charging the detained men, while the Home Office defended the measures, citing risks to safety and the inadmissibility of certain evidence in court proceedings.", "The House of Lords had previously ruled that the anti-terror measures broke human rights laws, but these detainees remain imprisoned."]}