{"raw_text": "Gurkhas to help tsunami victims\n \n Britain has offered to send a company of 120 Gurkhas to assist with the tsunami relief effort in Indonesia, Downing Street said.\n \n The deployment would involve troops from the 2nd Battalion Royal Gurkha Rifles, based in Brunei. Discussions have begun with Indonesia on the exact timing and location of the deployment, but the government said the offer was aimed at the Aceh province. Downing St said a similar offer might be made to the Sri Lankan government.\n \n However a spokesman pointed out that there were particular logistical difficulties in Indonesia which the Gurkhas might be able to help with. The spokesman said: \"Following this morning's daily coordination meeting on the post-tsunami relief effort, the government has formally offered the Indonesian government the assistance of a company of British Army Gurkhas from 2nd Battalion Royal Gurkha Rifles around 120 personnel and two helicopters. \"This is in addition to the ships and aircraft we have already committed to the relief operation in the Indian Ocean.\"\n \n Indonesia was by far the country worst affected by the tsunami, with 94,000 of the 140,000 confirmed deaths so far. International Development Minister Gareth Thomas said the assistance offer would most likely focus on the northern province of Aceh. \"We have offered the Gurkhas to help in the process of scaling up the relief effort, particularly in Aceh which is undoubtedly the hardest hit area in the Indian Ocean at the moment,\" he said. \"We've also had RAF aircraft flying in equipment which the UN desperately need in order to set up a truly effective relief operation on the ground in Aceh province as well.\" The offer comes as the Foreign Secretary Jack Straw arrives in Indonesia for a special summit meeting on the disaster.\n", "llama3.2:1b": ["Britain offers to send 120 Gurkhas to assist with tsunami relief efforts in Indonesia, aimed at the Aceh province.", "A similar offer might be made to Sri Lanka.", "British Army Gurkhas would help with logistics and potentially provide two helicopters.", "The offer comes as Foreign Secretary Jack Straw visits Indonesia for a summit meeting on the disaster."], "llama3.2:3b": ["Britain offers 120 Gurkhas from 2nd Battalion Royal Gurkha Rifles to help tsunami victims in Indonesia, particularly in Aceh province, with discussions on exact timing and location underway."], "gemma2:2b": ["Britain will send a company of 120 Gurkhas to assist with tsunami relief efforts in Indonesia, specifically Aceh province.", "This offer includes troops and two helicopters.", "A similar offer may be made to Sri Lanka.", "The deployment aims to help address logistical challenges faced by Indonesian authorities following the disaster."], "qwen2.5:0.5b": ["Britain offers to send Gurkhas to assist with tsunami relief."], "qwen2.5:1.5b": ["Gurkhas offered by Britain to help tsunami victims in Indonesia, including 120 troops and two helicopters, aiming primarily at Aceh province.", "Offer follows initial commitment of ships and aircraft already deployed elsewhere.", "Rescue effort focuses on northern Aceh hardest hit.", "Offers aim to scale up relief efforts with RAF equipment urgently needed in the area."], "qwen2.5:3b": ["Britain has offered to send 120 Gurkhas from the 2nd Battalion Royal Gurkha Rifles, based in Brunei, to assist with tsunami relief efforts in Indonesia, particularly focusing on Aceh province where they may be able to help with logistical difficulties.", "This offer comes alongside commitments of ships and aircraft for the relief operation.", "The International Development Minister Gareth Thomas mentioned that the focus would most likely be on Aceh due to its severity of impact.", "Foreign Secretary Jack Straw is arriving in Indonesia for a summit meeting to discuss the disaster."], "opencoder:1.5b": ["Gurkhas, a company aiming to aid in tsunami relief efforts, has offered to assist tsunami victims in deploying 120 British Army Gurkhas from the 2nd Battalion Royal Gurkha Rifles in the area of Brunei that was hit by the recent tsunamis.", "The Indonesia-based Sri Lanka government also has made an offer for assistance.", "However, it's important to note that there were logistical challenges faced by Indonesia and that's a significant part of their current situation."], "smollm:1.7b": ["The summary is concise and objective, preserving key ideas and details while omitting unnecessary information.", "It provides an overview of the UK's offer to send Gurkhas to assist with tsunami relief efforts in Indonesia, highlighting the specific logistical challenges faced by the Gurkhas and their potential role in supporting the relief effort."], "deepseek-r1:1.5b": ["The UK has offered a company of 120 Gurkhas from the 2nd Battalion Royal Gurkha Rifles in Brunei to assist in helping to alleviate the disaster relief efforts in Indonesia following the tsunami.", "The deployment targets Aceh province, which is particularly challenging due to its location and the logistical difficulties faced by the government.", "The offer also applies to other countries like Sri Lanka, with a similar support plan.", "International Development Minister Gareth Thomas highlighted the potential focus on Aceh province as part of their aid effort in that region."], "tinyllama:1.1b": ["Britain has offered to send a company of 120 Gurkhas to assist with the tsunaami relief effort in Indonesia, according to Downing Street.", "The deployment would involve troops from the 2nd Battalion Royal Guurkhas based in Brunei.", "The offer was aimed at Acah province and included helicopters and ships, but specific logistical difficulties in Indonesia were also noted by a spokesperson.", "The company will assist with scaling up the relief effort and will focus on Acah province, which is currently under heavy damage."], "tinydolphin:1.1b": [" The British government has offered to send a company of Gurkhas to assist with tsunami relief efforts in Indonesia, Downing Street said.", "This deployment would involve troops from the 2nd Battalion Royal Gurkha Rifles and is aimed at Aceh province, where the destruction caused by the earthquake and tsunami is particularly severe.", "The spokesman pointed out that logistical difficulties make it difficult to send the Gurkhas directly to Aceh, but a solution might involve sending them through Brunei first, and then flying them to Indonesia once they have arrived in the affected area.", "This move would not only provide aid to those affected by the disaster but also demonstrate the British government's commitment to humanitarian efforts abroad."], "phi:2.7b": [" Britain has offered 120 Gurkhas from 2nd Battalion Royal Gurkha Rifles to assist with tsunami relief efforts in Indonesia, particularly in Aceh province.", "They are being deployed along with ships and aircraft.", "This offer is also likely to be made to the Sri Lankan government.", "The logistical difficulties in Indonesia may require additional help from the Gurkhas."], "orca-mini:3b": [" Britain has offered Indonesia the assistance of a company of 120 Gurkhas from the 2nd Battalion Royal Gurkha Rifles, which would involve troops from the Brunei-based 2nd Battalion Royal Gurkha Rifles, to help with tsunami relief efforts in Aceh province.", "The offer includes two helicopters and ships to support the relief operation in the Indian Ocean.", "However, logistical difficulties in Indonesia could make it difficult for the Gurkhas to contribute much to the relief effort.", "The government has also committed to sending a team of aid workers and medical staff from the International Committee of the Red Cross (ICRC)."], "hermes3:3b": ["Gurkha battalion offered to help tsunami victims in Aceh province, Indonesia."], "stablelm-zephyr:3b": ["Britain offered to send 120 Gurkhas from the 2nd Battalion Royal Gurkha Rifles in Brunei to assist with tsunami relief efforts in Aceh province, Indonesia.", "Discussions are ongoing regarding the deployment timing and location.", "This offer is in addition to ships and aircraft previously committed to the relief operation.", "The Gurkhas could help with logistical difficulties in Indonesia.", "International Development Minister Gareth Thomas mentioned that the assistance would most likely focus on the northern province of Aceh, which has been hit hard by the tsunami."], "chatgpt-4o-latest": ["Britain has offered to send 120 Gurkhas from the 2nd Battalion Royal Gurkha Rifles, based in Brunei, to assist with tsunami relief efforts in Indonesia, particularly in Aceh province.", "Discussions are ongoing regarding the timing and location of their deployment.", "The offer includes two helicopters and is in addition to ships and aircraft already committed.", "A similar offer may be made to Sri Lanka.", "Indonesia, the worst-hit country with 94,000 of 140,000 confirmed deaths, faces logistical challenges that the Gurkhas could help address.", "International Development Minister Gareth Thomas emphasized the focus on scaling up relief in Aceh, while Foreign Secretary Jack Straw has arrived in Indonesia for a summit on the disaster."], "stablelm2:1.6b": ["The UK government has offered a company of 2nd Battalion Royal Gurkha Rifles soldiers and two helicopters to assist with tsunami relief efforts in Indonesia, specifically focusing on Aceh province.", "This is part of a potential similar offer to be made to the Sri Lankan government, but logistical considerations may prevent full deployment.", "The assistance would focus on helping with logistics and scaling up the relief effort in Aceh, where the majority of deaths have occurred."], "granite3.1-dense:2b": ["Britain has proposed sending approximately 120 Gurkhas from the 2nd Battalion Royal Gurkha Rifles to support Indonesia's tsunami relief efforts, primarily in the Aceh province.", "This deployment aims to address logistical challenges faced by Indonesian forces.", "The government has also offered two helicopters for this task.", "The offer extends to potentially aiding Sri Lankan relief efforts as well.", "The assistance will help scale up the relief operation, focusing on Aceh, which is the area most devastated by the tsunami with 94,000 of the total confirmed deaths of 140,000. International Development Minister Gareth Thomas emphasized that this support would assist in setting up a robust UN-led relief operation in Aceh.", "The Foreign Secretary, Jack Straw, was scheduled to attend a special summit in Indonesia regarding the disaster."]}