{"raw_text": "Thousands join strike in Wales\n \n Thousands of civil servants were on strike across Wales on Friday in protest at planned job cuts.\n \n A range of services in Wales were affected as civil servants in Wales joined the UK-wide strike. The strike, called by the Public and Commercial Services Union, was the biggest by civil servants in a decade. The action follows Chancellor Gordon Brown's announcement in July that 104,000 jobs would be cut, with around 6,000 of those expected in Wales. The worst-affected area in Wales will be the Department of Work and Pensions where 2,000 jobs are threatened. Across Wales, pickets were held by striking civil servants with protests in towns and cities including Cardiff, Bangor, Aberystwyth and Wrexham. Gordon Brown issued a defiant statement about the strike, saying the action would not affect the government's \"determination\" to make savings in order to increase investment in healthcare, education, transport and the fight against crime. \"Our decisions mean more police, more teachers, more doctors and more nurses,\" he said. \"We will provide help with information, relocation and retraining to help staff move into frontline work within the public sector, but we will not be diverted from these necessary changes so that we can make this essential investment.\" The UK-wide action hit Jobcentres, benefit agencies, pensions offices and driving test centres. The strike also affected the Welsh assembly building in Cardiff Bay, where only pass-holders were allowed in.\n \n Pickets were in place across Wales, with protests around the country. PCS Union spokesman Jeff Evans said: \"In Wales the civil service is major employer, there are more civil servants employed in Wales proportionately than in any other part of the country. \"Our protest is about defending jobs and also local services across the country. \"Parts of Objective One areas and Welsh-speaking areas will be particularly affected by these cuts.\" The chancellor has said that the cuts will allow funding for more teachers and police. Piers Freelove is senior benefit officer on the picket line at Companies House, in Cardiff. He said: \"The majority of people have decided not to come in because of the threat to their jobs. \"I joined the civil service to provide services as well as get a decent pension, as we thought, and pay, and it's those services that are being threatened as well as our jobs. \"People like pensioners need a face-to-face service not an impersonal service on the phone which is what they want to impose.\" PCSU deputy general secretary Hugh Lanning, who was on the same picket line, said: \"We're asking for them to negotiate not just to make announcements. \"There's a sensible way to do things and at the moment they're not even talking about how to go about it sensibly.\" \"The ballot was for one day's action. No further action is anticipated without a further ballot of staff.\" The Welsh Assembly Government said: \"This is a strike about national civil service issues. It is not about specific issues local to Wales or the assembly.\n", "llama3.2:1b": ["Thousands of civil servants joined a UK-wide strike in response to planned job cuts announced by Chancellor Gordon Brown, with around 6,000 expected in Wales.", "The strike affected various services including Jobcentres, benefit agencies, and pensions offices across Wales, as well as some government buildings.", "Pickets were held in towns and cities including Cardiff, Bangor, Aberystwyth, and Wrexham."], "llama3.2:3b": ["Thousands of civil servants in Wales went on strike against planned job cuts, which are expected to affect 2,000 jobs in the Department of Work and Pensions.", "The strike, called by the Public and Commercial Services Union, followed Chancellor Gordon Brown's announcement that 104,000 jobs would be cut nationwide."], "gemma2:2b": ["Thousands of civil servants in Wales participated in a nationwide strike to protest planned job cuts by Chancellor Gordon Brown.", "The strike, organized by the Public and Commercial Services Union (PCS), significantly affected public services across the country.", "Pickets were held in various locations, including cities like Cardiff, Bangor, Aberystwyth and Wrexham, with concerns about potential job losses, particularly in the Department of Work and Pensions.", "Chancellor Brown insisted that these cuts would allow for increased investment in healthcare, education, transportation, and crime prevention.", "The PCS union expressed a desire to negotiate with the government rather than solely relying on strikes and urged for alternative solutions."], "qwen2.5:0.5b": ["Thousands of civil servants across Wales took part in a 10-day-long strike last Friday, while plans for job cuts in the UK-wide action had already been announced.", "The biggest affected areas were in Cardiff, Bangor, Aberystwyth and Wrexham.", "The strike aimed to stop job losses in essential services such as healthcare, education, transport, and crime fighting.", "The government defended the decision, stating it would not affect investment in public services like police and teachers' salaries.", "Workers at companies headquarters in Cardiff raised concerns about job insecurity, including pensioners.", "A ballot was announced beforehand to decide on the strike's outcome."], "qwen2.5:1.5b": ["Thousands of civil servants in Wales took part in a nationwide strike against planned job cuts, with impacts on various services across the country.", "Gordon Brown defended the government's proposed savings but emphasized that such measures would support healthcare and education improvements.", "The action affected Jobcentres, benefit agencies, pensions offices, driving test centers, and Welsh Assembly buildings while preserving essential public sector roles for civil servants."], "qwen2.5:3b": ["Thousands of civil servants joined a strike in Wales on Friday, protesting planned job cuts announced by Chancellor Gordon Brown.", "The strike was organized by the Public and Commercial Services Union, marking the biggest such action by civil servants in a decade.", "Services across Wales were affected as jobs in areas like Work and Pensions are threatened with up to 6,000 positions cut, including 2,000 in Wales.", "Responding defiantly, Gordon Brown defended government plans for increased investment but not at the cost of job cuts.", "Strikes included pickets at Jobcentres, benefit agencies, pensions offices, and driving test centers across Wales.", "The PCS Union emphasized defending jobs and local services, particularly those affected by cutbacks.", "Civil service employment is higher in Wales than elsewhere, affecting more locals.", "Despite a one-day strike ballot, no further action was anticipated without another vote."], "opencoder:1.5b": ["Thousands join strike in Wales\n\nA range of services in Wales were affected as civil servants in Wales joined the UK-wide strike.", "The strike, called by the Public and Commercial Services Union, was the biggest by civil servants in a decade.", "The worst-affected area in Wales will be the Department of Work and Pensions where 2,000 jobs are threatened.", "Across Wales, pickets were held by striking civil servants with protests in towns and cities including Cardiff, Bangor, Aberystwyth and Wrexham.", "The UK-wide action hit Jobcentres, benefit agencies, pensions offices and driving test centres.", "The strike also affected the Welsh assembly building in Cardiff Bay, where only pass-holders could enter.", "The chancellor has said that the cuts will allow funding for more teachers and police."], "smollm:1.7b": ["The UK-wide strike by civil servants in Wales was a major protest against planned job cuts, with thousands of workers affected across the country.", "The strike was called by the Public and Commercial Services Union (PCSU) and was supported by the Welsh Assembly Government.", "The strike was not just about the specific jobs that were being cut, but also about the overall structure of the public sector in Wales.", "The strike was a response to the government's announcement on July 14th that 104,000 jobs would be cut across the UK, with around 6,000 of those expected in Wales.", "The worst-affected area in Wales is likely to be the Department of Work and Pensions (DWP) where 2,000 jobs are threatened.", "The strike was a major protest against these cuts and was supported by many civil servants across the country."], "deepseek-r1:1.5b": ["Thousands join the UK-wide strike in Wales as civil servants protest planned job cuts.", "The largest strike by civil servants in a decade affects employment services, pensions, work and pensions, driving tests, and Welsh assembly issues.", "Protests worldwide, with significant impact in Wales including Cardiff Bay.", "Government leader Gordon Brown has stated he won't affect the government's savings focus on healthcare, education, transport, or crime prevention.", "The strike threatens 2,000 jobs at Work and Pensions and affects Jobcentres, pensions offices, driving tests, and Welsh assembly buildings where only pass-holders are allowed in.", "Protests worldwide face opposition for wanting face-to-face services while receiving phoned information."], "tinyllama:1.1b": ["In protest at planned job cuts, thousands of civil servants joined a national strike in Wales on Friday, affecting various services across the country.", "A range of services were affected, including Jobcentres, benefit agencies, driving test centers, and local government offices.", "The strike was called by the Public and Commercial Services Union (PCS) Union, with pickets and protests in towns and cities throughout Wales, as well as in Cardiff Bay's assembly building.", "The majority of people who joined the strike were employees, while some were members of the PCS Union who opposed the strikes.", "The strike is expected to affect approximately 6,000 jobs in Wales, with around 2,000 expected to be threatened by cuts to civil servants' employment.", "Chancellor Gordon Brown issued a defiant statement about the strike, stating that it would not affect the government's \"determination\" to make saving investments in healthcare, education, transport, and the fight against crime."], "tinydolphin:1.1b": [" In the UK, thousands of civil servants have joined a major strike in protest at planned job cuts.", "This has affected services across Wales and other parts of the country as well.", "The action has also affected Department of Work and Pensions (DWP), where around 6,000 jobs are expected to be cut."], "phi:2.7b": [" Thousands of civil servants in Wales went on strike to protest against job cuts announced by Chancellor Gordon Brown, which would affect public services and have a significant impact on the Welsh economy.", "The picketing occurred across the country, with a particularly high concentration around Cardiff.", "Despite widespread sympathy for the cause, the union responsible for organizing the strike has not called for further action, indicating that negotiations may have reached an impasse."], "orca-mini:3b": [" Thousands of civil servants across Wales joined a UK-wide strike on Friday, protesting against planned job cuts.", "The strike affected Jobcentres, benefit agencies, pensions offices, and driving test centres, as well as other parts of the Welsh assembly building in Cardiff Bay.", "Pickets were in place across Wales, with protests in towns and cities including Cardiff, Bangor, Aberystwyth, and Wrexham.", "The worst-affected area was the Department of Work and Pensions, where 2,000 jobs are threatened.", "The chancellor has said that the cuts will allow funding for more teachers and police."], "hermes3:3b": ["Thousands of civil servants in Wales strike over job cuts."], "stablelm-zephyr:3b": ["Thousands of civil servants in Wales went on strike against planned job cuts, affecting services across the UK.", "Chancellor Gordon Brown announced 104,000 jobs would be cut, with around 6,000 expected in Wales, particularly at the Department of Work and Pensions where 2,000 jobs are threatened.", "Civil servants in Wales joined the UK-wide strike, causing disruptions at Jobcentres, benefit agencies, pensions offices, driving test centres, and the Welsh assembly building in Cardiff Bay.", "The strike was the biggest by civil servants in a decade, with PCS Union spokesman Jeff Evans emphasizing that the protest was about defending jobs and local services across the country."], "chatgpt-4o-latest": ["Thousands of civil servants across Wales went on strike to protest planned job cuts, part of a UK-wide action organized by the Public and Commercial Services Union.", "The strike, the largest in a decade, followed Chancellor Gordon Brown's announcement of 104,000 job cuts, including 6,000 in Wales, with the Department of Work and Pensions being the hardest hit.", "Pickets and protests took place in cities such as Cardiff, Bangor, Aberystwyth, and Wrexham.", "Brown defended the cuts, stating they were necessary to fund public services like healthcare, education, and policing, and promised support for affected workers.", "The strike disrupted Jobcentres, benefit agencies, pensions offices, and the Welsh Assembly building.", "Union representatives argued the cuts would harm local services and communities, particularly in Welsh-speaking areas.", "While no further action is planned without another ballot, union leaders urged the government to negotiate rather than impose changes unilaterally.", "The Welsh Assembly Government clarified that the strike was a national issue, not specific to Wales."], "stablelm2:1.6b": ["Thousands of civil servants in Wales went on strike as part of the UK-wide strike by the Public and Commercial Services Union, protesting planned job cuts that would impact around 6,0..\n- Chancellor Gordon Brown's announcement in July that jobs would be cut.", "- Strikes affected various services in Wales.", "- Protests took place in towns and cities such as Cardiff, Bangor, Aberystwyth, Wrexham, and the Welsh assembly building.", "- The strike hit job centers, benefit agencies, pensions offices, driving test centers, and other public sector institutions.", "- Strikes also targeted local services across the country and parts of Objective One areas and Welsh-speaking areas.", "- Brown stated that necessary changes would be made to increase investment in healthcare, education, transport, and the fight against crime."], "granite3.1-dense:2b": ["Thousands of civil servants in Wales went on strike on Friday, marking the largest such action in a decade due to planned job cuts announced by Chancellor Gordon Brown in July.", "The government aims to save 104,000 jobs, with approximately 6,000 impacted in Wales, primarily affecting the Department of Work and Pensions (2,000 jobs).", "Strikes affected services including Jobcentres, benefit agencies, pensions offices, driving test centers, and the Welsh assembly building in Cardiff Bay.", "Protests were held in major Welsh cities like Cardiff, Bangor, Aberystwyth, and Wrexham.", "Chief Executive Gordon Brown defended the cuts, asserting they would fund more teachers, police, healthcare professionals, and crime prevention efforts.", "He promised assistance to help affected civil servants transition into frontline public sector roles.", "However, strikers emphasized their concerns about job security and the impact on essential local services, particularly in Objective One areas and Welsh-speaking regions.", "Picket leaders highlighted the threat of automated services replacing face-to-face interactions for vulnerable groups like pensioners.", "The Public and Commercial Services Union (PCS) called for reasoned negotiations rather than announcements, stating no further action would be taken without a staff ballot.", "The Welsh Assembly Government clarified that the strike focused on national civil service matters, not specific local issues or assembly-related concerns."]}