{"raw_text": "Top judge clashes with ministers\n \n The UK's top judge has revealed he has clashed with ministers about how the heads of public inquiries are chosen.\n \n Lord Woolf said he was determined his current veto on whether a judge should chair an inquiry should continue as a guard for judicial independence. But he told MPs the Lord Chancellor, Lord Falconer, was insisting he should have the final say in such cases. Lord Hutton's inquiry into the death of Dr David Kelly sparked debate about who should run inquiries.\n \n The government says the lord chancellor would be unlikely to go against Lord Woolf's wishes. Lord Woolf, who is Lord Chief Justice of England and Wales, was giving evidence to the Commons public administration select committee's inquiry into public inquiries. He said he had not been involved in the choice of Lord Hutton, who as a law lord did not come under his jurisdiction. But he argued he should have a veto on whether judges generally should chair a particular inquiry and if so, which judge it should be. In written evidence to the committee, Lord Woolf said: \"I have, so far, failed to reach an agreement with the lord chancellor on this issue ... I intend to maintain my position and will press for this safeguard to be in any future legislation.\"\n \n Judges should think carefully before heading an inquiry into a highly political issue, such as the intelligence on Iraq's weapons of mass destruction, he said. He argued: \"The subject matter of the inquiry may be so political that it would be damaging to the judiciary for a judge to be involved. \"In addition, the question of whether there should be an inquiry at all may be highly controversial and if a judge is appointed, the judiciary, as a result of the appointment, may be seen as siding inappropriately with the government.\" He told the MPs: \"Anything that tends to undermine the confidence of the public in the judiciary worries me.\"\n \n Lord Woolf said the current rules were not written down but it was inconceivable in practice that the lord chancellor would overrule his concerns. But that situation could change with new legal reforms. The issue had been \"overlooked\" when a new agreement was drawn up about those responsibilities and the dispute had emerged in later discussions. \"What I am asking for is a situation where if the lord chancellor cannot obtain my agreement [on appointing a judge], it doesn't happen,\" he said.\n \n Lord Woolf said he did not think there would be difficulties but he wanted to establish the principle. A Department for Constitutional Affairs spokeswoman said Lord Woolf and Lord Falconer agreed about what happened in practice. \"Their disagreement is about whether the legislation should include a requirement for consultation or concurrence - a very narrow dispute, in Lord Woolf's words,\" she said. \"As Lord Woolf also acknowledged, it is highly unlikely that the lord chancellor would appoint a judge against the wishes of the lord chief justice. \"Judges are free to decide for themselves whether to accept positions as inquiry chairs.\" Parliament will examine the issue next year when it debates a new bill about public inquiries.\n", "llama3.2:1b": ["The UK's top judge, Lord Woolf, has clashed with ministers over who should chair an inquiry, particularly those related to highly political issues such as intelligence on Iraq's weapons of mass destruction.", "Lord Woolf stated that he wants to maintain his current veto on appointing judges to chairs public inquiries and only allows the lord chancellor's final say in these cases.", "He believes this is necessary for judicial independence.", "The Lord Chancellor, Lord Falconer, has insisted that he should have the final say in such cases, citing a previous agreement.", "However, Lord Woolf argued that his wishes must be respected due to concerns about the potential damage to the judiciary if judges are involved in politically sensitive inquiries.", "Lord Woolf expressed concerns that appointing a judge could undermine public confidence in the judiciary and is seeking a compromise where the lord chancellor cannot override his veto if he does not agree."], "llama3.2:3b": ["UK's top judge Lord Woolf clashes with ministers over who should chair public inquiries, insisting on maintaining his veto on judicial involvement to protect judicial independence and public confidence."], "gemma2:2b": ["Lord Woolf, the UK's top judge, disagrees with ministers over who should choose the heads of public inquiries.", "He maintains his veto on selecting judges for these roles and seeks to codify this in future legislation.", "Lord Woolf argues that judicial involvement in highly political inquiries can damage public trust in the judiciary.", "Despite disagreeing about wording, he believes the disagreement is a minor one and expects there to be no difficulty in implementing his wishes."], "qwen2.5:0.5b": ["Lord Woolf clashed with ministers about how heads of public inquiries should be chosen, and he argued they shouldn't appoint judges who could have veto power over an inquiry or who weren't involved in the choice of Lord Hutton's inquiry into the death of Dr. David Kelly."], "qwen2.5:1.5b": ["The UK's top judge clashed with ministers over who should chair public inquiries, particularly those related to politics and high-profile cases like Dr. David Kelly's death investigation.", "Lord Woolf argued for a judicial veto on such appointments but faced opposition from the government, which insists he would not always prevail in ministerial decisions."], "qwen2.5:3b": ["The UK's top judge, Lord Woolf, has clashed with ministers over his veto on choosing judges to chair public inquiries, particularly regarding Lord Hutton's Iraq Inquiry.", "While the government claims the Lord Chancellor would not go against Lord Woolf's wishes, Lord Woolf seeks a formal safeguard in future legislation.", "He argues that judges should be cautious about heading inquiries into controversial political matters and emphasizes the importance of maintaining judicial independence.", "The disagreement is over whether new legal reforms should include requirements for consultation or concurrence between the Lord Chancellor and the Lord Chief Justice regarding such appointments.", "Parliament will review this issue next year when debating a new bill on public inquiries."], "opencoder:1.5b": ["The UK's top judge has revealed he has clashed with ministers about how the heads of public inquiries are chosen.", "\"The government says the lord chancellor would be unlikely to go against Lord Woolf's wishes.", "Lord Woolf, who is Lord Chief Justice of England and Wales, was giving evidence to the Commons public administration select committee's inquiry into public inquiries.", "He said he had not been involved in the choice of Lord Hutton, who as a law lord did not come under his jurisdiction.", "But he argued he should have a veto on whether judges generally should chair a particular inquiry and if so, which judge it should be.\"", "The issue of judges should think carefully before heading an inquiry into a highly political issue, such as the intelligence on Iraq's weapons of mass destruction, the government argued: \"The subject matter of the inquiry may be so political that it would be damaging to the judiciary for a judge to be involved.", "In addition, the question of whether there should be an inquiry at all may be highly controversial and if a judge is appointed, the judiciary, as a result of the appointment, may be seen as siding inappropriately with the government.\"", "The Lord Chancellors decision to appoint a judge against the wishes of the lord chief justices has been \"overlooked\" when a new agreement was drawn up about those responsibilities and the dispute had emerged in later discussions.", "The issue could change with new legal reforms, which were likely attended by a Department for Constitutional Affairs (DCA) spokeswoman who agreed on what happened in practice."], "smollm:1.7b": ["The UK's top judge has revealed he has clashed with ministers over how the heads of public inquiries are chosen.", "The UK's top judge, Lord Woolf, said he was determined his current veto on whether a judge should chair an inquiry should continue as a guard for judicial independence.", "However, he told MPs the Lord Chancellor, Lord Falconer, is insisting he should have the final say in such cases.", "Lord Woolf argued that the government would not allow him to go against the lord chancellor's wishes and that he had not been involved in the choice of Lord Hutton, who as a law lord did not come under his jurisdiction.", "However, he said he would maintain his position and press for this safeguard to be in any future legislation.", "Judges should think carefully before heading an inquiry into a highly political issue, such as the intelligence on Iraq's weapons of mass destruction, he said.", "He argued that the subject matter of the inquiry may be so political that it would be damaging to the judiciary for a judge to be involved.", "In addition, the question of whether there should be an inquiry at all may be highly controversial and if a judge is appointed, the judiciary, as a result of the appointment, may be seen as siding inappropriately with the government.", "Lord Woolf said the current rules were not written down but it was inconceivable in practice that the lord chancellor would overrule his concerns.", "But that situation could change with new legal reforms.", "The issue had been \"overlooked\" when a new agreement was drawn up about those responsibilities and the dispute had emerged in later discussions.", "What I am asking for is a situation where if the lord chancellor cannot obtain my agreement (on appointing a judge) - a narrow dispute, in Lord Woolf's words - that the lord chief justice will not be concerned.", "Lord Woolf said he did not think there would be difficulties but he wanted to establish the principle.", "A Department for Constitutional Affairs spokeswoman said Lord Woolf and Lord Falconer agreed about what happened in practice.", "\"Their disagreement is about whether the legislation should include a requirement for consultation or concurrence - a very narrow dispute, in Lord Woolf's words,\" she said.", "\"As Lord Woolf also acknowledged, it is highly unlikely that the lord chancellor would appoint a judge against the wishes of the lord chief justice.", "\"Judges are free to decide for themselves whether to accept positions as inquiry chairs.\"", "Parliament will examine the issue next year when it debates a new bill about public inquiries."], "deepseek-r1:1.5b": ["Lord Woolf, who is regarded as Lord Chief Justice of England and Wales, has decided that he will not change his position on retaining the veto power over who chairs an inquiry into a highly political matter, such as the intelligence on Iraq's weapons of mass destruction.", "He argues that this decision is crucial for maintaining judicial independence.", "The government intends to preserve Woolf's stance despite possible challenges, as new legal reforms may pave the way for changes in judicial selection rules."], "tinyllama:1.1b": ["The UK's top judge has revealed that he and his counterpart have discussed the issue of judges heading public inquiry committees, citing it as an \"inconceivable\" scenario.", "He also expressed concerns over the current rules regarding the appointment of judges to such committees, highlighting the need for a new legal framework in order to avoid \"undermining\" the confidence of the public in the judiciary.", "The judge is also pushing for a mechanism that would ensure a consensus between himself and Lord Falconer, the minister responsible for judicial appointments, about who should run such committees.", "While his concerns were not explicitly stated, it can be inferred that he views the current system of consultation or concurrence as being highly unlikely to lead to a judge being appointed against their wishes.", "Parliament is expected to debate a new bill in 2018, which would include a provision on judicial appointments."], "tinydolphin:1.1b": [" The UK's top judge, Lord Woolf, has clashed with government ministers over the appointment of judges to head inquiries into sensitive political issues.", "He believes that he should have final say on whether his current veto is overridden, insisting that it is inconceivable for him to be overruled by his superior service chief.", "However, he has also argued that if the government's position is not reached in negotiations, judges should have the right to choose their own superiors, similar to the way they are appointed now.", "This disagreement highlights the ongoing debate about the role of judges in British politics and whether they should be more like the prime minister, with the ability to appoint or remove their own chairs."], "phi:2.7b": [" The UK's top judge, Lord Woolf, has expressed concern over his veto on who can chair public inquiries and argues that this safeguard is necessary to protect judicial independence.", "He says he has not been involved in recent cases involving the appointment of judges for inquiries into highly political issues like the intelligence on Iraq's weapons of mass destruction.", "He suggests that judges should think carefully before accepting invitations to head such inquiries, as it could damage their credibility and public trust in the judiciary.", "Lord Woolf believes that new legislation is necessary to make clear when his concerns can be overruled by ministers.", "The government says they would unlikely go against Lord Woolf's wishes on this matter."], "orca-mini:3b": [" Top judge Lord Woolf has clashed with ministers over how the heads of public inquiries are chosen, and he should have a veto on whether judges chair such inquiries and if so, which judge.", "He argued that judges should think carefully before heading an inquiry into a highly political issue like Iraq's weapons of mass destruction.", "However, there is no disagreement in practice and the lord chancellor would unlikely go against Lord Woolf's wishes.", "The issue has been overlooked when the new agreement was drawn up, but there is a dispute in later discussions.", "Lord Woolf wants to establish the principle, and he does not think there will be difficulties."], "hermes3:3b": ["UK top judge clashes with ministers over control of public inquiry judges, arguing judicial independence and concern over politicisation."], "stablelm-zephyr:3b": ["The UK's top judge, Lord Woolf, clashed with ministers over the process of choosing heads for public inquiries.", "He argued that judges should consider carefully before heading an inquiry into a politically charged topic to avoid undermining confidence in the judiciary.", "Lord Woolf sought to maintain his veto on whether a judge should chair an inquiry and intends to press for this safeguard in future legislation.", "While he believed it was unlikely that the Lord Chancellor would override his concerns, the disagreement was about whether consultation or concurrence should be required by law."], "chatgpt-4o-latest": ["Lord Woolf, the UK's top judge, has clashed with Lord Chancellor Lord Falconer over who should have the final say in appointing judges to chair public inquiries.", "Woolf insists on maintaining his veto to safeguard judicial independence, while Falconer argues he should have the ultimate authority.", "Woolf expressed concerns that judges leading politically sensitive inquiries could damage judicial impartiality.", "Although current rules are unwritten and the government claims the lord chancellor would not override Woolf’s wishes, legal reforms could change this.", "The dispute, described as narrow, will be addressed in upcoming legislation on public inquiries."], "stablelm2:1.6b": ["The UK's top judge, Lord Woolf, has clashed with ministers regarding who should be in charge of choosing heads for public inquiries.", "He maintains his current veto on whether judges can chair an inquiry to protect judicial independence.", "The disagreement comes as discussions surround the Lord Chancellor's insistence he should have the final say in such cases.", "However, the government asserts that Lord Falconer would not go against Lord Woolf's wishes.", "Lord Woolf argues for a safeguard in any future legislation and believes it is important for judges to be careful when heading an inquiry into highly political issues.", "The current rules do not include a requirement for consultation or concurrence on appointing a judge, but new legal reforms could change this.", "Parliament will examine the issue next year when it debates a new bill about public inquiries."], "granite3.1-dense:2b": ["Lord Woolf, UK's top judge and Lord Chief Justice of England and Wales, has clashed with the Lord Chancellor, Lord Falconer, over the selection process for chairing public inquiries.", "Lord Woolf maintains his veto on choosing judges for such roles as a safeguard for judicial independence, emphasizing that politically charged topics like intelligence on Iraq's weapons of mass destruction could undermine the judiciary's integrity if judges were involved.", "Despite initial disagreements, the government asserts Lord Falconer is unlikely to override Lord Woolf's concerns, given that judges have autonomy in accepting such positions.", "The issue will be further discussed by Parliament next year as they debate a new public inquiries bill."]}