{"raw_text": "Ministers 'naive' over phone-taps\n \n The government is being naive by refusing to allow phone-tap evidence in court, a senior EU politician says.\n \n Javier Solana, EU foreign policy chief, says phone-tap evidence works in the courts of other European countries. Human rights groups, top police officers and many MPs say allowing the evidence would remove the need to detain terror suspects without charge. But Home Secretary Charles Clarke says the evidence would not make much difference to these cases. Mr Solana told ITV1's Jonathan Dimbleby programme: \"[Phone-tap evidence in court] works, it is normal that it is done, it would be naive not to do it. \"It would be naive not to use this technological thing that we have at our disposal.\" Mr Solana's comments come the day after Sir Ian Blair, the newly-appointed Metropolitan Police commissioner, said he was in favour of phone-tap evidence.\n \n Under the Anti-Terrorism Crimes and Security Act 2001, foreign terror suspects can be detained in British jails without trial or charge. Several suspects have been detained under these powers because evidence against them was deemed too sensitive to be heard in court.\n \n Some of this evidence is believed to be telephone intercepts. Human Rights group Liberty has argued that if intercept evidence could be heard, these detainees could be brought to trial. But critics of phone-tap trials say the evidence is often weak and can expose the methods of the security services. The home secretary says intercepts would not make much difference because cases against terror suspects frequently rely on other kinds of surveillance. But Mr Clarke has been forced to change the regime of detention without trial after Law Lords ruled it illegal. He has opted for a system of \"control orders\" whereby suspects, both British and foreign, can be held under house arrest or surveillance. These orders will again involve a UK opt-out of parts of the European Convention on Human Rights. While accepting that people \"have to be prepared\" for a possible terrorist attack, Mr Solana said he had \"qualms\" about the home secretary's new plans. \"We have to fight terrorism with all our means, but not so far as to change our way of life,\" he said.\n", "llama3.2:1b": ["Ministers are being naive by refusing to allow phone-tap evidence in court due to concerns it may compromise human rights and deter suspects from coming forward.", "Human rights groups and police officers argue that phone-tap evidence works in other European countries, allowing for more effective investigations.", "However, the UK's Home Secretary has expressed skepticism, citing cases where intercepts were deemed too sensitive to be heard in court and fearing they might expose security service methods."], "llama3.2:3b": ["The government is being naive by refusing to use phone-tap evidence in court, says EU foreign policy chief Javier Solana.", "This would allow for the trial of terror suspects without detention, and many experts, including police officers and MPs, support its use.", "However, Home Secretary Charles Clarke believes it would not make a significant difference, while Mr Solana thinks it is necessary to \"fight terrorism with all our means\" and protect human rights."], "gemma2:2b": ["Javier Solana, EU foreign policy chief, believes phone-tap evidence should be used in court and that not doing so is naive.", "He argues it's standard practice in other European countries and would allow for more efficient trials of terror suspects.", "However, the UK government remains hesitant, citing concerns about evidence reliability and potential interference with law enforcement.", "Despite this, Mr. Solana expresses reservations regarding the home secretary's new \"control orders\" system that restricts suspect freedom."], "qwen2.5:0.5b": ["The minister's stance on phone-tap evidence in court is naive and does not align with European standards for evidence collection."], "qwen2.5:1.5b": ["The government is being naive by refusing to allow phone-tap evidence in court, a senior EU politician says, despite human rights groups and top police officers arguing that it would remove the need for detention without charge.", "The Home Secretary suggests the evidence wouldn't make much difference due to reliance on other types of surveillance but has been forced to change regime after Law Lords ruled it illegal."], "qwen2.5:3b": ["Ministers are being criticized by EU politician Javier Solana for refusing to allow phone-tap evidence in court, which works in other European countries.", "Despite concerns about human rights and the need for detaining terror suspects without charge, Solana argues it would be naive not to use this evidence.", "The Anti-Terrorism Crimes and Security Act 2001 allows such detentions.", "Critics worry exposing intercept evidence could undermine security services.", "Home Secretary Charles Clarke says phone-taps won't significantly change these cases, leading him to opt for control orders instead of detention without trial, which are now seen as illegal.", "Solana expresses reservations about changing UK ways of life in the fight against terrorism, while admitting that preparedness is necessary against possible attacks."], "opencoder:1.5b": ["The government is being naive by refusing to allow phone-tap evidence in court.", "Javier Solana, EU foreign policy chief, says phone-tap evidence works in the courts of other European countries.", "Home Secretary Charles Clarke insists the evidence would not make much difference to these cases.", "Under Anti-Terrorism Crimes and Security Act 2001, foreign terror suspects can be detained without trial or charge because evidence against them is deemed too sensitive to be heard in court."], "smollm:1.7b": ["The summary above is concise and objective, capturing the main ideas and key details from the original text.", "It does not include any explanations or justifications for the government's decision, nor does it provide additional information that might be relevant to the context.", "The goal is to present the main points in a clear and neutral manner, without adding personal opinions or biases."], "deepseek-r1:1.5b": ["The EU politician Javier Solana expresses reservations against using phone-tap evidence in court, stating it might be considered naive.", "He claims other European countries allow such evidence, but human rights groups and MPs oppose this, fearing detaining suspects without charge.", "Home Secretary Charles Clarke opts for \"control orders\" under house arrest or surveillance, though critics worry this could infringe on freedom of speech.", "The Anti-Terrorism Crimes Act 2001 allows foreign terror suspects to be detained if evidence is deemed too sensitive.", "While some individuals were previously detained via intercepts, concerns exist about the methods used and potential impact on free expression."], "tinyllama:1.1b": ["The EU foreign policy chief Javier Solana has stated that phone-tape evidence works in the courts of other European countries and is normal for these cases.", "He dismisses the Home Secretary's claim that allowing such evidence would make little difference to these instances, stating that it would not alter the need to detain terror suspects without charge.", "The comments come as several suspects have been held under anti-terrorism laws, with evidence against them often deemed too sensitive for trial.", "Critics of phone-tape trials argue they expose methods used by security services and could potentially expose evidence to trial.", "Despite acceptance of this method, the Home Secretary has opted for \"control orders\" that allow suspects under house arrest or surveillance.", "However, there are concerns regarding the home secretary's new plans regarding a European Convention on Human Rights."], "tinydolphin:1.1b": [" The Home Secretary, Charles Clarke, has ruled out allowing phone-tap evidence in court, stating that it would not make much difference to the cases against terror suspects.", "This decision has raised concerns among human rights groups and police officers, who believe allowing the evidence could expose their methods of investigation.", "Critics argue that it would weaken the strength of their case, while supporters of phone-tap evidence believe that it could provide critical information about the communication patterns of terror suspects.", "The government is being divided on the issue, with some politicians arguing for the use of phone-tap evidence and others supporting a more strict approach to security measures.", "In response to these concerns, Home Secretary Charles Clarke has announced plans to introduce \"control orders\" whereby suspects can be held under house arrest or surveillance.", "These measures will allow the government to maintain its ability to monitor potential threats, while avoiding any potential violations of human rights rights."], "phi:2.7b": [" The government is being criticized by senior EU politician Javier Solana for refusing to allow phone-tap evidence in court.", "However, Home Secretary Charles Clarke believes that the evidence would not make much difference in cases involving foreign terror suspects who can be detained without trial or charge under the Anti-Terrorism Crimes and Security Act 2001.", "Human rights groups, police officers, and many MPs argue that allowing phone-taps in court would remove the need to detain these suspects.", "Mr Solana believes that phone-tap evidence works in other European countries and would not want to be \"naive\" about using this technology.", "Sir Ian Blair, the new Metropolitan Police commissioner, has also expressed support for phone-tape evidence.", "The controversy over phone-taps highlights the balance between national security concerns and human rights considerations."], "orca-mini:3b": [" Ministers are being naive over phone-taps, according to EU foreign policy chief Javier Solana.", "He says that phone-tap evidence works in European countries and should be allowed in court.", "Human rights groups, top police officers, and MPs support this view.", "However, Home Secretary Charles Clarke says the evidence would not make much difference in terror cases."], "hermes3:3b": ["Ministers naive about using phone-tap evidence in courts, says EU foreign policy chief Javier Solana."], "stablelm-zephyr:3b": ["A senior EU politician, Javier Solana, believes that the government is naive for refusing to allow phone-tap evidence in court.", "He argues that allowing this evidence would remove the need for detaining terror suspects without charge and maintain the use of technology.", "This comes after Sir Ian Blair, the newly-appointed Metropolitan Police commissioner, expressed support for phone-tap evidence.", "However, some human rights groups and critics argue that the evidence is often weak and can expose the methods of security services.", "The home secretary has opted for a new system of \"control orders\" instead of detention without trial."], "chatgpt-4o-latest": ["The UK government is criticized for refusing to allow phone-tap evidence in court, with EU foreign policy chief Javier Solana calling the decision naive.", "He argues that such evidence is effective in other European countries, and human rights groups, police officers, and MPs believe it could prevent the need for detaining terror suspects without charge.", "However, Home Secretary Charles Clarke contends that phone-tap evidence would not significantly impact these cases, as other surveillance methods are used.", "The debate arises amid concerns over the Anti-Terrorism Crimes and Security Act 2001, which allows foreign terror suspects to be detained without trial.", "Critics argue that intercept evidence could enable trials, but opponents claim it is often weak and could compromise security methods.", "Clarke has been forced to revise detention policies after a Law Lords ruling, introducing \"control orders\" that allow house arrest or surveillance, requiring a UK opt-out from parts of the European Convention on Human Rights.", "Solana warns against counterterrorism measures that alter fundamental freedoms."], "stablelm2:1.6b": ["A senior EU politician, Javier Solana, says that phone-tap evidence is valid in European court systems and can be used to remove the need for terror suspects to be detained without trial or charge.", "However, Home Secretary Charles Clarke argues that allowing such evidence would not make much of a difference in cases against foreign terror suspects.", "Under the Anti-terrorism Crimes and Security Act, foreign suspects can be held without trial or charge if sufficient evidence is deemed too sensitive to be heard in court.", "Some phone-tap evidence may be used to support this process."], "granite3.1-dense:2b": ["EU Foreign Policy Chief Javier Solana criticizes the UK government for being naive in refusing to admit phone-tap evidence in court.", "He asserts that this practice is common in other European countries' courts and is essential for investigating terrorism effectively.", "Home Secretary Charles Clarke, however, believes phone-tap evidence would not significantly impact cases due to reliance on alternative surveillance methods.", "This stance contrasts with the views of human rights groups, police officers, and MPs who argue that such evidence could reduce detention without charge for terror suspects.", "Sir Ian Blair, the Metropolitan Police Commissioner, supports phone-tap trials.", "The controversy arises under the Anti-Terrorism Crimes and Security Act 2001, which allows foreign terror suspects' detention without trial or charge based on sensitive evidence, including telephone intercepts.", "Law Lords recently declared this regime illegal, prompting Clarke to implement \"control orders\" for house arrest or surveillance of suspects.", "Despite these concerns, Solana emphasizes the need to balance counter-terrorism efforts with upholding human rights."]}