{"raw_text": "Blair dismisses quit claim report\n \n Tony Blair has dismissed reports he told Gordon Brown he would quit before the next general election.\n \n \"You don't do deals over jobs like this,\" the prime minister told BBC One's Breakfast with Frost programme. According to a new book, Brown's Britain, Mr Blair went back on a pledge to make way for Mr Brown after Cabinet allies intervened in June 2004. Mr Blair said the claims were \"reheated from six months ago\" and that he was concentrating on running the country. Mr Blair said: \"I've dealt with this six months ago. I said then you don't do deals over jobs like this - you don't.\n \n \"What both of us are actually concentrating on are the issues that concern the country.\" The book, by Sunday Telegraph journalist Robert Peston and serialised in the newspaper, said the pair had \"mutual animosity and contempt\" for each other.\n \n It claims Tony Blair felt by November 2003 he had lost voters' trust because of the Iraq war and that he was no longer an asset to the Labour Party. And that at a dinner hosted by Deputy Prime Minister John Prescott he told Mr Brown of his intention to stand down. According to Mr Peston the prime minister said: \"Help me to get through the year and I will then stand down.\" But he then changed his mind in June 2004, following intervention from allies in the Cabinet and the suspicion that the chancellor was deliberately manoeuvring against him, according to the book.\n \n Mr Peston told BBC News: \"My understanding is that they are not nearly as close or as friendly as they once were. \"What the book says is there is now a pretty profound mutual mistrust, mutual animosity. \"I think in public you see this double-act pretending everything is alright, but in private I don't think the relationship is good because Brown, understandably, feels deeply betrayed - particularly over this issue of the leadership.\" But, in a wide-ranging BBC interview covering issues such as the Asian tsunami disaster, the Middle East peace process and Northern Ireland, Mr Blair said: \"When you get to the top in politics you get this huge swell around you. \"All sorts of people make all sorts of claims and counter-claims.\" He admitted to a \"sense of frustration\" about the allegations which he said had been made \"countless times\".\n \n There has been fresh speculation of a rift recently, following their separate responses to the Asian tsunami. These rumours were fuelled by Mr Blair's decision to hold his monthly media conference at the same time as a long-planned speech by Mr Brown on UK plans to tackle global poverty with a new \"Marshall Plan\" for Africa. There was speculation the pair were trying to outdo each other's response to the disaster. But the prime minister said he had discussed these claims with the chancellor and dismissed them as a \"load of nonsense\". Former welfare minister Frank Field MP said the prime minister should sack Mr Brown, but did not believe Mr Blair was strong enough to do so.\n \n Tory leader Michael Howard accused the prime minister and Mr Brown of \"squabbling like schoolboys\". He told Sky News' Sunday with Adam Boulton: \"This is the politics of the playground and Britain really does deserve better.\" The Liberal Democrat parliamentary chairman Matthew Taylor said the personal ambition of Mr Blair and Mr Brown was \"getting in the way of good government\". \"Either they need to grow up and put their squabbles to one side or they cannot expect the electorate to support a divided government at the next election.\" During the interview Mr Blair also said the former home secretary David Blunkett would play a \"big role\" at the general election.\n", "llama3.2:1b": ["Blair dismisses reports he told Gordon Brown he would quit before the next general election, saying they are \"reheated from six months ago\".", "The book claims both leaders have mutual animosity and contempt for each other.", "Blair says he had lost voters' trust due to the Iraq war and that Brown felt betrayed over this issue.", "Despite private tensions, Blair maintains a public image of friendship and cooperation with Brown."], "llama3.2:3b": ["Tony Blair dismissed reports he told Gordon Brown he would quit before the next general election, calling them \"reheated from six months ago\".", "The claims in a new book suggest mutual animosity and contempt between the two men, with Blair feeling betrayed by Brown's handling of his intended resignation.", "The rift was fueled by their separate responses to the Asian tsunami disaster, but Blair denied any attempt to outdo each other, saying allegations were \"countless times\" made."], "gemma2:2b": ["Tony Blair denies telling Gordon Brown he would resign before the next general election and dismisses claims of mutual animosity.", "Blair maintains that his focus is on running the country, citing intervention from allies in June 2004 as a reason for changing his plans regarding stepping down.", "A new book details their deteriorating relationship, including accusations of Blair's feeling of being betrayed by Brown and a sense of frustration over constant allegations.", "The prime minister denies these claims and attributes them to \"reheated\" stories from six months ago.", "Blair also mentions discussions with the chancellor and dismisses speculation regarding their responses to the Asian tsunami disaster as \"nonsense.\"", "Opposition parties, including Tory leader Michael Howard and Liberal Democrat chairman Matthew Taylor, criticize the personal ambition of Blair and Brown for hindering effective government."], "qwen2.5:0.5b": ["Tony Blair dismissed Brown's claims about quitting his position in Britain, saying he had already made up his mind to resign from the Labour Party.", "He believed these reports were based on an earlier pledge he made not to intervene during Cabinet meetings and that he was concentrating on running the country.", "The book \"Brown's Britain\" has been cited as evidence of mutual mistrust between Blair and Brown, with Tony Blair describing himself as a \"mutual animosity and contempt\"."], "qwen2.5:1.5b": ["Tony Blair dismissed reports of his intention to quit before the next election, saying it was done six months ago and that he focused on running the country.", "Robert Peston's book claims they had mutual animosity since November 2003 and now have a \"pretty profound mutual mistrust\".", "The prime minister admitted feeling frustrated about repeated allegations made \"countless times\" but said he had discussed them with Chancellor Gordon Brown."], "qwen2.5:3b": ["Tony Blair dismissed reports he had told Gordon Brown he intended to quit before the 2005 general election.", "He claimed these claims were from six months ago and that they were focusing on country issues.", "According to Robert Peston's book, published in the Sunday Telegraph, Brown felt betrayed by Blair over leadership succession; Blair initially announced his intention to step down but then changed his mind after Cabinet allies intervened in June 2004.", "The relationship between the two leaders was described as strained and hostile.", "Recent speculation of a rift emerged following their different responses to the Asian tsunami disaster.", "Blair maintained that there were no personal tensions, only differing approaches to addressing the crisis."], "opencoder:1.5b": ["Blair dismisses reports he told Gordon Brown he would quit before the next general election.", "Tony Blair dismissed reports he offered to support a government party known as the Labour Party who is now divided on issues of national security and international peace.", "Mr Blair felt that his loss of voters' trust was mainly due to the Iraq war, but also because he perceived the chancellor's manoeuvring against him as an offshoot of corruption.", "He said it was a \"sense of frustration\" about the allegations which he made \"countless times\".", "Several news outlets and magazine articles shared similar sentiments.", "According to BBC News, Mr Blair seemed to be resistant to criticism because his personal beliefs were \"getting in the way of good government.\"", "The book's analysis of Mr Peston’s discussions between Prime Minister Robert Peston and Cabinet allies revealed the fact that they had made a mutual mistrust and shared feelings about their relationship.", "They had a \"mutual animosity and contempt\" for each other.", "Meanwhile, Mr Brown's intention to stand down was a reflection of his personal views on global issues.", "He said he remembered meeting with former Prime Minister John Prescott earlier this year, and the latter made it clear he would not return again in 2023.", "As for the rift between Mr Blair and Mr Brown, the author of the book notes that they had been discussing Asian tsunami-related issues since November 2003.", "While initially perceived as disparaging, the tone and intensity of their statements have since been widely reported.", "The author further elaborates on the Middle East peace process and Northern Ireland's focus on global development.", "It suggests that Mr Blair’s decision to hold a monthly media conference at the same time as a long-term speech by Mr Brown was part of a broader strategy aimed at overcoming the disaster.", "The author also mentions that former home secretary David Blunkett, who was in the House of Lords during the tumultuous event, played a significant role at the election."], "smollm:1.7b": ["Summarize the text concisely, preserving key ideas and details."], "deepseek-r1:1.5b": ["Tony Blair dismissed reports he had announced a potential resignation before the next general election.", "His comments were met with mutual animosity from Robert Peston, who wrote about their political discussions.", "The text highlights Blair's internal conflicts around dealing with jobs, his loss of voter trust post-Iraq, and his attempts to stand down at key events.", "Blair also falsely accused Brown of misinformation in a public interview, while later he dismissed the accusations as \"load of nonsense.\"", "There was speculation about a political rift following responses to the Asian tsunami.", "Michael Howard criticized Blair for squabbling during a Conservative show, arguing for better government and against divided politics."], "tinyllama:1.1b": ["The text mentions that Tony Blair has dismissed reports he told Gordon Brown he would quit before the next general election, as mentioned in a new book by journalist Robert Peaton and serialised in The Sunday Telegraph newspaper.", "According to Peaton's book, published on October 20th, 2019, Blair said he was not leaving because of the Iraq war or his own trust issues with Brown.", "However, it also claims that Blair felt a loss of voteers' trust due to the Iraq war and felt no longer an asset for the Labour Party, leading him to consider standing down after his dinner meeting with Brown.", "The book claims that this change in Blair's stance towards Brown occurred by November 2003, where he expressed his intention to stand down but changed his mind in June 2004 following intervention from allies and suspicion that the chaos was being deliberately manipulated against him.", "The book also claims that there is now a profound mutual mistrust between Blair and Brown, while the prime minister dismisses allegations as \"non-sensense\" and denies any squabbling with Brown."], "tinydolphin:1.1b": [" Tony Blair has dismissed a report stating that he told Gordon Brown he would quit before the next general election, in hopes of avoiding any issues over the Labour leader's job performance.", "The prime minister said the claims were reheated from six months ago and denied there was any \"revolving door\" between them.", "He also criticized his Conservative opponents for \"squabbling like schoolboys,\" suggesting that they may have a better grasp on politics compared to him."], "phi:2.7b": [" Tony Blair has dismissed claims he would quit before the next general election and that he made deals over jobs with Gordon Brown.", "The claims are from a new book by Sunday Telegraph journalist Robert Peston, who reported that Blair told BBC One's Breakfast program in 2004 that deals over jobs should not be done and later changed his mind after intervention from Cabinet allies.", "Mr.Peston claims the relationship between the two is now characterized by mutual mistrust and animosity.", "The former prime minister said he felt betrayed and there has been speculation of a rift recently, which was fuelled by their responses to the Asian tsunami.", "There have been talks about Mr. Blair potentially firing Mr. Brown but he dismissed it as a \"load of nonsense.\"", "Some politicians believe that the personal ambition of the two is getting in the way of good government."], "orca-mini:3b": [" Tony Blair has dismissed claims he told Gordon Brown he would quit before the next general election, saying they were \"reheated from six months ago\".", "According to a new book, Brown's Britain, Mr Blair went back on a pledge to make way for Mr Brown after Cabinet allies intervened in June 2004.", "However, Mr Blair said the claims were not true and he was concentrating on running the country.", "He denied a rift between himself and Mr Brown and dismissed rumours of a feud as \"loads of nonsense\"."], "hermes3:3b": ["Tony Blair dismisses claims about quitting before general election and dealing over job with Gordon Brown, despite reports of mutual animosity and mistrust between them."], "stablelm-zephyr:3b": ["Tony Blair dismisses reports of him telling Gordon Brown he would quit before the next general election.", "According to a book, Brown's Britain, Blair initially considered quitting due to lost voters' trust from the Iraq war and tensions between himself and Brown.", "However, after intervention from Cabinet allies and suspicions that the chancellor was deliberately maneuvering against him, Blair changed his mind in June 2004.", "Both leaders have faced speculation about their relationship and potential division within the government, but Blair dismisses these claims as \"reheated from six months ago.\""], "chatgpt-4o-latest": ["Tony Blair dismissed reports that he promised to step down for Gordon Brown before the next general election, calling such claims \"reheated\" and insisting he was focused on governing.", "A book by journalist Robert Peston alleges Blair initially intended to resign in 2003 due to declining public trust over the Iraq war but changed his mind in 2004 after Cabinet allies intervened and suspected Brown of maneuvering against him.", "Peston describes a deep mistrust between the two, despite their public unity.", "Speculation about their rift intensified after their separate responses to the Asian tsunami, but Blair dismissed such claims as \"nonsense.\"", "Tory leader Michael Howard criticized their alleged infighting, calling it \"playground politics,\" while the Liberal Democrats warned that their rivalry could harm governance.", "Blair also stated that former home secretary David Blunkett would play a significant role in the upcoming election."], "stablelm2:1.6b": ["Tony Blair dismisses claims of quitting before the next general election; no deals on jobs are done, according to PM.", "Reports in Brown's Britain suggest Blair intended to make way for Brown after Cabinet intervention in June.", "The book says PM and Chancellor have mutual animosity and contempt.", "PM denies allegations and says there's a profound mistrust between them.", "In 2005 BBC interview, PM admitted to frustration over \"countless claims\" made by others.", "Speculation of rift following Asian tsunami response.", "Tory leader accuses PM and Brown of squabbling; Liberal Democrat criticizes personal ambition hindering good governance."], "granite3.1-dense:2b": ["Tony Blair dismissed claims from a new book, \"Brown's Britain,\" by Sunday Telegraph journalist Robert Peston, that he had promised to step down before the 2005 general election.", "According to the book, then-Chancellor Gordon Brown, in June 2004, sought Blair's support for early retirement due to declining public trust following the Iraq war.", "Blair denied these allegations, stating that he had addressed this issue six months prior and emphasized that such job changes should not be made over personal interests.", "He also noted their mutual mistrust and animosity, asserting that they focus on national issues instead of personal ambitions.", "Despite the denial, there were recent speculations of a rift between Blair and Brown due to differing responses during the 2004 Asian tsunami relief efforts.", "Blair described these allegations as \"nonsense,\" maintaining that he had communicated with Brown about the issue.", "Political figures, including former welfare minister Frank Field MP and Tory leader Michael Howard, criticized their relationship as reminiscent of schoolyard squabbling, calling for more united governance.", "Blair pledged significant roles for David Blunkett in the upcoming general election."]}