{"raw_text": "Jamieson issues warning to bigots\n \n Scotland's justice minister has warned bigoted soccer fans that she wants to hit them \"where it hurts most\" by banning them from matches.\n \n Cathy Jamieson said exclusion orders are one of a series of measures being considered in the Scottish Executive campaign against sectarianism. She praised Celtic and Rangers for their work in tackling the problem. However, the minister said stopping sectarian abuse associated with Old Firm matches is a key objective. Ms Jamieson was speaking ahead of the third round Scottish Cup clash between the Glasgow clubs at Parkhead on Sunday. The sectarianism long associated with sections of the support from both clubs has become a significant target for the executive. Last week Ms Jamieson and First Minister Jack McConnell met supporters' representatives from both clubs to discuss the issue.\n \n They plan to hold an anti-sectarian summit next month with officials from the clubs, church leaders, senior police officers and local authority chiefs among those to be invited. Speaking on BBC Radio Scotland's Sunday Live programme, Ms Jamieson described Friday's meeting as \"very productive\" and said putting the squeeze on the bigots would be a key aim. Ms Jamieson stressed that sectarianism has not been confined to football but it can act as a \"trigger\" for tensions and violence. Clubs have taken action in the past to ban troublesome fans and supporters' groups expressed their desire to ensure that the game is no longer tainted by the problem.\n \n Ms Jamieson said the executive should have a role in tackling the soccer troublemakers. She said: \"We can't get away from the fact that in some instances some of the religious hatred that some people try to associate with football boils over into violence. \"That is the kind of thing we want to stop and that's the kind of thing supporters' groups are very clear they don't want to be part of either, and they will work with us to try and deal with that.\"\n \n Ms Jamieson praised the police for their action and said: \"The police do want to identify whether there are particular individuals who are going over the top and inciting hatred or violence - they will crack down very effectively on them. \"We have of course already indicated that we will consider the introduction of banning orders to give additional powers to where there are people who are going over the top, who have made inappropriate behaviour at football matches, to be able to stop them attending the games. \"That's the kind of thing that will hit those kind of people where it hurts the most in not allowing them to attend the games,\" she said. Praising Celtic and Rangers for their efforts, she said: \"I don't think there is any doubt that we have seen some positive moves from the clubs. \"Both Rangers and Celtic football clubs have been involved in working with the executive to produce, for example, an educational pack for young people.\"\n", "llama3.2:1b": ["Scotland's justice minister, Cathy Jamieson, has warned bigoted soccer fans to stop sectarian abuse associated with Old Firm matches, calling it a key objective.", "The Scottish Executive is considering banning these fans from matches and plans to hold an anti-sectarian summit next month.", "The meeting was attended by representatives from both Celtic and Rangers clubs, who discussed the issue of sectarianism in football.", "Jamieson described the discussion as \"very productive\" and emphasized that putting pressure on bigots could be a key aim.", "She acknowledged that sectarianism is not confined to football but can trigger tensions and violence.", "The executive should have a role in tackling soccer troublemakers, according to Jamieson, who praised police for their action against those inciting hatred or violence at matches.", "Jamieson also stated that banning orders could be introduced to stop individuals from attending games after they have made inappropriate behavior, hitting them \"where it hurts most\".", "The Scottish Executive aims to tackle sectarianism in football and will consider introducing banning orders."], "llama3.2:3b": ["Scotland's justice minister Cathy Jamieson warns bigoted soccer fans that exclusion orders are being considered to ban them from matches, part of a campaign against sectarianism.", "She praises Celtic and Rangers for their efforts to tackle the problem, with plans to hold an anti-sectarian summit next month.", "The executive aims to stop sectarian abuse associated with Old Firm matches, with the goal of making the game no longer tainted by the issue."], "gemma2:2b": ["Scotland's Justice Minister Cathy Jamieson announced plans to target bigoted soccer fans through exclusion orders as part of a campaign against sectarianism.", "She praised the efforts of clubs like Celtic and Rangers in tackling the problem, but emphasized the need to stop abuse associated with Old Firm matches and acknowledged the potential for sectarianism to escalate into violence.", "The minister also highlighted the role of supporters' groups in working with the executive and the police to curb problematic behavior at games, stressing that banning orders would serve as a strong deterrent."], "qwen2.5:0.5b": ["The Scottish Football Association (SFA) has announced plans to ban bigoted soccer fans and supporters of Old Firm teams such as Celtic and Rangers.", "The minister emphasized stopping sectarian abuse associated with matches between both clubs, which is a key objective.", "She praised the clubs' efforts in tackling this issue."], "qwen2.5:1.5b": ["Scottish justice minister Cathy Jamieson warns bigoted soccer fans of banning orders as part of efforts against sectarianism, praising Celtic and Rangers' work on tackling the problem.", "She aims to stop sectarian abuse associated with Old Firm matches by introducing exclusion orders that would ban troublesome fans and supporters groups from attending games.", "The executive plans an anti-sectarian summit next month featuring officials from clubs, church leaders, senior police officers, and local authority chiefs."], "qwen2.5:3b": ["Scotland's justice minister Cathy Jamieson has warned bigoted soccer fans she wants to ban them from matches.", "She described exclusion orders as part of a campaign against sectarianism, praising Celtic and Rangers' efforts but emphasizing stopping abuse in Old Firm matches is key.", "They plan an anti-sectarian summit with officials, church leaders, police and local authorities.", "Jamieson said the executive should tackle soccer troublemakers; she praised police action to crack down on problematic fans.", "She also highlighted clubs' educational packs for young people, praising both Rangers and Celtic's positive moves."], "opencoder:1.5b": ["Jamieson issues warning to bigots.", "Scotland's justice minister has warned bigoted soccer fans that she wants to hit them where it hurts most.", "She banned them from matches due to their behaviour and compliments Celtic and Rangers for their work towards solving the problem.", "MSC: It's a challenging issue, but they can make significant progress.", "The executive must work closely with the clubs to tackle these problems.", "However, Ms Jamieson was speaking ahead of the third round Scottish Cup clash between the Glasgow clubs at Parkhead on Sunday.", "The sectarianism associated with sections of the support from both clubs has become a significant target for the executive.", "Last week, Ms Jamieson and First Minister Jack McConnell met supporters' representatives from both clubs to discuss this issue.", "They plan to hold an anti-sectarian summit next month.", "Speaking on BBC Radio Scotland's Sunday Live programme, Ms Jamieson described Friday's meeting as \"very productive\".", "It was a clear demonstration of the executive's commitment to tackling the problem and ensuring peace and equality in football matches.", "Ms Jamieson praised the police for their action.", "He said: \"The police do want to identify whether there are particular individuals who are going over the top and inciting hatred or violence - they will crack down very effectively on them.\"", "They have already indicated that we will consider the introduction of banning orders to give additional powers to where there are people who are going over the top, who have made inappropriate behaviour at football matches, to be able to stop them attending the games.", "They also appreciate the clubs' efforts in educating young people about this problem and making it a positive move.", "MSC: I believe it's an important challenge.", "The executive must work closely with the clubs to tackle these problems."], "smollm:1.7b": ["The summary should preserve key ideas and details as follows:\n\n1.", "Jamieson issues warning to bigots\n2.", "Scotland's justice minister has warned bigoted soccer fans that she wants to hit them \"where it hurts most\" by banning them from matches.", "3.", "Cathy Jamieson said exclusion orders are one of a series of measures being considered in the Scottish Executive campaign against sectarianism.", "She praised Celtic and Rangers for their work in tackling the problem.", "However, the minister said stopping sectarian abuse associated with Old Firm matches is a key objective.", "Ms Jamieson was speaking ahead of the third round Scottish Cup clash between the Glasgow clubs at Parkhead on Sunday.", "The sectarianism long associated with sections of the support from both clubs has become a significant target for the executive.", "Last week Ms Jamieson and First Minister Jack McConnell met supporters' representatives from both clubs to discuss the issue.", "4.", "They plan to hold an anti-sectarian summit next month with officials from the clubs, church leaders, senior police officers and local authority chiefs among those to be invited.", "Speaking on BBC Radio Scotland's Sunday Live programme, Ms Jamieson described Friday's meeting as \"very productive\" and said putting the squeeze on the bigots would be a key aim.", "Ms Jamieson stressed that sectarianism has not been confined to football but it can act as a \"trigger\" for tensions and violence.", "Clubs have taken action in the past to ban troublesome fans and supporters' groups expressed their desire to ensure that the game is no longer tainted by the problem.", "5.", "Ms Jamieson praised the police for their action and said: \"The police do want to identify whether there are particular individuals who are going over the top and inciting hatred or violence - they will crack down very effectively on them.\"", "She praised the police for their work in tackling sectarianism, saying they have already indicated that they will consider the introduction of banning orders to give additional powers to where there are people who are going over the top, who have made inappropriate behaviour at football matches.", "\"That's the kind of thing that will hit those kind of people where it hurts the most in not allowing them to attend the games,\" she said.", "6.", "Ms Jamieson praised Celtic and Rangers for their efforts, saying: \"I don't think there is any doubt that we have seen some positive moves from the clubs.\"", "Both Rangers and Celtic football clubs have been involved in working with the executive to produce an educational pack for young people."], "deepseek-r1:1.5b": ["Jamieson warns against soccer's role in causing tensions, advising fans to avoid matches where they might incite violence.", "She praised Celtic and Rangers for their work in preventing issues.", "A meeting aims to hold an anti-sectarian summit next month, involving officials, church leaders, and local authorities.", "Ms Jamieson stressed the need for support groups to handle issues and highlighted the police's role in identifying individuals who incite hatred or violence.", "She noted that while soccer can cause tension, it shouldn't be part of a problem where authorities should intervene."], "tinyllama:1.1b": ["The Scottish justice minister has warned bigoted fans of both football clubs that she wants to ban them from matches in a series of measures against sectarianism.", "In her remarks on BBC Radio Scotland's Sunday Live program, Caty Jamieson praised the efforts of CeltiC and Rangers in tackling the problem, stating that \"anti-sectarian summits\" are scheduled for later this month with officials from both clubs, church leaders, senior police officers, and local authority chiefs among those to be invited.", "Ms Jamieson emphasized that sectarianism can act as a trigger for violence, stating that the Scottish Executive campaign against sectarianism requires an \"extra bit\" of action.", "She expressed her support for further measures, including banning orders, to tackle bigots and their supporters at football games."], "tinydolphin:1.1b": [" In a recent gathering, Scotland's justice minister, Jamieson issued a warning against sectarian abuse, encouraging fans of Old Firm matches to step up efforts to tackle the prevalent problem.", "Jamieson praised Celtic and Rangers for their work in combating this issue.", "Meanwhile, meeting supporters' groups from both clubs, the minister also plans an anti-sectarian summit next month.", "The gathering will focus on targeting sectarianism as a key objective by putting pressure on bigots to stop their abuse of football matches."], "phi:2.7b": [" Cathy Jamieson, Scotland's justice minister, has warned bigoted soccer fans that she wants to hit them where it hurts most by banning them from matches.", "She stated that exclusion orders are one of the measures being considered in the Scottish Executive campaign against sectarianism and praised Celtic and Rangers for their work in tackling the problem.", "Ms Jamieson spoke about Friday's meeting with supporters' representatives from both clubs to discuss the issue, emphasizing the need to put the squeeze on the bigots and tackle sectarianism associated with Old Firm matches.", "She also discussed holding an anti-sectarian summit next month, inviting officials from the clubs, church leaders, senior police officers, and local authority chiefs.", "Ms Jamieson stressed that sectarianism has not been confined to football but can act as a trigger for tensions and violence, and highlighted the importance of taking action in the past to ban troublesome fans and supporters' groups.", "She also mentioned that banning orders could be introduced to give additional powers to those who incite hatred or violence at football matches.", "Ms Jamieson praised the police for their efforts and encouraged them to identify individuals who go over the top and make inappropriate behavior, then stop them from attending games.", "She concluded by acknowledging positive moves made by both clubs in working with the executive, including producing an educational pack for young people."], "orca-mini:3b": [" Scotland's justice minister has warned bigoted soccer fans that she wants to hit them \"where it hurts most\" by banning them from matches.", "Cathy Jamieson praised Celtic and Rangers for their work in tackling the problem of sectarianism but said stopping sectarian abuse associated with Old Firm matches is a key objective.", "The minister said introducing banning orders is one of a series of measures being considered in the Scottish Executive campaign against sectarianism."], "hermes3:3b": ["Cathy Jamieson warns bigoted soccer fans, promising to ban them from matches to combat sectarianism in Scotland's Old Firm matches."], "stablelm-zephyr:3b": ["Scotland's justice minister, Cathy Jamieson, has warned bigoted soccer fans that she wants to ban them from matches as part of the Scottish Executive campaign against sectarianism.", "Exclusion orders are being considered, along with other measures, in response to ongoing sectarian abuse associated with Old Firm matches between Celtic and Rangers.", "The meeting between Jamieson and First Minister Jack McConnell last week was described as \"very productive,\" with an anti-sectarian summit planned for next month involving officials from the clubs, church leaders, senior police officers, and local authority chiefs.", "The minister emphasized that sectarianism is not limited to football and can serve as a trigger for tensions and violence.", "Jamieson praised the police for their actions and stated that additional powers would be considered through banning orders.", "She also commended Celtic and Rangers for their efforts in tackling sectarianism, specifically mentioning the production of an educational pack for young people by both clubs."], "chatgpt-4o-latest": ["Scotland's justice minister, Cathy Jamieson, has warned bigoted soccer fans that they may face match bans as part of efforts to combat sectarianism.", "She highlighted exclusion orders as a key measure and praised Celtic and Rangers for their efforts in addressing the issue.", "Ahead of an Old Firm match, she emphasized the government's commitment to tackling sectarian abuse linked to football.", "Jamieson and First Minister Jack McConnell recently met with supporters' representatives and plan to hold an anti-sectarian summit with key stakeholders.", "She stressed that sectarianism extends beyond football but can trigger violence, and clubs have taken steps to ban troublesome fans.", "Jamieson affirmed the executive's role in addressing the issue and supported police efforts to crack down on individuals inciting hatred.", "She reiterated the potential introduction of banning orders to prevent offenders from attending matches, stating this would be an effective deterrent.", "She also commended Celtic and Rangers for their collaboration with the government on educational initiatives."], "stablelm2:1.6b": ["Scotland's justice minister, Cathy Jamieson, warns bigoted soccer fans about a potential ban during matches as part of the Scottish Executive campaign against sectarianism.", "She considers exclusion orders and aims to prevent sectarian abuse associated with Old Firm matches.", "The minister met supporters' representatives from both Celtic and Rangers clubs last week to discuss the issue.", "They plan to hold an anti-sectarian summit next month, inviting officials from the clubs, church leaders, senior police officers, and local authority chiefs.", "Jamieson stresses that sectarianism has not been limited to football but can act as a trigger for tensions and violence, urging the executive to tackle soccer troublemakers."], "granite3.1-dense:2b": ["Scotland's Justice Minister, Cathy Jamieson, has vowed to ban bigoted soccer fans from matches as part of a broader campaign against sectarianism.", "Speaking ahead of the Old Firm match between Celtic and Rangers, Jamieson highlighted that stopping such abuse is a priority.", "She praised both clubs for their efforts in addressing the issue and mentioned an upcoming anti-sectarian summit involving club officials, church leaders, police, and local authorities to discuss further measures.", "Jamieson emphasized that sectarianism can escalate from football stadiums into violence and tensions.", "She praised the police for their role in identifying troublemakers, who will face banning orders if they engage in inappropriate behavior at matches.", "These orders aim to deter such individuals by denying them access to games, thus \"hitting them where it hurts most.\"", "The minister also noted Celtic and Rangers' positive contributions, including producing an educational pack for young people to combat sectarianism."]}