{"raw_text": "Clarke plans migrant point scheme\n \n Anyone planning to move to the UK will have to pass a test to prove they can contribute to the country, Home Secretary Charles Clarke has said.\n \n He is proposing a points system similar to Australia's but would avoid the quota system planned by the Tories. Mr Clarke, who will unveil his plans on Monday, said economic migration helped the UK but \"needed proper policing\". The Lib Dems say they will look at his plans, but Tory Liam Fox said his party offered a \"clear choice\" on the issue. The Conservative Party Co-Chairman said the British electorate had a choice between a Labour government that had \"done nothing for eight years and will not set a limit\" on immigration and a Tory one that would impose quotas.\n \n The home secretary said, by 2008, he wanted everyone given a visa and entering the UK to have their fingerprints taken, to \"ensure we can know everybody who is in the country\". Speaking on BBC One's Breakfast with Frost, he said \"economic migrants are of great value to this country\", but stressed that proper policing was needed to ensure that they do not become a \"burden on society\". He said: \"We will establish a system ... which looks at the skills, talents and abilities of people seeking to come and work in this country, and ensures that when they come here they have a job and can contribute to the economy of the country.\"\n \n The home secretary, whose five-year blueprint for immigration and asylum is expected to be published on Monday, also rejected claims that the immigration debate encouraged bigotry. \"The issue of who does come into this country, and whether they are entitled to be in this country, who does settle here, how we have border controls, is a perfectly legitimate aspect of public debate,\" he said. Liberal Democrat home affairs spokesman Mark Oaten said: \"Whilst it is good that Labour has rejected the Tory idea of quotas on asylum, the jury is still out on the Home Office's ability to deliver a fair and efficient asylum system.\"\n \n Mr Howard has said Britain should take its fair share of the world's \"genuine refugees\". But he claims the current asylum system is being abused - and with it Britain's generosity. Trevor Phillips, chairman of the Commission for Racial Equality, called on Mr Clarke to denounce the suggestion Britain's hospitality was being tested by immigration. \"Tell that to the 44,000 doctors in the NHS and the 70,000 nurses without whom we would really see what pressure on the health service means,\" he said. \"Ditto the teachers, from South Africa, Australia, Jamaica, who are reducing the sizes of our classes and schools.\" The Refugee Council said Mr Howard's proposals would mean there would be no safe haven in the UK.\n", "llama3.2:1b": ["Home Secretary Charles Clarke plans to introduce a points-based system for migrant entry to the UK, aiming to prioritize skilled workers over others.", "He aims to establish a visa process by 2008 with fingerprint checks and labor market testing.", "The Home Office will not use quotas but rather focus on skills and qualifications.", "The plan has been welcomed by some parties, including the Liberal Democrats, while others, such as the Conservative Party Co-Chairman Liam Fox, have expressed skepticism about it."], "llama3.2:3b": ["Home Secretary Charles Clarke plans to introduce a points system for migrants moving to the UK, with a test to prove their ability to contribute to society.", "He wants to establish a system that looks at skills and abilities of those seeking work, ensuring they have a job and can contribute to the economy.", "The plan differs from the Conservative Party's proposal of quotas on asylum."], "gemma2:2b": ["Home Secretary Charles Clarke proposes a points-based system for migrant visas similar to Australia's but without quotas.", "This would assess individuals' skills and economic contributions, with fingerprint collection for everyone entering the country.", "Clarke emphasizes economic benefits of migrants while stressing the need for proper policing to prevent burdens on society.", "The Liberal Democrats are considering this proposal and Conservative party leader Liam Fox argues that he offers a choice on immigration compared to Labour's inaction.", "This debate also touches on claims that it encourages bigotry, with Clarke refuting these concerns.", "Some argue the current asylum system is abused, while others highlight the positive impact of diverse immigrants in healthcare, education, and other sectors."], "qwen2.5:0.5b": ["Clarke plans to propose a points system similar to Australia's for economic migration, but he avoids using quota systems.", "He believes proper policing is necessary.", "The Home Office has rejected claims that their immigration debate encourages bigotry and Labour rejects the Tory idea of quotas on asylum.", "The Refugee Council calls for safe haven in the UK."], "qwen2.5:1.5b": ["Home Secretary Charles Clarke plans a points system for economic migrants to help Britain but avoids quota restrictions, sparking debate over proper policing and fair asylum policies.", "Conservative Co-Chairman dismisses Labour's proposal of limiting asylum seekers while acknowledging British hospitality is being tested by immigration.", "The Liberal Democrats show interest in Clarke's proposals but question the ability to establish an efficient asylum system."], "qwen2.5:3b": ["Home Secretary Charles Clarke proposes a points-based migration system similar to Australia’s but without quotas, aimed at ensuring economic migrants contribute to the country.", "By 2008, he aims for all visa holders to have their fingerprints taken for identification purposes.", "He sees economic migrants as valuable but emphasizes proper policing to prevent them from becoming burdens on society.", "Clarke claims his plan addresses legitimate public debate concerns and rejects quota-based immigration control proposed by the Tories.", "Critics argue that such measures could undermine a fair and efficient asylum system, while critics like Trevor Phillips highlight the contributions of healthcare professionals and educators who might face shortages under Clarke's proposals."], "opencoder:1.5b": ["Clarke plans a migrant point scheme.", "Anyone planning to move to the UK will have to pass a test to prove they can contribute to the country, Home Secretary Charles Clarke has said.", "He is proposing a points system similar to Australia's but would avoid the quota system planned by the Tories.", "Mr Clarke, who will unveil his plans on Monday, said economic migration helped the UK but \"needed proper policing\".", "The Lib Dems and Tory Liam Fox said they will look at his plans.", "The Conservative Party Co-Chairman said the British electorate had a choice between a Labour government that had \"done nothing for eight years and will not set a limit\" on immigration and a Tory one that would impose quotas.", "The home secretary said, by 2008, he wanted everyone given a visa and entering the UK to have their fingerprints taken, to \"ensure we can know everybody who is in the country\".", "The BBC One's Breakfast with Frost, he said, \"economic migrants are of great value to this country\", but stressed that proper policing was needed to ensure that they do not become a \"burden on society\".", "He said: \"We will establish a system ... which looks at the skills, talents and abilities of people seeking to come and work in this country, and ensures that when they come here they have a job and can contribute to the economy of the country.\"", "Liberal Democrat home affairs spokesman Mark Oaten said: \"Whilst it is good that Labour has rejected the Tory idea of quotas on asylum, the jury is still out on the Home Office's ability to deliver a fair and efficient asylum system.", "Trevor Phillips, chairman of the Commission for Racial Equality, called on Mr Clarke to denounce the suggestion Britain's hospitality was being tested by immigration.\""], "smollm:1.7b": ["Clarke plans migrant point scheme"], "deepseek-r1:1.5b": ["Clarke proposes a flexible points system to assess migrants in the UK, avoiding the fixed quota system but ensuring proper policing.", "The plan involves evaluating skills, talents, and contributions to foster trust.", "A fingerprint check would verify identities.", "Clarke criticized policies like quotas on asylum and called for better safe shelters.", "He expected a detailed blueprint over five years, published, though he critiqued claims of encouraging bigotry."], "tinyllama:1.1b": ["Charles Clarke, the Home Secretary, has announced a points-based migration scheme to encourage economic migrants to join Britain's population.", "He plans to establish a system similar to Australia's, but with more stringent criteria for qualifying.", "The policy aims to curb economic migrants entering the country, while also ensuring that proper policing is implemented to monitor their contributions to society.", "The Lib Dem's party leader, Nick Clegg, has pledged an \"easy choice\" on this issue, and Mr Howard has claimed Britain should take its fair share of worldwide refugees.", "The proposed policy is being criticized by political parties, including the Liberal Democrats, who argue that Labour's current asylum system is being abused, while the Refugee Council believes that there would be no safe haven in the UK under Mr Howard's plans."], "tinydolphin:1.1b": [" Home Secretary Charles Clarke announced a new points system for migrants to the United Kingdom, aiming to make it easier for immigrants who can contribute to society and have work experience to gain permission to settle in the country.", "The scheme will be similar to Australia's but with more stringent criteria.", "Mr. Clarke claims that such migration has helped the UK, as well as benefiting migrants themselves.", "He also argued that Britain should not impose quotas on immigration like the Conservatives and the Lib Dems.", "Instead, he proposed a points system similar to Australia's, with an emphasis on job creation, education, and language proficiency for applicants.", "This could benefit both migrants and the UK economy by encouraging people from diverse backgrounds to settle in the country.", "The Liberal Democrats have expressed concerns about the proposal, as they believe it promotes bigotry and that Britain should take its fair share of refugees.", "Mr. Howard has claimed that Britain should be a generous nation, but he claims that the current asylum system is being abused.", "He also argues that Britain's hospitality is being tested by immigration, which he views as negative for the country's economy.", "The Refugee Council expressed concern that Mr. Howard's proposals will mean there would be no safe haven in the UK, as they argue that migrants would need to settle in large urban areas, where there may not be enough job opportunities or resources available for them."], "phi:2.7b": [" Home Secretary Charles Clarke has proposed a points-based system for people planning to move to the UK that aims to ensure economic migrants can contribute to the country.", "He also wants to take fingerprints of everyone entering the UK, and stresses the need for proper policing to prevent immigrants becoming a burden on society.", "The Labour Party will review his plans, but the Conservative Party offers a clear choice between a Labour government with no limits on immigration or a Tory party that imposes quotas.", "Mr Howard has said Britain should welcome genuine refugees, but the current asylum system is being abused and threatens Britain's generosity."], "orca-mini:3b": [" Clarke proposes migrant point scheme, but avoids quota system."], "hermes3:3b": ["Home Secretary Charles Clarke proposes migrant points system to test economic contributions before allowing entry to the UK."], "stablelm-zephyr:3b": ["Home Secretary Charles Clarke plans a migrant point scheme for anyone wishing to move to the UK, similar to Australia's system but without quotas.", "His proposed plan will consider the skills, talents, and abilities of migrants seeking work, ensuring they can contribute to the economy.", "He also wants everyone entering the country by 2008 to have their fingerprints taken for identification purposes.", "Clarke rejects claims that the immigration debate encourages bigotry and maintains that proper policing is needed to manage migration.", "However, Liberal Democrat Mark Oaten questions the Home Office's ability to deliver a fair and efficient asylum system.", "Critics argue that taking a fair share of the world's refugees would put strain on Britain's healthcare and education systems."], "chatgpt-4o-latest": ["Home Secretary Charles Clarke proposed a points-based immigration system for the UK, similar to Australia's, to ensure migrants contribute to the economy while avoiding the Conservative Party's quota system.", "He emphasized the need for proper policing of economic migration and announced plans for fingerprinting all visa holders by 2008.", "Clarke rejected claims that immigration debates encouraged bigotry, stating border control discussions were legitimate.", "The Liberal Democrats were open to reviewing the plan, while the Conservatives criticized Labour for not setting immigration limits.", "Tory leader Michael Howard argued the asylum system was being abused, while Trevor Phillips of the Commission for Racial Equality defended migrants' contributions to essential services.", "The Refugee Council warned that Conservative proposals could eliminate safe haven for refugees."], "stablelm2:1.6b": ["Home Secretary Charles Clarke proposes a points-based migrant system for the UK similar to Australia's, with proper policing needed to avoid burdening society.", "He plans to establish a system that assesses skills, talents, and abilities of migrants seeking work in the country while ensuring they have jobs and contribute to the economy.", "The proposal also includes fingerprinting everyone entering the UK by 2010 to ensure everyone knows who is present in the country."], "granite3.1-dense:2b": ["Home Secretary Charles Clarke plans a migrant point system for the UK, resembling Australia's but without quotas.", "This system aims to assess and prioritize economic migrants' skills, talents, and potential contributions.", "By 2008, all visa-holders will have their fingerprints taken to track their presence in the country.", "Clarke emphasizes that such a measure is necessary for proper policing to prevent immigrants from becoming a societal burden.", "He unveils these plans on Monday as part of his five-year blueprint for immigration and asylum.", "The Liberal Democrats will consider the proposal, while Conservative Co-Chairman Liam Fox positions it as a choice between a Labour government without immigration limits or a Tory party with imposed quotas on asylum seekers.", "Clarke also rejects claims that the immigration debate fosters bigotry, stating it is a legitimate aspect of public discourse.", "Meanwhile, British Prime Minister John Howard advocates for taking fair shares of genuine refugees, criticizing current asylum system abuse and the strain on British resources.", "Trevor Phillips from the Commission for Racial Equality urges Clarke to challenge suggestions that UK hospitality is being tested by immigration, citing healthcare professionals and teachers from diverse backgrounds who alleviate pressure on these sectors.", "The Refugee Council warns that Howard's proposals could deprive the UK of safe havens for refugees."]}