{"raw_text": "Kennedy questions trust of Blair\n \n Lib Dem leader Charles Kennedy has said voters now have a \"fundamental lack of trust\" of Tony Blair as prime minister.\n \n He said backing his party was not a wasted vote, adding that with the Lib Dems \"what you see is what you get\". He made his comments at the start of a day of appearances on Channel Five in a session on The Wright Stuff programme. Questions from callers, a studio audience and the show's presenter covered Lib Dem tax plans, anti-terror laws and immigration.\n \n Mr Kennedy said during his nearly 22 years in Parliament he had seen prime ministers and party leaders come and go and knew the pitfalls of British politics. \"1983 was when I was first elected as an MP - so Tony Blair, Michael Howard and myself were all class of '83 - and over that nearly quarter of a century the world has changed out of recognition,\" he said. \"We don't actually hear the argument any longer: 'Lib Dems, good people, reasonable ideas but only if we thought they could win around here - it's a wasted vote'. \"You don't hear that because the evidence of people's senses demonstrates that it isn't a wasted vote.\" But he said Mr Blair had lost the trust of the British people. \"There is a fundamental lack of trust in Tony Blair as prime minister and in his government,\" he said.\n \n \"What we've got to do as a party - what I've got to do as a leader of this party - is to convey to people that what you see is what you get.\" Mr Kennedy also used his TV appearance to defend his party's plans to increase income tax to 50% for those earning more than £100,000, saying it would apply to just 1% of the population. He said the extra revenue would allow his party to get rid of tuition and top-up fees, introduce free personal care for the elderly and replace the council tax with a local income tax. Mr Blair has already spent a day with Five and Michael Howard is booked for a similar session.\n", "llama3.2:1b": ["Charles Kennedy, leader of the Lib Dems, questioned the trust of Tony Blair as prime minister, stating that voters now have \"a fundamental lack of trust\" in him.", "He claimed backing his party was not a wasted vote due to the Lib Dems' consistent performance and policies.", "Kennedy noted that he had seen many prime ministers come and go over nearly 22 years in Parliament."], "llama3.2:3b": ["Liberal Democrat leader Charles Kennedy said voters now have a \"fundamental lack of trust\" in Tony Blair as prime minister, calling it a wasted vote that people should not be told to make.", "He stated that his party's tax plans, including increasing income tax to 50% for those earning over £100,000, are reasonable and would benefit the population."], "gemma2:2b": ["Charles Kennedy stated that voters lack trust in Tony Blair and his government.", "He emphasized the Liberal Democrats' commitment to transparency, arguing that their policies are not wasted votes.", "Kennedy defended his party's plan to increase income tax, stating it would benefit various social programs while only affecting a small percentage of earners."], "qwen2.5:0.5b": ["Lib Dem leader Charles Kennedy says voters now have \"fundamental lack of trust\" in Tony Blair as prime minister, adding that his party's policies are \"wasted votes\".", "He defends his party's income tax increase plans while praising the Labour government’s free care package and council tax replacement."], "qwen2.5:1.5b": ["Charles Kennedy, leader of the Liberal Democrats, questions Tony Blair's trustworthiness as prime minister, stating that voters now lack confidence in him despite his party winning elections.", "He argues people do not support his party if they have wasted their votes on it and expresses skepticism towards Blair's government.", "Kennedy defends his party's tax plans and other policies, including increasing income taxes for the wealthy to fund social programs."], "qwen2.5:3b": ["Kennedy questions Blair’s trust, stating voters now lack it as prime minister.", "He argues that the Lib Dems offer clear ideas rather than hoping for a win, emphasizing his 22 years of political experience and changes in British politics since 1983.", "Kennedy claims voters should see the party's policies: higher income tax for top earners (effectively affecting only 1%) would fund tuition fee abolition, free elderly care, and local income taxes instead of council taxes.", "He defends his party’s plans, while Blair and Michael Howard have also appeared on Channel Five."], "opencoder:1.5b": ["Kennedy questions trust of Blair\n\nLib Dem leader Charles Kennedy has said voters now have a \"fundamental lack of trust\" of Tony Blair as prime minister.", "He said backing his party was not a wasted vote, adding that with the Lib Dems \"what you see is what you get\".", "He made his comments at the start of a day of appearances on Channel Five in a session on The Wright Stuff programme.", "Questions from callers, a studio audience and the show's presenter covered Lib Dem tax plans, anti-terror laws and immigration.", "Mr Kennedy said during his nearly 22 years in Parliament he had seen prime ministers and party leaders come and go and knew the pitfalls of British politics.", "\"1983 was when I was first elected as an MP - so Tony Blair, Michael Howard and myself were all class of '83 - and over that nearly quarter of a century the world has changed out of recognition,\" he said.", "\"We don't actually hear the argument any longer: 'Lib Dems, good people, reasonable ideas but only if we thought they could win around here - it's a wasted vote'.", "\"You don't hear that because the evidence of people's senses demonstrates that it isn't a wasted vote.\"", "But he said Mr Blair had lost the trust of the British people.", "\"There is a fundamental lack of trust in Tony Blair as prime minister and in his government,\" he said.", "He used his TV appearance to defend his party's plans to increase income tax to 50% for those earning more than £100,000, saying it would apply to just 1% of the population.", "He said the extra revenue would allow his party to get rid of tuition and top-up fees, introduce free personal care for the elderly and replace the council tax with a local income tax.", "Mr Blair has already spent a day with Five and Michael Howard is booked for a similar session."], "smollm:1.7b": ["Kennedy questions trust of Blair\nLib Dem leader Charles Kennedy has said voters now have a \"fundamental lack of trust\" in Tony Blair as prime minister."], "deepseek-r1:1.5b": ["Charles Kennedy commented that voters now lack trust in Tony Blair as prime minister.", "He argued backing the party wasn't a wasted vote, with Lib Dems believing \"what you see\" is what you get but noting Blair's loss of trust.", "Kennedy criticized income tax policies to increase taxes on the top 1% and lower council taxes for those under £100k.", "Michael Howard is booked in another session alongside Blair."], "tinyllama:1.1b": ["The text mentions that voters have a \"fundamental lack of trust\" towards Tony Blair as prime minister, based on his party's proposals to increase income tax to 50% for those earning more than £100,000.", "Lib Dem leader Charles Kennedy also argued that voting Lib Dem was not a waste of votes, emphasizing the need to convey to people what they can expect from his party's plans.", "During an appearance on Channel Five, he defended his tax plan, explaining that it would only affect \"1% of the population\", and said it would allow his party to implement tuition fees' replacement, introduce free personal care for the elderly, and replace council tax with a local income tax.", "The text also mentioned Michael Howard's upcoming appearance on the same program and his plans to reduce university tuition fees to £10,000, which he would introduce as part of his party's proposals to abolish tuition fees altogether."], "tinydolphin:1.1b": [" Charles Kennedy questioned the trust of Tony Blair as Prime Minister on Monday, expressing dissatisfaction with the lack of trust in his decision-making abilities and government's policies.", "In an interview with Channel Five, he stated that backing his party was not a wasted vote because he believed voters now had a \"fundamental lack of trust\" in the former Labour Prime Minister.", "He also criticized the Conservative Party for having a leader who is perceived as unpredictable and change-averse, while the Liberal Democrats' policies align more closely with the desires of their supporters."], "phi:2.7b": [" Kennedy criticizes Blair's trustworthiness as prime minister due to lack of support from the British people.", "The Liberal Democrat party leader, Charles Kennedy, has been in politics since 1983.", "He defends his party's plans to increase income tax for those earning more than £100,000 to fund free personal care and education.", "Mr. Blair is set to appear on Channel Five as well."], "orca-mini:3b": [" Charles Kennedy, the leader of the Lib Dems, has stated that voters no longer trust Tony Blair as prime minister and that the party's plans to increase income tax to 50% only apply to 1% of the population.", "He made these comments during a TV appearance on Channel Five and defended his party's tax plans."], "hermes3:3b": ["Kennedy claims fundamental lack of trust in Blair as PM."], "stablelm-zephyr:3b": ["Lib Dem leader Charles Kennedy said voters have a \"fundamental lack of trust\" in Tony Blair as prime minister, during appearances on Channel Five's The Wright Stuff programme.", "He emphasized that backing his party was not a wasted vote, adding that the Lib Dems offer \"what you see is what you get.\"", "Kennedy mentioned that over nearly 22 years in Parliament, he had witnessed numerous changes and the challenges of British politics.", "He defended his party's plan to increase income tax to 50% for those earning more than £100,000, stating it would only affect 1%.", "The extra revenue would be used to remove tuition and top-up fees, provide free personal care for the elderly, and replace the council tax with a local income tax."], "chatgpt-4o-latest": ["Lib Dem leader Charles Kennedy stated that voters have a \"fundamental lack of trust\" in Prime Minister Tony Blair.", "He argued that supporting the Lib Dems is not a wasted vote, emphasizing that his party is transparent in its policies.", "Speaking on Channel Five's The Wright Stuff, Kennedy addressed issues such as tax plans, anti-terror laws, and immigration.", "He highlighted his long political experience and dismissed the notion that voting Lib Dem is futile.", "Kennedy defended his party's proposal to raise income tax to 50% for those earning over £100,000, stating it would affect only 1% of the population and fund policies like eliminating tuition fees, providing free personal care for the elderly, and replacing council tax with a local income tax.", "Blair and Conservative leader Michael Howard also participated in similar media sessions."], "stablelm2:1.6b": ["Lib Dem leader Charles Kennedy says there's a \"fundamental lack of trust\" in Tony Blair as prime minister, citing a change in public opinion.", "He defends the Lib Dems' stance on voting, noting that what you see is what you get, and criticizes Mr. Blair for losing trust from the British people.", "The article also covers Lib Dem tax plans, anti-terror laws, and immigration, along with defense of their proposed income tax increases to fund free services."], "granite3.1-dense:2b": ["Charles Kennedy, Liberal Democrat leader, expressed on Channel Five's The Wright Stuff program that voters have lost trust in Tony Blair as prime minister due to his government's actions over the past 22 years.", "Despite this, Kennedy maintained that voting for the Lib Dems is not a wasted vote, as their policies are transparent and reliable.", "He defended his party's tax plan to raise income tax for those earning over £100,000 to 50%, emphasizing it would affect only 1% of the population.", "The additional revenue, according to Kennedy, would fund eliminating tuition and top-up fees, providing free personal care for the elderly, and replacing council tax with a local income tax.", "This statement comes after both Tony Blair and Michael Howard have already appeared on Channel Five."]}