{"raw_text": "Clarke faces ID cards rebellion\n \n Charles Clarke faces his first real test as home secretary on Monday with a possible backbench rebellion over the controversial ID cards bill.\n \n Up to 30 Labour MPs could oppose the scheme during a Commons debate. Mr Clarke, who took on the post on Thursday after David Blunkett quit, has rejected calls to \"pause\" on the bill. Tory leader Michael Howard also faces a possible rebellion after deciding to back identity cards. The Liberal Democrats oppose the plans.\n \n Mr Clarke, writing in The Times, accused some critics of \"liberal woolly thinking and spreading false fears\" by claiming ID cards would erode civil liberties. He writes that it is actually a \"profoundly civil libertarian measure because it promotes the most fundamental civil liberty in our society - which is the right to live free from fear crime and fear\". Mr Clarke is expected to try and win over opponents to the scheme by saying officials who secretly accessed information they were not allowed to see would face up to two years in jail. He is also expected to cut the £85 cost of the card and passport, for the elderly and those on lower incomes.\n \n Mr Howard last week said his front bench team had reached a \"collective view\" to back ID cards after holding a \"good discussion\", but admitted it was \"not an easy issue\". He had decided to support the plans as the police said they would help fight terror, crime and illegal immigration. But former shadow attorney general Bill Cash said there was still \"very deep\" disquiet about the plan among senior Tories. He told BBC Radio 4's Today the government was \"intensely authoritarian\" and was creating \"increasingly a Big Brother society\". Critics argue that introducing the cards would be a costly scheme with no specific aim.\n \n Ministers say it would help the fight against terrorism, illegal immigration and organised crime. But opponents say that similar schemes in other countries have not prevented attacks like the Madrid rail bombing. On Sunday, Lib Dem leader Charles Kennedy repeated his call for a \"pause\" in considering the legislation.\n \n He told BBC's Breakfast with Frost programme that Mr Clarke had a \"real opportunity\" on Monday following the departure of Mr Blunkett. \"If you were running a family or a business would you have the second reading of the Identity Cards Bill tomorrow or would you pause to reflect and see what you might do about it in the New Year? \"That is the sensible way to go about it but I think this government has got itself so much into tram lines now that it is not behaving sensibly at all.\" The first cards would be issued in 2008 and, when he was introducing the bill, Mr Blunkett suggested Parliament could decide in 2011 or 2012 whether to make it compulsory for everybody to own the cards, although not to carry them. The new bill would also create new criminal offences on the possession of false identity documents.\n", "llama3.2:1b": ["Charles Clarke faces opposition from up to 30 Labour MPs during a Commons debate on ID card legislation, with Tory leader Michael Howard also expected to face criticism over his support for the plan.", "Critics accuse Clarke and other officials of spreading false fears about civil liberties.", "The government has promised to cut the cost of the card to the elderly and those on lower incomes, while opponents claim it is \"intensely authoritarian\" and could lead to a Big Brother society."], "llama3.2:3b": ["Charles Clarke faces a possible backbench rebellion from up to 30 Labour MPs over the ID card bill, with some critics accusing the government of \"liberal woolly thinking\" and spreading false fears.", "Clarke rejects calls to pause the scheme, while Liberal Democrats oppose it entirely.", "Michael Howard's decision to back the plan has caused concern among senior Tories, who fear it could create a \"Big Brother society\"."], "gemma2:2b": ["Charles Clarke faces a possible rebellion from Labour MPs over his controversial ID card bill.", "Opposition comes from various groups including Tories and the Liberal Democrats.", "Clarke defends the bill as promoting civil liberties, while critics highlight potential cost and lack of specific aim in preventing crime or terrorism.", "The debate is set for Monday with potential changes to the bill's legislation being considered."], "qwen2.5:0.5b": ["Charles Clarke faces a potential backbench rebellion over his proposed ID card bills.", "Conservative MP Charles Clarke will face a constitutional challenge to his authority as home secretary in an attempt to introduce the proposals.", "Tory leader Michael Howard is expected to oppose the bill, while Liberal Democrats have expressed support for it.", "The government hopes to win back opponents by claiming officials who secretly accessed information they were not allowed to see would face up to two years in jail.", "The bill aims to help fight terror and crime but critics argue its introduction would be a costly scheme with no specific aim.", "Charles Kennedy, the Lib Dem leader, has called for an \"pause\" in considering the legislation following his opposition to Clarke's proposals."], "qwen2.5:1.5b": ["Charles Clarke faces a potential rebellion from Labour MPs over ID card legislation and defends its civil liberties benefits while cutting costs.", "Tory leader Michael Howard may face a similar challenge after deciding to support the controversial bills following recent events.", "The bill's opponents argue it could lead to increased government surveillance and has failed in other countries at preventing attacks like the Madrid rail bombing."], "qwen2.5:3b": ["Charles Clarke faces a potential Labour backbench rebellion over controversial ID cards bill.", "Up to 30 MPs could oppose the scheme in Commons debate.", "Clarke denies calls for 'pause', rejecting critics who claim ID cards will erode civil liberties, arguing it promotes the right to live free from fear of crime and terrorism.", "He aims to win opponents by proposing jail sentences for officials who misuse information, lowering costs for certain groups.", "While Conservative leader Michael Howard supports identity cards due to their anti-terrorism benefits, some senior Tories are skeptical.", "Liberal Democrats oppose ID cards plans.", "Clarke's opportunity arises with David Blunkett quitting the post of Home Secretary.", "Lib Dem leader Charles Kennedy calls for a 'pause' in considering legislation, suggesting Parliament could decide on compulsory cards for all by 2011 or 2012.", "The bill also creates new offenses for possession of false identity documents."], "opencoder:1.5b": ["Clarke faces ID cards rebellion\n\nCharles Clarke faces his first real test as home secretary on Monday with a possible backbench rebellion over the controversial ID cards bill.", "Up to 30 Labour MPs couldOppose the scheme during a Commons debate.", "Mr Clarke, who took on the post on Thursday after David Blunkett quit, has rejected calls to \"pause\" on the bill.", "Tory leader Michael Howard also faces a possible rebellion after deciding to back identity cards.", "The Liberal Democrats oppose the plans.", "Mr Clarke wrote in The Times, accused some critics of \"liberal woolly thinking and spreading false fears\" by claiming ID cards would erode civil liberties.", "He claims it is actually a profoundly civil libertarian measure because it promotes the most fundamental civil liberty in our society - which is the right to live free from fear, crime, and fear.", "Mr Howard last week said his front bench team had backed ID cards after holding a \"good discussion\", but admitted it was not an easy issue.", "He had decided to support the plans as the police said they would help fight terrorism, illegal immigration, and organised crime.", "But opponents say that similar schemes in other countries have not prevented attacks like the Madrid rail bombing.", "On Sunday, Lib Dem leader Charles Kennedy repeated his call for a \"pause\" in considering the legislation.", "He told BBC's Breakfast with Frost programme that Mr Clarke had a \"real opportunity\" on Monday following the departure of Mr Blunkett.", "\"If you were running a family or a business would you have the second reading of the Identity Cards Bill tomorrow or would you pause to reflect and see what you might do about it in the New Year?", "That is the sensible way to go about it but I think this government has got itself so much into tram lines now that it is not behaving sensibly at all.\"", "The first cards would be issued in 2008 and, when he was introducing the bill, Mr Blunkett suggested Parliament could decide in 2011 or 2012 whether to make it compulsory for everybody to own the cards, although not to carry them.", "The new bill would also create new criminal offences on the possession of false identity documents."], "smollm:1.7b": ["The summary is concise and clear, preserving key ideas and details while omitting unnecessary information.", "It provides a brief overview of the main points in the text without adding or subtracting any information."], "deepseek-r1:1.5b": ["Clarke faces ID cards rebellion  \n\nCharles Clarke is facing potential backbench rebellion over the controversial ID cards bill, with up to 30 Labour MPs opposing in a Commons debate.", "His critics argue that the law is a \"liberal woolly thinking\" and spreads false fears, calling it an erasure of civil liberties.", "Clarke plans to try to persuade others by promising prison sentences for accessing sensitive information, reducing costs for vulnerable groups, and cutting expenses."], "tinyllama:1.1b": ["The article discusses a possible backbench rebellion by Labour MPs against the controversial ID cards bill, which was introduced by the current home secretary Charles Clarke on Thursday.", "The article states that the Home Office has rejected claims that the ID cards would erode civil liberties and promotes fundamental freedoms such as the right to live free from fear crime and fear.", "However, some critics argue that similar schemes in other countries have not prevented attacks like the Madrid rail bombing.", "Clarke faces a possible rebellion over the ID cards bill, with up to 30 Labour MPs potentially opposing it during a Commons debate on Monday.", "The article highlights that despite having a \"collective view\" among their front bench team, the government is not an \"intensely authoritarian\" and has introduced new measures in response to terrorism and crime."], "tinydolphin:1.1b": [" Charles Clarke, Home Secretary, faces his first real test since taking on the position on Monday, as a potential backbench rebellion looms over the controversial ID cards bill.", "The bill, which has faced significant opposition from Labour MPs, would create new identification cards for British citizens and permanent residents, allowing them to access numerous services without the need to produce their passports or other forms of ID.", "Critics argue that introducing such a card could undermine civil liberties and lead to increased surveillance, while supporters assert that the cards will help combat terrorism, illegal immigration, and organized crime.", "As the government weighs its options for addressing these concerns, critics are calling for a pause in consideration of the bill.", "The Home Secretary is expected to address these issues during a debate in the Commons on Monday, attempting to win over opponents while maintaining support from his own team."], "phi:2.7b": [" Charles Clarke faces a possible backbench rebellion over his controversial ID cards bill and has decided to press ahead with it despite the opposition from MPs.", "However, some critics believe that introducing the cards would be a costly scheme with no specific aim.", "Ministers say that the cards will help fight against terrorism, illegal immigration and organised crime but opponents argue that similar schemes in other countries have not prevented attacks like the Madrid rail bombing."], "orca-mini:3b": [" Clarke faces ID cards rebellion as up to 30 Labour MPs could oppose the scheme.", "The home secretary is expected to try and win over opponents to the scheme by saying officials who secretly accessed information they were not allowed to see would face up to two years in jail.", "Tory leader Michael Howard also faces a possible rebellion after deciding to back identity cards, while Charles Kennedy reiterates call for a \"pause\" in considering the legislation.", "The new bill would create new criminal offences on the possession of false identity documents."], "hermes3:3b": ["Charles Clarke facing potential ID cards rebellion; up to 30 Labour MPs may oppose scheme during Commons debate."], "stablelm-zephyr:3b": ["Charles Clarke faces a potential backbench rebellion over the UK's ID cards bill as up to 30 Labour MPs may oppose the scheme during a Commons debate.", "Reactions from Michael Howard, Tory leader, and the Liberal Democrats are also noted, with Clarke writing in The Times that opponents are spreading false fears and \"liberal woolly thinking.\"", "He is expected to try and win over critics by addressing concerns over secret information access and reducing the cost of the cards and passport for elderly individuals and those on lower incomes.", "The government argues that ID cards would help fight terrorism, illegal immigration, and organized crime, but opponents point to similar schemes in other countries that have not prevented attacks like the Madrid rail bombing."], "chatgpt-4o-latest": ["Home Secretary Charles Clarke faces a potential rebellion from up to 30 Labour MPs over the controversial ID cards bill.", "Despite calls to pause the legislation, Clarke insists ID cards enhance civil liberties by reducing crime and fear.", "He plans to address concerns by proposing penalties for officials misusing data and reducing costs for vulnerable groups.", "Tory leader Michael Howard supports the bill, citing police claims that it will help combat terrorism and crime, but faces dissent within his party.", "Critics argue the scheme is costly and ineffective, pointing to failures in other countries.", "Liberal Democrat leader Charles Kennedy urges a pause in the legislation.", "The bill, originally introduced by David Blunkett, proposes issuing ID cards in 2008, with a potential decision on making them compulsory by 2011 or 2012.", "It also introduces new criminal offences for possessing false identity documents."], "stablelm2:1.6b": ["Charles Clarke faces a possible backbench rebellion over ID card bill during home secretary position.", "Labour MPs could oppose scheme during Commons debate; Tory leader Michael Howard might have a rebellion too after deciding to support identity cards.", "Clarke accuses critics of spreading false fears about civil liberties; he aims to win opponents by mentioning officials who accessed information secretly and cutting cost for elderly and low-income individuals.", "Critics argue ID cards won..", "Ministers say it helps fight terrorism, crime, and illegal immigration; opponents claim similar schemes in other countries haven't stopped attacks like the Madrid rail bombing.", "Clarke's proposed bill would create new criminal offences on possessing false identity documents; first cards issued by 2010."], "granite3.1-dense:2b": ["Charles Clarke, as home secretary since David Blunkett's resignation, is preparing for a potential rebellion by up to 30 Labour MPs over the controversial ID cards bill in Monday's Commons debate.", "The Liberal Democrats and some Tory backbenchers oppose the plan.", "Clarke defends the scheme as civil libertarian, emphasizing its role in reducing crime and fear.", "He plans to address concerns by threatening jail terms for officials who misuse information and by cutting the card's cost for vulnerable groups.", "Tory leader Michael Howard, after a divided front bench discussion, has decided to back ID cards due to police promises of enhanced security against terrorism, crime, and illegal immigration.", "However, senior Tories like Bill Cash remain deeply dissenting, viewing the plan as authoritarian and leading to a Big Brother society.", "Opponents argue that similar foreign schemes have failed to prevent attacks like the Madrid rail bombing, making compulsion unwarranted.", "Lib Dem leader Charles Kennedy calls for a pause in considering the legislation, suggesting the government should reflect on it before 2011 or 2012.", "The first cards are expected to be issued in 2008, with new criminal offenses against false identity documents."]}