{"raw_text": "Labour pig poster 'anti-Semitic'\n \n The Labour Party has been accused of anti-Semitism over a poster depicting Michael Howard and Oliver Letwin - who are both Jewish - as flying pigs.\n \n Prospective Tory candidate Andrew Mennear, whose Finchley constituency contains a large Jewish community, branded it \"tasteless\" and offensive. The poster shows the two men's faces superimposed on winged pigs and says \"the day the Tory sums add up\". Labour said the poster was \"not anti-Jewish, but anti-Tory\".\n \n It is one of four designs e-mailed to Labour members, who were asked to vote for their favourite. Mr Mennear, who was sent the e-mail by a friend, said he had been \"shocked\" by the image and had shown it to friends who were similarly horrified. He said there was nothing more distasteful for a Jewish person than to be associated with a pig. \"I am not suggesting there is any deliberate intent, but these sort of things can cause great offence. It clearly wasn't thought through. \"It is possible the posters were designed for maximum impact, but this one clearly overstepped the mark and should be withdrawn.\"\n \n The campaign was particularly insensitive as it had come out at the same time as Holocaust Day, a \"difficult\" time for many Jewish people, Mr Mennear added. A Labour spokesman denied the campaign was anti-Semitic. \"As we said at the time the James report (the Tory backed inquiry into possible public spending savings) was published pigs will fly before the Tory's sums will add up. This poster is making a serious point,\" he said. A Conservative Party spokesman said: \"While the Conservatives are concentrating on the issues that matter to people, such as lower taxes and controlled immigration, it is clear to see that the Labour Party is not. People will not be fooled.\"\n", "llama3.2:1b": ["Labour poster 'anti-Semitic' accuses Michael Howard and Oliver Letwin of being flying pigs, but Labour claims the design was \"not anti-Jewish\".", "Conservative candidate Andrew Mennear defends the poster, saying it made a serious point about Tory sums adding up.", "A spokesperson for the Labour Party denies the campaign is anti-Semitic."], "llama3.2:3b": ["Labour accused of anti-Semitism over poster depicting Jewish politicians as flying pigs, with a Conservative candidate calling it \"tasteless\" and insensitive, particularly during Holocaust Day."], "gemma2:2b": ["A Labour Party poster depicting politicians Michael Howard and Oliver Letwin as pigs has sparked accusations of anti-Semitism.", "The poster was part of a campaign for Labour members to vote on design choices.", "Some argue the image is offensive, while Labour defends it as targeting Tory policies."], "qwen2.5:0.5b": ["The Labour Party has been accused of creating an anti-Semitic poster featuring Michael Howard and Oliver Letwin as flying pigs.", "Andrew Mennear, who represents a Jewish community in Finchley, UK, said the image was \"tasteless\" and offensive.", "He described it as \"not anti-Jewish but anti-Tory.\"", "Tory candidate Andrew Mennear sent this e-mail to Labour members about the design, saying they should vote for their preferred candidate.", "Mr. Mennear was shocked by the image and showed it to friends who were also horrified.", "The campaign came out at the same time as Holocaust Memorial Day, which many Jewish people find difficult.", "A Conservative Party spokesman claimed that the Conservatives are focusing on issues like lower taxes and immigration instead of focusing on anti-Semitism."], "qwen2.5:1.5b": ["The Labour Party's poster featuring Jewish politicians Michael Howard and Oliver Letwin as flying pigs has been accused of anti-Semitism.", "It was criticized by an opponent who found the image offensive.", "The party denies its intent but acknowledges it could offend Jews.", "This incident occurred during Holocaust Remembrance Day when candidates were asked to design posters, showing sensitivity towards themes related to their constituency's Jewish population."], "qwen2.5:3b": ["The Labour Party has been accused of anti-Semitism for a poster featuring Michael Howard and Oliver Letwin, both Jewish, superimposed onto winged pigs with the caption \"the day the Tory sums add up\".", "Andrew Mennear, a prospective Conservative candidate from Finchley, described it as \"tasteless\" and offensive.", "Mennear claimed it caused great offence to Jews, considering being associated with a pig is one of the most distasteful things for them.", "He stated that Labour denied the campaign was anti-Semitic, while Conservatives dismissed the criticism.", "The poster came during Holocaust Day, making it particularly insensitive."], "opencoder:1.5b": ["Labour Party poster \"anti-Semitic\"\n\nThe Labour Party has been accused of anti-Semitism over a poster depicting Michael Howard and Oliver Letwin who are both Jewish - as flying pigs.", "Prolonged pro-life_candidate Andrew Mennear, whose Finchley constituency contains a large Jewish community, branded it \"tasteless\" and offensive.", "The poster depicts the two men's faces superimposed on winged pigs with the word \"the day the Tory sums add up\".", "The campaign was resistant to criticism as it had come out at the same time as Holocaust Day, leading to a \"difficult\" time for many Jewish people.", "Mr Mennear, who was sent the e-mail by a friend, felt shock as he experienced the image and had shown it to friends who were similarly horrified.", "The poster clearly overstepped the mark and should be withdrawn.", "It's possible that the posters were designed for maximum impact, but this one indicates a lack of consideration and therefore should not be interpreted as an anti-Semitic attack.", "The campaign was particularly insensitive and there was a clear point made by the poster - it is possible that the report published on the James report (the Tory backed inquiry into possible public spending savings) was intended to help people cope with the harsh reality of the Holocaust."], "smollm:1.7b": ["The Labour Party has been accused of anti-Semitism over a poster depicting Michael Howard and Oliver Letwin - who are both Jewish - as flying pigs.", "The Labour Party has been criticized for its handling of this issue, with some calling it \"tasteless\" and offensive.", "The poster was one of four designs e-mailed to Labour members, who were asked to vote for their favourite.", "Andrew Mennear, who was sent the e-mail by a friend, said he had been \"shocked\" by the image and had shown it to friends who were similarly horrified.", "He said there was nothing more distasteful for a Jewish person than to be associated with a pig.", "\"I am not suggesting there is any deliberate intent, but these sort of things can cause great offence,\" he said.", "It clearly wasn't thought through, however, and should be withdrawn.", "The campaign was particularly insensitive as it had come out at the same time as Holocaust Day, a \"difficult\" time for many Jewish people.", "A Labour spokesman denied the campaign was anti-Semitic.", "While the Conservatives are concentrating on the issues that matter to people, such as lower taxes and controlled immigration, it is clear to see that the Labour Party is not.", "People will not be fooled."], "deepseek-r1:1.5b": ["The Labour Party accused a poster of being anti-Semitic for depicting Jewish individuals as pigs.", "A Conservative spokesperson denied it, while a Labour member criticized a Conservative candidate, who called the posters tasteless and offensive, especially in Finchley.", "The candidate emphasized their focus on issues like taxes and immigration instead of anti-Semitism."], "tinyllama:1.1b": ["In response to accusations of anti-Semitism from the Labour Party, a poster featuring Michael Howard and Oliver Letwin depicting them in superimposed pigs has been criticized as \"tasteless\" and offensive.", "The poster was sent out among party members by Labour members for their vote on four designs that were e-mailed to them.", "One of the design images shows Howard and Letwin flying pigs, and another depicts them superimposed on a winged pig.", "This has been described as \"not anti-Jewish, but anti-Toy\" by a Labour member, who shared the information with friends.", "The poster campaign's timing has also been criticized as potentially \"inseensitive\" at a time of Holocaust Day.", "The Conservative Party's spokesperson clarified that while the campaign was meant to make a serious point about public spendings savings, it was not anti-Semitic, adding that Labour is not.", "However, some have taken issue with the poster for being insensitive towards Jewish people in an attempt to highlight issues of lower taxes and controlled immigration."], "tinydolphin:1.1b": [" This text talks about a political poster created by the Labour Party.", "The poster has Michael Howard and Oliver Letwin as pigs flying.", "The Jewish community in Finchley is upset with this poster because they believe it's offensive and not related to Jews.", "Some people are even considering withdrawing it from circulation.", "A close friend of Mr. Mennear saw the e-mail sent by a Labour member, which includes four designs for the poster.", "Mr. Mennear feels there is nothing more distasteful for a Jewish person than being associated with a pig.", "This issue shows how politics can cause hurt and divisions between people."], "phi:2.7b": [" The Labour Party has been accused of anti-Semitism over a poster depicting Michael Howard and Oliver Letwin as flying pigs, saying \"the day the Tory sums add up\".", "Prospective Conservative candidate Andrew Mennear found the image offensive due to his large Jewish community.", "The other designs were also deemed tasteless by some members.", "The Labour party spokesperson denied the campaign was anti-Semitic and claimed it was designed for maximum impact.", "However, Mr Mennear argued that the poster overstepped the mark and should be withdrawn as it is insensitive at a time of Holocaust Day."], "orca-mini:3b": [" The Labour Party was accused of anti-Semitism after an e-mail containing four posters featuring Michael Howard and Oliver Letwin as flying pigs was sent to members.", "The poster with the \"tasteless\" and offensive design was designed to vote for the party's favorite poster.", "However, it caused offense to many Jewish people during the Holocaust Day, a \"difficult\" time for them.", "The campaign was designed to make a serious point, but it was not anti-Semitic."], "hermes3:3b": ["Labour poster accused of being anti-Semic, showing offensively designed image of Jewish MPs Michael Howard and Oliver Letwin as pigs."], "stablelm-zephyr:3b": ["The Labour Party has been criticized for a poster depicting Michael Howard and Oliver Letwin, both Jewish, as flying pigs with the caption \"the day the Tory sums add up.\"", "Prospective Tory candidate Andrew Mennear called it \"tasteless\" and offensive.", "The party denied that the campaign was anti-Semitic, claiming it made a serious point about public spending savings."], "chatgpt-4o-latest": ["The Labour Party faced accusations of anti-Semitism over a poster depicting Jewish politicians Michael Howard and Oliver Letwin as flying pigs.", "Conservative candidate Andrew Mennear, representing a constituency with a large Jewish community, called the image offensive and tasteless, noting that associating Jewish people with pigs is particularly distasteful.", "Labour defended the poster, stating it was anti-Tory, not anti-Jewish, and aimed to criticize Conservative economic policies.", "Mennear argued the timing, coinciding with Holocaust Day, made it especially insensitive.", "A Labour spokesman insisted the poster was making a serious political point, while a Conservative spokesman criticized Labour for focusing on such tactics instead of key issues like taxes and immigration."], "stablelm2:1.6b": ["The Labour Party has been accused of anti- Semitism due to a poster featuring Michael Howard and Oliver Letwin as flying pigs, both of whom are Jewish.", "Prospective Tory candidate Andrew Mennear criticized it as \"tasteless\" and \"offensive.\"", "The design was part of an email sent to Labour members who were asked to vote for their favorite, with the campaign being particularly insensitive during Holocaust Day.", "A Labour spokesman denied the campaign was anti- Semitism, stating that the poster was making a serious point."], "granite3.1-dense:2b": ["The Labour Party faced criticism for a poster depicting Michael Howard and Oliver Letwin, both Jewish, as flying pigs, superimposed with the caption \"the day the Tory sums add up\".", "Prospective Conservative candidate Andrew Mennear condemned it as tasteless and offensive, particularly insensitive given Holocaust Day.", "Labour defended the poster, claiming it was anti-Tory, not anti-Jewish, but Mennear believed it crossed a line, potentially causing great distress to Jewish individuals due to the association with pigs.", "A Conservative Party spokesman criticized Labour for not focusing on issues like taxes and immigration instead of engaging in such a controversial campaign."]}