{"raw_text": "Kilroy unveils immigration policy\n \n Ex-chatshow host Robert Kilroy-Silk has attacked UK policy on immigration saying Britain's open door approach is hitting low wage \"indigenous\" workers.\n \n The Veritas leader said the only people to benefit from immigrants from places like Poland were employers, landlords, members of the 'metropolitan elite'. The MEP said his party would only admit foreigners who were required because they had specific skills to offer. And he argued asylum cost £2bn a year for 14,000 successful applicants.\n \n Mr Kilroy-Silk said that worked out at £143,000 per successful asylum seeker. He said Veritas wanted to grant an amnesty for all those in Britain claiming asylum and who have children and deport everyone else. Britain should take its fair share of asylum seekers under the United Nations Convention on Human Rights, he argued. And Mr Kilroy-Silk said he wanted to spend an extra £500m a year to help provide for refugees abroad.\n", "llama3.2:1b": ["Robert Kilroy-Silk has criticized UK policy on immigration, arguing that it benefits only high-skilled workers and the wealthy, while harming low-wage \"indigenous\" workers.", "He wants to admit foreigners with specific skills but deport those without children or who don't fit his criteria.", "He also proposes a £500m annual spend to support refugees abroad."], "llama3.2:3b": ["Robert Kilroy-Silk, leader of Veritas, has unveiled an immigration policy that would only admit foreigners with specific skills and charge employers £143,000 per successful asylum seeker, while offering an amnesty to those already in Britain claiming asylum."], "gemma2:2b": ["Robert Kilroy-Silk criticizes UK immigration policy, claiming it unfairly benefits employers and landlords while hurting low-wage \"indigenous\" workers.", "He proposes stricter immigration policies, including admitting only skilled immigrants and ending asylum.", "He argues that the current system is expensive and should be reformed to fulfill international human rights obligations, including taking more refugees under UN conventions."], "qwen2.5:0.5b": ["UK immigration policy remains open despite criticism from Kilroy-Silk, UK's MEP.", "Kilroy-Silk believes that only employers and landlords are benefiting from the open-door approach while other immigrants like Poland workers and asylum seekers cost an extra £143,000 per successful applicant.", "He argues for a comprehensive amnesty and funding for refugees to help cover costs."], "qwen2.5:1.5b": ["Robert Kilroy-Silk criticizes UK immigration policy as benefiting employers and landlords while charging £143, 000 per successful asylum seeker.", "He advocates for amnesties and increased funding for refugee aid under UNCHR guidelines and seeks an additional £500m annually to help refugees abroad."], "qwen2.5:3b": ["Ex-chatshow host Robert Kilroy-Silk criticizes UK immigration policy, claiming it benefits only employers and landlords.", "He proposes admitting only skilled immigrants and offering amnesty to asylum seekers with children while deporting the rest.", "Kilroy-Silk argues that asylum seekers cost £2bn annually for 14,000 successful applicants, costing £143,000 per person.", "He also wants to allocate an extra £500m yearly for refugee aid."], "opencoder:1.5b": ["Kilroy unveils immigration policy.", "Robert Kilroy-Silk has attacked UK policy on immigration saying Britain's open door approach is hitting low wage \"indigenous\" workers.", "The Veritas leader argued asylum cost £2bn a year for 14,000 successful applicants.", "Mr Kilroy-Silk said worked out at £143,000 per successful asylum seeker.", "Veritas wanted to grant an amnesty for all those in Britain claiming asylum and who have children and deport everyone else.", "Kilroy-Silk spent an extra £500m a year to help provide for refugees abroad.", "This task is crucial as it will significantly reduce the strain on human capital and boost economic development across the globe."], "smollm:1.7b": ["The summary is:\n\nKilroy-Silk attacks UK immigration policy as unfair and exploitative of low-wage workers.", "He argues that the country's open door approach benefits only employers, landlords, and members of the \"metropolitan elite\".", "The Veritas party will only admit foreigners who are required because they have specific skills to offer.", "And he believes that the cost of asylum seekers is too high for 14,000 successful applicants.", "The key ideas in this summary include:\n\n1.", "Kilroy-Silk's criticism of UK immigration policy as unfair and exploitative of low-wage workers.", "2.", "The idea that the country's open door approach benefits only employers, landlords, and members of the \"metropolitan elite\".", "3.", "The Veritas party's stance on admitting foreigners who are required because they have specific skills to offer.", "4.", "Mr Kilroy-Silk's belief that the UK should take its fair share of asylum seekers under the United Nations Convention on Human Rights.", "5.", "His proposal for an amnesty for all successful asylum seekers and deportation of everyone else."], "deepseek-r1:1.5b": ["Robert Kilroy-Silk presents himself as attacked by UK immigration policies regarding low wages among indigenous workers, with Veritas and MEP criticizing his claims.", "He states that asylum seekers from Poland cost £143k per person to work, while Veritas wants an amnesty for all British claimants, using the UN Convention on Human Rights to cover more people, and aims to spend an extra £500 million annually on refugees abroad."], "tinyllama:1.1b": ["Robert Kilroy-Silk criticizes UK immigration policy, stating that it is hitting low wage \"native\" workers with benefits from foreign workers who benefit politically and financially from their successful applications.", "He argues that the cost of asylum for 14,000 successful claimants amounts to £143,000 per person, while deporting all those in Britain seeking asylum would be a fairer way to deal with the situation.", "Kilroy-Silk believes it is time for an amnesty and a deportation of everyone who has children in the UK and wants to remain.", "He calls for an additional £500m every year to support refugees abroad, while also advocating for UK policy on immigration to be fairer and more humane towards native workers."], "tinydolphin:1.1b": [" A summary of the text: Ex-chatshow host Robert Kilroy-Silk has criticized UK immigration policy, saying that it is hitting low wage \"indigenous\" workers and is unfairly benefiting employers and landlords.", "The Veritas leader argued that only specific foreign workers should be admitted into Britain.", "He proposed a plan to admit them on a case-by-case basis, providing an amnesty for those who have children and the opportunity to leave permanently if they wish.", "He also called for an additional £500m per year to help refugees abroad."], "phi:2.7b": [" Robert Kilroy-Silk attacked UK policy on immigration, claiming that it was hurting low-income \"indigenous\" workers and only benefiting employers, landlords, members of the metropolitan elite.", "He suggested that Veritas would only admit foreigners who had specific skills to offer and wanted to deport everyone else.", "Mr Kilroy-Silk also argued for an amnesty for all asylum seekers with children and proposed spending £500m a year on helping refugees abroad."], "orca-mini:3b": [" Kilroy unveils immigration policy by blaming low wages and benefit-taking immigrants on UK policy, stating that employers and landlords are the only ones benefiting from immigrants, and that asylum seekers cost the country billions of pounds annually.", "Kilroy also suggests that deporting all failed asylum seekers would save money, and proposes granting an amnesty for all those in Britain claiming asylum with children and deleting documents for everyone else.", "Veritas wants to take its fair share of asylum seekers under the United Nations Convention on Human Rights and proposes spending more money to help refugees abroad."], "hermes3:3b": ["Robert Kilroy-Silk opposes UK open immigration policy, claiming it benefits employers, landlords etc.", "; wants stricter admission of foreign workers based on specific skills; argues for granting amnesty for asylum claimants with children, deporting others; suggests increasing funding for refugees overseas."], "stablelm-zephyr:3b": ["Ex-chatshow host Robert Kilroy-Silk criticizes UK immigration policy, arguing that the open door approach is negatively impacting low-wage \"indigenous\" workers.", "He claims that only employers, landlords, and members of the metropolitan elite benefit from immigrants with specific skills.", "Veritas supports granting an amnesty for asylum seekers with children and paying Britain's fair share under the United Nations Convention on Human Rights.", "Kilroy-Silk proposes an extra £500m annual spending to help refugees abroad."], "chatgpt-4o-latest": ["Robert Kilroy-Silk, leader of Veritas, criticized the UK's immigration policy, claiming it harms low-wage indigenous workers while benefiting employers, landlords, and the metropolitan elite.", "He proposed admitting only skilled foreign workers and highlighted the £2bn annual cost of asylum for 14,000 successful applicants, equating to £143,000 per person.", "Veritas advocated granting amnesty to asylum seekers with children while deporting others.", "Kilroy-Silk supported taking a fair share of asylum seekers under the UN Convention and proposed an additional £500m annually to aid refugees abroad."], "stablelm2:1.6b": ["Ex-chatshow host Robert Kilroy- Silk criticized UK immigration policy and argued that only low-wage \"indigenous\" workers are affected by it.", "He claimed that employers, landlords, and the 'metropolitan elite' benefit from immigrants from Poland, while Veritas wants to grant amnesty for all asylum seekers with children.", "Kilroy-Silk proposed Britain should take its fair share of asylum seekers under the UN Convention on Human Rights and increase funding for refugees abroad."], "granite3.1-dense:2b": ["Ex-TV host Robert Kilroy-Silk, leading the Veritas party, criticizes UK's immigration policy as favoring employers and the metropolitan elite over \"indigenous\" workers, who suffer from low wages due to immigrant influx.", "He proposes a skills-based approach for admitted foreigners, deporting all other asylum seekers, and granting amnesty to those with British children.", "Kilroy-Silk advocates for Britain to accept its share of asylum seekers under the UN Convention on Human Rights and allocates an additional £500m annually for refugee support abroad.", "He estimates the annual cost of asylum at £2bn, amounting to £143,000 per successful applicant."]}