{"raw_text": "Sport betting rules in spotlight\n \n A group of MPs and peers has called for a tightening of regulations controlling betting on sport.\n \n The Parliamentary Group on Betting and Gaming held a substantial inquiry into betting last year. It followed fears that a massive increase in betting on sport, such as that done using the internet and mobile phones, has led to more cheating. The all-party group recommended 15 ways to protect punters and improve the integrity of sports betting. They include a proposal for raising the maximum jail sentence for gambling cheats above the current two years. Lord Condon, head of the International Cricket Council's anti-corruption unit, who originally made the call for longer prison sentences, said the two-year penalty was \"derisory\". \"You could get a bigger sentence for failing to pay your hotel bill criminally than you could for corruption in major sports. \"Symbolically, a higher penalty, perhaps as the Bill passes through the two Houses, might be appropriate.\"\n \n The report recommended the governing bodies of sports have a say in the type of bets offered to punters, and for bookmakers to set up \"audit trails\" - something the new betting exchanges already do - to allow suspicious betting patterns to be traced.\n \n Lord Faulkner of Worcester, who chaired the inquiry, said: \"Whilst we accept that the greater part of sports betting is neither corrupt nor unfair to punters, the evidence convinces us that the growth of betting exchanges - because of the facility they provide to bet against a result - has increased the potential for corruption. \"It is important that the government works with sporting administrators to review the difficulties faced by governing bodies in convicting the guilty and penalising them appropriately.\" The panel's aim was to try to define what constitutes cheating, assess how much might be going on and suggest what the government might do to put it right. As well as the growth of internet and mobile phone betting, there has been the creation of betting exchanges which allow punters to fix odds between themselves. Betting exchanges allow punters to back (to win) but also lay (to lose) a horse. This means they can control their odds at winning by placing their money both ways.\n", "llama3.2:1b": ["A parliamentary group recommends tightening regulations controlling sport betting, citing concerns over cheating and the growth of betting exchanges.", "The group suggests raising the maximum jail sentence for gambling cheats to 15 years, allowing for more severe penalties than current two-year sentences.", "They also recommend giving governing bodies of sports a say in bet types offered to punters and setting up \"audit trails\" for suspicious betting patterns."], "llama3.2:3b": ["A group of MPs and peers have called for stricter regulations on sport betting, citing concerns over cheating and the need for improved integrity in sports betting.", "They recommend increasing prison sentences for corruption, allowing governing bodies to regulate bets, and setting up audit trails to detect suspicious patterns.", "The panel found that the growth of betting exchanges has increased the potential for corruption due to their ability to allow punters to control odds by placing both win and lose bets."], "gemma2:2b": ["A parliamentary group has called for increased regulation of sports betting, citing concerns about its impact on cheating and the need to protect bettors.", "The group's recommendations include raising penalties for gambling cheats and empowering governing bodies in sport to regulate bets offered.", "They also advocate for \"audit trails\" from bookmakers to facilitate suspicious betting pattern detection."], "qwen2.5:0.5b": ["The Parliamentary Group on Betting and Gaming called for tighter regulation of sport betting, including increased jail sentences for gamblers using technology like smartphones and internet gambling platforms.", "They suggested governing bodies should have more say in what types of bets are offered to punters and bookmakers could set up \"audit trails\" to track suspicious betting patterns."], "qwen2.5:1.5b": ["The UK's Parliamentary Group on Betting and Gaming calls for stricter regulations on sports betting, including tougher penalties for cheaters, oversight of betting exchanges to track suspicious patterns, and input from sporting bodies in determining what constitutes corruption."], "qwen2.5:3b": ["A group of MPs and peers has called for stricter regulations on sport betting due to concerns about increased cheating, especially through internet and mobile platforms.", "The Parliamentary Group on Betting and Gaming recommended 15 measures to protect punters and enhance the integrity of sports betting, including raising penalties for cheaters, allowing governing bodies a say in offered bets, and implementing audit trails.", "Lord Condon recommends increasing prison sentences beyond two years due to corruption risks from betting exchanges, which allow punters to bet against results.", "The inquiry also noted that internet and mobile betting have grown along with the creation of betting exchanges.", "Lord Faulkner of Worcester emphasized the need for sports administrators and government cooperation in addressing potential corruption issues."], "opencoder:1.5b": ["\"Sport betting rules in spotlight\"\nA group of MPs and peers has called for a tightening of regulations controlling betting on sport.", "The parliamentary group held a substantial inquiry into the country's gambling habits, which was founded on fears that a massive increase in online betting could lead to corruption or cheating.", "The government recommended 15 ways to protect punters and improve the integrity of sports betting.", "It highlighted an important element of interest in sports betting, namely the ability to bet against a result directly instead of having to bet on outcomes that may not have occurred yet.", "The report also suggested the governing bodies of sports have a say in the type of bets offered to punters and for bookmakers to set up \"audit trails\" to allow suspicious betting patterns to be traced.", "This process helps to detect any fraudulent activities within the sport industry, thereby protecting the integrity of the business.", "The government has been working closely with governing bodies to assess any potential challenges they face when they try to convict the guilty and correct them appropriately.", "As for growth in internet and mobile phone betting, there is growing evidence suggesting that it could lead to corruption or cheat.", "As betting rules evolve, so too do their prevalence and the strategies adopted by sports gambling.", "The Government has made significant investments into creating more efficient betting systems, which can allow punters to control their odds at winning by placing their money both ways in a given match."], "smollm:1.7b": ["The text above is concise, preserving key ideas and details.", "It summarizes the main points of the text without adding or removing information.", "The summary should be as brief as possible while still conveying the essential meaning of the original text."], "deepseek-r1:1.5b": ["A group of MPs and peers have called for stricter regulations on sports betting.", "They criticized a parliamentary inquiry into increased internet and mobile phone sports betting, which worried about potential cheating issues.", "The inquiry recommended 15 ways to protect punters and improve integrity, including raising the maximum jail sentence forGamblers above two years.", "Lord Condon, International Cricket Council's anti-corruption head, argued that a two-year penalty was \"derisory\" compared to criminal penalties for hotel billing failures, suggesting higher sentences might be appropriate when Bill comes through both houses.", "The report also suggested that governing bodies should have input on betting types and bookmakers should establish audit trails like new exchanges provide.", "Lord Faulkner chairs the inquiry, emphasizing that sports betting growth increases corruption potential and calling for government action to correct these issues."], "tinyllama:1.1b": ["The House of Commons has called for increased punishment and more controls on sports betting, with a proposal to raise the maximum prison sentence for gambling cheats and introduce \"audiotrails\" for bookmaker suspicious bet patterns.", "The Parliamentary Group on Betting and Gaming held an inquiry in 2019 and came up with 15 proposals to improve the integrity of sports betting.", "The report recommended that sporting administrators, including the International Cricket Council, have a say in the type of bets available to punters, and for bookmakers to set up \"audiotrails\" to trace suspicious betting patterns.", "Lord Faulkner, chair of the inquiry, said the growth of betting exchangs - betting exchanges that allow punters to fix odds between themselves - has increased the potential for corrpution in sports betting.", "He also highlighted the need to work with sporting administrator to review difficulties facing governing bodies and assess how much might be going on to put it right.", "The panel's aim was to try to define what constitutes cheating, assess the levels of corruption involved and suggest what the government might do to put things right."], "tinydolphin:1.1b": [" The inquiry into the regulation of betting in sport has revealed that the growth of online bookmaking and betting exchanges has made it more difficult for governing bodies to convict cheaters, resulting in increased risks to punters.", "A key recommendation from the all-party group on betting and gaming is for the government to work with sporting authorities to review the difficulties faced by governing bodies in prosecuting guilty individuals.", "The Parliamentary Group on Betting and Gaming has also called for a new maximum jail sentence of two years for those found guilty of cheating.", "If such a penalty was introduced, Lord Condon, head of the International Cricket Council's anti-corruption unit, stated that the two-year penalty would be \"derisory\".", "Therefore, it seems that the government is struggling to keep up with the rapid advancements in online betting and must find new ways to protect punters from potential corruption."], "phi:2.7b": [" The Parliamentary Group on Betting and Gaming has called for tighter regulations on sports betting due to concerns over increased cheating and the growth of betting exchanges.", "They suggested raising the maximum jail sentence for gambling cheats, as well as improving monitoring systems such as audit trails provided by betting exchanges.", "The group's aim was to assess the extent of corruption in sports betting and recommend solutions to protect punters."], "orca-mini:3b": [" The group called for tighter regulations controlling betting on sport, following concerns about the massive increase in betting on sport using the internet and mobile phones, leading to more cheating.", "They recommended raising the maximum jail sentence for gambling cheats above the current two years, and for governing bodies of sports to have a say in the type of bets offered to punters and for bookmakers to set up \"audit trails\" to allow suspicious betting patterns to be traced."], "hermes3:3b": ["Summary:\nMPs and peers call for tighter sports betting regulations to combat cheating, suggest raising maximum jail sentence for gambling cheats, and recommend governing bodies having say in bets offered and bookmakers setting up 'audit trails'."], "stablelm-zephyr:3b": ["A group of MPs and peers is calling for tighter regulations on sport betting due to concerns that an increase in online and mobile betting has led to more cheating.", "The Parliamentary Group on Betting and Gaming conducted a substantial inquiry last year, recommending 15 measures to protect punters and enhance the integrity of sports betting.", "These include higher maximum jail sentences for gambling cheats, having governing bodies of sports influence the types of bets offered, and setting up \"audit trails\" to trace suspicious betting patterns.", "The growth of betting exchanges, allowing punters to bet against results, has also increased the potential for corruption."], "chatgpt-4o-latest": ["A group of MPs and peers has called for stricter regulations on sports betting due to concerns over increased cheating, particularly with internet and mobile betting.", "The Parliamentary Group on Betting and Gaming conducted an inquiry and proposed 15 measures to protect bettors and maintain sports integrity.", "Recommendations include raising the maximum jail sentence for gambling cheats beyond the current two years, which Lord Condon criticized as too lenient.", "The report also suggests that sports governing bodies should have input on bet types and that bookmakers should establish audit trails to track suspicious betting patterns.", "Lord Faulkner emphasized that while most sports betting is fair, betting exchanges, which allow punters to bet against outcomes, have heightened corruption risks.", "The panel aims to define cheating, assess its prevalence, and propose government actions to address it."], "stablelm2:1.6b": ["A group of MPs and peers is calling for stricter regulation on sports betting due to concerns over increased cheating through internet and mobile phone usage.", "The International Cricket Council's anti--corruption unit initially proposed longer jail sentences, but the report recommends raising the maximum sentence to three years.", "Betting bodies should have a say in offering bets, and bookmakers must set up \"audit trails\" to trace suspicious betting patterns.", "The aim is to define what constitutes cheating, assess its extent, and suggest how the government can address it."], "granite3.1-dense:2b": ["The Parliamentary Group on Betting and Gaming, in response to concerns about increased sports betting cheating via the internet and mobile devices, proposed 15 measures to enhance punter protection and maintain sports betting integrity.", "These include raising the maximum jail sentence for gambling offenders from two years to a more substantial term, empowering sports governing bodies to influence bet offerings, and compelling bookmakers to establish audit trails for suspicious betting patterns.", "The report also highlights that betting exchanges, which enable punters to both back and lay on outcomes, have potentially heightened corruption risks due to their facilitating nature.", "The aim of these recommendations is to clarify cheating definitions, evaluate the extent of such activities, and guide the government in addressing these issues effectively."]}