{"raw_text": "MPs assess Scots fishing industry\n \n A group of MPs are on a two-day fact-finding mission to Scotland to gather evidence for a report into the UK's fishing industry.\n \n Members of Westminster's environment, food and rural affairs committee will be touring fish markets and talking to fish processors. They will also talk to Fisheries Minister Ross Finnie and scientists. MPs are deciding whether to recommend a new system of \"community quotas\" to conserve fish stocks. The aim is that fishing ports like Peterhead or Fraserburgh would be allocated a quota and local people would decide how to fish it. The scheme is a variation on the local management committees already being established by the European Union.\n \n Details are contained in a Royal Commission report for the UK Government, along with the more controversial idea of closing some mixed fishing grounds completely. Six members of the committee will be in Scotland to seek views from fishermen and processors in Aberdeen and Peterhead. They will also speak to Mr Finnie, representatives of the Royal Society and the Sea Fish Industry Authority. Committee chairman Austin Mitchell said some way has to be found of harvesting mixed fisheries without wasting stocks.\n", "llama3.2:1b": ["MPs assess Scots fishing industry\n MPs on a two-day fact-finding mission in Scotland to gather evidence for a report into the UK's fishing industry.", "MPs will tour fish markets, talk to processors and Fisheries Minister Ross Finnie, and scientists.", "A new system of \"community quotas\" could be introduced, with local people deciding how to allocate them among fishing ports like Peterhead or Fraserburgh."], "llama3.2:3b": ["A group of MPs are on a two-day fact-finding mission to Scotland to gather evidence for a report on the UK's fishing industry.", "They will assess community quotas, local management committees, and closing mixed fishing grounds to conserve fish stocks.", "Six members of the committee will visit Aberdeen and Peterhead to speak with fishermen and processors."], "gemma2:2b": ["MPs are visiting Scotland to gather evidence for a report on the UK's fishing industry, considering whether to recommend \"community quotas\" or closing mixed fishing grounds."], "qwen2.5:0.5b": ["A group of MPs are visiting Scotland to gather evidence for a report into UK fishing industry, including talks with fish processors, Fisheries Minister Ross Finnie, scientists, and potential new system of community quotas.", "Details will be included in the Royal Commission's report and the European Union's local management committee, along with plans for closing some mixed fisheries completely."], "qwen2.5:1.5b": ["Members of Westminster's Environment, Food, and Rural Affairs Committee are visiting Scotland for two days to investigate the UK's fishing industry, with a focus on assessing community quotas as an alternative to local management committees in EU member states.", "They will also discuss new proposals on closing certain mixed fishing grounds completely, gathering input from fishermen, processors, Fisheries Minister Ross Finnie, scientists, and Royal Society representatives.", "This includes touring fish markets and talking to people in Aberdeen and Peterhead about the issue of harvesting mixed fisheries without wasting stocks."], "qwen2.5:3b": ["A group of MPs on a two-day fact-finding mission to Scotland aims to gather evidence for a report on the UK's fishing industry.", "They will visit fish markets, talk to processors, and meet Fisheries Minister Ross Finnie and scientists.", "The goal is to decide whether to recommend a new system of \"community quotas\" to conserve fish stocks, akin to existing EU local management committees.", "This involves allocating quotas to fishing ports like Peterhead or Fraserburgh, which locals would manage.", "The MPs will also consider the controversial option of closing some mixed fishing grounds completely.", "The committee chairman, Austin Mitchell, emphasizes finding a way to harvest mixed fisheries without wasting stocks.", "Details are part of a Royal Commission report for UK Government and involve visits to Aberdeen and Peterhead."], "opencoder:1.5b": ["MPs assess the Scots fishing industry.", "A group of MPs are on a two-day mission to gather evidence for a report into UK's fishing industry.", "Members of the environment, food and rural affairs committee will be engaging in lively discussions with fish markets and talking to fish processors.", "They also meet with Fisheries Minister Ross Finnie and scientists to decide whether to adopt a new system of \"community quotas\" to conserve fish stocks.", "The aim is for ports like Peterhead or Fraserburgh to be allocated a quota, and local people will decide the course on how to catch it.", "The system is based on previous agreement between local management committees established by the European Union."], "smollm:1.7b": ["The MPs assess the Scottish fishing industry by touring fish markets and talking to fish processors.", "They decide whether to recommend a new system of community quotas for conserving fish stocks, which is a variation on the local management committees already being established by the European Union.", "The aim is that fishing ports like Peterhead or Fraserburgh would be allocated a quota and local people would decide how to fish it.", "The report contains details about the Royal Commission's findings and the more controversial idea of closing some mixed fishing grounds completely.", "Six members of the committee will be in Scotland to seek views from fishermen and processors in Aberdeen and Peterhead, as well as representatives of the Royal Society and the Sea Fish Industry Authority."], "deepseek-r1:1.5b": ["MPS are conducting a two-day fact-finding mission in Scotland to gather evidence for a report on the UK's fishing industry.", "They will visit fish markets and processors, including those in Aberdeen and Peterhead, with discussions about sustainable fishing practices.", "The aim is to allocate specific \"community quotas\" at designated ports like Peterhead or Fraserburgh, allowing local fishermen and scientists to decide how to manage the fishery.", "Additionally, MPs are considering a new system of community quotas, which could be a variation on existing local management committees already established by the European Union.", "Other MPs include Ross Finnie and representatives from the Royal Society and the Sea Fish Industry Authority.", "There is also mention of challenges in managing mixed fishing grounds."], "tinyllama:1.1b": ["The House of Commons' Environment, Food & Rural Affairs committee will embark on a two-day fact-finding mission in Scotland to gather evidence for a report investigating the UK's fishing industry.", "Members will be visiting fish market places and talking with fish processors while also meeting scientists and MPs from Westminster's Environment, Food & Rural Affairs committee to determine if community quotas are suitable for conserving fish stocks in local fishing ports like Peterhead or Fraserburgh.", "The report is titled \"Scotland's Fisheries: Towards a sustainable future,\" and aims to establish regional quotas based on the local management commitments established by EU, as well as a \"closing\" policy for certain mixed fishing grounds.", "Six MPs will be traveling to Scotland to receive feedback from fishers and processors while seeking opinions from others within the Royal Commission report."], "tinydolphin:1.1b": [" Members of Westminster's environment, food, and rural affairs committee are embarking on a two-day fact-finding mission to Scotland.", "They will be touring fish markets and talking to fish processors in Aberdeen and Peterhead.", "They will also discuss with Fisheries Minister Ross Finnie the concept of \"community quotas,\" a system where each fishing port would receive a quota based on local input.", "The aim is that fishing areas such as Peterhead or Fraserburgh would be given a quota to fish while local people decide how to use it.", "In addition, six members of the committee are in Scotland for a Royal Commission report and other information."], "phi:2.7b": [" A group of MPs is visiting Scotland on a two-day fact-finding mission to gather evidence for a report into the UK's fishing industry.", "They will tour fish markets, talk to fish processors and talk to Fisheries Minister Ross Finnie and scientists to assess whether to recommend a new system of \"community quotas\" to conserve fish stocks.", "The aim is that fishing ports like Peterhead or Fraserburgh would be allocated a quota, and local people decide how to fish it.", "MPs are also seeking views from fishermen and processors in Aberdeen and Peterhead on closing some mixed fishing grounds completely as suggested by a Royal Commission report."], "orca-mini:3b": [" Westminster MPs are visiting Scotland to assess the UK fishing industry, including talking to Fisheries Minister Ross Finnie and scientists.", "They will recommend a new system of \"community quotas\" to conserve fish stocks, which would allow fishing ports like Peterhead or Fraserburgh to allocate a quota and local people to decide how to fish it.", "The committee chairman Austin Mitchell said the UK government needs to find a way to harvest mixed fisheries without wasting stocks."], "hermes3:3b": ["MPs inspect Scottish fishing industry, examining potential \"community quotas\" for conserving fish stocks."], "stablelm-zephyr:3b": ["A group of MPs are on a two-day fact-finding mission in Scotland to gather evidence for a report into the UK's fishing industry.", "They will tour fish markets, speak to fish processors and Fisheries Minister Ross Finnie, as well as scientists.", "The committee is considering recommending a new system of \"community quotas\" to conserve fish stocks, similar to local management committees being established by the European Union.", "They will also discuss the possibility of closing some mixed fishing grounds entirely."], "chatgpt-4o-latest": ["A group of MPs is visiting Scotland on a fact-finding mission to gather evidence for a report on the UK's fishing industry.", "They will tour fish markets, speak with fish processors, Fisheries Minister Ross Finnie, and scientists.", "The MPs are considering recommending \"community quotas,\" where fishing ports like Peterhead or Fraserburgh receive quotas managed locally.", "This idea is similar to EU local management committees.", "A Royal Commission report also suggests the controversial option of closing some mixed fishing grounds.", "Six committee members will consult fishermen, processors, and industry representatives in Aberdeen and Peterhead.", "Committee chairman Austin Mitchell emphasized the need to harvest mixed fisheries without wasting stocks."], "stablelm2:1.6b": ["A group of MPs are visiting Scotland to assess the UK fishing industry as part of a report.", "They'll talk to fish markets, processors, minister Ross Finnie, scientists, and fishermen about community quotas for conserving fish stocks.", "The aim is that local people decide how to fish while fishing ports like Peterhead or Fraserburgh get allocated a quota.", "This scheme is similar to the EU's local management committees.", "Six MPs will travel to Aberdeen/Peterhead for more information."], "granite3.1-dense:2b": ["A team of UK Parliament Members from the environment, food, and rural affairs committee is conducting a two-day fact-finding mission in Scotland to collect data for a report on the UK's fishing industry.", "Their objectives include assessing community quota proposals, which would allocate quotas to specific fishing ports like Peterhead or Fraserburgh, allowing local stakeholders to manage fishing.", "They will also explore the idea of closing certain mixed fishing grounds completely.", "The MPs aim to consult with Fisheries Minister Ross Finnie, scientists, and representatives from organizations such as the Royal Society and the Sea Fish Industry Authority.", "Committee chairman Austin Mitchell emphasizes the need to prevent overfishing while preserving fish stocks."]}