{"raw_text": "Army chiefs in regiments decision\n \n Military chiefs are expected to meet to make a final decision on the future of Scotland's Army regiments.\n \n A committee of the Army Board, which is made up of the most senior defence figures, will discuss plans for restructuring regiments on Monday. The proposals include cutting Scotland's six single-battalion regiments to five and merging these into a super regiment. The plans have faced stiff opposition from campaigners and politicians alike. The committee's decision must be ratified by Defence Secretary Geoff Hoon and Prime Minister Tony Blair. It is expected that it will be made public next week. When ministers announced a reorganisation of the Army it drew a question mark over the futures of the Black Watch, the Kings Own Scottish Borderers, the Royal Scots, the Royal Highland Fusiliers and the Argyll and Sutherland Highlanders. In October, the Council of Scottish Colonels proposed the merger of the Royal Scots and the King's Own Scottish Borderers into a single battalion.\n \n Under their vision, it would be one of five in the new super regiment. The proposals to either merge or amalgamate the six regiments into a super regiment sparked a political outcry, with Labour backbenchers and opposition politicians opposing the plan. They felt the timing was insensitive because the Black Watch was in the frontline in Iraq, suffering casualties. The Save the Scottish Regiments campaigners were so angered they threatened to stand against Labour at the next general election.\n \n Speaking ahead of the expected Army Board meeting, a spokesman said: \"The government and the Army Board have spent the past four months attempting to trick serving soldiers and the public into thinking their planned changes for the Scottish regiments are for the good of the Army and for that of the serving soldier. \"They are very much not for the good and will destroy Scotland's regiments by moulding them into a single super regiment which will lead to severe recruitment problems, a loss of local connections to those regiments and a loss to Scotland of an important part of her heritage and, most importantly, her future - the regiments are the envy of armies around the world.\" An alternative blueprint had been put forward by Labour MP Eric Joyce, who proposed going ahead with the merger while preserving the other regiments. For a brief time, there was speculation the prime minister might consider the plan, but that now seems unlikely. Speaking in Scotland last week, Mr Blair said the aim was to preserve tradition but introduce a more effective structure and hinted that a super regiment was likely. He said: \"They don't want to get rid of the history or the traditions of the regiment or the local connections - far from it, all they want to do is make sure they can transfer people easily across regiments and deploy them more flexibly.\" The prime minister said he hoped campaigners' concerns would be taken into account but the need for effective change had to be paramount.\n", "llama3.2:1b": ["Army chiefs in Scotland will meet to discuss plans for restructuring the country's six single-battalion regiments, which include the Black Watch, Royal Scots, and others.", "The proposals include merging these regiments into a super regiment, with five merged units.", "A committee of the Army Board has proposed the plan, but it faces opposition from campaigners and politicians.", "The plan is expected to be discussed at an upcoming meeting, with Defence Secretary Geoff Hoon and Prime Minister Tony Blair involved in the decision-making process."], "llama3.2:3b": ["Military chiefs will meet to decide on Scotland's Army regiment restructuring plans, which include cutting six single-battalion regiments to five and merging them into a super regiment.", "Campaigners and politicians oppose the plan, citing concerns about tradition, local connections and recruitment problems.", "The proposal is expected to be made public next week and must be ratified by Defence Secretary Geoff Hoon and Prime Minister Tony Blair."], "gemma2:2b": ["Army chiefs will meet to decide the future of Scotland's six army regiments, proposing a merger into a super regiment.", "This plan has faced opposition from campaigners and politicians due to its potential impact on recruitment, local connections, and Scottish heritage.", "The decision needs approval from the Defense Secretary and Prime Minister.", "An alternative plan exists, proposed by Labour MP Eric Joyce, but it is unlikely to be adopted.", "The Prime Minister intends to preserve traditions while creating a more efficient structure for deployment."], "qwen2.5:0.5b": ["Army chiefs in Scotland are expected to discuss future plans for the Army regiments, with the Army Board considering proposals including merging six regiments into a super regiment and reducing their numbers by one.", "However, opposition from Labour backbenchers and politicians led to the plan being questioned and rejected earlier this year."], "qwen2.5:1.5b": ["Army chiefs will meet to decide on restructuring of Scotland's six Army regiments, merging five into a super regiment that faces opposition from campaigners and politicians due to its impact on recruitment, local connections, and traditions.", "The decision is expected to be made public next week."], "qwen2.5:3b": ["Army chiefs are meeting to decide on Scotland's Army regiments’ future, with plans including merging six single-battalion regiments into five or one super regiment.", "Opponents oppose this restructuring due to its impact on recruitment and local connections.", "Labour politicians argue that the timing is insensitive given some regiments’ involvement in Iraq.", "The proposed change faces strong opposition from campaigners and politicians alike, especially over potential recruitment issues.", "An alternative plan by Eric Joyce preserves current regiments while introducing a more effective structure, but this seems unlikely with Prime Minister Tony Blair’s stance leaning towards creating a super regiment."], "opencoder:1.5b": ["Army chiefs in regiments decision\n\nMilitary chiefs are expected to meet to make a final decision on the future of Scotland's Army regiments.", "A committee of the Army Board, which is made up of the most senior defence figures, will discuss plans for restructuring regiments on Monday.", "The proposals include cutting Scotts's six single-battalion regiments to five and merging these into a super regiment.", "The plans have faced stiff opposition from campaigners and politicians alike.", "The committee's decision must be ratified by Defence Secretary Geoff Hoon and Prime Minister Tony Blair.", "It is expected that it will be made public next week.", "Ministers announced a reorganisation of the Army it drew a question mark over the futures of the Black Watch, the Kings Own Scottish Borderers, the Royal Scots, the Royal Highland Fusiliers and the Argyll and Sutherland Highlanders.", "In October, the Council of Scottish Colonels proposed the merger of the Royal Scots and the King's Own Scottish Borderers into a single battalion.", "Under their vision, it would be one of five in the new super regiment.", "The proposals to either merge or amalgamate the six regiments into a super regiment sparked a political outcry, with Labour backbenchers and opposition politicians opposing the plan.", "Speaking ahead of the expected Army Board meeting, a spokesman said: \"The government and the Army Board have spent the past four months attempting to trick serving soldiers and the public into thinking their planned changes for the Scottish regiments are for the good of the Army and for that of the serving soldier.", "They are very much not for the good and will destroy Scotland's regiments by moulding them into a single super regiment which will lead to severe recruitment problems, a loss of local connections to those regiments and a loss to Scotland of an important part of her heritage and, most importantly, her future - the regiments are the envy of armies around the world.\"", "An alternative blueprint had been put forward by Labour MP Eric Joyce who proposed going ahead with the merger while preserving the other regiments.", "For a brief time, there was speculation the prime minister might consider the plan, but that now seems unlikely.", "Speaking in Scotland last week, Mr Blair said the aim was to preserve tradition but introduced a more effective structure and hinted that a super regiment was likely.", "He said: \"They don't want to get rid of the history or the traditions of the regiment or the local connections - far from it, all they want to do is make sure they can transfer people easily across regiments and deploy them more flexibly.\"", "The prime minister hoped campaigners' concerns would be taken into account but the need for effective change had to be paramount."], "smollm:1.7b": ["The Army chiefs in regiments decision was made by a committee of the Army Board, which is made up of the most senior defence figures.", "The committee discussed plans for restructuring regiments on Monday and proposed cutting Scotland's six single-battalion regiments to five and merging these into a super regiment.", "The proposals have faced stiff opposition from campaigners and politicians alike."], "deepseek-r1:1.5b": ["The Army chiefs meet to decide on the future of Scotland's regiments, which will be restructured into a super regiment by merging six existing regiments.", "Opposition from campaigners and politicians faces stiff resistance against this move, as it could impact key groups in Iraq and Scotland's heritage.", "The government aims for a traditional structure but prioritizes flexibility and ease of recruitment.", "Meanwhile, alternative plans are considered, including preserving some regiments."], "tinyllama:1.1b": ["The military chiefs of Scotland's Army regiments are scheduled to meet on Monday to discuss plans for restructuring and merging into a super regiment, with some campaigners opposing the proposal.", "The proposals include cutting the country's six single-battalion regimental units down to five and merging these into a new super regiment.", "In October, the Council of Scottish Colonelssuggested the merge or amalgamation of the Royal Scot Regimentand the King's Own Scottish Border Regimentinto a single battalion.", "However, opposition from Labour MP Eric Joyce prompted a political outcry, with Labour backbenchers and opposition politicians opposing the plan.", "The Save the Scottish Regiment campaigners were angered by the timing and accused Labour of trying to trick soldiers and the public into supporting changes that would destroy Scotland's regimental units.", "The Army Board is expected to announce a recommendation for the future of the regiments in its meeting on Monday, with the aim being to preserve tradition while introducing an effective structure and ensuring soldiers can transfer easily across different regiments and be deployed more flexibly."], "tinydolphin:1.1b": [" The Army Board has announced a proposal to reorganize Scotland's army regiments, with plans to merge or integrate five into a single super regiment.", "This decision comes amidst growing concern over future cuts and possible disbandment of the Scottish regiments.", "The proposed reforms include cutting Scotland's six single-battalion regiments to five by next week.", "The committee responsible for making this decision will be headed by Defence Secretary Geoff Hoon and Prime Minister Tony Blair.", "This move is expected to have a significant impact on the future of Scotland's army, with campaigners and politicians alike voicing concerns about the potential loss of local connections and history for Scotland's regiments.", "The new super regiment would likely comprise five battalions and could create significant changes in the way military personnel are deployed across the country."], "phi:2.7b": [" Army chiefs are expected to discuss plans to cut Scotland's six single-battalion regiments to five and merge them into a super regiment, causing strong opposition from campaigners and politicians.", "The decision must be ratified by Defence Secretary Geoff Hoon and Prime Minister Tony Blair.", "There have been proposals to either merge or amalgamate the six regiments into a single battalion, which has sparked outrage among critics who feel it is insensitive given the Black Watch's frontline deployment in Iraq.", "An alternative plan put forward by Labour MP Eric Joyce would retain all six regiments while still introducing more effective structures.", "The prime minister hinted that a super regiment was likely but acknowledged the need for both preserving tradition and implementing change."], "orca-mini:3b": [" Army chiefs in Scotland are expected to meet to decide on the future of Scotland's Army regiments.", "A committee of the Army Board, which is led by the most senior defense figures, will discuss plans to restructure the regiments into a super regiment.", "The proposals include cutting Scotland's six single-battalion regiments to five and merging these into a super regiment.", "The plan has faced strong opposition from campaigners and politicians alike.", "The committee's decision must be ratified by Defense Secretary Geoff Hoon and Prime Minister Tony Blair.", "It is expected that the proposal will be made public next week."], "hermes3:3b": ["Military chiefs to decide Scotland regiment future"], "stablelm-zephyr:3b": ["Military chiefs are set to meet and make a final decision on the future of Scotland's Army regiments, following proposals that include merging or amalgamating the six single-battalion regiments into one super regiment.", "The plans have faced opposition from campaigners and politicians, who claim the changes will lead to severe recruitment problems, loss of local connections, and heritage.", "If ratified by Defence Secretary Geoff Hoon and Prime Minister Tony Blair, it is expected that the decision will be made public next week.", "An alternative proposal by Labour MP Eric Joyce suggested merging the other regiments while preserving the current ones."], "chatgpt-4o-latest": ["Military chiefs are set to decide on the future of Scotland's Army regiments, with a committee of the Army Board discussing plans to restructure them.", "The proposal involves reducing Scotland’s six single-battalion regiments to five and merging them into a super regiment, sparking strong opposition from campaigners and politicians.", "The decision must be approved by Defence Secretary Geoff Hoon and Prime Minister Tony Blair and is expected to be announced next week.", "Critics argue the plan will harm recruitment, sever local ties, and erase historical traditions.", "Campaigners have threatened political action against Labour, while an alternative plan by MP Eric Joyce to merge only two regiments was briefly considered but now seems unlikely.", "Blair defended the restructuring, emphasizing the need for flexibility while preserving traditions."], "stablelm2:1.6b": ["Military chiefs are meeting to discuss restructuring plans for Scotland's Army regiments, including cutting six single-battalion regiments down to five and merging them into a super regiment.", "The proposals have faced opposition from campaigners and politicians.", "A committee of defense figures will discuss the plans next week, with their decision needing approval from Defense Secretary Geoff Hoon and Prime Minister Tony Blair.", "If approved, the plan would lead to severe recruitment problems, loss of local connections, and erode Scotland's heritage and future.", "Labour MP Eric Joyce proposed an alternative blueprint to preserve other regiments while merging them into a super regiment."], "granite3.1-dense:2b": ["Military chiefs, comprising the senior defense figures on an Army Board committee, are set to deliberate and decide on the future of Scotland's six single-battalion Army regiments (Black Watch, Kings Own Scottish Borderers, Royal Scots, Royal Highland Fusiliers, Argyll and Sutherland Highlanders) during a Monday meeting.", "Proposed restructuring includes merging these into a single super regiment, sparking significant opposition from campaigners and politicians due to concerns about preserving traditions, local connections, and Scotland's heritage.", "The decision must be endorsed by Defence Secretary Geoff Hoon and Prime Minister Tony Blair.", "The government's reorganization plan aims to enhance flexibility while maintaining regimental history and identity, but critics argue the merger will lead to severe recruitment challenges and erosion of local ties.", "Labour MP Eric Joyce proposed a compromise that would merge three regiments while keeping others intact, though this is now deemed unlikely by Prime Minister Blair.", "The government's stance emphasizes the need for effective structure alongside preserving tradition and connections."]}