{"raw_text": "David Blunkett in quotes\n \n David Blunkett - who has resigned as home secretary - built his reputation as a plain-speaking Yorkshire man.\n \n  \n \n  I fell in love with someone and they wouldn't go public and things started to go very badly wrong in the summer, and then the News of the World picked up the story. \"I tried for three years to make something work.\" \n \n  \"Trust, plain-speaking and straight talking is something which matters so much to me as a politician and as a man that I have decided, of my own volition, to request an independent review of the allegations that I misused my position.\"\n \n \"I don't think anyone can say I have said one thing in public and done another in private.\" \"It would be dangerous territory if I wasn't practising what I preach which is to always accept responsibility, always accept the consequences of your actions. \n \n  \"None of us believe countering terrorism is about party politics.\"\n \n \"I accepted by necessity we have to have prevention under a new category which is to intervene before the act is committed, rather than do so by due process after the act is committed when it's too late,\" he said in reference to new anti-terrorism measures. \n \n  \"Our work with the French government...has been hugely successful,\" said Mr Blunkett. \"The number of illegal immigrants detected in Dover has dropped dramatically.\" \n \n  \"Strengthening our identity is one way or reinforcing people's confidence and sense of citizenship and well-being.\" \n \n  \"I foolishly thought as this was a celebrity edition it would be more relaxed than normal.\" \n \n  \"You wake up and you receive a phone call - Shipman's topped himself. You have just got to think for a minute: is it too early to open a bottle?\"\n", "llama3.2:1b": ["David Blunkett resigned as home secretary, stating he will request an independent review of alleged misconduct due to the News of the World scandal.", "He has denied saying contradictory things in public and private."], "llama3.2:3b": ["David Blunkett, who resigned as home secretary, said he tried for three years to make his marriage work but it ended badly.", "He also emphasized the importance of trust, plain speaking and accepting responsibility.", "On terrorism, he argued that prevention before action should be prioritized over due process after the fact.", "He praised a French collaboration that reduced illegal immigrant detection in Dover."], "gemma2:2b": ["David Blunkett resigned as home secretary amid allegations of misuse of his position.", "He acknowledges the need for an independent review and emphasizes the importance of responsibility in public life.", "He states that countering terrorism requires proactive measures, not just reactive ones, and offers examples of success with France's anti-immigration efforts."], "qwen2.5:0.5b": ["David Blunkett, former home secretary, has resigned from his role as home secretary in the UK.", "He built his reputation as a plain-speaking Yorkshire man and had a strong stance against party politics.", "He accepted responsibility by saying \"none of us believe countering terrorism is about party politics\" and that he believed it was more appropriate to intervene before an act is committed rather than after it has been done.", "He also acknowledged the difficulties in dealing with immigration, which led to improved data on illegal immigrants in Dover."], "qwen2.5:1.5b": ["David Blunkett, former Home Secretary, resigned citing allegations of misconduct.", "He pledged an independent review but emphasized honesty as central to his ethics and responsibility in public service.", "He expressed support for prevention strategies over post-act interventions, noted successes with intergovernmental cooperation on immigration issues, and called for strengthening national identity to enhance people's sense of citizenship and well-being."], "qwen2.5:3b": ["David Blunkett, now former Home Secretary, gained reputation as plain-spoken Yorkshire politician.", "He confessed his three-year failed relationship led to personal scandal involving News of the World.", "Blunkett requested an independent review of allegations regarding misuse of position.", "Believes honesty and accountability are core values.", "Opposes political influence in terrorism countermeasures favoring preventive action.", "Praised successful collaboration with French on immigration detection in Dover, stating illegal immigrants dropped significantly.", "Suggested opening champagne upon receiving unexpected news about Anthonyshipman's death."], "opencoder:1.5b": ["\"David Blunkett builds his reputation as a plain-speaking Yorkshire man.\"", "\"In three years, he tried his best to make something work.\"", "\"He insists on trust and accepts plain-speaking and straight talking as important as politics.\"", "\"He doesn't believe in counter-terrorism measures or accepting the consequences of his actions in a new category, rather he intervenes before the act is committed when it's too late.\"", "\"The French government's work has been particularly successful.", "As the number of illegal immigrants detected in Dover has dropped dramatically,\" said Mr Blunkett."], "smollm:1.7b": ["David Blunkett, who built his reputation as a plain-speaking Yorkshire man, was involved in the controversy surrounding his relationship with someone and the subsequent allegations of misuse of power.", "He resigned from the Home Secretary's office and later expressed regret for not being more vocal about the issues.", "In the summer of 2013, Blunkett reported that he had misused his position as Home Secretary by allowing the News of the World to publish a story about his relationship with someone without him going public first.", "He also claimed that the newspaper's reporting was \"dangerous territory\" and that it would be \"dangerous for anyone who is not prepared to accept responsibility.\"", "Blunkett has since accepted that he did say one thing in public and did another in private, but he believes that this does not excuse his actions.", "He also accepts that the new anti-terrorism measures are a necessary step to prevent terrorist attacks, but he believes that they must be implemented in conjunction with due process after the fact.", "In response to the controversy surrounding his relationship with someone, Blunkett accepted that it was a \"foolish\" decision and that he would not have made it if he had been more vocal about the issues.", "He also acknowledged that the Home Secretary's office did not always follow the rules and that there were instances of abuse of power.", "Blunkett has expressed regret for not being more vocal about the issues surrounding his relationship with someone, but believes that this does not excuse his actions.", "He also accepts that the new anti-terrorism measures are a necessary step to prevent terrorist attacks, but he believes that they must be implemented in conjunction with due process after the fact.", "In response to the controversy surrounding his work with the French government, Blunkett accepted that it was a \"stronger\" partnership and that it had been successful in reducing illegal immigration in the area.", "He also acknowledged that the Home Secretary's office did not always follow the rules and that there were instances of abuse of power.", "Blunkett has expressed regret for not being more vocal about the issues surrounding his relationship with someone, but believes that this does not excuse his actions.", "He also accepts that the new anti-terrorism measures are a necessary step to prevent terrorist attacks, but he believes that they must be implemented in conjunction with due process after the fact."], "deepseek-r1:1.5b": ["David Blunkett is known for his straightforward political approach as home secretary in Yorkshire.", "He emphasizes truth over emotion in his dealings with the media, citing politicians needing to act on their policies.", "His quote about not counteracting terrorism via party politics highlights security concerns.", "He mentioned new anti-terror measures and his work with the French government improving things.", "A famous line from a celebrity edition contrasts it with normal news—it's too easy."], "tinyllama:1.1b": ["David Blunkett, who has resigned as home secretary, was characterized by his plain-speaking Yorkshire man image in quotes.", "He built up his reputation as a \"plain-speaking\" politician, stating that he fell in love with someone and they went public, leading to a scandal involving the News of the World picking up the story and things going \"very badly wrong.\"", "He also mentioned that he decided to request an independent review, stating that it would be dangerous territory if he didn't accept responsibility for his actions.", "Mr Blunkett admitted that none of them believed countering terrorism was about party politics, and stated that his work with the Frech government had been successful, with the number of immigrants detected decreasing dramatically.", "Despite this, he emphasized the importance of strong identity for national well-being, stating that he intended to stay in the political game."], "tinydolphin:1.1b": [" David Blunkett has resigned as Home Secretary due to allegations of improper use of office position, which led to his affair with a woman and damaging the reputation of the British government.", "He fell in love with her and had a tumultuous relationship that led to serious problems for the couple and their loved ones.", "His public image is built on his plain-speaking nature, as evidenced by his comments during the summer of 2006 when he was accused of using office resources unfairly.", "He has also advocated for a more balanced approach towards countering terrorism, suggesting it could involve preventive measures before an attack occurs rather than reaction after it's happened.", "This statement emphasizes how his actions have put him in a difficult position and highlights the importance of maintaining his integrity even during difficult times."], "phi:2.7b": [" David Blunkett resigned as Home Secretary after building his reputation as a plain-speaking Yorkshire man.", "He had a relationship with someone who did not want the story made public, which went badly wrong and was eventually reported by the News of the World.", "Blunkett requested an independent review of the allegations that he misused his position.", "Despite admitting to some indiscretions, he maintained the importance of trust, plain-speaking, and taking responsibility for one's actions.", "In terms of anti-terrorism measures, Blunkett believes in preventing crimes before they occur rather than waiting until it is too late.", "Working with the French government has resulted in a significant decrease in the number of illegal immigrants crossing Dover.", "Strengthening national identity through reinforcing citizenship and well-being was also emphasized.", "Blunkett believed that his \"celebrity edition\" story would be more relaxed, but he ended up being contacted by Shipman during his final hours of life.", "The phone call led to a question about opening a bottle, suggesting that the situation may have been too early for such actions."], "orca-mini:3b": [" David Blunkett, who was the home secretary, built his reputation as a plain-speaking Yorkshire man.", "In 2005, he fell in love with someone and they couldn't get married.", "The News of the World picked up the story.", "He requested an independent review of the allegations that he misused his position.", "Blunkett said countering terrorism is about prevention, not after the act is committed.", "His work with the French government has been successful, and Dover illegal immigrants have decreased.", "Strengthening people's confidence and citizenship is one way to reinforcing their well-being.", "Blunkett was foolishly thinking the celebrity edition of a show would be more relaxed.", "He received a phone call that caused him to think it was too early to open a bottle."], "hermes3:3b": ["* Blunkett, former home secretary, talks about resigning and admitting to attempt to make relationship work private.", "* Insists on being seen as consistently honest and accepting responsibility.", "* Supports counter-terrorism measures that involve intervention before the act.", "* Work with French government successful in reducing illegal immigration at Dover."], "stablelm-zephyr:3b": ["David Blunkett, former home secretary, is known for his plain-speaking style.", "He resigned after allegations of misusing his position and decided to request an independent review.", "Blunkett emphasized the importance of taking responsibility and stated that countering terrorism isn't about party politics.", "He also mentioned the successful collaboration with the French government in detecting illegal immigrants."], "chatgpt-4o-latest": ["David Blunkett, who resigned as home secretary, emphasized his commitment to trust, plain-speaking, and accountability.", "He acknowledged personal struggles, including a failed relationship that became public.", "He defended his integrity, stating he had not acted hypocritically.", "Blunkett stressed that countering terrorism should not be politicized and justified preventive anti-terrorism measures.", "He highlighted successful cooperation with France in reducing illegal immigration and advocated for strengthening national identity.", "Reflecting on a celebrity event, he admitted misjudging its tone.", "He also made a darkly humorous remark about the suicide of Harold Shipman."], "stablelm2:1.6b": ["David Blunkett, now resigned as home secretary, is known for his plain-speaking Yorkshire background.", "After an affair, he requested an independent review of allegations about misusing his position due to trust issues.", "Blunkett emphasizes the importance of responsibility and accountability in politics.", "He acknowledges that new anti-terrorism measures necessitate intervention before acts are committed, citing a successful partnership with France.", "The number of illegitimate immigrants detected in Dover has significantly dropped.", "Blunkett stresses the necessity for strengthening one's identity and reinforcing people's sense of citizenship and well-being.", "His comments were made after joking about being part of a celebrity edition when it was not meant to be relaxed."], "granite3.1-dense:2b": ["David Blunkett, a Yorkshire politician known for his straightforwardness, resigned as home secretary after allegations surfaced regarding misuse of his position in personal matters.", "He vowed to request an independent review of these claims, emphasizing his commitment to trust, plain-speaking, and accepting responsibility.", "Blunkett also addressed counter-terrorism efforts, advocating for proactive prevention rather than post-facto due process.", "He praised collaborative work with the French government on reducing illegal immigrants in Dover.", "Furthermore, he stressed the importance of strengthening national identity and citizen confidence.", "In a personal anecdote, Blunkett recounted a celebrity edition phone call where he considered whether it was too early to open a bottle upon learning about Harold Shipman's suicide."]}