{"raw_text": "Brown and Blair face new rift claims\n \n For the umpteenth time, Tony Blair and Gordon Brown are said to have declared all out war on each other.\n \n This time the alleged rift is over who should take the credit for the government's global aid and debt initiatives, particularly in the wake of the tsunami disaster - an issue many hoped and believed was above such things. It dominated the prime minister's monthly news conference, which saw Mr Blair start in full irritation mode as he was forced to bat away question after question about his relationship with his neighbour. As he told journalists: \"I am not interested in what goes in and out of newspapers. There is a complete unity of purpose.\" And he again heaped praise on Mr Brown saying he was doing a great job, and would continue doing it - although he would not commit to any job for Mr Brown after the election.\n \n So why did he arrange his press conference at the last moment so it coincided with Mr Brown's long-arranged keynote speech on aid and debt, he was asked? By now Mr Blair had moved from irritation mode to his barely disguised fury setting. He snapped back that the hacks knew very well what the operational reasons were for the timing of his press conference. Well, not really, as it happens.\n \n And he repeated what a great man Gordon was and how united they were, before again sneering that he took absolutely no notice of what went in and out of the newspapers, preferring to get on with the job of doing the best for the country and the world. Although in the next breath he declared: \"I get increasingly alarmed by what I read in the newspapers\" before catching himself on and quickly adding: \"In so far as I read them of course.\" He probably had good reason to be alarmed because the newspapers had been full of stories about the claimed open warfare between the two men.\n \n As far as the timing of the prime minister's press conference is concerned, there are two options. The first is that it was a calculated attempt to upstage the chancellor and seize back the initiative on the big issue of the moment. If that is the case it suggests that even the fear of seriously negative newspaper headlines is not enough to stop the squabbling. The second option is that it was an unavoidable coincidence, which would suggest the government has lost its once-famed ability to strictly co-ordinate announcements - through the infamous Downing Street grid - to avert just such allegations.\n \n Either way, the effect was the same - to overshadow the big announcements of government policy on a hugely pertinent issue. And there had been previous suggestions that the new year had started with a fresh outbreak of the warfare between the two men. Firstly, the prime minister insisted on Wednesday that he had been intimately involved in the development of the proposals to get G8 countries to freeze debt repayments from the tsunami-hit countries. It was claimed he had been embarrassed by the fact that Gordon Brown appeared to have taken the initiative over the government's response to the disaster while Mr Blair was still on holiday in Egypt.\n \n Then, as if to pour fuel on the flames, both men separately spoke about working on tsunami or wider aid and development policy with their cabinet colleagues Foreign Secretary Jack Straw, Aid minister Hilary Benn and Deputy Prime Minister John Prescott - without mentioning the other. All this came amid fresh claims that Mr Brown was still seething that he had been excluded from a prominent role in general election planning and had, as a result, started to set out his own platform. The fact that he used an article in the Guardian newspaper to set out what he believed \"should\" be in the manifesto, has embarked on a mini tour of Britain to set out his aid plans and will next week visit Africa on the same mission - often seen as the prime minister's \"turf\" - has only added to the impression of rival camps operating entirely independently of each other. The prime minister denied all that as well, repeating his insistence that it was inconceivable the economy and the chancellor would not be at the centre of the election campaign. But the big fear with many on the Labour benches now is that, unless a lid can be put on the speculation over the rivalry, it may even threaten to undermine the election campaign itself.\n", "llama3.2:1b": ["Tony Blair and Gordon Brown are in dispute over who should take credit for government's global aid and debt initiatives.", "The issue sparked their annual monthly news conference, which coincided with Brown's keynote speech on aid and debt.", "Blair expressed unity of purpose and praised Brown's work, but then snapped back, saying the timing was \"calculated\" to upstage Brown and seize initiative.", "He later claimed he read newspapers about the dispute.", "The controversy has raised questions about how government announcements are coordinated, with previous suggestions that new year might bring further clashes between the two leaders."], "llama3.2:3b": ["Tony Blair and Gordon Brown faced a new rift claim over who should take credit for government aid and debt initiatives following the tsunami disaster.", "The rift led to a tense press conference where Blair defended his relationship with Brown and praised him for his work on aid and debt policy, but also appeared angry when asked about their reported differences.", "The timing of the press conference coincided with Brown's keynote speech on aid and debt, leading some to suggest it was a calculated attempt to upstage him."], "gemma2:2b": ["Tony Blair and Gordon Brown are reportedly experiencing renewed tension regarding credit for government aid initiatives, specifically in the wake of the tsunami disaster.", "This led to a public clash during Blair's press conference where he criticized the media and praised Brown while maintaining a united front.", "Blair’s announcement followed Brown’s speech on the same topic.", "While some see this as a calculated move by Blair to overshadow Brown, others suggest it is simply a coincidence.", "The ongoing tension has led to claims of separate initiatives on aid policy from both men without mentioning each other.", "This internal conflict has sparked concerns that the rivalry could negatively impact the Labour Party’s upcoming election campaign."], "qwen2.5:0.5b": ["The rift between Tony Blair and Gordon Brown over aid and debt initiatives erupted again in February, with both men positioning themselves as primary contributors to the government's response to the tsunami disaster.", "The prime minister arranged his press conference just two weeks before their keynote speech on the issue.", "This situation highlights the challenges of maintaining a united front while also being sensitive about media coverage, which has been a major source of controversy in British politics for decades."], "qwen2.5:1.5b": ["Tony Blair and Gordon Brown engage in public disputes over credit for global aid initiatives following criticism of their relationship during a press conference and cabinet meeting related to tsunami response coordination and manifesto planning.", "The incident highlights ongoing internal conflicts within Labour Party leadership regarding policy direction, potentially damaging unity and cooperation efforts."], "qwen2.5:3b": ["Tony Blair and Gordon Brown are reportedly in open conflict again over credit for government's global aid and debt initiatives following the tsunami disaster.", "Despite Blair stating unity of purpose, he clashed with journalists about the timing of his press conference coinciding with Brown’s speech.", "Blair defended himself by claiming operational reasons, but admitted to being alarmed by media reports.", "The timing was seen as a potential attempt to overshadow Brown's announcements.", "Previous accusations suggested both men were operating independently on aid and development policy, leading some to fear it could undermine the election campaign."], "opencoder:1.5b": ["Brown and Blair face new rift claims for the umpteenth time.", "Tony Blair and Gordon Brown declare all out war on each other in this unprecedented conflict of international affairs.", "In the wake of a tsunami disaster, Mr Blair's government took up an initiative to bolster its global aid and debt initiatives.", "He directed his media toward a full-scale campaign of public statements about the benefits Mr Blair could offer to those in need.", "But it occurred before Mr Brown's long-arranged keynote speech on aid and debt, he was asked.", "He told reporters: \"I am not interested in what goes in and out of newspapers.", "There is a complete unity of purpose.\"", "Mr Blair started laughing at Mr Brown's questioning about his relationship with his neighbour, and he immediately turned to a full-blown fury.", "He sat there in an enraged state until he was presented with the news - that the news had suddenly become official after the election.", "He then repeated what a great man Gordon was and how united they were before saying: \"I am not interested in what goes in and out of newspapers, preferring to get on with the job of doing the best for the country and the world.\"", "The timing of Mr Blair's press conference coincided with the announcement on aid and debt by Mr Brown.", "He then declared: \"In so far as I read them of course.\"", "He probably had good reasons to be alarmed, because the newspapers were full of stories about the open warfare between Tony Blair and Gordon Brown.", "As far as the timing of the prime minister's press conference is concerned, there are two options.", "The first option was an attempt to upstage the chancellor and seize back the initiative on the big issue of the moment.", "If it is so, then it would suggest that even the fear of seriously negative newspaper headlines is not enough to stop the squabbling.", "The second option was a coincidence, which could be explained as the government has lost its once-famed ability to strictly coordinate announcements - through the downing street grid issue.", "Either way, the effect was the same - to overshadow the big announcements of government policy on a major issue.", "The two men separately spoke about working on tsunami or wider aid and development policy with their cabinet colleagues - Foreign Secretary Jack Straw, Aid minister Hilary Benn and Deputy Prime Minister John Prescott.", "All this came amid fresh claims that Mr Brown was still seething, which he had been embarrassed by his article to set out what he believed \"should\" be in the manifesto.", "The prime minister denied all that and repeated his insistence that it should not be inconceivable.", "The big fear with many on the Labour benches now is that it may even threaten to undermine the election campaign itself, as well as any other candidates.", "However, this could only make matters worse if a lid can be put on the speculation over the rivalry."], "smollm:1.7b": ["The text summary should preserve key ideas and details:\n\n1.", "The main idea of the text is that Tony Blair and Gordon Brown are said to have declared all out war on each other for the umpteenth time.", "2.", "This time the alleged rift was over who should take the credit for the government's global aid and debt initiatives, particularly in the wake of the tsunami disaster - an issue many hoped and believed was above such things.", "It dominated the prime minister's monthly news conference, which saw Mr Blair start in full irritation mode as he was forced to bat away question after question about his relationship with his neighbour.", "As he told journalists: \"I am not interested in what goes in and out of newspapers.", "There is a complete unity of purpose.\"", "And he again heaped praise on Mr Brown saying he was doing a great job, and would continue to do so - although he would not commit to any job for Mr Brown after the election.", "3.", "The main idea of the text is that the prime minister arranged his press conference at the last minute so it coincided with Mr Brown's long-arranged keynote speech on aid and debt initiatives.", "This shows that the prime minister was trying to take advantage of the rivalry between him and Mr Brown to gain publicity for his own policies.", "4.", "The text also mentions that the prime minister repeated what a great man Gordon was and how united they were, before again sneering at the idea that he took no notice of what went in and out of the newspapers.", "This shows that the prime minister believed that the rivalry between him and Mr Brown was above the newspaper headlines.", "5.", "The main idea of the text is that the government's press conference on the tsunami disaster coincided with a planned speech by Mr Blair to the United Nations General Assembly, which would have given him more publicity for his own policies.", "This shows that the prime minister was trying to use the rivalry between him and Mr Brown to gain publicity for his own policies."], "deepseek-r1:1.5b": ["Blair and Brown argue over whose credit should go to whom in their global aid efforts, especially during the Tsunami disaster.", "Blair starts with irritation, gets more confrontational, and expresses alarm when he read news stories.", "They discuss meetings on debt repayment for G8 countries, where Blair was confused about Brown's initiative.", "Both are also working on broader aid plans without coordination, and the prime minister denies everything but hopes for a lid around speculation.", "Labour benches are concerned if this rivalry threatens election credibility."], "tinyllama:1.1b": ["Brown and Blair face new rifts over aid and debt initiatives as each claims dominance in government policy development.", "This time around, Tony Blair declares all out war on Gordon Brown over wavering support for their global aid and debt programs, accusing his neighbor of being \"interested\" in what goes in and out of newspaper headlines, even though they are both seen as leading a \"unitary\" effort.", "However, the media coverage highlights that this is more than just another spat between two rivals in power, with each claiming to have been excluded from crucial decision-making processes.", "The prime minister denies all rumors of rivalry and insists they are working together on election plans, while Labour MPs fear a damaging speculation that threatens the campaign itself."], "tinydolphin:1.1b": [" The article discusses Tony Blair and Gordon Brown's war of words over who should take credit for government aid and debt initiatives during the tsunami crisis.", "Both leaders are accused of declaring an all-out war on each other, even though they both declared that they were focused on global aid efforts.", "Tony Blair was seen as attacking his neighbor by claiming that he took credit for the government's global aid and debt initiatives.", "This accusation led to Brown being blamed for not taking charge of these matters.", "The two leaders have also been embroiled in a conflict over who should be given the credit for their respective roles during the tsunami disaster.", "Despite the tension between them, both leaders remain committed to their positions on the issues.", "Brown is expected to attend an important meeting of the G8 summit on Wednesday, where he is set to present his plan for a global development framework during the election campaign.", "On the other hand, Tony Blair has shifted away from being in charge and focused on working with his cabinet colleagues.", "The fact that Brown's plans have been widely reported as part of the Labour Party's manifesto suggests a lack of centralization within the government regarding aid and debt initiatives.", "This may contribute to rumors and speculations about who is really in charge and who will be most effective in managing these matters during the election campaign."], "phi:2.7b": [" The text summary is:\n\nTony Blair and Gordon Brown are said to have had an unnamed rift over who should take credit for global aid and debt initiatives in light of the tsunami disaster.", "This caused their press conferences to coincide, with the chancellor delivering his keynote speech.", "There were two possible explanations for this timing: either it was a calculated attempt to upstage the other or just a coincidence.", "However, this overshadowed the big announcements on these issues.", "The rift has been happening before and there are rumours of another outbreak in the new year.", "Both men denied any rivalry but some Labour MPs worry it could affect the election campaign."], "orca-mini:3b": [" Brown and Blair face new rift claims"], "hermes3:3b": ["Tony Blair and Gordon Brown feud over credit for aid and debt initiatives."], "stablelm-zephyr:3b": ["Tony Blair and Gordon Brown are allegedly at odds over who should take credit for the government's global aid and debt initiatives, particularly in the wake of the tsunami disaster.", "This rift has coincided with both men giving speeches on aid and debt, leading to speculation about the timing and purpose behind it.", "The situation has overshadowed big announcements on government policy regarding aid and development issues.", "There have also been claims that Mr. Brown was excluded from a prominent role in general election planning, which has fueled suspicions of rival camps operating independently of each other."], "chatgpt-4o-latest": ["Tony Blair and Gordon Brown are once again reported to be in conflict, this time over credit for the government's global aid and debt initiatives, particularly after the tsunami disaster.", "Blair dismissed claims of a rift, praising Brown but refusing to confirm any future role for him.", "However, Blair's last-minute press conference coincided with Brown’s long-planned speech on aid, fueling speculation of deliberate upstaging.", "The timing either reflects internal disorganization or an intentional move to overshadow Brown.", "Reports suggest tensions have escalated, with Brown feeling sidelined from election planning and independently promoting his own platform.", "Despite Blair’s denials, concerns grow within Labour that ongoing speculation about their rivalry could harm the party’s election campaign."], "stablelm2:1.6b": ["Tony Blair and Gordon Brown are allegedly in a rift over who should take credit for the government's aid and debt initiatives following the tsunami disaster.", "This issue was highlighted during their monthly news conference, where questions about their relationship were asked by journalists.", "Despite accusations of war between them, both men claimed unity and praised each other's performance in office.", "The timing of Blair's press conference coincided with Brown's keynote speech on aid and debt.", "Speculations suggest that the rivalry between them overshadowed major government announcements on a pertinent issue.", "Some argue it threatens to undermine the election campaign itself."], "granite3.1-dense:2b": ["Tony Blair and Gordon Brown are reportedly in another high-stakes rift, this time centered around credit for global aid and debt initiatives, particularly in response to the tsunami disaster.", "The tension was evident during a joint news conference where Blair defended his relationship with Brown, praising him as doing a \"great job,\" yet expressing frustration over media coverage of their supposed feud.", "The timing of Blair's press conference coinciding with Brown's keynote speech on aid and debt further fueled speculation about the rivalry.", "Previously, Blair had claimed he was involved in tsunami response plans, while Brown felt marginalized during election planning.", "Brown's independent campaign trail and media presence have intensified perceptions of competing camps within the Labour government, raising concerns that this internal strife might jeopardize the upcoming election campaign."]}