{"raw_text": "Blair 'said he would stand down'\n \n Tony Blair promised Gordon Brown he would stand down before the next election, a new book about the chancellor claims.\n \n But the prime minister changed his mind following intervention from allies in the Cabinet, according to the book. The book by Sunday Telegraph journalist Robert Peston said the pair had \"mutual animosity and contempt\" for each other. The book, Brown's Britain, said Tony Blair felt by November 2003 he had lost voters' trust.\n \n The author's sources, all unnamed \"allies\" of Mr Blair and Mr Brown, said the prime minister felt the Iraq war had undermined him and that he was no longer an asset to the Labour Party.\n \n The book, serialised in the Sunday Telegraph, alleges that Mr Blair told the chancellor at a dinner hosted by deputy PM John Prescott in November 2003 of his intention to stand down. \"At that stage he saw Gordon Brown and said, 'look you are the next most influential member of the government, I need your help to get through the next year,\" Mr Peston said. \"I myself recognise that I'm going to have to stand down before the election but help me to get through the year and I will then stand down.'\" But he changed his mind in June 2004, following intervention from allies in the Cabinet and the suspicion that the chancellor was deliberately manoeuvring against him, the book claims.\n \n Mr Peston told BBC News: \"My understanding is that they are not nearly as close or as friendly as they once were. \"What the book says is there now a pretty profound mutual mistrust, mutual animosity. \"I think in public you see this double act pretending everything is alright but in private I don't think the relationship is good because Brown, understandably, feels deeply betrayed - particularly over this issue of the leadership.\" There has been fresh speculation of a rift recently, following their separate responses to the Asian tsunami. Rumours of a rift were fuelled by the sudden decision to hold Mr Blair's monthly media conference at the same time as a long-planned speech by Mr Brown on UK plans to tackle global poverty with a new \"Marshall Plan\" for Africa. There was speculation the pair were trying to outdo each other's response to the disaster.\n \n Former welfare minister Frank Field MP criticised the reported rivalry between the pair on GMTV's Sunday Programme.\n \n \"What sort of model does it give to the nation when the two most important political leaders do nothing but fight it out together or use their aides to fight it out?\" the Labour MP for Birkenhead asked. He said the prime minister should sack Mr Brown, but did not believe Mr Blair was strong enough to do so. Conservative policy co-ordinator David Cameron, MP for Witney, added: \"If it wasn't so serious it would be funny. \"But it is serious - you've got the two most senior people in the government not concentrating on fighting crime, poverty or dirty hospitals - they are fighting each other.\" Carol Walker, BBC News 24 political correspondent, added: \"There is a real concern that this could undermine the general election campaign. \"And clearly it is very bad news for the government at a time when it is trying to explain what it is doing to respond to the terrible problems thrown up by the tsunami disaster.\"\n", "llama3.2:1b": ["Blair and Brown had a falling out over the leadership of Labour, with Blair feeling betrayed by Brown's decision not to stand down after his resignation in 2003.", "The tension escalated following intervention from allies in the Cabinet, with Blair reportedly telling Brown he would stand down before an election if Brown didn't support him.", "However, this change of heart occurred in June 2004 when sources claimed the pair were closer and had less animosity towards each other."], "llama3.2:3b": ["Tony Blair promised Gordon Brown he would stand down before the next election, but changed his mind in June 2004 following intervention from allies and suspicion of a deliberate move against him.", "The pair had \"mutual animosity and contempt\" for each other, with Blair feeling undermined by the Iraq war and no longer an asset to the Labour Party."], "gemma2:2b": ["Tony Blair promised Gordon Brown he would stand down before the next election, but changed his mind after intervention from allies in the Cabinet.", "The book \"Brown's Britain\" alleges a mutual animosity and contempt existed between them.", "Blair's decision was influenced by suspicions about Brown's maneuvering against him.", "Recent events such as contrasting responses to the Asian tsunami have fueled speculation of a rift between them, raising concerns about their impact on the general election campaign."], "qwen2.5:0.5b": ["Tony Blair said he would stand down before the next election, according to Sunday Telegraph journalist Robert Peston.", "But Gordon Brown changed his mind following intervention from allies in the Cabinet and suspects that the chancellor was deliberately manoeuvring against him."], "qwen2.5:1.5b": ["Tony Blair told Gordon Brown he would stand down before the next election, but later reversed his decision due to intervention from allies in Cabinet and concerns over Brown's leadership."], "qwen2.5:3b": ["Tony Blair promised Gordon Brown he would stand down before the next election, but changed his mind due to intervention from allies in the Cabinet and mutual mistrust.", "The book \"Brown's Britain\" claims Blair felt voters had lost trust, Iraq war undermined him, and he was no longer an asset to the Labour Party.", "In November 2003, Blair told Brown he needed help to get through the next year before standing down.", "However, in June 2004, Blair decided to stand down despite his intention to remain prime minister until then.", "The book suggests a deep mutual mistrust and animosity between the two leaders, with speculation that this rift could negatively impact the government's response to the Asian tsunami disaster."], "opencoder:1.5b": ["Tony Blair promised Gordon Brown he would stand down before the next election.", "The prime minister changed his mind following intervention from allies in the Cabinet.", "He told the BBC News: \"My understanding is that they are not nearly as close or as friendly as they once were.", "What the book says is there now a pretty profound mutual mistrust, mutual animosity.\"", "Former welfare minister Frank Field MP criticized the reported rivalry between the pair on GMTV's Sunday Programme."], "smollm:1.7b": ["The text summarizes the main points of the article, which describes the relationship between Tony Blair and Gordon Brown as being one of mutual animosity and contempt.", "The article claims that Mr Blair promised to stand down before the next election, but later changed his mind after intervention from allies in the Cabinet.", "The book by Robert Peston, \"Tony Blair: The Man Who Couldn't Stop Talking\", alleges that Mr Blair told Gordon Brown at a dinner party that he would stand down before the election if they worked together to get through the year and then stood down again when the election approached.", "However, the article claims that there is a mutual mistrust between the two leaders, which has been fueled by their recent responses to the Asian tsunami disaster.", "The article also suggests that Mr Blair should sack Gordon Brown, but believes that Mr Cameron would be better off fighting crime, poverty and dirty hospitals together."], "deepseek-r1:1.5b": ["Tony Blair announced his planned exit from the government before the next election but changed his mind after political influence from his cabinet members.", "The book suggests mutual mistrust and animosity due to Blair feeling lost by voter trust while Brown felt betrayed over leadership roles.", "Blair faced criticism for losing public trust in his efforts post- Iraq War, which strained his credibility.", "His background was marked by corruption, while Brown had similar experiences but later ascended to office.", "Blair's actions were seen as a major turn for the Labour Party.", "Speculations emerged about a rift related to the Asian tsunami, driven by both leaders' responses to the crisis.", "This could have increased public concern and potential tension between them."], "tinyllama:1.1b": ["The text briefly summarizes Tony Blair's alleged promise to Gordon Brown before the next election that he would stand down, which was followed by an alleged mutual animosity and mistrust between the two leaders.", "The book claims that Blair felt betrayed over the Iraq war and decided to help Brown to get through the year, but later changed his mind in June 2004 due to perceived manipulation from allie's in the Cabinet.", "A report by Sunday Telegram journalist Robert Peston alleges that the prime minister and deputy PM John Prescott hosted a dinner in November 2003 where Blair made his intentions clear, but later changed his mind after the suspicion of manipulation.", "Despite their reported rivalry, Mr Peston believes there is no direct evidence to support the allegations, and says that the two leaders are seen as \"not nearly as close or as friendly\" as before.", "The article suggests that the perceived mistrust between them may impact the general election campaign."], "tinydolphin:1.1b": [" Blair announced his intention to stand down from politics before the next election, according to new book authored by Sunday Telegraph journalist Robert Peston.", "The book claims that Brown's friendship with the former Labour leader had ended due to the Iraq war and that the prime minister felt losing voters' trust in him.", "The sources also mention that Brown felt a need for allies during his tenure as chancellor to support him amidst internal conflict.", "However, there are differing reports regarding the reasons behind this decision, with some suggesting that Brown manipulated events and others suggesting an ongoing feud between them."], "phi:2.7b": [" Tony Blair promised Gordon Brown he would stand down before the next election but changed his mind following intervention from Cabinet members, according to a new book.", "The prime minister and Chancellor had mutual animosity and contempt for each other, with Mr Blair feeling that the Iraq war had undermined him.", "Mr Peston's sources say Mr Blair told the chancellor in 2003 of his intention to stand down, but later changed his mind after intervention from allies in the Cabinet.", "There have been further rumors of a rift between the two, which could undermine their ability to lead during an election campaign."], "orca-mini:3b": [" Blair said he would stand down, but changed his mind due to pressure from allies in the Cabinet and suspicion that Brown was deliberately manoeuvring against him.", "Sources unnamed as \"allies\" of Blair and Brown alleged that they had lost voters' trust over the Iraq war and felt the need to stand down before the next election.", "The book alleges that Blair told Brown at a dinner hosted by Deputy PM John Prescott in November 2003 that he would stand down, but changed his mind later that year following intervention from allies in the Cabinet."], "hermes3:3b": ["Tony Blair promised Gordon Brown he would stand down before next election, but changed mind following cabinet intervention, according to book."], "stablelm-zephyr:3b": ["A new book, Brown's Britain, by Sunday Telegraph journalist Robert Peston claims that Tony Blair promised to stand down before the next election after feeling he had lost voters' trust by November 2003.", "However, Prime Minister changed his mind following intervention from allies in the Cabinet.", "The book alleges that Blair felt the Iraq war had undermined him and was no longer an asset to the Labour Party.", "This led to a mutual mistrust and animosity between Blair and Gordon Brown.", "The reported rivalry between the pair is causing concern as it may undermine the general election campaign.", "Former welfare minister Frank Field MP criticized this development, suggesting that the two most important political leaders should be concentrating on fighting crime, poverty, or dirty hospitals instead of fighting each other."], "chatgpt-4o-latest": ["Tony Blair promised Gordon Brown he would step down before the next election but later changed his mind after Cabinet allies intervened, according to a book by journalist Robert Peston.", "The book claims Blair and Brown had deep animosity and mistrust, with Blair feeling weakened by the Iraq war and no longer an asset to Labour.", "Blair allegedly told Brown in November 2003 that he would resign but reversed his decision in June 2004, suspecting Brown was maneuvering against him.", "Their strained relationship was highlighted by separate responses to the Asian tsunami, fueling speculation of rivalry.", "Former minister Frank Field criticized their infighting, suggesting Blair should sack Brown, while Conservative MP David Cameron mocked their focus on personal battles over governance.", "Concerns were raised that their conflict could harm Labour’s election campaign."], "stablelm2:1.6b": ["Former Prime Minister Tony Blair promised Gordon Brown he would stand down before the next election, but changed his mind due to intervention from allies in the Cabinet.", "The book \"Brown's Britain\" claims that Blair felt lost the voters' trust and believed the Iraq war undermined him.", "Brown felt betrayed by Blair over this issue of leadership.", "There were speculations of a rift between them following their responses to the Asian tsunami, with rumors of rivalry fuelled by a media conference conflict.", "Critics like Frank Field MP criticized these rivalries within the government.", "The article suggests that the rivalry between the two political leaders hinders their work towards addressing important issues such as fighting crime, poverty or dirty hospitals."], "granite3.1-dense:2b": ["Tony Blair initially intended to step down as prime minister before the next election, according to a book by Robert Peston, titled \"Brown's Britain.\"", "This decision was made in November 2003 at a dinner hosted by deputy PM John Prescott.", "Blair felt he had lost voters' trust due to the Iraq war and believed Gordon Brown would help him navigate the following year.", "However, after intervention from allies in the Cabinet, Blair reconsidered his standdown plan in June 2004.", "The book suggests a deep-seated mutual mistrust between Blair and Brown, with Brown feeling betrayed over the leadership issue.", "This reported rift was further highlighted by their separate responses to the Asian tsunami, with speculation that they were attempting to outdo each other's public statements on UK poverty initiatives.", "Critics, including former Labour MP Frank Field and Conservative policy co-ordinator David Cameron, expressed concern about the negative impact of this rivalry on national leadership and the government's response to the tsunami disaster."]}