{"raw_text": "Blair dismisses quit claim report\n \n Tony Blair has dismissed reports he told Gordon Brown he would quit before the next general election.\n \n \"You don't do deals over jobs like this,\" the prime minister told BBC One's Breakfast with Frost programme. According to a new book, Brown's Britain, Mr Blair went back on a pledge to make way for Mr Brown after Cabinet allies intervened in June 2004. Mr Blair said the claims were \"reheated from six months ago\" and that he was concentrating on running the country. Mr Blair said: \"I've dealt with this six months ago. I said then you don't do deals over jobs like this - you don't.\n \n \"What both of us are actually concentrating on are the issues that concern the country.\" The book, by Sunday Telegraph journalist Robert Peston and serialised in the newspaper, said the pair had \"mutual animosity and contempt\" for each other.\n \n It claims Tony Blair felt by November 2003 he had lost voters' trust because of the Iraq war and that he was no longer an asset to the Labour Party. And that at a dinner hosted by Deputy Prime Minister John Prescott he told Mr Brown of his intention to stand down. According to Mr Peston the prime minister said: \"Help me to get through the year and I will then stand down.\" But he then changed his mind in June 2004, following intervention from allies in the Cabinet and the suspicion that the chancellor was deliberately manoeuvring against him, according to the book.\n \n Mr Peston told BBC News: \"My understanding is that they are not nearly as close or as friendly as they once were. \"What the book says is there is now a pretty profound mutual mistrust, mutual animosity. \"I think in public you see this double-act pretending everything is alright, but in private I don't think the relationship is good because Brown, understandably, feels deeply betrayed - particularly over this issue of the leadership.\" But, in a wide-ranging BBC interview covering issues such as the Asian tsunami disaster, the Middle East peace process and Northern Ireland, Mr Blair said: \"When you get to the top in politics you get this huge swell around you. \"All sorts of people make all sorts of claims and counter-claims.\" He admitted to a \"sense of frustration\" about the allegations which he said had been made \"countless times\".\n \n There has been fresh speculation of a rift recently, following their separate responses to the Asian tsunami. These rumours were fuelled by Mr Blair's decision to hold his monthly media conference at the same time as a long-planned speech by Mr Brown on UK plans to tackle global poverty with a new \"Marshall Plan\" for Africa. There was speculation the pair were trying to outdo each other's response to the disaster. But the prime minister said he had discussed these claims with the chancellor and dismissed them as a \"load of nonsense\". Former welfare minister Frank Field MP said the prime minister should sack Mr Brown, but did not believe Mr Blair was strong enough to do so.\n \n Tory leader Michael Howard accused the prime minister and Mr Brown of \"squabbling like schoolboys\". He told Sky News' Sunday with Adam Boulton: \"This is the politics of the playground and Britain really does deserve better.\" The Liberal Democrat parliamentary chairman Matthew Taylor said the personal ambition of Mr Blair and Mr Brown was \"getting in the way of good government\". \"Either they need to grow up and put their squabbles to one side or they cannot expect the electorate to support a divided government at the next election.\" During the interview Mr Blair also said the former home secretary David Blunkett would play a \"big role\" at the general election.\n", "llama3.2:1b": ["Tony Blair has dismissed reports he told Gordon Brown that he would quit the Labour Party before the 2005 general election, but claims this was just about jobs and not a genuine pledge.", "Blair said the claims were \"reheated from six months ago\" and that his focus is on issues affecting the country.", "However, the book \"Brown's Britain\" suggests they have \"mutual animosity and contempt\" for each other.", "The book also claims Blair felt he had lost voters' trust due to the Iraq war and that Brown was no longer an asset to the Labour Party by November 2003.", "Blair has denied having changed his mind about standing down, but admits to a sense of frustration with allegations made against him."], "llama3.2:3b": ["Tony Blair has dismissed reports that he told Gordon Brown he would quit before the next general election, saying claims are \"reheated from six months ago\" and that they have been concentrating on running the country.", "According to a new book, the pair had mutual animosity and contempt for each other, with Blair feeling betrayed by Brown's actions in June 2004."], "gemma2:2b": ["Tony Blair denies reports he told Gordon Brown he would quit before the next election.", "A new book claims they have mutual animosity and mistrust, with Blair planning to stand down in 2004 after intervention from allies and suspicion of Brown's maneuvering.", "Blair dismisses these allegations as \"reheated\" and emphasizes his focus on running the country.", "Speculation of a rift between Blair and Brown has increased following their respective responses to the Asian tsunami disaster.", "Both men have dismissed such claims as \"nonsense\".", "Political leaders, including Tory leader Michael Howard, Conservative MP Frank Field and Liberal Democrat chairman Matthew Taylor, criticize the constant squabbing from the PM and Chancellor, suggesting it is harming good governance."], "qwen2.5:0.5b": ["Tony Blair dismissed reports he told Gordon Brown about quitting before the general election, and that these had been rehashed from six months ago.", "He claimed he was concentrating on running the country instead of dealing with job deals.", "The book argues Tony Blair felt hurt by a £1bn Iraq war claim and now feels betrayed when meeting Mr Brown."], "qwen2.5:1.5b": ["Prime Minister Tony Blair dismissed reports he quit before the next general election, saying it was six months ago and that Brown had changed his mind about succession due to intervention from Cabinet allies and suspicion of Chancellor's maneuvers.", "The book claims the two men have mutual distrust and animosity since November 2003 over Iraq war allegations."], "qwen2.5:3b": ["Tony Blair dismissed reports he told Gordon Brown he would quit before the next general election, stating that such deals over jobs are not done.", "According to a new book by Robert Peston, Brown's Britain, Blair went back on his pledge to make way for Brown after Cabinet allies intervened in 2004.", "The book alleges mutual animosity and contempt between them due to Blair feeling voters had lost trust over the Iraq war and fearing he was no longer an asset to the Labour Party.", "In October 2003, Blair reportedly told Brown he would step down but later changed his mind, leading to speculation of a rift.", "Recent personal disputes, such as their differing responses to the Asian tsunami, fueled rumors of a conflict in leadership.", "Blair dismissed these claims and said they are \"countless times\" made about him."], "opencoder:1.5b": ["Tony Blair has dismissed reports he told Gordon Brown he would quit before the next general election, while Blair dismisses a claim about concentrating on issues of concern for the country.", "He refers to the mutual animosity and contempt between the two men, saying they share a profound emotional and personal relationship that he feels deeply betrayed and frustrated over this issue of the leadership.", "The book's claims about Mr Blair feeling by November 2003 he had lost voters' trust and being no longer an asset to the Labour Party suggest that Blair faced intense scrutiny for his missteps.", "During a dinner hosted by Deputy Prime Minister John Prescott, Blair told BBC News: \"My understanding is that they are not nearly as close or as friendly as they once were.\"", "There was also renewed speculation about a rift recently, after their separate responses to the Asian tsunami.", "These revelations fuelled by Mr Blair's decision to hold his monthly media conference at the same time as a long-planned speech by Mr Brown on UK plans to tackle global poverty with a new \"Marshall Plan\" for Africa suggest that the pair had tried to outdo each other's response.", "The personal ambition of Mr Blair and Mr Brown, who both have argued against their previous statements about the challenges faced during and after the disaster, may be fuelled by Mr Blair's enthusiasm for government responsibility and his confidence in his position as the prime minister.", "The former seems to have gained momentum from his personal contributions to alleviating suffering."], "smollm:1.7b": ["The summary is:\n\n* The prime minister dismisses reports he told Gordon Brown he would quit before the next general election.", "* Tony Blair has dismissed reports he told Gordon Brown he would quit before the next general election.", "* Mr Blair said the key ideas and details of the text are preserved, but the tone and emphasis have changed from \"mutual animosity and contempt\" to \"mutual mistrust\".", "* The prime minister claims Tony Blair felt by November 2003 he had lost voters' trust because of the Iraq war.", "* Mr Peston told BBC News: \"My understanding is that they are not nearly as close or as friendly as they once were.\"", "* There has been fresh speculation of a rift recently, following their separate responses to the Asian tsunami.", "These rumours were fueled by Mr Blair's decision to hold his monthly media conference at the same time as a long-planned speech by Mr Brown on UK plans to tackle global poverty with a new \"Marshall Plan\" for Africa.", "* The prime minister said he had discussed these claims with the chancellor and dismissed them as a \"load of nonsense\".", "* Former welfare minister Frank Field MP accused the prime minister and Mr Brown of \"squabbling like schoolboys\".", "* The Liberal Democrat parliamentary chairman Matthew Taylor said the personal ambition of Tony Blair and Gordon Brown is \"getting in the way\" of good government.", "* Either they need to grow up and put their squabbles to one side or they cannot expect the electorate to support a divided government at the next election."], "deepseek-r1:1.5b": ["Tony Blair dismissed reports he told Gordon Brown of his quitting before the general election, criticizing claims as \"reheated from six months ago\" and emphasizing job-related deals.", "With Iraq's loss shifting public trust and Blair no longer an asset to Labour, he changed plans in 2004 amid Cabinet allies' intervention.", "His approach was contrasted by former Home Secretary David Blunkett, who noted his potential role at the election.", "The relationship between Blair and Brown was fraught with tension as per Robert Peston's book, highlighting mutual animosity.", "British media highlightedSpeculation of a rift following responses to the Asian tsunami, though rumors were dismissed as misdirections.", "Tory leader Michael Howard accused Blair and Brown of \"squabbling,\" suggesting personal issues might prevent a unified government in future elections.", "**Summary:** Blair dismissed previous claims about quitting before the election, emphasizing job deals.", "He changed plans due to Cabinet intervention.", "Meanwhile, former Home Secretary Blunkett expressed role potentiality at the election.", "The pair's relationship was strained by media speculation and personal tensions."], "tinyllama:1.1b": ["The prime minister, Tony Blair, dismisses quit claim reports from the day's BBC One program, \"Breakfast with Frost,\" as \"rehired from six months ago.\"", "He says he is concentrating on running the country and that Gordon Brown made a mistake about making way for him before Cabinet allies intervened.", "The prime minister claims both Blair and Brown are losing trust from the electorate due to issues related to the Iraq War, and says their recent public statements prove their disconnect.", "He dismisses speculation of a divide between the two leaders as \"non-sensical\" and \"a load of non-sense.\"", "Liberal Democrat parliamentary leader Matthew Taylor believes Blair's ambition is getting in the way of good government, while a former home secretary, David Blunkett, will play a \"big role\" during the election."], "tinydolphin:1.1b": [" Tony Blair has dismissed reports that he told Prime Minister Gordon Brown he would quit before the next general election, in response to concerns over the UK's handling of Iraq.", "The prime minister claimed there was no reheated pledge and dismissed the claims as \"reheated from six months ago.\"", "The dismissal comes amid allegations of infighting between the two leaders, with Mr Brown's Britain accusing Mr Blair of not being a good leader.", "The book by Sunday Telegraph journalist Robert Peston also suggests that Tony Blair lost trust in him due to the Iraq war and there is mutual animosity between the pair over this issue.", "However, the prime minister insists he has not spoken to Brown about his future plans."], "phi:2.7b": [" Tony Blair dismissed reports he told Gordon Brown he would quit before the next general election, according to a new book.", "He said he didn't do deals over jobs and was focusing on running the country.", "There are claims that he changed his mind in June 2004 after Cabinet allies intervened, but Mr Peston says they have mutual animosity and mistrust.", "Mr Blair has denied being at odds with Gordon Brown and said he feels deep betrayal after the Iraq war.", "The two leaders' different responses to the Asian tsunami also fuelled speculation of a rift between them."], "orca-mini:3b": [" Blair dismisses quit claim report"], "hermes3:3b": ["Tony Blair dismissed claims about his reported promise to quit before the next general election, saying he had discussed it with Gordon Brown and dismissing the allegations as \"reheated from six months ago\"."], "stablelm-zephyr:3b": ["Tony Blair dismisses reports of him telling Gordon Brown he would quit before the next general election.", "According to a book, the pair had mutual animosity and contempt for each other due to issues such as the Iraq war and perceived lack of trust in Tony Blair's ability to be an asset to the Labour Party.", "Despite rumors of a rift between them, Blair discusses various topics including the Asian tsunami disaster, Middle East peace process, and Northern Ireland with BBC's Breakfast with Frost program.", "Tory leader Michael Howard criticizes the prime minister and Brown for squabbling like schoolboys, while the Liberal Democrat parliamentary chairman Matthew Taylor highlights the personal ambition of both politicians is hindering good government."], "chatgpt-4o-latest": ["Tony Blair dismissed reports that he promised to step down for Gordon Brown before the next general election, calling such claims \"reheated\" and insisting he was focused on governing.", "A book by journalist Robert Peston alleges Blair initially intended to resign in 2003 due to declining public trust over the Iraq war but changed his mind in 2004 after Cabinet allies intervened and suspected Brown of maneuvering against him.", "The book describes a deep mistrust and animosity between the two.", "Blair denied any rift, dismissing speculation about their rivalry, including their responses to the Asian tsunami.", "Tory leader Michael Howard criticized their alleged infighting, calling it \"playground politics,\" while the Liberal Democrats warned their personal ambitions were harming governance.", "Blair also stated that former home secretary David Blunkett would play a significant role in the upcoming election."], "stablelm2:1.6b": ["UK Prime Minister Tony Blair dismissed reports that he told Gordon Brown he would quit before the next general election.", "According to Brown's Britain book, Blair went back on a pledge to make way for Brown after Cabinet allies intervened in June 2003.", "The prime minister said: \"You don't do deals over jobs like this.\"", "There are now mutual mistrust and animosity between Blair and Brown, according to Robert Peston's book.", "Labour leader Tony Blair admitted to frustration about allegations made by others, following a recent speculation of rift regarding their respective responses to the Asian tsunami disaster.", "Tory leader Michael Howard accused the pair of \"squabbling like schoolboys.\""], "granite3.1-dense:2b": ["Tony Blair refutes claims from a new book, \"Brown's Britain,\" by Robert Peston and Sunday Telegraph journalist Robert Peston, that he told Gordon Brown in June 2004 he would resign before the next general election.", "Blair dismissed these allegations as rehashed, emphasizing his focus on national issues rather than personal politics.", "The book suggests a deep-seated mutual mistrust and animosity between the two, stemming from Blair's perception of losing voters' trust due to the Iraq war.", "According to the report, Blair initially intended to step down in November 2003 but changed his mind after Cabinet allies intervened and suspecting Brown was undermining him.", "Despite these claims, Blair maintains a close working relationship with Brown and dismissed recent speculation of a rift following their responses to the Asian tsunami as baseless.", "Critics, including former welfare minister Frank Field MP and Tory leader Michael Howard, have accused the duo of childish behavior in public.", "They argue that personal ambition is hindering effective governance and could undermine support for a divided government at the next election.", "Blair also announced David Blunkett's significant role in the upcoming general election."]}