{"raw_text": "Brown in appeal for Labour unity\n \n Gordon Brown has made an appeal for unity after reports claimed Mr Blair went back on a pledge to stand down before the next general election.\n \n The chancellor would not comment on the reports, but insisted he would not be \"diverted or distracted\" from tackling the challenges faced by the country. His only \"motivation\" was to ensure Labour was re-elected, he insisted. Mr Blair earlier dismissed the claim he had reneged on a promise to stand aside for Gordon Brown as old news. According to a new book, Brown's Britain by Sunday Telegraph journalist Robert Peston, Mr Blair went back on a pledge to make way for Mr Brown after Cabinet allies intervened in June 2004.\n \n In an interview with BBC One's Breakfast with Frost, Mr Blair said: \"I've dealt with this six months ago. I said then you don't do deals over jobs like this - you don't. \"What both of us are actually concentrating on are the issues that concern the country.\"\n \n In a separate interview with BBC political editor Andrew Marr, Mr Brown said: \"It's very important that we all do what we can in a unified way to ensure the election of a Labour government. \"I think it is very important to stress that that is the motivation that I have. \"That is my purpose in politics, and that is what every day I seek to do. And I am not going to be diverted or distracted, nor is Tony Blair, by newspaper stories or books or rumours or gossip. \"The only reason why we are in government is to get on with the job in a unified way to deal with the challenges facing this country.\" Mr Brown also said he had discussed the general election campaign with the prime minister on Saturday and pledged to play his part as he had been asked to do.\n \n But Mr Peston said the pair had \"mutual animosity and contempt\" for each other and that Mr Blair had decided in November 2003 he would quit because he felt he had lost voters' trust because of the Iraq war. He then changed his mind in June 2004, following intervention from allies in the Cabinet and the suspicion that the chancellor was deliberately manoeuvring against him, according to the book. Andrew Marr said: \"This is enormously damaging. Gordon Brown knows it as well as Tony Blair. \"I think the relationship is genuinely, privately, very poor indeed. Things are very difficult.\" He added: \"Lots of ministers believe Tony Blair will attempt to move Gordon Brown out of the Treasury after the election. \"That depends on whether there's still a Labour government and their majority.\"\n \n Senior MPs are expected to raise concerns about the latest reports of infighting at the regular meeting of Labour backbenchers on Monday.\n \n Health Secretary John Reid said those fuelling such reports were damaging Labour's re-election chances and would not be easily forgiven. Fresh speculation of a rift recently followed Mr Blair and Mr Brown's separate responses to the Asian tsunami. These rumours were fuelled by Mr Blair's decision to hold his monthly media conference at the same time as a long-planned speech by Mr Brown on UK plans to tackle global poverty with a new \"Marshall Plan\" for Africa. There was speculation the pair were trying to outdo each other's response to the disaster. But the prime minister said he had discussed these claims with the chancellor and dismissed them as a \"load of nonsense\". Tory leader Michael Howard accused the prime minister and Mr Brown of\"squabbling like schoolboys\". Liberal Democrat parliamentary chairman Matthew Taylor said the personal ambition of Mr Blair and Mr Brown was \"getting in the way of good government\".\n", "llama3.2:1b": ["Gordon Brown has made an appeal for Labour unity following reports that former Prime Minister Tony Blair may have reneged on a pledge to stand down before the next general election.", "Reports suggest Blair went back on his promise, which Brown insists is not true and only motivated him to ensure Labour's re-election.", "Brown also discussed the challenges facing the country with Prime Minister John Reid in an interview, stating that he prioritizes getting work done rather than personal interests or media attention.", "The BBC has expressed concerns about infighting within the party, citing reports of disagreements over issues like the Asian tsunami and general election campaigning."], "llama3.2:3b": ["Gordon Brown appealed for unity with Labour ahead of next year's general election following reports that Tony Blair may have reneged on a pledge to step down.", "Mr Blair denied making a U-turn, saying he had already addressed the issue six months ago and was focused on tackling challenges facing the country.", "Mr Brown said his motivation was ensuring Labour's re-election and that he would not be distracted by \"newspaper stories or books or rumours\".", "Senior MPs are expected to raise concerns about infighting at Monday's backbenchers meeting, with some speculating that Blair may try to move Brown out of the Treasury after the election."], "gemma2:2b": ["Gordon Brown appealed for Labour unity after reports suggested Tony Blair reneged on a promise to step aside before the next general election.", "Reports from a new book claim Blair went back on this pledge, with intervention by Cabinet allies in June 2004.", "However, both men have denied these claims and remain focused on achieving re-election for the Labour party.", "The prime minister stated he is not distracted by rumours or gossip and has discussed his plans for the general election campaign with Brown.", "Backbench MPs are expected to raise concerns about this alleged infighting at a meeting on Monday, while senior MPs have expressed concern over the reports of the rift."], "qwen2.5:0.5b": ["Gordon Brown urges unity against Labour's potential losses, while Prime Minister Tony Blair has dismissed claims about his reneging on a pledge to stand down.", "In an interview with BBC Breakfast with Frost, Blair said he deals with job challenges, not infighting, and Brown stressed their shared mission: ensuring a Labour government.", "In the UK media, speculation of a rift between Blair and Brown is fuelled by rumours about the Asian tsunami."], "qwen2.5:1.5b": ["Gordon Brown has called for unity after reports suggest Tony Blair backtracked on a pledge to stand down before next's election.", "Brown insists he will remain focused on tackling country's challenges, while Blair dismisses claims as old news from book.", "Brown discusses campaign with PM; MPs criticize rumours of infighting."], "qwen2.5:3b": ["Gordon Brown has appealed for Labour unity amid reports that Tony Blair reneged on a promise to step down before the next general election.", "Brown insisted he would not be distracted, stating his sole motivation is re-electing Labour.", "In contrast, Blair dismissed the claims as old news and claimed he dealt with the issue six months ago.", "A new book suggests Blair intervened in June 2004 to prevent Brown from taking over after Cabinet allies urged him to do so.", "This has led to mutual animosity between Blair and Brown, raising concerns about Labour's internal unity for upcoming elections.", "Senior MPs are expected to discuss these issues at a meeting on Monday, with speculation that the rift may affect Labour's chances of re-election."], "opencoder:1.5b": ["The text provided summarizes the following key points: \n\n1.", "Gordon Brown has made an appeal for unity after reports claimed that Mr Blair went back on a pledge to stand down before the next general election.", "2.", "The chancellor would not comment on the reports, but insisted he would not be \"diverted or distracted\" from tackling the challenges faced by the country.", "3.", "His only \"motivation\" was to ensure Labour was re-elected.", "4.", "According to a new book, Brown's Britain by Sunday Telegraph journalist Robert Peston said that Mr Blair went back on a pledge to make way for Mr Brown after Cabinet allies intervened in June 2004.", "5.", "In an interview with BBC One's Breakfast with Frost, Mr Blair said: \"I've dealt with this six months ago.", "I said then you don't do deals over jobs like this - you don't.", "The only reason why we are in government is to get on with the job in a unified way to deal with the challenges facing this country.\"", "6.", "In another interview with BBC political editor Andrew Marr, Mr Brown said that they had \"mutual animosity and contempt\" for each other.", "7.", "But Mr Peston said the pair had \"mutual animosity and contempt\" for each other and that Mr Blair had decided in November 2003 he would quit because he felt he had lost voters' trust because of the Iraq war.", "He then changed his mind in June 2004, following intervention from allies in the Cabinet and the suspicion that the chancellor was deliberately manoeuvring against him.", "8.", "Senior MPs are expected to raise concerns about the latest reports of infighting at the regular meeting of Labour backbenchers on Monday.", "9.", "Health Secretary John Reid said those fuelling such reports were damaging Labour's re-election chances and would not be easily forgiven.", "Fresh speculation of a rift recently followed Mr Blair and Mr Brown's separate responses to the Asian tsunami.", "These rumours were fuelled by Mr Blair's decision to hold his monthly media conference at the same time as a long-planned speech by Mr Brown on UK plans to tackle global poverty with a new \"Marshall Plan\" for Africa.", "There was speculation the pair were trying to outdo each other's response to the disaster.", "10.", "The prime minister said he had discussed these claims with the chancellor and dismissed them as a \"load of nonsense\".", "Tory leader Michael Howard accused the prime minister and Mr Brown of\"squabbling like schoolboys\"."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details.", "The main points are:\n\n1.", "Gordon Brown has made an appeal for Labour unity after reports claimed Mr Blair went back on a pledge to stand down before the next general election.", "2.", "Gordon Brown has not commented on the reports, but insisted he would not be \"diverted or distracted\" from tackling the challenges faced by the country.", "3.", "The chancellor would not comment on the reports, but insisted he would not be \"diverged or distracted\" from re-examining the Labour Party's strategy for tackling global poverty with a new \"Marshall Plan\".", "4.", "Mr Blair and Mr Brown have been in a personal relationship since 2003, and there is speculation that they are trying to outdo each other's response to the disaster.", "5.", "The prime minister has not discussed these claims with Mr Brown, but said he had discussed them with the chancellor.", "6.", "Mr Brown has not confirmed or denied reports of infighting at the Labour backbenchers' meeting on Monday."], "deepseek-r1:1.5b": ["Brown's appeal for Labour unity after reports and Blair's decision to quit are both significant concerns.", "The text highlights the ongoing tension between Gordon Brown and Tony Blair, with Blair reneging on an election promise.", "Despite this, they aim to work together.", "A report of mutual animosity and Blair quitting due to factors like the Iraq war is mentioned.", "Mutual criticism suggests poor relationships.", "Senior MPs and health Secretary Reid note potential risks from such reports affecting Labour's re-election."], "tinyllama:1.1b": ["Brown in appeal for Labour unity, Gordon Brown has made an appeal for unity after reports claimed that he went back on a promise to stand down before the next general election.", "The news came just days after reports suggested that Mr Blair had reneged on a plea to leave office for Mr Brown's sake.", "Speculation about a rift between the pair was fuelled by Mr Blair holding his monthly media conference during the same time as an upcoming speech by Mr Brown, which was later revealed as part of his wider \"Marshall Plan\" for Africa.", "The Prime Minister, Michael Howard, accused Mr Brown of squabbling like schoolboy with Mr Blair, while Liberal Democrat parliamentary leader Matthew Taylor slammed the personal ambition of both leaders."], "tinydolphin:1.1b": [" Constructed as a concise summary, this passage highlights that the relationship between Tony Blair and Gordon Brown is strained after reports of infighting.", "The two leaders are expected to raise concerns about the latest accusations at their regular Labour backbench meeting.", "This comes amid speculation over whether there will be any major changes in the Labour Party's leadership following the election results, with some observers suggesting that Tony Blair could move out of the Treasury.", "The passage does not provide explicit information regarding who is fueling these rumors or how they are affecting Labour's chances in the upcoming general election."], "phi:2.7b": [" The text discusses reports that Labour's Tony Blair may have broken a pledge to step down before the next general election.", "Gordon Brown has made an appeal for unity within the party, but denies any involvement in the alleged deal with Mr Blair.", "Mr Peston alleges that Mr Blair went back on his promise after Cabinet colleagues intervened.", "He would not comment further, but insisted he was focused on tackling challenges faced by the country.", "In separate interviews, both Mr Brown and Mr Blair denied the report.", "However, Mr Peston suggests a deeper issue of mutual animosity and contempt between the two.", "Senior MPs are expected to discuss these reports at their meeting later in the day.", "The Health Secretary has accused those spreading rumours of damaging Labour's chances in the election."], "orca-mini:3b": [" Brown in appeal for Labour unity, reports claim Tony Blair reneged on promise to step down before next general election.", "Brown's Britain by Sunday Telegraph journalist Robert Peston, according to a new book.", "Brown and Blair have mutual animosity and contempt, according to the book.", "Health Secretary John Reid said rumours of a rift are damaging Labour's re-election chances."], "hermes3:3b": ["Gordon Brown urges Labour unity; denies reports of Tony Blair backpedalling on standdown pledge."], "stablelm-zephyr:3b": ["Gordon Brown called for unity within the Labour party amid reports that Tony Blair had gone back on his pledge to not stand down before the next general election.", "While both Blair and Brown denied the claims, tensions remained high between the pair.", "Health Secretary John Reid spoke out against the rumours, stating they were damaging Labour's re-election chances and would not be easily forgiven.", "Fresh speculation of a rift emerged after Mr. Blair and Mr. Brown responded to the Asian tsunami disaster separately.", "The prime minister dismissed these claims as \"load of nonsense,\" while Tory leader Michael Howard accused the prime minister and Brown of \"squabbling like schoolboys.\""], "chatgpt-4o-latest": ["Gordon Brown called for Labour unity amid reports that Tony Blair reneged on a pledge to step down before the next election.", "Brown refused to comment on the claims but emphasized his focus on Labour’s re-election.", "Blair dismissed the allegations as old news, stating that leadership decisions were not made through deals.", "A book by journalist Robert Peston suggested Blair initially planned to resign in 2003 due to lost trust over the Iraq war but changed his mind in 2004 after Cabinet intervention and suspicions about Brown’s ambitions.", "Reports of animosity between the two were seen as damaging, with speculation that Blair might move Brown from the Treasury after the election.", "Senior MPs were expected to address concerns over infighting, while Health Secretary John Reid warned that such divisions harmed Labour’s chances.", "Further speculation arose from Blair and Brown’s separate responses to the Asian tsunami, but Blair dismissed rivalry claims.", "Opposition leaders criticized their disputes, with Michael Howard likening them to schoolboy squabbles and Matthew Taylor accusing their ambitions of hindering governance."], "stablelm2:1.6b": ["Chancellor Gordon Brown appeals for unity amidst reports that former Prime Minister Tony Blair went back on a pledge to step down before the next general election.", "Despite not commenting on the claims, Brown insisted he wouldn.", "t be \"diverted or distracted\" from tackling the challenges faced by the country.", "Earlier, Blair dismissed the claim as old news.", "In separate interviews, Brown and Blair reiterated their commitment to ensuring Labour's re-election while stressing that unity is necessary for addressing the issues facing the country.", "Health Secretary John Reid has expressed concerns about ministers fueling such reports, damaging Labour's chances of re-election."], "granite3.1-dense:2b": ["Gordon Brown has appealed for Labour unity, despite recent reports suggesting Tony Blair reneged on a pledge to step down before the next general election.", "The chancellor declined to comment but emphasized his commitment to ensuring Labour's re-election.", "In an interview, Blair dismissed the claim as old news and stated they focus on national issues rather than political maneuvering.", "Brown pledged to work unified with Blair for a successful election campaign, stressing it is his primary motivation in politics.", "However, a new book by Robert Peston claims that Blair initially agreed to step aside due to losing voter trust over the Iraq war but changed his mind after intervention from Cabinet allies and suspicions of Brown's oppositional tactics in November 2003.", "The relationship between Blair and Brown is portrayed as strained and privately poor, with some ministers predicting Blair may attempt to remove Brown from the Treasury post after the election if Labour remains in power.", "These allegations have damaged Labour's re-election prospects, according to MPs and opposition leaders.", "Speculation arose following their separate media appearances on Asian tsunami responses, which were dismissed by Blair as a fabrication.", "Critics, including Tory leader Michael Howard and Liberal Democrat chairman Matthew Taylor, accuse the duo of petty infighting, suggesting personal ambitions undermine effective governance."]}