{"raw_text": "Labour MPs' fears over squabbling\n \n If there is one thing certain to stiffen the spines of Labour MPs it is the prospect of losing their seats at a general election.\n \n And it was largely that fear that led to Tony Blair and Gordon Brown being read the riot act during a meeting of the parliamentary Labour party. The views expressed by both backbenchers and Labour peers over the claimed squabbling between the two men starkly demonstrated the widely-held view within the Labour party that the two most powerful figures in the government are jeopardising the next election. As one hugely-disgruntled backbencher said before the meeting: \"It is time they realised it's not just my seat they are threatening but if they go on like this they could put the election in doubt.\" It is a sentiment that is now running throughout the Labour benches with MPs eager to underline the message to their leaders to stop the squabbling and get on with the job at hand.\n \n As Paul Flynn said: \"What has deeply upset the party is in this time of all times, when we wanted to come together, we wanted to lead on the global issues, to change politics for the next decade, the whole thing was wrecked by a piece of childishness by the two main people in the party, two people we greatly respect.\"\n \n Stephen Pound echoed the message, saying: \"We know that the one thing that could entirely jeopardise what we are trying to achieve, not for the Labour Party but for this country, is the appearance of division. We remember the 1980s\". They backed the suggestion that unless the squabbling stopped, the people briefing on behalf of the two men would be \"named and shamed\". The dressing down appears to have done the trick, with Mr Brown joining his alleged rival Alan Milburn - who the prime minister put in charge of election planning in Mr Brown's stead - and Deputy Prime Minister John Prescott at an election poster launch. But the effect of all this is to have achieved two things. Firstly, nobody is attempting to suggest any more that the stories of the rift between the chancellor and the prime minister are fictions created by the media and authors. Even Mr Prescott admitted that, had he still been a backbencher, he would have been giving Mr Blair and Mr Brown the same message.\n \n Secondly it has also underlined the view that the election campaign has, to all intents and purposes, kicked off. But whether the telling off and the subsequent change in behaviour by the two men will do any good - or can even be sustained through the campaign - remains to be seen.\n \n Even as the MPs were expressing their fears it emerged that, while Mr Brown is in Africa for a week, the prime minister is to deliver a keynote speech on election themes for a third term. And he is expected to repeat his recent insistence that the next manifesto will be \"New\" Labour through and through. Similarly, some were pointing out that the chancellor, during the election poster launch, once again refused to deny the claim that he told the prime minister he could never trust anything he said. None the less, what some believe now is that the effect of the warnings from the backbenchers will actually be to silence the Brown camp, effectively strengthening the prime minister's hand. For example, will those Brownite briefers suggest their man is unhappy at the prime minister's timing or subject matter, as may have been the case in the past? What all seem agreed on, however, is that this sniping simply cannot be allowed to go on through the election campaign. Mind you, we have heard similar pledges before.\n", "llama3.2:1b": ["Labour MPs' fears over squabbling between Tony Blair and Gordon Brown led to a meeting of the parliamentary Labour party where they expressed concerns about the perceived conflict between the two men, with some backbenchers saying it could put the next election in doubt.", "This sparked a response from the party's leaders, with Deputy Prime Minister John Prescott at an election poster launch, but also raised questions about the impact on the election campaign."], "llama3.2:3b": ["Labour MPs fear losing their seats due to perceived squabbling between Tony Blair and Gordon Brown, jeopardizing the next election.", "Backbenchers and peers expressed disapproval of the two men's behavior, calling it \"childishness\" that could put the election in doubt.", "The Labour party wants the leaders to stop squabbling and focus on the job at hand."], "gemma2:2b": ["Labour MPs are concerned about the potential for their squabbling between Prime Minister Tony Blair and Chancellor Gordon Brown to jeopardize their chances of winning the next general election.", "This concern was evident in a recent meeting where backbenchers expressed the danger of such divisions jeopardizing the party's efforts, even threatening its ability to take on global issues.", "The reprimand aimed at Brown and Blair has resulted in both men participating more actively in campaign related activities, silencing some accusations of a rift between them.", "While there is agreement about the need for unity and a cessation of internal conflicts, it remains to be seen if this message will endure during the election campaign."], "qwen2.5:0.5b": ["Labour MPs expressed fears over squabbling between Tony Blair and Gordon Brown during a parliamentary meeting.", "They highlighted the widely-held view within the Labour Party that these two most powerful figures in the government are jeopardizing the next general election.", "The message was conveyed to the Prime Minister, who backed the suggestion that they stop the squabbling and focus on their work.", "However, it is unclear whether this will be sustained through the campaign or if the warnings from the backbenchers actually have an effect."], "qwen2.5:1.5b": ["Labour MPs fear losing their seats during a general election and view Tony Blair and Gordon Brown's squabbling as jeopardizing it.", "They demand the two leaders stop fighting or face consequences.", "The MPs believe this will prevent damaging divisional news stories that could undermine future elections.", "Despite these warnings, both Prime Minister David Cameron and Chancellor George Osborne continue to ignore allegations of their disagreements during the election campaign."], "qwen2.5:3b": ["Labour MPs' fears over squabbling intensified with a meeting of the parliamentary Labour party where backbenchers and peers expressed concern about Prime Minister Tony Blair and Chancellor Gordon Brown’s disagreements potentially jeopardizing the next election.", "One disgruntled MP called for an end to their squabbling, fearing it could put the entire election in doubt.", "The dressing-down appeared effective as all three men (Blair, Brown, and Deputy PM Prescott) attended an election poster launch.", "However, whether this will result in positive change remains uncertain.", "Meanwhile, some argue that warnings from backbenchers will silence the Brown camp, strengthening the prime minister's position.", "Despite these concerns, they believe sniping must stop throughout the campaign."], "opencoder:1.5b": ["This summary of the provided text accurately captures the main points and key details.", "The main takeaway from the given text is that Labour MP fear over squabbling has led to a change in behaviour by the men who were initially against it during the election campaign.", "It also highlights the importance of clarifying what constitutes a 'squabble' as it may not always lead to the desired outcome."], "smollm:1.7b": ["The Labour party has been gripped by a sense of unease over the squabbling between Tony Blair and Gordon Brown during their meeting at the Labour party conference.", "The fears that this could lead to a loss of the party's seats in the next general election are well-founded, with many backbenchers expressing deep concern about the situation.", "The prime minister has been particularly vocal on the issue, reiterating his commitment to \"New\" Labour through and through.", "This message is likely to be reinforced by the chancellor during the election poster launch, where he once again refused to deny that he told the prime minister he could never trust anything he said.", "The effect of this warning is likely to be significant, with many backbenchers believing it will strengthen the prime minister's hand and give him greater confidence in his ability to lead the party through the election campaign.", "However, what some believe now is that the warnings from the backbenchers will actually have the opposite effect, silencing the Brown camp and strengthening the prime minister's position.", "This may be the case, as many backbenchers are likely to be more cautious in their approach during the election campaign than they were during the previous one.", "It is also worth noting that this sniping has been a feature of Labour politics for years, with similar promises being made before and after elections.", "However, what makes this particular episode significant is that it seems to have had a lasting impact on the party's fortunes.", "The chancellor's refusal to deny that he told the prime minister he could never trust anything he said may well be seen as a sign of weakness by some backbenchers, who may feel that they are no longer able to rely on their leader.", "Ultimately, it is too early to say for certain what will happen in the election campaign, but one thing is clear: the Labour party has been gripped by a sense of unease over the squabbling between Tony Blair and Gordon Brown during their meeting at the Labour party conference.", "The fears that this could lead to a loss of the party's seats in the next general election are well-founded, with many backbenchers expressing deep concern about the situation."], "deepseek-r1:1.5b": ["Labour MPs fear losing their seats at an election due to potential squabbling between figures like Tony Blair and Gordon Brown.", "They've called it a riot in a meeting led by backbenchers, highlighting division within the Labour Party.", "The Prime Minister and Chancellor have warned against division, with the prime minister emphasizing the need for unity during the campaign despite its ongoing nature."], "tinyllama:1.1b": ["The text mentions a key concern of Labour MPs regarding the squabbling between Tony Blair and Gordon Brown, which has resulted in warnings from backbenchers and Labour peerages over the perceived threat to the next election.", "This is reflected in the meeting of Labour party officials during which it was stated that the leaders must stop the squabbling or risk putting the election in doubt.", "The text highlights that this sentiment is widespread within the Labour benches, with MPs underlining the need for Labour party leaders to put an end to the perceived childishness of Blair and Brown.", "The meeting was addressed by two senior members of the Labour government, the Deputy Prime Minister John Prescott and Labour Chancellor Alan Milburn, who offered their support for election planning and stated that they would be \"named and shamed\" if they were associated with any perceived division in the party."], "tinydolphin:1.1b": [" Summary: Labour MPs are apprehensive over squabbling among their leadership, fearing that losing seats at the general election would jeopardize the party's electoral prospects.", "In a meeting between Tony Blair and Gordon Brown, these concerns were voiced by backbenchers and Labour peers.", "The prime minister was then named and shamed as he took responsibility for any perceived division within the government.", "This has resulted in an all-out effort to unite the party ahead of the next election."], "phi:2.7b": [" Labour MPs are concerned about losing their seats in the next general election due to squabbling between Prime Minister Tony Blair and Chancellor Gordon Brown.", "The issue was discussed at a meeting of the parliamentary Labour party, where it was clear that many viewed the two men's behavior as endangering the upcoming election.", "Labour backbenchers urged their leaders to stop the quarrels and get on with the job.", "Labour MPs are also worried about the appearance of division within the party, which could jeopardize their efforts to achieve their goals for the country.", "The tension between Blair and Brown has been ongoing since the 1990s, and it is unclear whether a change in behavior will have any positive impact on the election campaign.", "Despite this uncertainty, there is agreement that the squabbling must not continue during the campaign."], "orca-mini:3b": [" The Labour MPs are worried about the squabbling between Tony Blair and Gordon Brown, which could jeopardize their party's upcoming general election.", "The MPs fear that the two most powerful figures in the government are undermining the next election.", "One MP said, \"It is time they realized it's not just my seat they are threatening but if they go on like this, they could put the election in doubt.\"", "Stephen Pound and Paul Flynn echoed the same message, saying that unless the squabbling stops, the people briefing on behalf of the two men would be named and shamed.", "However, the effect of all this was to have achieved two things.", "Firstly, nobody is attempting to suggest any more that the stories of the rift between the chancellor and the prime minister are fictions created by the media and authors.", "Secondly, it has also underlined the view that the election campaign has kicked off."], "hermes3:3b": ["Labour MPs worried about internal squabbling between Blair and Brown jeopardizing next election.", "Both men read the riot act during parliamentary meeting; hope squabbling stops for better electoral performance."], "stablelm-zephyr:3b": ["Labour MPs are concerned about potential divisions within the party, especially with regards to squabbling between Tony Blair and Gordon Brown.", "This led to a meeting where backbenchers expressed their fears of losing seats in an upcoming general election.", "Both Tony Blair and Gordon Brown were reprimanded during this meeting, as they were seen jeopardizing the election.", "The MPs emphasized the importance of unity within the party to achieve success on a national level.", "Although some believe the warnings from backbenchers will lead to silence within the Brown camp, others think it may strengthen the prime minister's position.", "One thing that is clear is that the election campaign has begun and any squabbling cannot be allowed to continue throughout the campaign."], "chatgpt-4o-latest": ["Labour MPs fear that ongoing tensions between Tony Blair and Gordon Brown could jeopardize the next general election.", "During a parliamentary Labour party meeting, backbenchers and peers strongly urged the two leaders to end their disputes and focus on governance.", "MPs warned that continued division could harm the party’s electoral prospects, with some threatening to expose those fueling the conflict.", "The reprimand appeared to prompt a temporary show of unity, but doubts remain about whether it will last.", "Blair is set to deliver a major speech on election themes while Brown is in Africa, raising concerns that tensions may persist.", "Some believe the warnings will silence Brown’s supporters, strengthening Blair’s position.", "However, past pledges to end infighting have not always been upheld, leaving uncertainty about whether the party can maintain unity through the campaign."], "stablelm2:1.6b": ["Labour MPs fear the potential loss of their seats during an upcoming general election due to claims of squabbling between Tony Blair and Gordon Brown.", "The views expressed by both backbenchers and Labour peers indicate that the two most powerful figures in the government are jeopardizing the election outcome.", "During a meeting, Labour MPs urged their leaders to stop the squabbling and work together on global issues.", "However.", "The dressing down received from Mr. Brown joining Alan Milburn (previously put in charge of election planning by PM Brown) and Deputy Prime Minister John Prescott at an election poster launch seems to have worked, showing that nobody is suggesting again that the rumors about the rift between them are fake.", "Moreover, this event has also highlighted the election campaign's initiation.", "However, it remains uncertain whether the warning from backbenchers will actually help suppress the Brown camp's actions or strengthen the Prime Minister's position.", "Regardless of the outcome, this sniping could not be allowed to continue through the election campaign."], "granite3.1-dense:2b": ["Labour MPs are deeply concerned about the perceived squabbling between Prime Minister Tony Blair and Chancellor Gordon Brown, which they fear could jeopardize their seats in the upcoming general election.", "This apprehension led to a stern rebuke of both men by Labour party members during a meeting.", "The backbenchers and peers emphasized that the ongoing disagreements threaten not just individual MPs' seats but potentially the entire party's chances in the election.", "The dressing-down, delivered by influential figures like John Prescott, aimed to curb this behavior and encourage unity.", "Despite the backbenchers' strong words, there are indications that the rift may persist, as evidenced by Blair's planned keynote speech on election themes while Brown is in Africa and the chancellor's continued refusal to deny his reported lack of trust in the prime minister.", "Nevertheless, many now believe the MPs' intervention will help silence the Brown camp, reinforcing Blair's position.", "The effectiveness of this approach in preventing further internal division before the election remains uncertain, given similar pledges made in the past."]}