{"raw_text": "'Poll Idols' face first hurdles\n \n Vote For Me - ITV1's Pop Idol style talent contest for would-be politicians - finally hits our screens this week.\n \n Over the next four days, hundreds of potential candidates will be whittled down by a panel of experts and public vote. The winner will then be encouraged to stand as an independent at the next general election, which is expected in the spring. But opinion is divided on whether any of the potential candidates unearthed so far have got what it takes to make it in politics. \"Any of them would make competent MPs,\" former independent MP Martin Bell insisted on BBC Radio 4's Today programme.\n \n Mr Bell, who will be offering his advice to the contestants on Wednesday, argues that Westminster has its share of \"odd balls\" and the show will engage ordinary voters. \"If it gets more people voting and more people interested in politics there is no harm in that,\" he said. But Sir Bernard Ingham, Margaret Thatcher's former press secretary, took a less charitable view, accusing the programme of \"corrupting politics\".\n \n He said the producers would not achieve their aim of re-engaging voters \"with that bunch of nutters\". To give Sir Bernard his dues, Monday evening's opening episode did attract more than a smattering of eccentrics and self-publicists. Among those chancing their arm were a druid priest and a former porn star, who insisted on removing her top to make her point about the legalisation of brothels. Among the more eccentric policy proposals was a public holiday on Bruce Forsyth's birthday and Bill Oddie for prime minister. The show follows the time-honoured Pop Idol format, with queues of nervous hopefuls and a panel of three experts judging their performance.\n \n The contestants were given 60 seconds to present their manifestos. Then the final 25 were tested on their lobbying ability. They were then cross-examined by the panel, which was chaired by ex-ITN political editor John Sergeant, with television host Lorraine Kelly taking the Nicki Chapman role. But the real star of the show is Kelvin MacKenzie, in the Simon Cowell, Mr Nasty seat.\n \n The former Sun editor dispensed a stream of well-crafted insults and one-liners. His advice for one young contestant was to \"get a haircut and a brain transplant\". Wheelchair user Kevin Donnellon was asked: \"Why on earth do you want our elected representatives to be disabled?\" \"Don't you care about the Inuit?\", implored guitar-toting environmental campaigner Barry Lim. \"I don't care about them. I care about myself and when the sun's shining I think - fantastic,\" replied Mr MacKenzie.\n \n Mr Lim later reduced the panel to fits of giggles as he outlined his plan to make people do community service instead of paying taxes. \"When the prime minister turns to the chancellor and says how much have we got in the coffers Mr Brown, he says well, prime minister, bad news, all the houses in Britain have been painted but actually nobody has paid any tax,\" observed Mr MacKenzie. \"That was an total disaster. I just couldn't seem to think of things to say,\" a crestfallen Mr Lim confided in the show's presenter, Jonathan Maitland. Irfan Hanif, a 25-year-old doctor from Bolton, made a good impression, even if he was a little thrown by Mr MacKenzie's suggestion that instead of being treated by the NHS, young drunks should \"given a good beating\" and left to die. Dominic Carman - son of late libel lawyer George Carman - was voted through to the final 25, on a platform of cutting defence spending to boost education. Opinion was more divided over Rodney Hylton-Potts, a 59-year-old convicted fraudster. Mr MacKenzie thought the smooth-talking former solicitor - with a hardline on crime and immigration - deserved a chance to progress. \"He could join the rest of the crooks in the Houses of Parliament.\" But Ms Kelly said she \"would not trust him as far as she could throw him\". The series continues throughout the week, with the public given the chance to evict one prospective MP every night. ITV will not fund the election campaign for the eventual winner, but the publicity could give the winner a flying start over other candidates.\n", "llama3.2:1b": ["Poll Idols faces first hurdles as hundreds of potential candidates compete for the show's coveted spot and potential political careers.", "The contestants were given 60 seconds to present their manifestos before being tested on lobbying ability, with public votes determining the final nominees.", "Kelvin MacKenzie was the standout performer in the opening episode, dispensing a stream of insults and one-liners that left the audience laughing.", "However, other contestants struggled, including Kevin Donnellon who wanted disabled people to be able to vote freely, and Irfan Hanif who suggested young people should be beaten if they were drunk.", "The show's producers face criticism from Sir Bernard Ingham for promoting \"corrupting politics\", while Martin Bell argues that the show will engage ordinary voters."], "llama3.2:3b": ["Poll Idols, an ITV1 talent contest for would-be politicians, begins airing this week.", "Hundreds of potential candidates will be narrowed down by experts and public vote to reach the final 25.", "The show's format follows Pop Idol, with contestants presenting manifestos and lobbying ability tests before being cross-examined.", "Opinion is divided on whether any contestants have what it takes for politics, with some critics accusing the program of \"corrupting politics.\"", "A panel of experts, including Kelvin MacKenzie, will judge the contestants' performances.", "The winner will be encouraged to stand as an independent candidate in the next general election."], "gemma2:2b": ["A new talent show called \"Vote For Me\" features aspiring politicians competing in challenges like giving their manifestos and lobbying.", "The show follows the format of Pop Idol, with public voting determining which contestants progress.", "The panel is comprised of experts and TV personalities such as Kelvin MacKenzie, who offers harsh but entertaining criticism.", "Some contestants present outlandish proposals, while others display a more grounded approach.", "The winner may gain national recognition even if they cannot run for office without public financing."], "qwen2.5:0.5b": ["\"Pop Idol 365\" features over 100 potential contestants competing for the position of independent candidate at the next general elections in May 2022.", "The show will feature three experts judging their performance, including a panel hosted by ex-ITN political editor John Sergeant and television host Lorraine Kelly.", "Kelvin MacKenzie takes the Simon Cowell seat, presenting his manifesto.", "Other contestants include Kevin Donnellon from Wheelchair User's Group, Barry Lim, Jonathan Maitland, Irfan Hanif, Dominic Carman, George Carman, Rodney Hylton-Potts, and a 59-year-old convicted fraudster named Mr MacKenzie."], "qwen2.5:1.5b": ["Pop Idol-style contest for would-be politicians airs on ITV1, with hundreds of candidates facing elimination by experts and public votes before picking an independent politician to stand in the next general election expected in spring.", "Critics debate whether any of the candidates can succeed in politics."], "qwen2.5:3b": ["'Poll Idols' begins airing on ITV1's Pop Idol-style contest for would-be politicians.", "Over four days, hundreds of contestants are narrowed down by experts and public voting.", "The winner will run as an independent candidate in the spring election.", "Former MP Martin Bell supports the show, seeing it engage voters positively, while Bernard Ingham criticizes it as corrupting politics.", "Early episodes featured eccentric contestants and policies such as a holiday for Bruce Forsyth or Bill Oddie.", "Kelvin MacKenzie provides harsh feedback with Simon Cowell-like insults.", "The series continues, allowing public voting to evict one contestant each night; the winner will not receive funding but may gain election momentum."], "opencoder:1.5b": ["'Poll Idols' face first hurdles and find a vibrant community of opinion seeking the next big thing in politics, yet it's only when the show finally hits its screens that we see the real winner and its impact on our lives."], "smollm:1.7b": ["The summary is concise and objective, preserving key ideas and details of the text while omitting unnecessary information.", "The main points covered in the text are:\n\n1.", "Poll Idols face first hurdles - the contestants will be whittled down by experts and public vote.", "2.", "Over the next four days, hundreds of potential candidates will be offered up for the general election.", "3.", "Any of them would make competent MPs - opinions vary on whether any of the potential candidates have what it takes to make it in politics.", "4.", "The show will engage ordinary voters - if it gets more people voting and more people interested in politics, there is no harm in that.", "5.", "Sir Bernard Ingham argues that Westminster has its share of \"odd balls\" - some contestants are not suitable for the job.", "6.", "Mr Bell, who will be offering his advice to the contestants on Wednesday, argues that Westminster has its share of \"corrupting politics\".", "7.", "He said the producers would not achieve their aim of re-engaging voters with that bunch of nutters - but they did manage to get 25 contestants in the final episode.", "8.", "The contestants were given 60 seconds to present their manifestos - then the final 25 were tested on their lobbying ability.", "9.", "Kelvin MacKenzie was asked: \"Why on earth do you want our elected representatives to be disabled?", "- well, prime minister, bad news, all the houses in Britain have been painted but actually nobody has paid tax\" - he thought it was an excellent question and would give him a good chance of progressing.", "10.", "Mr Lim later reduced the panel to fits of giggles as he outlined his plan to make people do community service instead of paying taxes - bad news, all the houses in Britain have been painted but actually nobody has paid tax.", "11.", "Irfan Hanif was voted through to the final 25 contestants - he thought he would not trust him as far as he could throw him.", "12.", "ITV will not fund the election campaign for the eventual winner - opinions vary on whether any of the potential candidates has what it takes to make it in politics."], "deepseek-r1:1.5b": ["Poll Idols  \nTV1's Pop Idol-style political talent show has finally reached our screens this week.", "The producers narrow down hundreds of potential contestants over four days, using expert panels and public vote.", "The winner is expected to stand as an independent at the next general election in spring.", "Martin Bell sees many contestants with competent MPs, while Sir Bernard Ingham doubts it, calling the show corrupting politics.", "He mentions producers won't engage voters \"with nutters,\" and some eccentric ideas like public holidays and special days were included.", "Contestant Kelvin MacKenzie was in Simon Cowell's spot and offered advice on getting a haircut for a brain transplant.", "He also criticized Kevin Donnellon over disabled representatives.", "Another contestant, Barry Lim, suggested changing taxes to focus on community service instead of taxing.", "Maitland was confused when he said the prime minister blamed everyone for tax cuts.", "Other candidates like Maitland and Dominic Carman had different platforms, including education funding and fraud.", "The show doesn't fund election campaigns but gives the winner an early advantage.", "TV1 will continue this week with a mix of eccentric ideas and public eviction each night."], "tinyllama:1.1b": ["The 'Political Idol' talent show on ITV1, hosted by Lorraine Kelly and John Sergeant, has already faced criticism from former political adviser Martin Bell for making \"odd balls\" and the show's viewers more likely to vote.", "The producers have also been accused of \"re-engaging voters with that buck of nutters\" and \"involving ordinary voters\".", "One of the contestants, a druid priest from Wales, proposed a public holiday on Bruce Forrest's birthday and a drug addict politician with a hardline on crime and immigration who would be joined by Rodney Hylton-Poots.", "The show has also faced criticism for featuring lobbying abilities tests, but the expert panel had a stream of well-crafted insults for contestants, including guitar-toting environmental campaigner Barry Lim.", "The public voted to get rid of one candidate, with the contestant being evicted during each night's episode.", "The show has already faced criticism from the public, and the winner will need to engage more than ordinary voters in politics.", "While the series continues throughout the week, critics have questioned whether it will help anyone but politicians."], "tinydolphin:1.1b": [" This text is a summary of an article discussing Poll Idols, a new political talent show on ITV which aims to find the UK's next politician by voting for who they think deserves to be in charge.", "The show features various contestants vying for attention and votes, with the winner taking up the role of an independent MP.", "The article provides details about some of the contestants and their policies, as well as opinions from experts and politicians on whether any of them are suitable for a political career."], "phi:2.7b": [" A user asked for a summary of a passage about 'Poll Idols' face first hurdles on their journey to becoming independent politicians in an election contest inspired by ITV1's Pop Idol.", "The show will select one contestant through public vote and expert panel.", "There is debate among political experts regarding the potential success of these candidates, with some expressing skepticism while others believe it could engage more people in politics.", "The first episode of the show featured eccentric contestants such as a druid priest and a former porn star making bold claims.", "A panel of judges including former politician Sir Bernard Ingham and ex-ITN political editor John Sergeant judged the contestants' manifestos, lobbying abilities, and performance.", "The most memorable moment was Kelvin MacKenzie's insults towards one contestant, Kevin Donnellon.", "Other contestants also made their mark, such as guitar player Barry Lim proposing a community service instead of taxes.", "Irfan Hanif made a good impression despite Mr MacKenzie's suggestion that young drunks should be given a beating and left to die.", "The show continues throughout the week with public voting to evict one contestant each night.", "ITV will not fund the election campaign for the eventual winner, but the publicity could give them an advantage over other candidates."], "orca-mini:3b": [" Poll Idols face hurdles in their first step towards becoming an independent politician.", "Over four days, hundreds of candidates will be tested on their skills and knowledge in politics.", "Some oddballs and self-publicists are expected to participate, as well as a public holiday on Bruce Forsyth's birthday and Bill Oddie for PM.", "The show features a panel of three experts who judge the candidates' performance during the 60-second presentations of their manifestos.", "The panel will also test the candidates on their lobbying ability.", "The winner will be encouraged to stand as an independent at the next general election, which is expected in the spring.", "However, opinions are divided over the potential candidates unearthed so far, with some experts arguing that they do not have what it takes to make it in politics."], "hermes3:3b": ["TV show 'Vote For Me' looks at potential politicians; contestants are judged in manifestos, lobbying skills and public cross-examination.", "Some experts think it could engage voters while others criticize it as corrupting politics."], "stablelm-zephyr:3b": ["\"Poll Idols,\" an ITV1 talent contest for would-be politicians, begins this week, with hundreds of potential candidates being narrowed down by a panel of experts and public voting.", "The top 25 will be judged on their lobbying abilities and interviewed by the panel chaired by ex-ITN political editor John Sergeant and television host Lorraine Kelly.", "Kelvin MacKenzie is the star of the show dispensing well-crafted insults and one-liners.", "The contest, divided opinions, could engage ordinary voters and potentially provide a candidate with a flying start in politics; however, it may also be criticized for \"corrupting politics.\""], "chatgpt-4o-latest": ["ITV1's \"Vote For Me,\" a Pop Idol-style talent contest for aspiring politicians, has begun, aiming to select an independent candidate for the next general election.", "Over four days, contestants are judged by a panel and public vote, with the winner encouraged to stand for election.", "Former MP Martin Bell supports the show for engaging voters, while Sir Bernard Ingham criticizes it as corrupting politics.", "The show features eccentric candidates, including a druid priest and a former porn star, and unconventional policy proposals.", "Contestants present manifestos, undergo lobbying tests, and face tough questioning from a panel led by John Sergeant, Lorraine Kelly, and the outspoken Kelvin MacKenzie.", "MacKenzie delivers sharp critiques, dismissing some candidates outright.", "Among those advancing are doctor Irfan Hanif and Dominic Carman, while convicted fraudster Rodney Hylton-Potts sparks debate.", "The public will vote contestants out nightly, and while ITV won't fund the winner's campaign, the exposure may provide an electoral advantage."], "stablelm2:1.6b": ["A talent contest for politicians called \"Poll Idols\" is set to air on ITV this week.", "The show aims to find potential candidates who can make it in politics.", "Over four days, hundreds of hopefuls will be judged by an expert panel and public vote, with the winner encouraged to run as an independent candidate in the next general election if possible.", "However, opinions are divided regarding whether any of the contestants have what it takes to succeed in politics.", "The show's format is similar to Pop Idol, with contestants presenting their manifestos and lobbying abilities before being tested on their results.", "A number of eccentric policy proposals were presented by contestants during the first episode."], "granite3.1-dense:2b": ["'Poll Idols,' a Pop Idol-style talent contest on ITV1 for potential politicians, premieres this week.", "Over four days, hundreds of hopefuls will be judged by experts and voted on by the public.", "The winner will stand as an independent in the upcoming spring general election.", "Opinions are divided; some, like former MP Martin Bell, believe the contestants could make competent MPs, while others, such as Sir Bernard Ingham, criticize it as corrupting politics and featuring \"nutters.\"", "The show follows Pop Idol's format, with contestants presenting their manifestos in 60 seconds.", "The final 25 are tested on lobbying skills, cross-examined by a panel chaired by former ITN editor John Sergeant, and cross-examined by Lorraine Kelly.", "Contestants include eccentric figures like a druid priest, a former porn star, and an environmental campaigner proposing community service for tax evasion.", "Kelvin MacKenzie, a former Sun editor, serves as the most critically acclaimed panelist, dishing out insults and witty remarks.", "He questioned Kevin Donnellon about caring for Inuit people and suggested that disabled individuals should be MPs.", "Barry Lim proposed his plan to make people do community service instead of paying taxes, causing the panel to burst into laughter.", "Irfan Hanif, a 25-year-old doctor from Bolton, impressed the panel with his NHS-focused platform.", "Dominic Carman, son of late libel lawyer George Carman, was voted through for proposing defense spending cuts to boost education.", "Rodney Hylton-Potts, a 59-year-old convicted fraudster, faced mixed opinions; MacKenzie thought he deserved another chance in Parliament, while Kelly expressed lack of trust in him.", "The public will have the opportunity to evict contestants each night throughout the week, potentially boosting the eventual winner's campaign with increased visibility.", "ITV does not fund the winner's election campaign but may provide a competitive edge due to the show's exposure."]}