{"raw_text": "How political squabbles snowball\n \n It's become commonplace to argue that Blair and Brown are like squabbling school kids and that they (and their supporters) need to grow up and stop bickering.\n \n But this analysis in fact gets it wrong. It's not just children who fight - adults do too. And there are solid reasons why even a trivial argument between mature protagonists can be hard to stop once its got going. The key feature of an endless feud is that everyone can agree they'd be better off if it ended - but everyone wants to have the last word.\n \n Each participant genuinely wants the row to stop, but thinks it worth prolonging the argument just a tiny bit to ensure their view is heard. Their successive attempts to end the argument with their last word ensure the argument goes on and on and on. (In the case of Mr Blair and Mr Brown, successive books are published, ensuring the issues never die.) Now this isn't because the participants are stupid - it's actually each individual behaving entirely rationally, given the incentives facing them. Indeed, there's even a piece of economic theory that explains all this. Nothing as obscure as \"post-neo-classical endogenous growth theory\" which the chancellor himself once quoted - but a ubiquitous piece of game theory which all respectable policy wonks are familiar with.\n \n It's often referred to as the \"prisoner's dilemma\", based on a parable much told in economics degree courses... about a sheriff and two prisoners. The story goes that two prisoners are jointly charged with a heinous crime, and are locked up in separate cells. But the sheriff desperately needs a confession from at least one of them, to provide enough evidence to convict them of the crime. Without a confession, the prisoners will get a minimal sentence on some trumped up charge.\n \n Clearly the prisoners' best strategy is to keep their mouths shut, and take the short sentence, but the clever sheriff has an idea to induce them to talk. He tells each prisoner separately, that if they confess - and they are the only one to confess - they'll be let off their crime. And he tells them that if they don't confess - and they are the only one not to confess - they'll get life. Now, if you are prisoner confronted with this choice, your best bet is to confess. If your partner doesn't confess, you'll get off completely. And if your partner does confess, you'd better confess to ensure you don't get life. The result is of course, both prisoners confess, so the sheriff does not have to let either one off. Both prisoners' individual logic was to behave that way, even though both would have been better if they had somehow agreed to shut up. Don't worry if you don't entirely follow it - you can to look it up on Google, where there are 283,000 entries on it.\n \n The prisoners' dilemma and all its ramifications have truly captured economists in the last couple of decades. It is a parable used to describe any situation where there is an obvious sensible choice to be taken collectively, but where the only rational choice individually is to behave selfishly.\n \n A cold war arms race for example - a classic case where both Russia and America would be better off with just a few arms, rather than a lot of arms. But as long as each wants just a few more arms than the other, an arms race ensues with the results that the individually logical decision to buy more arms, results in arms levels that are too high. What economics tells us is that once you're in a prisoners' dilemma - unless you are repeating the experience many times over - it's hard to escape the perverse logic of it. It's no good just exhorting people to stop buying arms, or to stop arguing when all their incentives encourage them to carry on. Somehow, the incentives have to change.\n \n In the case of the Labour Party, if you believe the rift between Blair and Brown camps is as bad as the reports suggest, Solomon's wisdom needs to be deployed to solve the problem. Every parent knows there are ingenious solutions to arguments, solutions which affect the incentives of the participants. An example, is the famous rule that \"one divides, the other chooses\" as a way of allocating a piece of cake to be sliced up between greedy children. In the case of an apparently endless argument, if you want it to come to an end, you have to ensure the person who has the last word is one who loses rather than the one who wins the row. The cost of prolonging the row by even one more briefing, or one more book for that matter, has to exceed the benefit of having the last word, and getting your point in. If the rest of the party can enforce that, they'll have the protagonists retreating pretty quickly.\n", "llama3.2:1b": ["Political squabbles snowball because everyone wants to be heard but thinks it's worth prolonging the argument just a little to ensure their view is heard.", "Individuals behave rationally given their incentives, but succeed in extending the argument and preventing its conclusion due to incentives that favor prolonged debate over decisive action."], "llama3.2:3b": ["Blair and Brown's feud is not just childish behavior; it's a classic example of the \"prisoner's dilemma,\" where individual rationality leads to collective irrationality.", "Both want the argument to end, but each wants to prolong it to make their point heard.", "This creates an endless cycle of arguments, with no obvious solution unless incentives are changed."], "gemma2:2b": ["Political squabbles often perpetuate themselves due to a rational pursuit of self-interest even when it would be beneficial to stop arguing.", "This phenomenon is similar to \"the prisoners' dilemma,\" a game theory concept where individuals acting in their own best interest lead to suboptimal outcomes for all parties involved, as seen in the example of arms races.", "The authors suggest this \"prisoners' dilemma\" mindset makes political disputes difficult to resolve and argues that shifting incentives may be necessary."], "qwen2.5:0.5b": ["Political disagreements among politicians often escalate into a \"prisoner's dilemma\".", "The participants' best strategy is to shut up and take the short sentence if their opponents are the only ones who want to continue the argument.", "If both parties agree on an individual solution, either party can win with just a few more points than the other.", "A cold war arms race could be solved by making an \"one divides, the other chooses\" rule apply."], "qwen2.5:1.5b": ["Political squabbles escalate as adults engage in mutually beneficial but difficult-to-terminate arguments due to rational self-interest and repeated attempts to achieve their desired outcomes by prolonging the conflict.", "The \"prisoner's dilemma\" concept is applied to explain why seemingly simple disagreements can persist indefinitely, despite both parties recognizing they'd be better off if the argument ended."], "qwen2.5:3b": ["How political squabbles snowball\n\nIt's common to see comparisons between political rivals like Blair and Brown as immature children fighting, but this analysis is flawed.", "Adults engage in conflicts too, especially when each participant wants their view heard despite agreeing that ending the conflict would be beneficial.", "The key feature of an endless feud lies in everyone wanting one last word before it ends, driven by rational incentives.", "Economic theory explains such behaviors, drawing from the \"prisoner's dilemma\" scenario where two prisoners' best strategy is to confess for potential leniency, leading them both to confess despite mutual benefit being silent.", "This concept extends to real-world issues like arms races, where each participant's logic leads to unproductive actions due to selfish incentives.", "For political squabbles, a solution might involve ensuring the last word goes to someone who loses rather than wins, thus changing participants' incentives and forcing an end to the conflict."], "opencoder:1.5b": ["The given text is an attempt at summarizing a political debate between Mr. Blair and Mr. Brown, with some participants arguing against each other for too long.", "The summary aims to preserve the key points of the discussion without any explanations or reasoning process.", "In this debate, it was clear that adults are more likely to argue than children because they have different views and motivations.", "Each group has a clear goal: to keep their positions held regardless of the outcome, which is a condition known as \"peace.\"", "This goal seems to be rooted in post-neo-classical economic theory, which describes that everyone should have equal access to benefits regardless of the income level or class.", "However, it's worth mentioning that this was not a matter of political squabbles and that the people of the two countries continued to argue over the same issues.", "The argument seemed rather abstract and theoretical, but it eventually became clear when the debate escalated into an extensive legal dispute by some supporters.", "In the end, each country managed to find a compromise - a position where they could maintain peace and prevent potential conflicts, even if they were facing similar challenges in the future.", "It's not about whether someone should win or lose the row; it's about finding a compromise that balances the benefits of peace and the concerns of conflict."], "smollm:1.7b": ["The article provides a concise summary of the key ideas and details related to the \"prisoner's dilemma\" concept, which is often used to describe situations where individual rationality leads to suboptimal outcomes for all parties involved.", "The article highlights the importance of considering the incentives faced by each party in such situations, and how these incentives can lead to irrational behavior.", "The article also mentions the \"cold war arms race\" as an example of a situation where the prisoners' dilemma occurs, but it is not the only one.", "It suggests that once the parties are in the prisoner's dilemma, it is hard to escape the perverse logic of the situation and suggest ways to solve the problem.", "The article also touches on the concept of \" Solomon's wisdom\" as a way to solve the problem, by suggesting that ingenious solutions can be found to allocate resources in situations where there are multiple parties with competing interests.", "In the case of an endless argument between Blair and Brown camps, it is suggested that the last word should belong to the one who loses rather than the one who wins.", "The article also notes that the cost of prolonging the row by even one more briefing or one more book for that matter, has to exceed the benefit of having the last word, and getting one's point in."], "deepseek-r1:1.5b": ["Adults bickering can be endless because each argument's outcome affects others.", "Game theory shows cycles of conflict without resolution.", "The prisoner's dilemma demonstrates cooperation isn't always good if there's a personal cost.", "The Cold War arms race highlights perpetual conflict with individual incentives driving confusion.", "The Labour Party uses solutions like the \"one divides, the other chooses\" method to end arguments by making the last word lose."], "tinyllama:1.1b": ["The political squabbles between Prime Ministers Tony Blair and Gordon Brown are often characterized by a struggle to end an \"endless feuled\" debate with everyone agreeing to stop arguing once their view is heard.", "This analysis explains the reasons why even rational participants of the argument continue to engage in the struggle to avoid ending the conflict.", "The key feature of this type of argument is that individuals genuinely want to have the last word, while each participant believes the incidents encouraging them to continue arguing are enough to justify prolonging the argument.", "This is because economic theory explains that even when incriminating evidence exists to prove one's innocence, those who need the \"win\" most will feel compelled to convince their supporters of their guilt instead of ending the argument.", "The best strategy for the participants is to take the shortest sentence as their guide and encourage confessions or self-incrimination, regardless of whether they actually need the win more.", "However, as long as there are economic incentives in place that encourage each participant to continue arguing, no solution will be found until the issue's incriminating evidence is exhausted or the inclementives are altered to reflect new realities."], "tinydolphin:1.1b": [" The political squabble between Tony Blair and David Cameron is not a game but a complex tug-of-war that has been raging for decades.", "It’s not just children who fight; adults do too.", "The key to ending this longstanding feud once and for all lies in understanding the psychological principles at play, which are actually quite similar to those in economics.", "The reason why people can agree to end a trivial argument is that they have an incentive to think their view is better.", "In a zero-sum game where everyone gets less of what they desire, an outcome that benefits one person also benefits everyone else.", "This can create a vicious cycle where individuals feel compelled to keep their mouths shut and avoid the needless drama.", "The \"prisoner's dilemma\" is a classic example of this behavior.", "If two prisoners are locked up in separate cells, neither of them will likely confess unless they know which prisoner will not get a life sentence for committing the crime.", "This logic is even more pronounced when it comes to arguments between politicians.", "If one side believes their view is the only true and correct, they're motivated to keep talking and never let go of the belief that they are right.", "Another rationale for this approach is the concept of life expectancy.", "When people grow old, they typically lose a decade of their potential life, meaning that each year when people age, we're actually shortening the productive lifespan of future generations.", "This means that if we continue to allow arguments to persist, not only will we be infringinging on the rights of those who are yet to be born, but we'll also be taking away from future generations by not investing in their potential.", "To resolve this issue once and for all, it’s crucial that the protagonists understand the principles of economics and apply them to their arguments.", "In a similar vein, political parties should enforce a rule whereby if one side believes their view is the only true and correct, they're not allowed to give speeches or present arguments further than the last person who gave one.", "This would force the other party to ensure that their last word is not just the end of the argument, but the beginning of a productive dialogue between the two parties."], "phi:2.7b": [" Political squabbles between Blair and Brown are not just childish arguments; adults engage in them too.", "Each participant genuinely wants the row to end, but thinks it's worth prolonging the argument with their last word.", "This leads to endless fighting, which happens because of the incentives faced by each party.", "Game theory explains that this is rational behavior for individuals, and economists often refer to it as the \"prisoner's dilemma\".", "In a prisoners' dilemma, both parties benefit from cooperation, but they end up betraying each other when acting selfishly.", "This has been observed in many situations, including the cold war arms race.", "Solving such conflicts requires changing incentives, which can be achieved by making the cost of prolonging the row greater than the benefit of getting your point across.", "The Labour Party must apply this concept to end their disputes between Blair and Brown."], "orca-mini:3b": [" The political squabbling between Blair and Brown seems to snowball due to the participants' rational behavior in an incentive-based system despite their desire to stop fighting.", "The prisoners' dilemma and the arms race are examples of situations where individual choices lead to outcomes that are not optimal for everyone involved, highlighting the perverse logic of such situations.", "It is up to the party leadership to find ingenious solutions to end the argument between the two leaders without resorting to violence or personal attacks."], "hermes3:3b": ["Summary of \"How Political Squabbles Snowball\":\n* Explains how endless political arguments occur despite both sides wanting them to end.", "* Cites \"prisoner's dilemma\" game theory example as explanation for prolonged arguments.", "* Argues that incentives need to change to stop the argument, rather than just asking people to stop.", "* Suggests enforcing a rule where the person having last word loses the benefit is key to ending arguments."], "stablelm-zephyr:3b": ["This text discusses how political squabbles escalate due to the prisoner's dilemma, a concept from game theory.", "It explains that both participants want to have the last say, even though they know it prolongs the argument and reaches an unfavorable outcome for either side.", "The example given is the rift between the Labour Party's camps of Blair and Brown, which can be resolved by ensuring one person loses rather than wins the argument.", "This requires enforcing a compromise that outweighs the desire to have the last word in each instance."], "chatgpt-4o-latest": ["Political disputes, like the ongoing feud between Blair and Brown, persist not because of childishness but due to rational behavior explained by game theory, specifically the \"prisoner's dilemma.\"", "Each side wants the argument to end but also wants the last word, leading to an endless cycle.", "This dilemma applies to various situations, such as the Cold War arms race, where individual rational decisions result in collectively undesirable outcomes.", "To break the cycle, incentives must change—such as ensuring that the last word comes at a cost rather than a benefit.", "In the Labour Party's case, enforcing such a rule could help resolve the conflict."], "stablelm2:1.6b": ["Political disputes between Blair and Brown, as well..\nShowdowns between grown-ups: The key feature of an endless feud is that everyone agrees it would be better if it ended, but each participant wants to prolong the argument just a bit to ensure their view is heard.", "Incentives matter: Each participant behaves rationally given the incentives facing them.", "A piece of economic theory explains this behavior: \"post-neo-classical endogenous growth theory\" and game theory, especially the \"prisoner's dilemma.\"", "Solving the problem with incentive: To end an argument, you must ensure one side loses rather than winning the row.", "Enforcing this in a disagreement between Blair and Brown could be achieved through their respective books being published to keep the issues alive.", "Example of an inventive solution: The famous rule that \"one divides, the other chooses\" is used as an example of such an effective solution to arguments.", "In summary, political squabbles can snowball due to rational behavior and selfishness in participants.", "To end a disagreement, incentives must change, and a clever incentive strategy can be implemented to ensure one side loses."], "granite3.1-dense:2b": ["Political disputes among mature individuals, like those between Blair and Brown, can persist due to a rational yet perverse logic known as the \"prisoners' dilemma.\"", "This economic concept illustrates that each participant believes their self-interest lies in prolonging the argument to ensure their view is heard.", "The consequence of not confessing (in this case, agreeing to stop the argument) is a detrimental outcome, just as in the prisoners' dilemma where both parties prefer to confess but end up confessing due to each other's self-interest.", "This situation is similar to cold war arms races or ongoing political feuds, where collective good sense dictates moderation, yet individual incentives drive escalation.", "To break such endless arguments, external forces must alter the participants' incentives—in this case, by ensuring the person who speaks last is the one who loses rather than gains.", "This approach encourages protagonists to end their disagreements quickly, as the cost of continuing outweighs the benefit of having the final word and maintaining their stance."]}