{"raw_text": "Tory leader unveils spending plan\n \n Tory leader Michael Howard says his party can save £35bn in government spending by tackling waste.\n \n The money would be ploughed back into frontline services like the NHS and schools with the rest used to cut government borrowing and reduce taxes. The Tory leader has also shrugged off the defection of one of his MPs, Robert Jackson, a former minister, to Labour. Mr Howard said that these things happened in politics and it would not affect the outcome of the election. \"Let's be realistic - the election is not going to be decided on the basis of what Mr Jackson did\", he told BBC 1's Breakfast with Frost programme. However the defection on Saturday has cast a shadow over the launch of the Conservatives' spending plans. Fuller details are due to be unveiled on Monday.\n \n The bulk of the £35bn saved by tackling bureaucracy and inefficient systems will go back into frontline services, Mr Howard said. The £12bn left over would then be spent on reducing government borrowing, he added. However, the remainder would deal with some of the \"unfair taxes\". \"Almost every independent expert says if you get another Labour government you are going to have to pay higher taxes,\" Mr Howard insisted. \"Because borrowing is going up, it is out of control, that is bound to lead to higher taxes or higher interest rates or both. \"So part of the £12bn we are going to apply to filling the government's black hole, reducing the borrowing. \"The rest will be used to reduce these unfair taxes which are bearing so heavily on the people of our country today.\"\n \n Mr Howard is expected to say that around £6bn will be available for tax cuts when he makes his announcement on Monday. The cuts will be paid for out of the savings identified by business trouble-shooter David James. Home Office spending could be cut by £1.6bn, according to the final instalment of his year-long review. Savings of £153m at the Foreign Office and £336m at the Department for Culture Media and Sport, have also been identified. In all, almost a quarter of a million jobs and 168 public bodies would go under Mr James' proposals.\n \n Mr Howard said: \"All this adds up to a bottom line and the bottom line is at this election people will have a clear choice between Mr Blair, who will waste more and tax more, and a Conservative government that will give them value for money and tax less.\" However, Chief Treasury Secretary Paul Boateng said: \"None of the Tories' figures add up so they can't make these savings and can't pay for any tax cuts, which means the only guaranteed cut from the Tories is £35bn of cuts, hitting frontline public services hard.\" Liberal Democrat leader Charles Kennedy added: \"People will not be taken in by Michael Howard's claims of £35bn worth of savings. \"This can't be achieved without drastic cuts in local services in their own communities.\" A poll for the News of the World newspaper suggests the Conservatives are on course for their worst election defeat in a century. Labour will hold key marginal constituencies, winning a majority of 160, the Populus survey suggests. And the Liberal Democrats will take three key seats from the Conservatives, leaving the Tories with just 163 MPs, two less than they returned atLabour's 1997 landslide and their worst showing since 1906.\n", "llama3.2:1b": ["Michael Howard, Tory leader, unveils a spending plan to save £35bn in government spending by cutting waste and increasing frontline services like the NHS and schools.", "The bulk of this savings will go back into these services, with the remaining funds being used to reduce \"unfair taxes\" such as borrowing.", "Howard claims that Labour's high tax rates could lead to higher taxes if elected, while also stating that the Conservative party will give value for money and cut taxes.", "However, Treasury officials contradict Howard's claim, saying that the Tories' figures cannot be used to make these savings due to a lack of funds."], "llama3.2:3b": ["Tory leader Michael Howard has announced a spending plan that could save £35bn by tackling waste in government spending.", "The money would be used to reduce taxes, cut borrowing, and plug the \"black hole\" in public finances.", "The savings are expected to include cuts of up to £12bn, with around £6bn available for tax cuts."], "gemma2:2b": ["Tory leader Michael Howard proposes £35 billion in government spending cuts to be achieved through tackling waste and inefficiency.", "The bulk of the savings will go towards frontline services, followed by reducing government borrowing and ultimately cutting taxes.", "The plan includes tax cuts, public service cuts, and reductions in specific departmental budgets.", "Critics argue that the claims lack substance and that significant cuts to public services are inevitable.", "Polls suggest a potential Labour majority with the Conservatives facing their worst election showing in over a century."], "qwen2.5:0.5b": ["Cabinet spending cuts could save £35bn by tackling inefficiencies and improving services like NHS and schools.", "Conservative leader Michael Howard says the government will use nearly a quarter of a million jobs and public bodies to make up for these savings, but Labour and Lib Dems say they cannot afford it."], "qwen2.5:1.5b": ["Michael Howard unveils Conservative spending plan aimed at £35bn savings by tackling bureaucracy, focusing on NHS, schools, reducing borrowing, cutting unfair taxes, with additional £6bn in tax cuts available on Monday.", "Critics doubt the feasibility of achieving £35bn and threatening to cut frontline public services.", "Poll suggests Conservatives may suffer their worst defeat since 1906."], "qwen2.5:3b": ["Tory leader Michael Howard unveils a £35bn spending plan to tackle waste, reinvesting savings in frontline services like the NHS and schools with the rest used for reducing government borrowing and taxes.", "He expects around £6bn for tax cuts from David James' proposals.", "The Conservative party's plans have been overshadowed by Robert Jackson's defection to Labour.", "Howard claims the Tories offer value for money compared to a potential Labour government, while critics argue his figures are not credible.", "Polls suggest significant losses for the Conservatives in this election, potentially marking their worst performance since 1906."], "opencoder:1.5b": ["Tory leader unveils spending plan\n\nTory leader Michael Howard says his party can save £35bn in government spending by tackling waste.", "The money would be ploughed back into frontline services like the NHS and schools with the rest used to cut government borrowing and reduce taxes.", "The Tory leader has also shrugged off the defection of one of his MPs, Robert Jackson, a former minister, to Labour.", "Mr Howard said that these things happened in politics and it would not affect the outcome of the election.", "\"We're going to be realistic - the election is not going to be decided on the basis of what Mr Jackson did,\" he told BBC 1's Breakfast with Frost programme.", "Mr Howard also says: \"Let's be realistic - the election is not going to be decided on the basis of what Mr Jackson did\".", "However, the defection on Saturday has cast a shadow over the launch of the Conservatives' spending plans.", "Fuller details are due to be unveiled on Monday.", "The bulk of the £35bn saved by tackling bureaucracy and inefficient systems will go back into frontline services, Mr Howard said.", "The £12bn left over would then be spent on reducing government borrowing, he added.", "However, the remainder would deal with some of the \"unfair taxes\".", "\"Almost every independent expert says if you get another Labour government you are going to have to pay higher taxes,\" Mr Howard insisted.", "\"Because borrowing is up, it is out of control, that is bound to lead to higher taxes or higher interest rates or both.", "\"So part of the £12bn we are going to apply to filling the government's black hole, reducing the borrowing.", "The rest will be used to reduce these unfair taxes which are bearing so heavily on the people of our country today.", "Mr Howard is expected to say that around £6bn will be available for tax cuts when he makes his announcement on Monday.", "The cuts will be paid for out of the savings identified by business trouble-shooter David James.", "Home Office spending could be cut by £1.6bn, according to the final instalment of his year-long review.", "Savings of £153m at the Foreign Office and £336m at the Department for Culture Media and Sport, have also been identified.", "In all, almost a quarter of a million jobs and 168 public bodies would go under Mr James' proposals."], "smollm:1.7b": ["The summary is:\n\n* The Tory leader Michael Howard says his party can save £35bn in government spending by tackling waste.", "* The money would be ploughed back into frontline services like the NHS and schools with the rest used to cut government borrowing and reduce taxes.", "* Mr Howard said that these things happened in politics and it would not affect the outcome of the election.", "\"Let's be realistic - the election is not going to be decided on the basis of what Mr Jackson did\", he told BBC 1's Breakfast with Frost programme.", "However the defection on Saturday has cast a shadow over the launch of the Conservatives' spending plans.", "* The bulk of the £35bn saved by tackling bureaucracy and inefficient systems would go back into frontline services, Mr Howard said.", "* The remainder would deal with some of the \"unfair taxes\".", "\"Almost a quarter of a million jobs and 168 public bodies would go under Mr James' proposals\", Mr Howard added.", "* The Labour leader Paul Boateng said: \"None of the Tories' figures add up so they can't make these savings and can't pay for any tax cuts, which means the only guaranteed cut from the Tories is £35bn worth of savings\".", "* Liberal Democrat leader Charles Kennedy added: \"People will not be taken in by Michael Howard's claims of £35bn worth of savings.", "This can't be achieved without drastic cuts in local services in their own communities\".", "* The Labour party holds key marginal constituencies, winning a majority of 160 seats from the Conservatives, the Populus survey suggests.", "And the Liberal Democrats will take three key seats from the Conservatives, leaving the Tories with just 163 MPs, two less than they returned at Labour's 1997 landslide and their worst showing since 1906."], "deepseek-r1:1.5b": ["The Spending Bill proposes a saving of £35bn by addressing government inefficiency, reallocating funds to frontline services such as NHS and schools while reducing borrowing.", "Specific savings include £1.6bn at Home Office and £336m at Department for Culture Media and Sport.", "These cuts aim to reduce unfair taxes and fund local services.", "The bill would save approximately 60% in taxes and boost public bodies, though this might trigger a pivot towards Labour's policies."], "tinyllama:1.1b": ["The text summarizes the launch of the Conservative Party's spendings plan, which includes saving a total of £35 billion in government spending by tackling waste and reducing taxes.", "The money will be used to pay for tax cuts in various areas such as frontline services, business trouble-shooter David James' proposed review identifying almost a quarter million jobs, 168 public bodies, and nearly a thousand public bodies being sliced from the government.", "Despite the party's claims of saving £35 billion worth of spending, Liberal Democrats are expected to win majorities in some key constituencies.", "The Conservatives are set to lose their best chance at securing an overall majority."], "tinydolphin:1.1b": [" Michael Howard announced that the Tory party can save £35 billion by reducing waste in government spending and taxes.", "The money will be used to reduce taxes, increase frontline services, and decrease deficit.", "He also shrugged off one of his party's MPs who switched to Labour, stating that these things did not affect the outcome of the election.", "Conservative spokesperson Paul Boateng said it is all a \"conspiracy\" and people will have a clear choice between Mr. Blair and Tory governments.", "He also added that they can't make these savings, which means the only guaranteed cuts from the Tories are £35 billion worth of cuts hitting frontline public services hard."], "phi:2.7b": [" Conservative leader Michael Howard has announced a plan to save £35bn by tackling waste in government spending.", "He plans to use this money to increase funding for frontline services like the NHS and schools while also reducing borrowing and taxes.", "The defection of one of his MPs, Robert Jackson, will not affect the outcome of the election according to Mr Howard.", "However, it has cast a shadow over the launch of the Conservatives' spending plan.", "The bulk of the £35bn saved by tackling bureaucracy and inefficient systems will be used to fund frontline services, with the rest going towards reducing borrowing and taxes.", "The £12bn left over will be used to reduce \"unfair taxes\" that Mr Howard claims are burdening the people of the country today.", "Mr Howard is expected to announce a plan to use this money for tax cuts on Monday.", "The Conservatives' figures add up to £35bn worth of savings, which would require drastic cuts in local services and frontline public sector jobs.", "A poll suggests that the Conservatives are on course for their worst election defeat in over a century.", "Labour will likely retain key marginal constituencies while the Liberal Democrats take three key seats from the Conservatives."], "orca-mini:3b": [" Tory leader Michael Howard unveils spending plan to save £35bn in government spending by tackling waste.", "The money would be ploughed back into frontline services like the NHS and schools with the rest used to cut government borrowing and reduce taxes."], "hermes3:3b": ["Tory leader Michael Howard announces £35bn savings plan to reduce government spending by cutting waste, aimed at NHS and schools; remainder for tax cuts and reducing borrowing."], "stablelm-zephyr:3b": ["Tory leader Michael Howard unveiled a spending plan to save £35bn in government spending by tackling waste.", "The money would be invested in frontline services like the NHS and schools, while the remaining £12bn would be used to reduce government borrowing and unfair taxes.", "Around £6bn would be available for tax cuts, funded by savings identified by business troubleshooter David James.", "Critics argue that these claims of savings cannot be achieved without drastic cuts in local services and point out that Tory figures do not add up.", "A poll suggests the Conservatives may face their worst election defeat in a century."], "chatgpt-4o-latest": ["Tory leader Michael Howard claims his party can save £35bn by cutting government waste, redirecting most funds to frontline services like the NHS and schools while using £12bn to reduce borrowing and cut \"unfair taxes.\"", "He dismissed the defection of MP Robert Jackson to Labour, saying it would not impact the election.", "Howard plans to announce £6bn in tax cuts, funded by savings identified by business expert David James, which include cutting Home Office spending by £1.6bn and eliminating nearly a quarter of a million jobs and 168 public bodies.", "Labour and the Liberal Democrats criticized the plan, arguing the savings are unrealistic and would harm public services.", "A poll suggests the Conservatives are heading for their worst election defeat in a century, with Labour projected to win a majority of 160 seats."], "stablelm2:1.6b": ["Tory leader Michael Howard unveils a £1bn saving plan in government spending by tackling waste and allocating funds to frontline services, reducing government borrowing, and cutting \"unfair taxes.\"", "The bulk of the savings will go back into front-line services, with the remaining amount being used for reducing government borrowing.", "Approximately £6bn will be available for tax cuts when announcing spending plans on Monday; however..\nChief Treasury Secretary Paul Boateng states that none of the Tory's figures add up to make these savings and pay for tax cuts.", "The Conservatives are projected to have their worst election defeat in a century, with Labour holding key marginal constituencies and gaining an advantage over two crucial Conservative seats."], "granite3.1-dense:2b": ["Tory leader Michael Howard has unveiled a £35bn spending plan to tackle government waste, which he plans to allocate primarily back into frontline services like the NHS and schools.", "The rest will be used for reducing borrowing and cutting taxes.", "Key findings from business trouble-shooter David James' review include potential Home Office savings of £1.6bn, with additional reductions identified at the Foreign Office (£153m) and Department for Culture Media and Sport (£336m).", "These cuts would affect nearly 250,000 jobs across 168 public bodies.", "However, Chief Treasury Secretary Paul Boateng disputes the Tories' figures, arguing they cannot achieve these savings without severe cuts to local services.", "A recent poll predicts a significant Conservative electoral defeat, with Labour expected to secure 160 more seats and the Liberal Democrats gaining three key constituencies from the Tories, leaving them with 163 MPs."]}