{"raw_text": "Donor attacks Blair-Brown 'feud'\n \n The reported feud between Tony Blair and Gordon Brown has prompted a Labour donor to say he will almost certainly refuse to give more funds.\n \n Duncan Bannatyne also attacked the government over Iraq and its \"poor\" response to the Asian tsunami crisis. His broadside came as ex-Foreign Secretary Robin Cook said he hoped Mr Brown would be premier at some point. Mr Bannatyne has previously given Labour £50,000. He made his fortune from care homes and health clubs.\n \n The 52-year-old on Tuesday said was he was reviewing his donations because of Cabinet disunity and international issues. His spokesman said it was highly unlikely he would give Labour more money, although he would remain a supporter and not fund the Conservatives.\n \n Robert Peston's new book has prompted more speculation about the Blair-Brown rift with its claims that the prime minister broke a promise made in 2003 to stand down. Mr Bannatyne said: \"Disunity in the Cabinet has a corrosive effect on the country. \"Gordon Brown is a great chancellor who has delivered a stable economy, but business wants that to continue and not be blown off course by petty squabbles based on personal ambition.\" The businessman, whose latest venture is a casino in Newcastle, also voiced concern about the ongoing violence in Iraq.\n \n And he branded the UK government's response to the tsunami as \"piecemeal and poor\". \"The people there need practical help not just pledges of money,\" he said. \"The US has forces helping on the ground - we can do more.\" British Navy ships have helped the relief effort and the prime minister has said the government could ultimately give hundreds of millions of pounds in aid. Mr Bannatyne is due to host a new television programme and is also appearing on BBC2 business start-up programme Dragon's Den. But his spokesman insisted his attack on Labour was not a publicity stunt.\n \n In a separate development, Robin Cook gave his support to Mr Brown's prime ministerial ambitions but told a lunch for political journalists winning the election had to be Labour's election. But he insisted the recent squabbles between Mr Blair and Mr Brown were not \"perceived as a problem by the voters,\" adding there was no impression of governmental incompetence. Mr Cook argued that more prominence was given to these matters because there was \"not an alternative source of opposition to the government\". He warned the \"Abstentions Party\" was the real challenge to Labour - and they would not be motivated by Mr Blair's promise to produce an \"unremittingly New Labour\" election manifesto. His comments come after Dave Prentis, the leader of Britain's biggest union Unison, told the Daily Record newspaper he wants a date to be set for Mr Blair to be replaced as Labour leader.\n", "llama3.2:1b": ["Tony Blair and Gordon Brown have reportedly been at odds with each other in recent months due to cabinet disunity and international issues.", "A Labour donor has announced that he will not give more funds to Labour unless the party changes its policy on the government's response to the Asian tsunami crisis.", "Duncan Bannatyne, a businessman who has donated £50,000 to Labour, attacked Gordon Brown in an interview, stating that disunity in the cabinet has a corrosive effect on the country and that Brown is not fit to be prime minister due to his ambition.", "Bannatyne also expressed concern about the UK government's response to the Iraq crisis, calling it \"piecemeal and poor\" and stating that more needs to be done to help the affected countries.", "He has criticized Labour for its handling of the situation and warned that the party may not be able to overcome opposition from other parties.", "Additionally, Robert Peston's new book has sparked speculation about the Blair-Brown rift, with Bannatyne stating that Brown broke a promise to stand down in 2003 over Iraq."], "llama3.2:3b": ["Duncan Bannatyne is unlikely to donate more funds to Labour due to Cabinet disunity and international issues.", "He attacked the government over Iraq and its response to the Asian tsunami crisis, calling it \"piecemeal and poor\".", "Bannatyne has given £50,000 to Labour in the past and remains a supporter of the party but will not fund the Conservatives."], "gemma2:2b": ["A Labour donor, Duncan Bannatyne, plans not to donate more money due to internal disputes within Labour and poor international responses like the Asian tsunami crisis.", "He believes this disunity will harm business and expressed concern about the ongoing Iraq conflict.", "He remains a supporter of Labour but opposes funding the Conservatives."], "qwen2.5:0.5b": ["Donor attacks Blair-Brown 'feud'\nDuncan Bannatyne attacks Blair-Brown on donation disunity, criticizes Bush's Iraq and tsunami policies.", "Robert Peston's new book highlights Blair-Brown rift with PM Gordon Brown.", "UK Prime Minister Gordon Brown may be premier if Blair leaves.", "UK government's response to tsunami has been praised but criticised by UK business.", "Blair has promised an \"unremittingly New Labour\" election while Brown wants Blair to produce a more centrist plan.", "Blair and Brown were never allies, despite their differences."], "qwen2.5:1.5b": ["A donor who previously gave £50, 000 to Labour has stated he will not donate further funds due to concerns over Cabinet disunity and international issues such as Iraq and the tsunami disaster response.", "Tony Blair is described as a \"great chancellor\" but criticized for potentially disrupting economic stability with petty squabbles."], "qwen2.5:3b": ["Donor Duncan Bannatyne has criticized Tony Blair and Gordon Brown over Cabinet disunity and Iraq response, announcing he will likely refuse further donations to Labour.", "He praised Brown's economic stability but criticized the government's handling of the Asian tsunami crisis.", "At 52, Bannatyne previously donated £50,000 to Labour and is set to host a new TV program.", "Despite these criticisms, Bannatyne maintains his support for Labour as a supporter and not funding the Conservatives.", "Former Foreign Secretary Robin Cook supported Brown's potential premiership but argued recent squabbles did not affect public perception of government competence."], "opencoder:1.5b": ["The text provided is quite long and comprehensive; it contains numerous details about the events and people that led to the feud between Tony Blair and Gordon Brown.", "The key idea behind this text is summarized as: \"A donor attack on a government initiative\".", "While there are multiple threads of information included in this summary, it's noteworthy to mention that the focus here was more on the narrative rather than any specific details about the exact actions of the people or organizations involved."], "smollm:1.7b": ["The reported feud between Tony Blair and Gordon Brown has prompted a Labour donor to say he will almost certainly refuse to give more funds.", "The broadside came as ex-Foreign Secretary Robin Cook said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne also attacked the government over Iraq and its \"poor\" response to the Asian tsunami crisis.", "His broadside came as ex-Foreign Secretary Duncan Bannatyne said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The 52-year-old on Tuesday said was he reviewing his donations because of Cabinet disunity and international issues.", "His spokesman said it was highly unlikely he would give Labour more money, although he would remain a supporter and not fund the Conservatives.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The 52-year-old on Tuesday said was he reviewing his donations because of Cabinet disunity and international issues.", "His spokesman said it was highly unlikely he would give Labour more money, although he would remain a supporter and not fund the Conservatives.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The reported feud between Tony Blair and Gordon Brown has prompted a Labour donor to say he will almost certainly refuse to give more funds.", "The broadside came as ex-Foreign Secretary Robin Cook said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne also attacked the government over Iraq and its \"poor\" response to the Asian tsunami crisis.", "His broadside came as ex-Foreign Secretary Duncan Bannatyne said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The 52-year-old on Tuesday said was he reviewing his donations because of Cabinet disunity and international issues.", "His spokesman said it was highly unlikely he would give Labour more money, although he would remain a supporter and not fund the Conservatives.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The 52-year-old on Tuesday said was he reviewing his donations because of Cabinet disunity and international issues.", "His spokesman said it was highly unlikely he would give Labour more money, although he would remain a supporter and not fund the Conservatives.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The reported feud between Tony Blair and Gordon Brown has prompted a Labour donor to say he will almost certainly refuse to give more funds.", "The broadside came as ex-Foreign Secretary Duncan Bannatyne said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne also attacked the government over Iraq and its \"poor\" response to the Asian tsunami crisis.", "His broadside came as ex-Foreign Secretary Robin Cook said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The 52-year-old on Tuesday said was he reviewing his donations because of Cabinet disunity and international issues.", "His spokesman said it was highly unlikely he would give Labour more money, although he would remain a supporter and not fund the Conservatives.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The reported feud between Tony Blair and Gordon Brown has prompted a Labour donor to say he will almost certainly refuse to give more funds.", "The broadside came as ex-Foreign Secretary Duncan Bannatyne said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne also attacked the government over Iraq and its \"poor\" response to the Asian tsunami crisis.", "His broadside came as ex-Foreign Secretary Robin Cook said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The 52-year-old on Tuesday said was he reviewing his donations because of Cabinet disunity and international issues.", "His spokesman said it was highly unlikely he would give Labour more money, although he would remain a supporter and not fund the Conservatives.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The reported feud between Tony Blair and Gordon Brown has prompted a Labour donor to say he will almost certainly refuse to give more funds.", "The broadside came as ex-Foreign Secretary Duncan Bannatyne said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne also attacked the government over Iraq and its \"poor\" response to the Asian tsunami crisis.", "His broadside came as ex-Foreign Secretary Robin Cook said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The 52-year-old on Tuesday said was he reviewing his donations because of Cabinet disunity and international issues.", "His spokesman said it was highly unlikely he would give Labour more money, although he would remain a supporter and not fund the Conservatives.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The reported feud between Tony Blair and Gordon Brown has prompted a Labour donor to say he will almost certainly refuse to give more funds.", "The broadside came as ex-Foreign Secretary Duncan Bannatyne said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne also attacked the government over Iraq and its \"poor\" response to the Asian tsunami crisis.", "His broadside came as ex-Foreign Secretary Robin Cook said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The 52-year-old on Tuesday said was he reviewing his donations because of Cabinet disunity and international issues.", "His spokesman said it was highly unlikely he would give Labour more money, although he would remain a supporter and not fund the Conservatives.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs.", "The reported feud between Tony Blair and Gordon Brown has prompted a Labour donor to say he will almost certainly refuse to give more funds.", "The broadside came as ex-Foreign Secretary Duncan Bannatyne said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne also attacked the government over Iraq and its \"poor\" response to the Asian tsunami crisis.", "His broadside came as ex-Foreign Secretary Robin Cook said he hoped Mr Brown would be premier at some point.", "Mr Bannatyne has previously given Labour £50,000.", "He made his fortune from care homes and health clubs."], "deepseek-r1:1.5b": ["The Labour donor refutes a claim by Blair-Brown over their feud, stating he will refuse more funds.", "Duncan Bannatyne, involved in Iraq and the tsunami crisis, has built his fortune in care homes and health clubs but remains a Labour supporter.", "Robin Cook supports Blair's prime ministerial ambitions but isn't perceived as causing voters' issues, offering Labour support through election prospects.", "He also mentions the Abstentions Party as a key challenge to Labour.", "Dave Prentis wants a leader replacement for Labour."], "tinyllama:1.1b": ["The reported feud between Tony Blair and Gordon Brown has prompted a donor from one of their respective supporters to attack the government over their \"poor\" response to the Asian tsunami crisis.", "The ex-Foreign Secretary Robin Cook has also given his support for Mr Brown's potential leadership, arguing that there is no alternative to Labour but a group of protesting voters known as the Abstenction Party.", "In response to this criticism, the businessman Duncan Bannatyne has reportedly said he will consider giving more money to Labour if the party can demonstrate some improvement in its policy on foreign aid and international affairs.", "The businessman also warned that there is \"no impression\" of governmental incompetence among voters, while expressing his support for Mr Brown's leadership despite criticisms from Mr Cook."], "tinydolphin:1.1b": [" The text describes an interview with Duncan Bannatyne, a businessman who has given considerable funds to the Conservatives.", "He is reviewing his donations due to disagreements between Tony Blair and Gordon Brown over Iraq and the Asian tsunami crisis.", "In response, Bannatyne criticizes both leaders for their perceived inability to address these issues effectively.", "He believes that Britain should prioritize aid to Iraq and not engage in war-like behavior.", "He also expresses disappointment with the current government's performance, suggesting it has become corrupt due to the ongoing feud between Blair and Brown.", "Bannatyne is quoted as saying, \"The UK government's response to the tsunami was piecemeal and poor.", "They needed practical help not just pledges of money.\"", "He also criticizes the Conservatives for being too focused on winning power in the upcoming election rather than focusing on long-term issues like addressing Iraq's problems."], "phi:2.7b": [" A wealthy donor has announced that he will not give more funds to Labour due to the political feud between Tony Blair and Gordon Brown.", "The feud has also prompted speculation about the prime minister's possible resignation in future elections.", "The former Foreign Secretary Robin Cook expressed his support for Mr Brown, but warned of a potential threat from a new party called the Abstentions Party.", "Meanwhile, another wealthy donor, Duncan Bannatyne, attacked the government over its response to the Asian tsunami and Iraq.", "He said that Cabinet disunity is harming the country, and that he will review his donations unless Mr Brown resigns as Prime Minister."], "orca-mini:3b": [" Donor attacks Blair-Brown feud and calls for more unity in Cabinet"], "hermes3:3b": ["Labour donor Duncan Bannatyne unlikely to donate more after Tony Blair-Gordon Brown feud; criticises Cabinet disunity and UK government response to Iraq tsunami."], "stablelm-zephyr:3b": ["A Labour donor, Duncan Bannatyne, has said he will likely refuse donating more funds to the party due to the reported feud between Tony Blair and Gordon Brown.", "Bannatyne criticized the government's responses to Iraq and the tsunami crisis, saying disunity in the Cabinet has a corrosive effect on the country.", "He expressed concern over ongoing violence in Iraq and criticized the UK government's response to the tsunami as \"piecemeal and poor.\"", "Bannatyne, who previously donated £50,000, said he is reviewing his donations due to Cabinet disunity and international issues but will remain a supporter and not fund the Conservatives."], "chatgpt-4o-latest": ["Labour donor Duncan Bannatyne criticized the reported feud between Tony Blair and Gordon Brown, stating it was causing Cabinet disunity and affecting the country.", "He announced he was unlikely to donate more to Labour, citing concerns over Iraq and the government's inadequate response to the Asian tsunami.", "Bannatyne praised Brown's economic leadership but warned against internal conflicts.", "His remarks coincided with speculation from Robert Peston's book that Blair had broken a promise to step down.", "Meanwhile, former Foreign Secretary Robin Cook supported Brown's future leadership but downplayed the Blair-Brown tensions, arguing that voter abstention was Labour's real challenge.", "Unison leader Dave Prentis also called for a timeline for Blair's replacement."], "stablelm2:1.6b": ["A donor will refuse to give more funds to Labour due to disunity in the Cabinet and international issues.", "Duncan Bannatyne, who previously donated to Labour, criticized Brown's leadership over Iraq response and urged for unity among leaders.", "He also voiced concern about ongoing violence in Iraq and called UK government's response to the tsunami \"piecemeal and poor.\"", "Former Foreign Secretary Robin Cook supported Gordon Brown's potential role as premier but did not perceive issues as a problem for voters."], "granite3.1-dense:2b": ["Duncan Bannatyne, a prominent Labour donor who previously gave £50,000 and made his fortune from care homes and health clubs, has stated he will likely cease further contributions due to perceived Cabinet disunity and international issues.", "Bannatyne criticized the Blair-Brown feud, Iraq's conflict, and the UK's response to the Asian tsunami as insufficiently helpful.", "He expressed concern that petty political squabbles were detrimental to national stability.", "Despite his remarks, Bannatyne maintains support for Labour and will not fund the Conservatives.", "In contrast, former Foreign Secretary Robin Cook endorsed Gordon Brown's potential prime ministerial aspirations but emphasized that a Labour victory was essential.", "Cook suggested recent Blair-Brown disputes were not perceived as governmental incompetence by voters, attributing media attention to the lack of an alternative opposition.", "He warned that the \"Abstentions Party\" posed a significant challenge to Labour and would not be influenced by Blair's pledge for a New Labour manifesto."]}