{"raw_text": "Amnesty chief laments war failure\n \n The lack of public outrage about the war on terror is a powerful indictment of the failure of human rights groups, Amnesty International's chief has said.\n \n In a lecture at the London School of Economics, Irene Khan said human rights had been flouted in the name of security since 11 September, 2001. She said the human rights movement had to use simpler language both to prevent scepticism and spread a moral message. And it had to fight poverty, not just focus on political rights for elites.\n \n Ms Khan highlighted detentions without trial, including those at the US camp at Guantanamo Bay in Cuba, and the abuse of prisoners as evidence of increasing human rights problems. \"What's a new challenge is the way in which this age-old debate on security and human rights has been translated into the language of war,\" she said. \"By using the language of war, human rights are being sidelined because we know human rights do not apply in times of war.\" Ms Khan said such breaches were infectious and were now seen in almost very major country in the world. \"The human rights movement faces a crisis of faith in the value of human rights,\" she said. That was accompanied by a crisis of governance, where the United Nations system did not seem able to hold countries to account.\n \n The Amnesty secretary-general said a growing gap between the perceived influence of human rights group and what they could actually achieve was fuelling scepticism. \"Public passivity on the war against terror is the single most powerful indictment on the failures of human rights groups,\" she said. Ms Khan said the movement had failed to mobilise public outrage about what was happening to the human rights system. There needed to be a drive to use simpler language, talking about the basic morality of the issues rather than the complexity of legal processes. Such efforts could make the issues more relevant to people across the world, she said.\n \n The human rights groups also had to recognise there were new groups which had to be tackled in new ways as power dripped away from state governments. Al-Qaeda, for example, was not going to be impressed by a traditional Amnesty letter writing campaign. More also needed to be done to develop a human rights framework for international business corporations. Amnesty International members voted in 2001 to extend the organisation's work from political and civil rights to cover social and economic rights too. Ms Khan said the human rights movement would make itself irrelevant if it turned away from the suffering caused by economic strife. \"We would be an elitist bunch working for the elites, for those who cannot read the newspaper of their choice rather than those who cannot read,\" she said. Despite her concerns, Ms Khan dubbed herself a \"hope-monger\", saying she was confident the passions of the human rights movement could overcome the new challenges.\n", "llama3.2:1b": ["Amnesty chief Irene Khan criticized the lack of public outrage about the war on terror and the failure of human rights groups to use simpler language to prevent scepticism, while also highlighting abuses such as detentions without trial and prisoner abuse.", "Khan emphasized that human rights were being sidelined by using the language of war and that the movement faced a crisis of faith in the value of human rights.", "She noted that public passivity on the war against terror was the single most powerful indictment of the failures of human rights groups.", "The Amnesty secretary-general highlighted the need for a more direct approach, using basic morality to describe issues rather than complex legal processes, and for efforts to develop a human rights framework for international business corporations.", "Khan also acknowledged that the movement needed to tackle new challenges such as power struggles in state governments and corporate interests.", "Despite her concerns, she referred to herself as a \"hope-monger\", confident that the passions of the human rights movement could overcome these challenges."], "llama3.2:3b": ["Human rights groups, including Amnesty International, have failed to mobilize public outrage about human rights abuses in the name of security since 9/11, with Irene Khan stating that the lack of reaction is a powerful indictment of their failure."], "gemma2:2b": ["Human rights groups face a crisis of faith and effectiveness in the wake of the war on terror.", "Amnesty International chief Irene Khan argues that the failure to mobilize public outrage against human rights abuses is a key factor in their diminished influence.", "She calls for a simpler message, focusing on basic morality rather than legal complexities, and for addressing new challenges like economic strife and international corporate responsibility.", "Khan believes progress can still be made but emphasizes the need for urgent action."], "qwen2.5:0.5b": ["Amnesty International chief Irene Khan warns that the war on terror has been used to ignore human rights issues and fail to mobilize public outrage about what's happening to the human rights system, while human rights groups need to use simpler language, focus on basic morality rather than legal processes.", "The movement has failed to make itself relevant if it turns away from economic strife."], "qwen2.5:1.5b": ["Amnesty International's chief calls for stronger language to combat skepticism about human rights during times of war and emphasizes that addressing issues such as poverty and economic inequality alongside political rights is essential, while also acknowledging a growing gap between perceived influence and actual achievements in the human rights field."], "qwen2.5:3b": ["Amnesty International's chief, Irene Khan, laments the failure of the war on terror to spark public outrage and criticizes the dominance of security language over human rights discourse since 9/11.", "She highlights issues like indefinite detention at Guantanamo Bay and prisoner abuse as evidence of rising human rights problems.", "Khan advocates for a simpler, more accessible approach to communicate human rights messages globally, including addressing poverty alongside political rights.", "She also emphasizes the need for the movement to tackle new groups such as Al-Qaeda in innovative ways and develop a framework for international business corporations.", "Despite these challenges, she remains optimistic about the ability of the human rights movement to mobilize public support and address economic issues that affect broader populations."], "opencoder:1.5b": ["Amnesty International chief laments the failure of human rights groups\n\nThe lack of public outrage about the war on terror is a powerful indictment of the failure of human rights groups.", "In a lecture at the London School of Economics, Irene Khan highlighted detentions without trial, including those at the US camp in Guantanamo Bay in Cuba, and the abuse of prisoners as evidence of increasing human rights problems.", "The human rights movement faced a crisis of faith in the value of human rights and governance issues.", "Public passivity on the war against terror was the single most powerful indictment on the failures of human rights groups.", "The human rights movement therefore needed to face new challenges, particularly those related to the complexities of legal processes."], "smollm:1.7b": ["The lack of public outrage about the war on terror is a powerful indictment of the failure of human rights groups, Amnesty International's chief has said.", "In a lecture at the London School of Economics, Irene Khan said human rights had been flouted in the name of security since 11 September, 2001.", "She said the human rights movement had to use simpler language both to prevent scepticism and spread a moral message.", "And it had to fight poverty, not just focus on political rights for elites.", "Ms Khan highlighted detentions without trial, including those at the US camp at Guantanamo Bay in Cuba, and the abuse of prisoners as evidence of increasing human rights problems.", "\"What's a new challenge is the way in which this age-old debate on security and human rights has been translated into the language of war,\" she said.", "By using the language of war, human rights are being sidelined because we know human rights do not apply in times of war.", "Ms Khan said such breaches were infectious and were now seen in almost every major country in the world.", "\"The human rights movement faces a crisis of faith in the value of human rights,\" she said.", "That was accompanied by a crisis of governance, where the United Nations system did not seem able to hold countries to account.", "The Amnesty secretary-general said a growing gap between the perceived influence of human rights group and what they could actually achieve was fuelling scepticism.", "Ms Khan said the movement had failed to mobilise public outrage about what was happening to the human rights system.", "There needed to be a drive to use simpler language, talking about the basic morality of the issues rather than the complexity of legal processes.", "Such efforts could make the issues more relevant to people across the world, she said.", "Ms Khan said the human rights groups also had to recognize there were new groups which had to be tackled in new ways as power dripped away from state governments.", "Al-Qaeda, for example, was not going to be impressed by a traditional Amnesty letter writing campaign.", "More also needed to be done to develop a human rights framework for international business corporations.", "Amnesty International members voted in 2001 to extend the organisation's work from political and civil rights to cover social and economic rights too.", "Ms Khan said the human rights movement would make itself irrelevant if it turned away from the suffering caused by economic strife.", "Ms Khan dubbed herself a \"hope-monger\", saying she was confident the passions of the human rights movement could overcome the new challenges.", "Despite her concerns, Ms Khan touted the human rights movement as a powerful force for change and said it would continue to work towards its goals despite the setbacks."], "deepseek-r1:1.5b": ["Lira criticized the human rights group for failing to capture public outrage over the war on terror, suggesting their failures stem from insufficient public engagement.", "In her London School of Economics lecture, Irene Khan argued against using war tactics in human rights and advocating for simpler, moral language instead of legal processes.", "She highlighted detentions without trial as examples of increasing human rights problems.", "The group needed to move away from political rights focus towards basic morality.", "Additionally, international business corporations should have a human rights framework, while addressing economic issues beyond human rights is crucial.", "Khan emphasized her role as a hope-monger but criticized current leaders for failing to address new challenges."], "tinyllama:1.1b": ["In a lecture at the London School of Economics, Amnesty International's chief Irène Khan emphasized the failure of human rights groups in their efforts to prevent scape-goating about the war on terror and spread a moral message by using simpler language.", "She argued that the movement has failed to mobilize public outrage about what is happening to human rights systems and called for it to use simpler languaire to address new issues such as Al-Qaeda's disregard for international business corporations and their right to social and economic rights.", "While acknowledging the importance of tackling power drift from state government, she argued that such efforts needed to be developed in new ways by recognizing the need to develop a human rights framework for international business corporations and addressing suffering caused by economic strain.", "Khan's concern for the movement's relevance and her belief in its ability to overcome challenges highlights the urgency of implementing concrete measures to ensure that human rights groups continue to make an impact beyond their traditional domains."], "tinydolphin:1.1b": [" The Amnesty International chief, Irene Khan, has expressed concern about the lack of public outrage against global terrorism and the failure of human rights groups to make a more significant impact in addressing the issue.", "Ms Khan believes that the human rights movement needs to use simpler language to avoid scepticism and to spread a moral message.", "She also suggests focusing on issues such as poverty and the need for international business corporations to adhere to social and economic rights, as these areas are causing suffering around the world.", "Despite her concerns, Ms Khan remains hopeful that with the right approach, human rights movements can overcome the challenges they face in promoting their values."], "phi:2.7b": [" Amnesty International's chief has criticized the lack of public outrage about the war on terror as an indictment of human rights groups' failure to use simpler language and fight poverty in addition to political rights for elites.", "She highlighted violations such as detentions without trial and abuses of prisoners, noting that these breaches were becoming more common in many countries.", "Ms Khan argued that a growing gap between the perceived influence of human rights organizations and their achievements had fueled skepticism.", "She called on the movement to be more relevant by using simpler language and addressing issues like economic strife caused by power shifting away from governments."], "orca-mini:3b": [" Amnesty International's chief has criticized the failure of human rights groups to prevent the war on terror, blaming public passivity and a lack of simple language to communicate the moral message.", "Irene Khan said the movement needed to fight poverty rather than just focus on political rights for elites.", "She added that the UN system was failing to hold countries accountable, leading to growing skepticism about human rights groups' influence."], "hermes3:3b": ["Amnesty chief criticizes lack of public outrage over war on terror's human rights violations.", "Khan argues for simpler language, addressing poverty and security debate rather than focusing only on political rights for elites."], "stablelm-zephyr:3b": ["Amnesty International's chief, Irene Khan, has criticized the lack of public outrage about the war on terror and called for simpler language to spread moral messages and prevent skepticism.", "She highlighted issues like detentions without trial and human rights being sidelined in times of war as major challenges facing the human rights movement.", "Ms. Khan also mentioned a crisis of governance where international organizations couldn't hold countries accountable.", "She suggested that the movement needs to focus on using simpler language, talking about basic morality rather than legal processes, and addressing economic strife to make issues more relevant to people worldwide.", "Despite her concerns, she expressed hope that the human rights movement can overcome these challenges."], "chatgpt-4o-latest": ["Amnesty International chief Irene Khan criticized the failure of human rights groups to generate public outrage over the war on terror, calling it a major indictment of their effectiveness.", "Speaking at the London School of Economics, she argued that human rights had been undermined in the name of security since 9/11, with detentions without trial and prisoner abuse becoming widespread.", "She warned that framing security issues as war had sidelined human rights, leading to a global crisis of faith in their value and a failure of governance at the UN level.", "Khan urged human rights groups to use simpler language to engage the public and address economic and social rights, not just political freedoms.", "She emphasized the need to adapt strategies to new power structures, including non-state actors like Al-Qaeda and multinational corporations.", "Despite these challenges, she remained hopeful that the movement could overcome them through renewed passion and relevance."], "stablelm2:1.6b": ["Amnesty International's chief, Irene Khan, criticized the lack of public outrage regarding the war on terror and the failure of human rights groups.", "She argued that human rights have been ignored in favor of security since 9/11 and that the human rights movement needs to use simpler language to prevent skepticism and spread a moral message.", "Khan highlighted detentions without trial and prisoner abuse as evidence of increasing human rights problems, particularly since the war debate has been translated into the language of war.", "She said such breaches are now seen in almost every major country worldwide.", "The crisis of governance, where the United Nations system does not hold countries accountable, adds to the movement's challenges.", "Public passivity on the war against terror is the most powerful indictment of human rights group failures.", "Despite concerns about turning away from the suffering caused by economic strife, Khan remains optimistic that the passions of the human rights movement can overcome these new challenges."], "granite3.1-dense:2b": ["Amnesty International's chief, Irene Khan, lamented the lack of public outcry regarding human rights abuses linked to the war on terror as a sign of the organization's failure.", "In a lecture at the London School of Economics, she emphasized that since 9/11, human rights have been disregarded in the name of security, citing examples like Guantanamo Bay detentions and prisoner abuse.", "Khan highlighted the need for the human rights movement to simplify its language to avoid skepticism and convey moral messages more effectively.", "She also stressed the importance of addressing poverty alongside political rights and tackling new adversaries like Al-Qaeda, which cannot be swayed by traditional methods.", "Khan identified a crisis of faith in human rights' value and governance, with the United Nations system failing to hold countries accountable.", "She noted that public passivity on the war against terror is a powerful critique of her organization's failures.", "To bridge this gap, Khan proposed simplifying language to focus on basic morality and relevance to global audiences, while also addressing economic strife and developing a human rights framework for international corporations.", "Despite these challenges, she expressed confidence in the movement's capacity to overcome new obstacles."]}