{"raw_text": "New UKIP defection to 'Veritas'\n \n The UK Independence Party has lost one of its two London Assembly members to Robert Kilroy-Silk's new political party, expected to launch on Wednesday.\n \n Damian Hockney said ex-chatshow host Mr Kilroy-Silk would \"deliver better\" as the leader of a eurosceptic party. He said Mr Kilroy-Silk had made him deputy party leader of Veritas, Latin for truth. Sources close to Mr Hockney said around eight other members of London UKIP were also planning to jump ship.\n \n Details of the coming week's events were hammered out at a meeting at Mr Kilroy-Silk's Buckinghamshire home on Sunday, the BBC News Website was told. The news came after UKIP suspended a candidate for allegedly suggesting the criminally insane should be killed. John Houston, 54, was due to stand in the East Kilbride seat in Lanarkshire at the next election. A spokesman for UKIP called on Mr Hockney to quit the London Assembly. UKIP asserts that Mr Hockney \"has a moral obligation, if not a legal one\" to stand down. Mr Hockney meanwhile told the BBC: \"I believe that Robert Kilroy-Silk can deliver better as a leader of a eurosceptic party than the current leadership of the UK Independence Party.\"\n \n On the suspension of Mr Houston, UKIP said those who selected him knew nothing of his views. Mr Houston is alleged to have said that the organs of the criminally insane should be \"made available to law-abiding members of the community\" and proposed the legalisation of drugs and the sex trade.\n \n The document reportedly said: \"We're looking for the resurrection of the British Empire. \"The problems for the human race - environmental and others - can only be dealt with on a global scale, and that calls for a radical alliance of the English-speaking nations, which they are uniquely able to do.\" UKIP spokesman Mark Croucher said the main issue would be that Mr Houston's reported views had been presented as UKIP policy, which they were not.\n", "llama3.2:1b": ["New UKIP defector Robert Kilroy-Silk's party, Veritas, is expected to launch on Wednesday.", "Damian Hockney has joined Veritas and said it will deliver better than the current UK Independence Party leadership.", "Eight other London UKIP members are also planning to leave.", "UKIP suspended a candidate for allegedly suggesting the criminally insane should be killed, which led to John Houston's suspension from the party."], "llama3.2:3b": ["UKIP has lost London Assembly member Damian Hockney to Robert Kilroy-Silk's new party Veritas.", "Around eight other members plan to leave UKIP due to a row over candidate John Houston, who was suspended after making controversial comments about the criminally insane and drugs."], "gemma2:2b": ["Damian Hockney, a UKIP London Assembly member, has defected to Robert Kilroy-Silk's new political party, Veritas.", "Around eight other UKIP members are also planning to join.", "This follows UKIP suspending a candidate for allegedly suggesting the criminally insane should be killed and endorsing extreme views on drugs and the sex trade.", "The party denies any connection between Mr Houston's views and UKIP policy."], "qwen2.5:0.5b": ["UK Independence Party (UKIP) defection to Veritas party expected after defections by London Assembly member and ex-chatshow host Robert Kilroy-Silk.", "Details of upcoming week’s events will be hammered out in a meeting at Mr Kilroy-Silk's Buckinghamshire home on Sunday, BBC News Website reported.", "UKIP suspended John Houston from the East Kilbride seat as he stood in for UK Independence Party candidate.", "UKIP accuses Kilroy-Silk of delivering \"better\" and claims Kilroy-Silk can't be trusted to stand down as leader."], "qwen2.5:1.5b": ["The UK Independence Party has lost its London Assembly member to Robert Kilroy-Silk's new Veritas party, set to launch on Wednesday.", "The party leader promises better leadership compared to current UKIP.", "Around eight other London UKIP members plan to leave.", "Details of the coming events are being hammered out at Kilroy-Silk's home.", "UKIP has suspended a candidate due to suggesting criminally insane individuals should be killed and presented as UKIP policy, accusing them of knowing nothing about Houston's views."], "qwen2.5:3b": ["UK Independence Party has lost one of its two London Assembly members, Damian Hockney, to Robert Kilroy-Silk’s new eurosceptic party, Veritas.", "Hockney is expected to become deputy leader and around eight other UKIP members are planning defections.", "The impending launch by Veritas is being discussed at a meeting in Kilroy-Silk's Buckinghamshire home.", "Hockney argues that Kilroy-Silk would be better suited as leader than current UKIP leaders, despite UKIP suspending Houston for suggesting the criminally insane should have their organs made available to law-abiding citizens and legalizing drugs and sex trade.", "The party emphasizes its goal of reviving the British Empire on a global scale through alliances with English-speaking nations."], "opencoder:1.5b": ["The UK Independence Party has lost one of its London Assembly members to Robert Kilroy-Silk's new political party, expected to launch on Wednesday.", "Damian Hockney said Mr Kilroy-Silk would \"deliver better\" as the leader of a eurosceptic party.", "Sources close to Mr Hockney say around eight other members of London UKIP were also planning to jump ship.", "The coming week's events were hammered out at a meeting at Mr Kilroy-Silk's Buckinghamshire home on Sunday.", "The news came after UKIP suspended a candidate for allegedly suggesting the criminally insane should be killed, who was due to stand in the East Kilbride seat in Lanarkshire at the next election.", "A spokesman for UKIP called on Mr Hockney to quit the London Assembly.", "On the suspension of Mr Houston, UKIP said those who selected him knew nothing of his views.", "Mr Houston is alleged to have said that the organs of the criminally insane should be \"made available to law-abiding members of the community\" and proposed the legalisation of drugs and the sex trade.", "The document reportedly said: \"We're looking for the resurrection of the British Empire.", "The problems for the human race - environmental and others - can only be dealt with on a global scale, and that calls for a radical alliance of the English-speaking nations, which they are uniquely able to do.\"", "UKIP spokesman Mark Croucher said the main issue would be that Mr Hockney's reported views had been presented as UKIP policy, which they were not."], "smollm:1.7b": ["The summary is concise and preserves key ideas and details:\n\n1.", "The UK Independence Party has lost one of its two London Assembly members to Robert Kilroy-Silk's new political party, expected to launch on Wednesday.", "2.", "Damian Hockney said ex-chatshow host Mr Kilroy-Silk would \"deliver better\" as the leader of a eurosceptic party.", "3.", "The UKIP has suspended around eight other members of London UKIP from standing in the East Kilbride seat at the next election, due to alleged suggestions that they have made statements supporting the criminally insane.", "4.", "A spokesman for UKIP told on Sunday that Mr Hockney would quit the London Assembly if he were to stand as a candidate.", "5.", "The document reportedly said: \"We're looking for the resurrection of the British Empire.\"", "6.", "The main issue will be that Mr Hockney's reported views had been presented as UKIP policy, which they are not.", "7.", "UKIP has suspended Mr Hockney from his position as a member of London UKIP due to alleged suggestions that he has made statements supporting the criminally insane."], "deepseek-r1:1.5b": ["The UK Independence Party has lost one of its two London Assembly members to Robert Kilroy-Silk, who will join Veritas.", "Sources close to Damian Hockney said he would take him up as deputy party leader, with others also leaving.", "The document mentions John Houston's accusations for suggesting criminals should be killed and promoting drugs and sex trade.", "UKIP called out Houston's views and stated that their global solutions for environmental issues could require a radical alliance of English-speaking nations."], "tinyllama:1.1b": ["UK Independence Party lost one of its two London Assembly members to Robert Kilroy-Silk's new political party, expected to launch on Wednesday.", "Damian Hockney said that Mr Kilroy-Silk had made him deputy party leader of Veritas, Latin for \"truth,\" and planned for a \"radical allliance\" with other English-speaking nations.", "The meeting discussing the UKIP suspension of a candidate for allegedly suggesting the criminally insane should be killed was attended by UKIP members and officials, and UKIP asserted that Mr Hockney has a moral obligation to stand down.", "In the wake of his suspension, UKIP has seen around eight other members of London UKIP plan to join Veritas, while there are also reports of a \"suspended\" candidate standing in the East Kilbridie seat who is alleged to have suggested the legalisation of drugs and the sex trade."], "tinydolphin:1.1b": [" The UK Independence Party (UKIP) has lost one of its two London Assembly members to a political newcomer named Robert Kilroy-Silk, who will likely launch his party on June 17th.", "This individual is expected to join forces with Robert Kilroy-Silk's Veritas party and provide better leadership than the current UK Independence Party (Ukip) leadership.", "The decision to abandon UKip in favor of a new political entity has been met with excitement among some within the party, but others have expressed concern about the uncertainties surrounding the Veritas party's stability and credibility.", "Some critics argue that Robert Kilroy-Silk may lack the character to lead a true Eurosceptic party, while others fear his affiliations with certain organizations that could be perceived as undermining UKip's image.", "The decision of UKIP to reconsider its stance on joining a new political entity has also led to a flurry of speculation and confusion about the party's future direction.", "Some supporters believe that joining a new party could allow UKip to move away from its more populist roots and focus more on the core issues at hand, such as protecting British citizens from immigration and supporting the British flag.", "The debate surrounding the future direction of UKIP is expected to continue until the launch of Veritas on June 17th."], "phi:2.7b": [" UK Independence Party (UKIP) has lost one of its two London Assembly members to a new political party, Veritas.", "The party is expected to launch on Wednesday and its leader, Robert Kilroy-Silk, has made Damian Hockney his deputy.", "Other UKIP members are also planning to join Veritas, which is a eurosceptic party with Latin for \"truth\" in its name.", "A meeting was held at Kilroy-Silk's home to discuss the coming week's events, and it was reported that one of UKIP's candidates, John Houston, had been suspended for suggesting the criminally insane should be killed.", "The UK Independence Party has called on Mr Hockney to quit as he believes Kilroy-Silk can deliver better as a leader of a eurosceptic party."], "orca-mini:3b": [" Damian Hockney, one of two London Assembly members for the UK Independence Party (UKIP), has defected to Robert Kilroy-Silk's new political party, Veritas.", "Hockney said Kilroy-Silk would \"deliver better\" as the leader of a eurosceptic party, and that around eight other members of UKIP were also planning to leave the party.", "Kilroy-Silk suspended John Houston, who was due to stand in the East Kilbride seat at the next election, over allegations of suggesting the criminally insane should be killed.", "Hockney called on Hockney to resign from his position as deputy party leader of Veritas.", "UKIP has suspended a candidate for allegedly promoting views calling for the legalisation of drugs and the sex trade.", "The suspension came after Houston's reported comments were presented as UKIP policy, which they were not."], "hermes3:3b": ["UKIP London Assembly member Damian Hockney leaves for Veritas party; joins Robert Kilroy-Silk, expected to defect around 8 others."], "stablelm-zephyr:3b": ["A London Assembly member from UKIP, Damian Hockney, has defected to Robert Kilroy-Silk's new political party, Veritas.", "Hockney believes Kilroy-Silk can \"deliver better\" as a leader of a eurosceptic party.", "Sources close to Hockney suggest around eight other members of London UKIP are planning to leave as well.", "This comes after UKIP suspended John Houston, who allegedly suggested the criminally insane should be killed and legalized drugs and sex trade.", "The suspension led UKIP to denounce Houston's views, claiming they were not part of their policy."], "chatgpt-4o-latest": ["UK Independence Party (UKIP) member Damian Hockney has defected to Robert Kilroy-Silk's new eurosceptic party, Veritas, where he has been appointed deputy leader.", "Sources suggest around eight other UKIP members in London may also leave.", "UKIP has called for Hockney to resign from the London Assembly, arguing he has a moral obligation to do so.", "Meanwhile, UKIP has suspended candidate John Houston for allegedly advocating extreme views, including the execution of the criminally insane and the legalisation of drugs and the sex trade.", "UKIP insists Houston's views do not reflect party policy."], "stablelm2:1.6b": ["UK Independence Party member Damian Hockney has defected to Robert Kilroy-Silk's new political party called Veritas.", "Eight other members of London UKIP are also planning to join the new party.", "The move comes after a candidate was suspended for allegedly suggesting that mentally ill people should be killed.", "UKIP claims Hockney has a moral obligation to step down, while he maintains Kilroy-Silk can deliver better as leader of a eurosceptic party."], "granite3.1-dense:2b": ["UK Independence Party (UKIP) has experienced a significant defection, with London Assembly member Damian Hockney joining Robert Kilroy-Silk's newly formed political party, Veritas.", "Around eight other UKIP members in London are also reportedly considering the switch.", "The details of this realignment were discussed at Kilroy-Silk's Buckinghamshire residence on Sunday.", "This development follows UKIP's suspension of candidate John Houston for allegedly advocating the killing of criminally insane individuals, organ harvesting from their bodies, and legalization of drugs and prostitution.", "UKIP has called upon Hockney to resign from the London Assembly due to his perceived moral obligation or potential legal responsibility in this matter.", "Hockney, however, expressed confidence in Kilroy-Silk's ability to lead a eurosceptic party more effectively than the current UKIP leadership.", "The UKIP spokesman emphasized that Houston's alleged views were not part of UKIP's official policy but were mistakenly presented as such during the selection process.", "The document suggests that Veritas aims to revive the British Empire and address global issues, such as environmental concerns, through a radical alliance among English-speaking nations."]}