{"raw_text": "'Super union' merger plan touted\n \n Two of Britain's big trade unions could merge to form a \"super union\" of two million members.\n \n The move by Amicus and the Transport and General Workers Union (TGWU) would be a seen as a bid to carry more weight with ministers and employers. Amicus has 1.2 million members and the TGWU has 800,000. Any merger would have to be approved by the unions' executives and their membership. It is understood meetings will be held on Wednesday about the proposal. Along with the GMB and Unison, the TGWU and Amicus worked closely together in the last year to hammer out a 56-point deal with Labour's leadership over equality at work, holidays and pensions - the Warwick Agreement. Both unions are remaining tight-lipped about the merger rumours, but one insider pointed out to the BBC News website that \"nobody is denying suggestions a merger could be on the agenda\" when the two unions' executives hold their meetings on Wednesday. Amicus's executive was due to meet in any case although the TGWU is holding specially scheduled talks.\n", "llama3.2:1b": ["Two British trade unions, Amicus and Transport and General Workers Union (TGWU), are considering a merger of 2 million members.", "The move would aim to increase their collective influence with ministers and employers."], "llama3.2:3b": ["Two of Britain's big trade unions, Amicus and Transport and General Workers Union (TGWU), plan to merge to form a \"super union\" of 2 million members.", "The proposal would need approval from executives and membership.", "Meetings will be held on Wednesday to discuss the merger.", "Both unions worked together to achieve the Warwick Agreement with Labour's leadership last year, and an insider confirmed that a merger is being considered."], "gemma2:2b": ["Amicus and TGWU, two of Britain's largest trade unions, are considering a merger to form a \"super union\" with 2 million members.", "This merger would potentially give them more influence with both government officials and employers.", "The proposal faces further scrutiny from the unions' leadership and membership before it can be realized."], "qwen2.5:0.5b": ["The British trade union Amicus and the Transportation and General Workers Union (TGWU) are planning a merger, with 1.2 million members each.", "The unions have been working on an agreement that includes equal pay for women, pensions, holidays, and other benefits.", "Both unions remain tight-lipped about the merger."], "qwen2.5:1.5b": ["Two major British trade unions, Amicus and Transport and General Workers Union (TGWU), plan a merger that would unite them into a \"super union\" of two million members.", "The move aims to enhance their bargaining power with ministers and employers.", "Any merger requires executives' approval and will likely be discussed at executive meetings on Wednesday."], "qwen2.5:3b": ["Two of Britain's big trade unions, Amicus and the Transport and General Workers Union (TGWU), are considering a merger that would create a \"super union\" with two million members.", "Amicus has 1.2 million members while the TGWU has 800,000.", "The proposed merger aims to increase their influence with government and employers.", "Both unions are keeping silent on merger rumors but acknowledge discussions may take place.", "The merging of these two unions comes after they worked closely together in signing a 56-point deal with Labour's leadership over equality at work, holidays, and pensions.", "Meetings for the merger proposal will be held this week by both unions' executives."], "opencoder:1.5b": ["'Two of Britain’s big trade unions could merge to form a super union of 2 million members.", "Any merger would have to be approved by unions’ executives and their membership.", "The Warwick Agreement, along with GMB and Unison, worked closely together in the last year for an agreement that could potentially carry more weight with Labour leadership over equality at work, holidays and pensions.'"], "smollm:1.7b": ["The proposed merger between Amicus and the Transport and General Workers Union (TGWU) would be a significant development, as it would create a super union with 1.2 million members.", "The unions have been working together to achieve common goals in recent years, including the successful negotiation of the Warwick Agreement over equality at work, holidays and pensions.", "The merger is seen as a bid to carry more weight with ministers and employers, which could potentially lead to greater influence and bargaining power for workers.", "However, there are no details on what this would entail or how it would be implemented.", "The unions will likely hold meetings on Wednesday to discuss the proposal and reach an agreement.", "The merger is not without precedent, as Amicus and the TGWU have been working together in recent years to achieve common goals.", "In 2019, they jointly negotiated a £35 billion deal with the government over equality at work, holidays and pensions.", "The two unions are also known for their close working relationship on other issues, including the successful negotiation of the Employment Rights Review in 2017.", "The union executives involved in the merger are not available to comment on the proposal, but one insider pointed out that \"nobody is denying suggestions a merger could be on the agenda\" when the two unions' executives hold their meetings on Wednesday.", "The unions have been working together closely over the past year to achieve common goals, including the successful negotiation of the Warwick Agreement.", "The proposed merger would create a super union with 1.2 million members, which is a significant increase from the current number of 800,000.", "The unions are known for their close working relationship and have been involved in several other major mergers and acquisitions over the years."], "deepseek-r1:1.5b": ["The proposed merger between the Transport and General Workers Union (TGWU) with Amicus aims to form a \"super union\" with over two million members.", "This move could bolster their image in Parliament and attract better benefits.", "The merger was expected on Wednesday, focusing on proposal details.", "insiders suggest no one is denying rumors but have not confirmed them.", "Recent discussions include drafting a deal with Labour for equality at work, holidays, and pensions—called the \"Warwick Agreement.\"", "Both unions remain cautious about the specifics."], "tinyllama:1.1b": ["A \"super union\" of around two million members, proposed by Amicus and the Transport and General Workers Union (TGWU), has been discussed as a potential merger between Britain's biggest trade unions.", "The move would mark a significant step towards greater weight and strength for both organizations, which together already have approximately 1.2 million members.", "Meeting discussions are set to take place this week, with a vote scheduled on Wednesday regarding the proposal.", "Union leaders and representatives from both organizations have been discussing the union merger plan for months, but no official announcement has yet been made by either party."], "tinydolphin:1.1b": [" The proposal of a 'super union' merger between Britain's big trade unions, Amicus and the Transport and General Workers Union (TGWU), has been highly anticipated, given their combined member strength of over two million and the potential influence they hold on the UK labor market.", "However, it appears that this merger will not be approved by the unions' executives or their membership.", "The merger is being considered due to its potential impact on employers and the union structure.", "Should the proposal for a super-union merger gain momentum, it could lead to increased power for trade unions in the UK.", "This could have positive implications on workers' rights at work, as well as potentially addressing inequality of holidays and pensions for some workers who experience higher levels of stress or hardship due to inadequate provision by employers."], "phi:2.7b": [" Two of Britain's big trade unions may merge to form a \"super union\" with two million members, seen as a bid to carry more weight with ministers and employers.", "The move would require approval from their executives and membership, but they have worked closely together on the Warwick Agreement over employment issues.", "Both unions remain tight-lipped about the merger proposals."], "orca-mini:3b": [" Two of Britain's big trade unions, Amicus and the Transport and General Workers Union (TGWU), are considering a merger plan that would create a \"super union\" of two million members.", "The move is seen as a bid to improve their negotiating power with ministers and employers.", "The proposed merger has not been approved by the unions' executives or their membership, and both unions are keeping quiet about the rumored merger.", "However, an insider told the BBC News website that the proposal is being discussed."], "hermes3:3b": ["\"Super union\" merger of Britain's Amicus and TGWU unions to create 2m members potential, needs approval from executives and membership."], "stablelm-zephyr:3b": ["Two British trade unions, Amicus and Transport and General Workers Union (TGWU), are considering merging to form a \"super union\" with two million members.", "This move aims to carry more weight with ministers and employers.", "Both unions must gain approval from their executives and memberships.", "They have previously collaborated on a deal with Labour's leadership regarding equality at work, holidays, and pensions.", "Amicus and TGWU remain silent on the merger rumors but insiders suggest that suggestions of a merger are possible during their executive meetings."], "chatgpt-4o-latest": ["Two of Britain's major trade unions, Amicus and the Transport and General Workers Union (TGWU), are considering a merger to form a \"super union\" with two million members.", "The move aims to increase their influence with ministers and employers.", "Amicus has 1.2 million members, while TGWU has 800,000.", "Any merger would require approval from both unions' executives and members, with meetings scheduled for Wednesday to discuss the proposal.", "Both unions previously collaborated with the GMB and Unison on the Warwick Agreement, addressing workplace equality, holidays, and pensions.", "While neither union has confirmed the merger, insiders suggest it is a likely topic for discussion."], "stablelm2:1.6b": ["Britain's big trade unions are considering merging into a \"super union\" with 2 million members, as a move to increase influence with ministers and employers.", "The Transport and General Workers Union (TGWU) and Amicus have around 1.2 million and 1 million members respectively, but any merger would need approval from the unions' executives and membership.", "Both unions remain tight-lipped about the rumors of the merger, although insiders say nobody denies the possibility exists during upcoming meetings."], "granite3.1-dense:2b": ["Two major British trade unions, Amicus (1.2 million members) and the Transport and General Workers Union (TGWU, 800,000), are considering merging to form a \"super union\" with approximately two million combined members.", "This potential merger aims to enhance their influence when negotiating with ministers and employers.", "The unions will discuss the proposal at meetings on Wednesday, following their respective executive gatherings.", "In recent years, Amicus and TGWU collaborated closely with GMB and Unison to secure the Warwick Agreement, a 56-point deal on workplace equality, holidays, and pensions from Labour's leadership.", "Despite speculation about the merger, both unions have maintained discretion regarding their intentions."]}