{"raw_text": "Tories leave door open for Archer\n \n The Conservative Party would deal \"sympathetically\" with any application by disgraced peer Lord Archer to rejoin its ranks, its co-chairman has said.\n \n Dr Liam Fox told BBC One's Breakfast with Frost programme there was no place for \"vindictiveness\" in politics. Lord Archer spent two years in prison after being convicted of perjury and perverting the course of justice. The former Tory deputy chairman's five-year suspension from the party has just elapsed.\n \n A jury ruled that Lord Archer lied during a libel trial against the Daily Star at the High Court in London in 1987.\n \n He won damages after the newspaper printed allegations about involvement with a prostitute. Dr Fox was asked if he would say yes or no if Lord Archer applied to rejoin. \"I'm sure that in line with people having served their sentence and having done some reparations for what they did wrong, we would look at that sympathetically. \"I don't believe in vindictiveness, I don't think that has any place in politics, unlike the prime minister and Alastair Campbell.\"\n \n Tory peer Lord Tebbit said he agreed with Dr Fox's view, and said the case should be looked at on its merits. \"After all, he is far from being the worst perjurer in the world,\" he added. Meanwhile, senior Conservative MP Sir Teddy Taylor warned that moves bring Lord Archer back into the fold could be controversial. He said: \"I suppose, on a Sunday in particular, we should always make provision for forgiving sinners. But there is no doubt it would be controversial.\" Lord Archer, who was not available for comment, remains a popular figure among constituency Tory parties and is a successful fundraiser. He has not been seen in the House of Lords since his release from prison in July 2003, although there is nothing in the rules to prevent him from attending.\n", "llama3.2:1b": ["Tories will consider Lord Archer's application to rejoin the party despite concerns about vindictiveness; Dr Liam Fox says they would look at it \"sympathetically\".", "Lord Archer was convicted of perjury and has a five-year suspension from the party, which is set to expire soon.", "A jury found him liable for libel against the Daily Star in 1987, resulting in damages."], "llama3.2:3b": ["The Conservative Party's co-chairman Dr Liam Fox said the party would deal \"sympathetically\" with any application by Lord Archer, a former deputy chairman who served two years in prison for perjury and perverting justice, after his five-year suspension has elapsed."], "gemma2:2b": ["The Conservative Party co-chairman Liam Fox stated that Lord Archer could be considered for rejoining the party after serving his sentence and making amends.", "Others, including Lord Tebbit and Sir Teddy Taylor, agree with this stance while acknowledging it might be controversial."], "qwen2.5:0.5b": ["The Conservative Party welcomes Lord Archer's application but emphasizes that \"vindictiveness\" should not be a priority in politics.", "They believe he served two years in prison after being convicted of perjury and are considering his rejoining the party.", "Sir Teddy Taylor, who represents a constituency party, warns that controversial measures might be taken."], "qwen2.5:1.5b": ["Conservative Party sympathetic toward Lord Archer's reapplication for membership; former peer convicted of perjury faces potential reinstatement despite lengthy suspension and sentence."], "qwen2.5:3b": ["The Conservative Party would consider sympathetically any application by Lord Archer to rejoin its ranks, despite his conviction for perjury and perverting the course of justice.", "Co-chairman Dr Liam Fox stated there should be no place for vindictiveness in politics, differing from Prime Minister’s Campbell's view.", "While some agree to reconsider on merits, others suggest it could be controversial given his status as a popular figure among constituency parties and successful fundraiser."], "opencoder:1.5b": ["Tories leave door open for Archer\n\nThe Conservative Party would deal \"sympathetically\" with any application by disgraced peer Lord Archer to rejoin its ranks.", "Dr Liam Fox told BBC One's Breakfast with Frost programme there was no place for \"vindictiveness\" in politics.", "Lord Archer spent two years in prison after being convicted of perjury and perverting the course of justice.", "A jury ruled that Lord Archer lied during a libel trial against the Daily Star at the High Court in London in 1987.", "He won damages after the newspaper printed allegations about involvement with a prostitute."], "smollm:1.7b": ["The Conservative Party would deal sympathetically with any application by disgraced peer Lord Archer to rejoin its ranks, its co-chairman has said.", "The former Tory deputy chairman's five-year suspension from the party has just elapsed.", "A jury ruled that Lord Archer lied during a libel trial against the Daily Star at the High Court in London in 1987.", "He won damages after the newspaper printed allegations about involvement with a prostitute.", "Dr Fox was asked if he would say yes or no if Lord Archer applied to rejoin.", "\"I'm sure that in line with people having served their sentence and having done some reparations for what they did wrong, we would look at that sympathetically,\" he said.", "Meanwhile, senior Conservative MP Sir Teddy Taylor warned that moves bring Lord Archer back into the fold could be controversial.", "He said: \"I suppose, on a Sunday in particular, we should always make provision for forgiving sinners.", "But there is no doubt it would be controversial.\"", "Lord Archer, who was not available for comment, remains a popular figure among constituency Tory parties and is a successful fundraiser.", "He has not been seen in the House of Lords since his release from prison in July 2003, although there is nothing in the rules to prevent him from attending."], "deepseek-r1:1.5b": ["The Conservative Party would address Lord Archer's application, while Dr Liam Fox emphasized the absence of vindictiveness in politics, highlighting his five-year prison sentence and conviction for perjury and perverting the course of justice.", "A jury found he lied in a libel trial against The Daily Star, winning damages after allegations about a prostitute were made.", "Dr Fox suggested not believing in vindictiveness but focusing on accountability, aligning with former Tory deputy chairman Tebbit who agreed with him.", "Lord Archer remains popular among Tory supporters and has been successful as a fundraiser but faces controversy if returned to power."], "tinyllama:1.1b": ["The Conservative Party has ruled out any sympathy for disgraced peer Lord Archer who was cleared of perjury charges after serving two years in prison.", "The co-chairman, Dr Liam Fox, stated that \"sympathetic\" discussions could be held about reintegrating the ex-Tory deputy chairman into party ranks.", "In relation to the case of Lord Archer, a jurist ruled in his favor during a libel trial against the Daily Star in 1987.", "Dr Fox was asked if he would say yes or no, and replied that people serving their sentence for wrongdoing should be considered sympathetically.", "Senior Conservative MP Sir Teddy Taylor warned that any move back into Lord Archer's seat could potentially cause controversy, stating that forgiveness is not something to always \"make provision\" for."], "tinydolphin:1.1b": [" Summary: The Conservative Party appears open to reconsidering its decision on whether to accept Lord Archer into their ranks following allegations of perjury made against him by the Daily Star.", "Dr Liam Fox, co-chairman of the party, believes that there is no place for \"vindictiveness\" in politics and that applying for reconsideration would be a way to make amends for what he perceives as wrongdoing.", "This decision is also seen by some as a symbolic gesture against perjury.", "However, senior Tories like Sir Teddy Taylor warn that such moves might not go down well with the majority of constituents and may be controversial."], "phi:2.7b": [" The Conservative Party's co-chairman said they would deal sympathetically with any application by disgraced peer Lord Archer to rejoin its ranks.", "Dr Liam Fox expressed that there was no place for vindictiveness in politics and a sympathetic approach should be taken towards Lord Archer, who served two years in prison after being convicted of perjury and perverting the course of justice.", "The case against Lord Archer lasted five years and he won damages after allegations were made by Daily Star about his involvement with a prostitute.", "While Dr Fox expressed that they would consider Lord Archer's application on its merits, senior Conservative MP Sir Teddy Taylor warned that it could be controversial."], "orca-mini:3b": [" The Conservative Party would consider applications by Lord Archer to rejoin their ranks but only on a \"sympathetic\" basis, according to Dr Liam Fox.", "The party's co-chairman said there was no place for vindictiveness in politics and he agreed with Lord Tebbit's view that the case should be looked at on its merits.", "However, Sir Teddy Taylor warned that moves to bring Lord Archer back into the fold could be controversial."], "hermes3:3b": ["Tories open door for Archer (rejoining), sympathetically deal with ex-peer's suspension end."], "stablelm-zephyr:3b": ["The Conservative Party's co-chairman, Dr Liam Fox, said they would consider sympathetically any application by Lord Archer, a disgrased peer who spent two years in prison for perjury and lying during a libel trial.", "Lord Archer's suspension from the party has ended, and while some believe his return should be considered on its merits, others worry it could be controversial.", "Lord Archer remains popular among constituency Tory parties and as a successful fundraiser."], "chatgpt-4o-latest": ["The Conservative Party may allow Lord Archer to rejoin after his five-year suspension, with co-chairman Dr Liam Fox stating they would consider his application sympathetically.", "Archer, a former Tory deputy chairman, served two years in prison for perjury and perverting the course of justice.", "Tory peer Lord Tebbit supported Fox’s stance, while senior MP Sir Teddy Taylor warned it could be controversial.", "Archer remains popular among Tory constituency parties and a successful fundraiser but has not attended the House of Lords since his 2003 release."], "stablelm2:1.6b": ["Conservative Party co-chairman Liam Fox said they would deal sympathetically with any application by disgraced peer Lord Archer to rejoin their ranks after serving two years for perjury and other crimes.", "Fox does not believe in vindictiveness, and while moves could be contentious, the party views the situation sympathetically due to Archer's successful fundraising and popularity among constituency Tory parties."], "granite3.1-dense:2b": ["The Conservative Party's co-chairman, Dr Liam Fox, stated that they would consider sympathetically any application from disgraced peer Lord Archer to rejoin the party, emphasizing the importance of avoiding vindictiveness in politics.", "This comes after a five-year suspension for perjury and perverting justice during a libel trial in 1987.", "Fellow Tory peer Lord Tebbit agreed with this stance, suggesting a merit-based evaluation.", "However, senior MP Sir Teddy Taylor warned that reinstating Lord Archer could be highly contentious.", "Despite his conviction and subsequent two-year prison term, Lord Archer remains influential in constituency Tory parties as a successful fundraiser, having last attended the House of Lords in July 2003."]}