{"raw_text": "Howard denies split over ID cards\n \n Michael Howard has denied his shadow cabinet was split over its decision to back controversial Labour plans to introduce ID cards.\n \n The Tory leader said his front bench team had reached a \"collective view\" after holding a \"good discussion\", but admitted it was \"not an easy issue\". He had decided to support the plans as the police said they would help fight terror, crime and illegal immigration. The Lib Dems have pledged to oppose the bill when it is debated next Monday.\n \n Tory sources say senior party figures had argued vociferously against the ID card scheme. Among those reported to have serious reservations over the strategy were senior shadow cabinet members David Davis, Oliver Letwin and Tim Yeo. But Mr Howard denied Mr Yeo, his transport and environment spokesman, said the plans \"stink\". He also said he was confident shadow home secretary Mr Davis would \"set out the position very clearly\" when he stands up to debate the matter next week. Mr Howard said the police had said ID cards could \"help them foil a terror bomb plot in which people could lose their lives\". He added: \"When the police say that you have to take them seriously\".\n \n He acknowledged there were \"good libertarian arguments\" against the cards, but said the shadow Cabinet had weighed up all the \"conflicting interests\" before reaching its decision. \"I don't pretend that it is an easy decision but at the end of the day a decision has to be taken.\" He also denied he was afraid of looking \"soft\" on the issue, compared to Labour. The Conservatives announced their support for the government plans on Monday evening.\n \n Sources within the party told the BBC Mr Howard had always been in favour of ID cards, and tried to introduce them when he was Home Secretary. But the Tories insisted they would hold ministers to account over the precise purpose of the scheme.\n \n They said they would also press Labour over whether objectives could be met and whether the Home Office would be able to deliver them. And they pledged to assess the cost effectiveness of ID cards and whether people's privacy would be properly protected. \"It is important to remember that this bill will take a decade to come into full effect,\" a spokesman said. Lib Dem home affairs spokesman Mark Oaten has branded the ID scheme a waste of money and \"deeply flawed\". He said: \"This has all the signs of Michael Howard overruling colleagues' concerns over ID cards.\"\n \n The chairman of the Bar Council, Guy Mansfield QC warned there was a real risk that people on the \"margins of society\" would be driven into the hands of extremists. \"What is going to happen to young Asian men when there has been a bomb gone off somewhere? They are going to be stopped. If they haven't [ID cards] they are going to be detained.\" Tory ex-minister Douglas Hogg said he opposed the plans for ID cards branding them a \"regressive\" step which would intrude into the lives of ordinary citizens without any counterbalancing benefits. He predicted ultimately carrying the cards would become compulsory and that would lead to large numbers of Britain's ethnic minorities being stopped by police.\n", "llama3.2:1b": ["Howard denies split within his shadow cabinet over ID card plans, saying it was a collective view reached after discussions.", "Tory sources had argued against the plan, but Howard said they \"weighed up all the conflicting interests\".", "He has always supported ID cards and tried to introduce them when he was Home Secretary, but insists the party will hold ministers accountable for their precise purpose."], "llama3.2:3b": ["Michael Howard denied his shadow cabinet was split over ID card plans, saying they reached a collective view after discussion.", "Senior Tories David Davis, Oliver Letwin, and Tim Yeo reportedly opposed the scheme, but Howard said he was confident Davis would set out the position clearly next week.", "The Conservative party supports the Labour plan, with concerns raised about privacy and cost effectiveness."], "gemma2:2b": ["Michael Howard denies that his shadow cabinet was split over supporting Labour's ID card plans.", "He states that his front bench team reached a \"collective view\" after discussing the issue, ultimately deciding to support the plan as it could help fight terror and crime.", "While some senior party figures opposed the scheme, including David Davis, Howard maintains confidence in their shadow home secretary's clear stance on the matter.", "Opposition is expected from the Liberal Democrats, who will oppose the bill when debated next week."], "qwen2.5:0.5b": ["Howard denies the shadow cabinet was splitting over ID cards, stating his team reached a \"collective view\" during their discussion with the police.", "He admits it is an \"easy issue,\" but emphasizes that the Cabinet backed the plans for ID cards as they would help fight crime and prevent illegal immigration.", "The Tories pledged to support the bill while the Lib Dems plan to oppose it."], "qwen2.5:1.5b": ["Michael Howard denies his shadow cabinet split over Labour plans for ID cards, saying they reached a \"collective view\" after discussing the controversial measure.", "Howard supports the plans, which he believes help combat terrorism and illegal immigration, while Lib Dems oppose them.", "Key opposition figures opposed to the plan included David Davis, Oliver Letwin, Tim Yeo, and others, but Howard claims he was confident they would clarify their position.", "The ID card scheme is seen as essential by some due to its potential to prevent terrorist attacks, which could result in fatalities.", "Tories aim to hold ministers accountable for the purposes of the measure and assess cost effectiveness and privacy protection concerns.", "Some fear it will lead to greater discrimination against ethnic minorities."], "qwen2.5:3b": ["Howard denied his shadow cabinet was split over supporting controversial Labour plans for ID cards.", "After a \"good discussion,\" he claimed there was a \"collective view.\"", "The decision came from the police's stance, which stated ID cards could help prevent terror plots and crime.", "While some senior figures had reservations, Howard stood firm on their support, emphasizing the importance of taking decisions based on facts rather than fears.", "Conservative sources noted they would hold ministers accountable over the scheme’s purpose and impact.", "Critics like Mark Oaten from the Lib Dems called for more scrutiny and cost-effectiveness assessments, while Guy Mansfield QC highlighted potential risks to minority groups.", "Douglas Hogg criticized it as a \"regressive\" measure intruding into citizens' lives without sufficient benefits."], "opencoder:1.5b": ["As a machine, I can't generate text but I can provide a summary of the given text:\n\nHoward denied split over ID cards\n\nMichael Howard has denied his shadow cabinet was split over its decision to back controversial Labour plans to introduce ID cards.", "The Tory leader said his front bench team had reached a \"collective view\" after holding a \"good discussion\", but admitted it was \"not an easy issue\".", "He decided to support the plans as the police said they would help fight terror, crime and illegal immigration.", "The Lib Dems have pledged to oppose the bill when it is debated next Monday.", "Tory sources say senior party figures had argued vociferously against the ID card scheme.", "Among those reported to have serious reservations over the strategy were senior shadow cabinet members David Davis, Oliver Letwin and Tim Yeo.", "But Mr Howard denied Mr Yeo, his transport and environment spokesman, said the plans \"stink\".", "He also said he was confident shadow home secretary Mr Davis would \"set out the position very clearly\" when he stands up to debate the matter next week.", "Mr Howard said the police had said ID cards could \"help them foil aterror bomb plot in which people could lose their lives\".", "He added: \"When the police say that you have to take them seriously\".", "He acknowledged there were \"good libertarian arguments\" against the cards, but said the shadow Cabinet had weighed up all the \"conflicting interests\" before reaching its decision.", "\"I don't pretend that it is an easy decision but at the end of the day a decision has to be taken.\"", "He also denied he was afraid of looking \"soft\" on the issue, compared to Labour.", "The Conservatives announced their support for the government plans on Monday evening.", "Sources within the party told the BBC Mr Howard had always been in favour of ID cards, and tried to introduce them when he was Home Secretary.", "But the Tories insisted they would hold ministers to account over the precise purpose of the scheme.", "They said they would also press Labour over whether objectives could be met and whether the Home Office would be able to deliver them.", "And they pledged to assess the cost effectiveness of ID cards and whether people's privacy would be properly protected.", "\"It is important to remember that this bill will take a decade to come into full effect,\" a spokesman said.", "Lib Dem home affairs spokesman Mark Oaten has branded the ID scheme a waste of money and \"deeply flawed\".", "He said: \"This has all the signs of Michael Howard overruling colleagues' concerns over ID cards.\"", "The chairman of the Bar Council, Guy Mansfield QC warned there was a real risk that people on the \"margins of society\" would be driven into the hands of extremists.", "\"What is going to happen to young Asian men when there has been a bomb gone off somewhere?", "They are going to be stopped.", "If they haven't [ID cards] they are going to be detained.\"", "Tory ex-minister Douglas Hogg said he opposed the plans for ID cards branding them a \"regressive\" step which would intrude into the lives of ordinary citizens without any counterbalancing benefits.", "He predicted ultimately carrying the cards would become compulsory and that would lead to large numbers of Britain's ethnic minorities being stopped by police."], "smollm:1.7b": ["The summary is:\n\n* Howard denies split over ID cards\n* Tory leaders opposed ID cards, but agreed to support them as police say they will help fight terror, crime and illegal immigration\n* Sources within the party told the BBC that Mr Howard had always been in favor of ID cards, and tried to introduce them when he was Home Secretary.", "But the Tories insisted they would hold ministers to account over the precise purpose of the scheme\n* They said they would also assess the cost effectiveness of ID cards and whether people's privacy would be properly protected\n* The chairman of the Bar Council warned there was a real risk that people on the \"margins of society\" would be driven into the hands of extremists\n* What is going to happen to young Asian men when there has been a bomb gone off somewhere?", "They are going to be stopped.", "If they haven't ID cards they are going to be detained"], "deepseek-r1:1.5b": ["The shadow cabinet debate on ID cards introduced in Britain has been heated between Mr. Howard and his shadow team.", "Michael Howard denies the debate was split, stating his front bench reached a collective view after a \"good discussion.\"", "However, he admitted it was a challenging issue.", "The Lib Dems stated they would oppose the bill when debated next Monday, while Tory sources noted senior figures were skeptical of the ID card scheme.", "Shadow Home Secretary David Yeo disputed the plan's feasibility and confidence in its resolution.", "Howard, however, dismissed some \"libertarian arguments\" but maintained he'd take it seriously.", "He acknowledged libertarian views but emphasized weighing conflicting interests before declaring.", "The Conservative Party supported plans to introduce ID cards, emphasizing accountability over objectives and protecting privacy.", "Sources also noted concerns about individuals on societal margins being targeted by extremists and the potential of ID cards becoming compulsory for certain groups."], "tinyllama:1.1b": ["The Guardian reports that Labour's shadow cabinet has agreed to back the government's controversial ID card scheme, despite dissent among some senior figures on the party's decision-making team.", "According to its report, Michael Howard, the leader of the party's front bench, was forced to reject claims that the plans were a \"regressive\" step and that they would lead to large numbers of people being stopped by police.", "The paper quotes senior shadow cabinet members as saying they had reservations about the ID card scheme but ultimately decided to back it because they believed it would help \"fight terror, crime, and illigal immigration\".", "However, some Labour MPs have expressed doubts over the project's objectives and privacy protection.", "The paper notes that the party's home affairs speaker, Mark Oaten, has branded the ID card scheme a \"waste of money\" and warned that people on the \"margin of society\" would be driven into the hands of extremists."], "tinydolphin:1.1b": [" The Tory leader, Michael Howard, has denied his shadow cabinet was split over its decision to support the ID card scheme proposed by his government.", "In an interview with the BBC, Mr. Howard said it was not an easy issue for them to decide on, and that they had \"set out a collective view\".", "He also emphasized the importance of the police's involvement in the decision-making process.", "However, Lib Dem spokesman Mark Oaten claimed that the ID card scheme will take a decade to come into full effect, and criticized Michael Howard for overruling his colleagues' concerns over privacy."], "phi:2.7b": [" Michael Howard, the Tory leader, has denied claims that his shadow cabinet was divided over their decision to back controversial Labour plans to introduce ID cards.", "He said senior party members had debated the issue but had reached a collective view after discussing it in detail.", "The Conservatives have announced their support for the bill, which will take 10 years to fully implement.", "However, the Liberal Democrats oppose the plan and are expected to debate it next week.", "Despite concerns over privacy and cost-effectiveness, Mr Howard said the police had claimed that ID cards would help fight terrorism, crime, and illegal immigration.", "He also claimed that there were \"good libertarian arguments\" against the cards but his shadow cabinet weighed up all of the conflicting interests before making a decision."], "orca-mini:3b": [" Michael Howard has denied his shadow cabinet was split over its decision to back controversial Labour plans to introduce ID cards.", "The Tory leader said his front bench team had reached a \"collective view\" after holding a \"good discussion\", but admitted it was \"not an easy issue\".", "He had decided to support the plans as the police said they would help fight terror, crime and illegal immigration.", "The Lib Dems have pledged to oppose the bill when it is debated next Monday.", "Sources within the party told the BBC Mr Howard had always been in favour of ID cards, and tried to introduce them when he was Home Secretary.", "But the Tories insisted they would hold ministers to account over the precise purpose of the scheme.", "They also promised to press Labour over whether objectives could be met and whether the Home Office would be able to deliver them.", "And they pledged to assess the cost effectiveness of ID cards and whether people's privacy would be properly protected.", "The chairman of the Bar Council warned there was a real risk that people on the \"margins of society\" would be driven into the hands of extremists.", "Tory ex-minister Douglas Hogg also opposed the plans for ID cards branding them a \"regressive\" step which would intrude into the lives of ordinary citizens without any counterbalancing benefits.", "He predicted ultimately carrying the cards would become compulsory and that would lead to large numbers of Britain's ethnic minorities being stopped by police."], "hermes3:3b": ["Michael Howard denies Tory shadow cabinet split over ID card support, despite opposition from some members like David Davis, Oliver Letwin, Tim Yeo."], "stablelm-zephyr:3b": ["Michael Howard, leader of the Conservatives, denied that his shadow cabinet was divided over supporting Labour's plans to introduce ID cards.", "He said that after discussing it, his team reached a \"collective view\".", "The Tories announced their support for the government plans because they believe ID cards could help fight terror, crime, and illegal immigration.", "Some people in the party have concerns about how well the scheme will work and if it respects people's privacy.", "Labour's ID card plan might make some people feel like their lives are being intruded upon, but others worry that not having an ID card could put them in danger.", "The Conservatives want to make sure the Home Office can deliver on its promises and assess the cost-effectiveness of ID cards."], "chatgpt-4o-latest": ["Michael Howard denied that his shadow cabinet was divided over supporting Labour's ID card plans, stating they reached a \"collective view\" after discussion.", "He backed the scheme based on police claims that ID cards could help combat terrorism, crime, and illegal immigration.", "However, senior Tory figures, including David Davis, Oliver Letwin, and Tim Yeo, reportedly had reservations.", "Howard dismissed claims that Yeo called the plans \"stink\" and expressed confidence in Davis presenting the party's stance.", "While acknowledging libertarian concerns, Howard insisted a decision was necessary.", "The Tories pledged to scrutinize the scheme's purpose, feasibility, cost-effectiveness, and privacy implications.", "Lib Dems opposed the bill, calling it flawed and wasteful.", "Critics, including Bar Council chairman Guy Mansfield and ex-Tory minister Douglas Hogg, warned ID cards could lead to discrimination and unnecessary police stops, particularly for ethnic minorities."], "stablelm2:1.6b": ["Tory leader Michael Howard denies split among his cabinet over ID card support, as senior party figures David Davis, Oliver Letwin, and Tim Yeo had reportedly serious reservations about the strategy.", "Despite this opposition, Howard decided to support Labour's ID card plans as police claimed they would assist in fighting terrorism, crime, and illegal immigration.", "However, the Lib Dems pledged to oppose the bill when it is debated next week.", "A decade will be needed for the ID cards scheme to come into full effect.", "Critics such as Mark Oaten from the Lib Dems argue that the ID card scheme is a waste of money and deeply flawed."], "granite3.1-dense:2b": ["Michael Howard, Tory leader, denied a split within his shadow cabinet over supporting Labour's controversial ID card plans.", "Despite reservations from senior members like David Davis and Tim Yeo, the front bench reached a collective view after considering police claims that ID cards could aid in preventing terrorist attacks, crime, and illegal immigration.", "The Conservatives announced their support for the government plans on Monday.", "However, critics, including the Lib Dems and some within the Tory party, argue against the scheme, citing concerns about privacy, potential misuse, and ineffectiveness.", "Mark Oaten from the Lib Dems called it a waste of money, while Guy Mansfield QC warned of pushing marginalized groups into extremism.", "Douglas Hogg expressed concern that carrying ID cards might lead to increased police stops of ethnic minorities without commensurate benefits.", "The Tories promised to scrutinize the scheme's purpose, effectiveness, and cost-effectiveness, as well as privacy protections."]}