{"raw_text": "Taxes must be trusted - Kennedy\n \n Public trust in taxes is breaking down because Labour and Tories are not being straight with people on the issue, Lib Dem leader Charles Kennedy has said.\n \n A day ahead of the government's pre-Budget report, Mr Kennedy used a speech to say his party was facing up to \"painful economic realities\". He said the current level of taxation was about right, although he would put a new 50% tax on top earners. Other parties have accused the Lib Dems of making uncosted promises. Mr Kennedy made it clear he was determined to counter that accusation. The Lib Dems have already published what they say are the full costings for all their plans and Wednesday's speech did not announce new policies.\n \n Speaking at the Commonwealth Club, Mr Kennedy said it was critical for a political party to have economic credibility, both on what it promised and what it was expected to deliver. He said. \"Budgets have to add up. Tough choices are needed in public spending.\" The Lib Dems would cut \"low priority\" spending, including the government's ID cards scheme and the Child Trust Fund.\n \n Those cutbacks would free up funds for increasing basic state pensions for over-75s, putting more police on the streets and reintroducing fee eye and dental checks, he said. The Lib Dems argue they were honest about taxes in the past by calling for a 1p rise on income tax. Now they say the only simple tax rise they want is a new 50% tax band for top earners to pay for scrapping university tuition fees, providing free personal care for elderly and disabled people and keeping local taxes down. There would also be a local income tax to replace council tax and a number of changes to environmental taxes to ensure it is the \"polluter who pays\".\n \n The Lib Dems say the Tories have only laid out possible options for cutting taxes to grab headlines while Labour has hidden most of its tax rises. Mr Kennedy said: \"That contract with the people - that the government will only tax fairly and will spend their money wisely - can only be sustained if the political parties are straightforward about their plans. \"With the stealth tax strategy of Gordon Brown, the obvious unfairness of our current tax system - especially the council tax, and the empty promises of the Conservative party on this issue - it is no wonder that trust in taxation is breaking down.\" He challenged the Treasury to open up its books so the National Audit Office can report on the government's performance.\n \n Conservative co-chairman Liam Fox said: Liam Fox said \"If Charles Kennedy is serious about making his budgets add up he should start by explaining how they would fund their 100 spending commitments. \"The reality is, the Lib Dems lack the courage to tackle waste and bureaucracy, and the only people who would face 'tough choices' would be the families who would be £630 worse off a year. \" And Chancellor Gordon Brown said the Lib Dem figures did not add up. He accused the party of claiming it would spend less while across the country committing itself to spend more.\n", "llama3.2:1b": ["Lib Dem leader Charles Kennedy has accused Labour and Tories of breaking public trust in taxes, with the Lib Dems saying they are being \"stealthy\" on tax policy and hiding most of their own tax rises.", "The party's proposed cuts include free basic state pensions for over-75s, more police officers, and reduced fees for council tax and environmental taxes."], "llama3.2:3b": ["Public trust in taxes is breaking down due to lack of transparency from Labour and Conservative parties, according to Charles Kennedy.", "The Lib Dems argue for a new 50% tax on top earners to fund scrapping university tuition fees, free personal care for elderly and disabled people, and other public spending cuts."], "gemma2:2b": ["Charles Kennedy, leader of the Liberal Democrats, argues that public trust in taxes is declining due to dishonest political practices from both Labour and Conservatives.", "He emphasizes his party's commitment to financial credibility, proposing specific tax policies including a new 50% top-earner tax to fund their agenda while maintaining budget balance through spending cuts in less important areas.", "The Lib Dems challenge the other parties to address waste and bureaucracy instead of just making promises."], "qwen2.5:0.5b": ["Key points: Charles Kennedy, Labour and Tory leaders do not trust taxes because they aren't being honest with people about tax rises.", "Summary: The Liberal Democrats are facing pressure from their opponents to address issues such as university tuition fees and free personal care for elderly and disabled people.", "They argue that the Conservatives have only laid out possible options and are hiding most of their tax rises.", "The Lib Dems claim this undermines trust in taxation, which is breaking down due to \"painful economic realities\"."], "qwen2.5:1.5b": ["Liberal Democrat leader Charles Kennedy criticized Labour and Tories for lacking economic credibility, calling on them to be straightforward about their tax plans in order to restore trust in taxes.", "The Lib Dems proposed cutting \"low priority\" spending, increasing basic pensions, adding police officers, introducing eye and dental health checks, replacing council tax with a local income tax, and changing environmental taxes to make polluters pay more.", "Kennedy called on the government to open up its books for scrutiny.", "Conservative co-chairman Liam Fox disagreed, arguing that the Lib Dems' figures do not add up and are likely to worsen families' finances.", "Chancellor Gordon Brown also disputed the Lib Dem's claims, saying they made empty promises in previous elections."], "qwen2.5:3b": ["Public trust in taxes is declining due to Labour and Tories hiding economic realities, according to Charles Kennedy, Lib Dem leader.", "The Lib Dems are planning a 50% tax on top earners to fund their policies, including scrapping university tuition fees, providing free personal care for the elderly, and reducing local taxes.", "Kennedy emphasized that political parties need economic credibility and would cut \"low priority\" spending like ID cards and the Child Trust Fund to finance their proposals.", "He criticized Labour and Tories for hiding tax rises and promised open budget details to rebuild trust in taxation."], "opencoder:1.5b": ["Taxes must be trusted - Kennedy\n\nPublic trust in taxes is breaking down because Labour and Tories are not being straight with people on the issue, while Lib Dem leader Charles Kennedy has said.", "A day ahead of the government's pre-Budget report, Mr Kennedy used a speech to say his party was facing up to \"painful economic realities\".", "He explained that the current level of taxation was about right, although he would put a new 50% tax on top earners.", "Other parties have accused the Lib Dems of making uncosted promises.", "Speaking at the CommonModule, Mr Kennedy said it was critical for a political party to have economic credibility.", "They argued they were honest about taxes in the past by calling for a 1p rise on income tax.", "Now, they argue the only simple tax rise they want is a new 50% tax band for top earners to pay for scrapping university tuition fees, providing free personal care for elderly and disabled people and keeping local taxes down.", "The Lib Dems say the Tories have only laid out possible options for cutting taxes to grab headlines while Labour has hidden most of its tax rises.", "Mr Kennedy challenged the Treasury's books so they can report on the government's performance."], "smollm:1.7b": ["The summary is:\n\n* Taxes must be trusted - Kennedy\n* A day ahead of the government's pre-Budget report, Mr Kennedy used a speech to say his party was facing up to \"painful economic realities\".", "He said the current level of taxation was about right, although he would put a new 50% tax on top earners.", "Other parties have accused the Lib Dems of making uncosted promises.", "Mr Kennedy made it clear he was determined to counter that accusation.", "The Lib Dems have already published what they say are the full costings for all their plans and Wednesday's speech did not announce new policies.", "* Speaking at the Commonwealth Club, Mr Kennedy said it was critical for a political party to have economic credibility, both on what it promised and what it was expected to deliver.", "He said.", "\"Budgets have to add up.", "Tough choices are needed in public spending.\"", "The Lib Dems would cut \"low priority\" spending, including the government's ID cards scheme and the Child Trust Fund.", "* Those cuts would free up funds for increasing basic state pensions for over-75s, putting more police on the streets and reintroducing fee eye and dental checks, he said.", "The Lib Dems argue they were honest about taxes in the past by calling for a 1p rise on income tax.", "Now they say the only simple tax rise they want is a new 50% tax band for top earners to pay for scrapping university tuition fees, providing free personal care for elderly and disabled people and keeping local taxes down.", "There would also be a number of changes to environmental taxes to ensure it is the \"polluter who pays\".", "* The Lib Dems say the Tories have only laid out possible options for cutting taxes to grab headlines while Labour has hidden most of its tax rises.", "Mr Kennedy said: \"That contract with the people - that the government will only tax fairly and will spend their money wisely - can only be sustained if the political parties are straightforward about their plans.\"", "With the stealth tax strategy of Gordon Brown, the obvious unfairness of our current tax system - especially the council tax, and the empty promises of the Conservative party on this issue - it is no wonder that trust in taxation is breaking down.", "* The Lib Dems say the Tories lack the courage to tackle waste and bureaucracy, and the only people who would face \"tough choices\" would be the families who would be £630 worse off a year.", "And Chancellor Gordon Brown said the Lib Dem figures did not add up.", "He accused the party of claiming it would spend less while across the country committing itself to spend more."], "deepseek-r1:1.5b": ["Charles Kennedy, the leader of the Lib Dem party, has emphasized that his party is handling tough economic realities, including raising a 50% income tax on top earners.", "He suggested the government could add up budget numbers and make tough choices in public spending.", "The Lib Dems plan to cut spending on the ID cards scheme, the Child Trust Fund, and reduce local taxes to free up funds for basic state pensions.", "These cuts aim to address issues like medical expenses, police presence, and environmental improvements.", "The government is pushing for better transparency through reports from the National Audit Office, though critics warn Lib Dems' tax proposals lack affordability."], "tinyllama:1.1b": ["In response to the challenges posed by trust in taxation, the Labour Party has been criticized for its \"stealth tax strategy\" on income and council tax, as well as making uncosted promises on other policies like ID cards and tuition fees.", "To address these concerns, the Liberal Democrats have outlined a new 50% tax band for top earners to fund the scrapping of university tuition fees, provision of free personal care for elderly and disabled people, local income tax, and more efficient environmental taxes.", "However, the Conservative Party has accused the Lib Dems of hiding their tax rise from the public, as the current level of taxation is about right.", "In response to this criticism, the Coalition government has announced it will open up its books so that the National Audit Office can report on the government's performance, but the party continues to lack the courage to tackle waste and buraucracy and only promises \"spending\" commitments, leaving families with over £600 less a year."], "tinydolphin:1.1b": [" Charles Kennedy, the leader of the Liberal Democrats, announced that his party will tax high income earners by introducing a new 50% tax band and scrapping university tuition fees.", "He also criticized the Conservatives for only talking about their plans while hiding their tax rises from the public.", "The UK is facing a major budgetary challenge as politicians try to balance spending with reducing the deficit, which has been growing under the present government."], "phi:2.7b": [" Charles Kennedy, leader of the Liberal Democrats, believes that public trust in taxes is breaking down due to Labour and Conservative parties being dishonest with people regarding taxation.", "The current level of taxation is about right, although Mr Kennedy supports a new 50% tax on top earners.", "Other parties accuse the Lib Dems of making uncosted promises.", "However, the Lib Dems have published full costings for all their plans.", "Mr Kennedy stresses the need for economic credibility, and that budgets must add up.", "The party's plan includes cutting low priority spending such as government ID cards and Child Trust Funds.", "This would free up funds to increase basic state pensions, put more police on the streets, and reintroduce fee-eye and dental checks.", "The Lib Dems also support a 50% tax band for top earners to pay for scrapping university tuition fees, providing free personal care for elderly and disabled people, and keeping local taxes down.", "They argue that they were honest about taxes in the past by calling for a 1p rise on income tax.", "Mr Kennedy believes trust in taxation can only be maintained if political parties are straightforward about their plans, which he says is not the case with Labour and the Conservative party.", "He suggests that councils should adopt a local income tax to replace council tax and environmental taxes should be changed so that polluters pay."], "orca-mini:3b": [" Kennedy said that the current level of taxation was about right, but he would put a new 50% tax on top earners.", "The Lib Dems have already published what they say are the full costings for all their plans and on Wednesday's speech did not announce new policies.", "The party argues it was honest about taxes in the past by calling for a 1p rise on income tax.", "Now, they want a new 50% tax band for top earners to pay for scrapping university tuition fees, providing free personal care for elderly and disabled people and keeping local taxes down.", "There would also be a local income tax to replace council tax and a number of changes to environmental taxes to ensure it is the \"polluter who pays.\""], "hermes3:3b": ["Lib Dems doubt public trust in taxes due to parties' dishonest tax plans, Kennedy argues for economic credibility and honest budgeting."], "stablelm-zephyr:3b": ["Liberal Democrat leader Charles Kennedy criticized a lack of trust in taxes, stating that both Labour and the Conservatives were not being transparent about their policies.", "He claimed that his party faced economic realities and presented plans to cut low-priority spending while increasing basic state pensions for over-75s, adding more police on the streets, and reintroducing eye and dental checks.", "The Liberal Democrats argue they are honest about taxes by proposing a new 50% tax band for top earners to fund university tuition fee cancellations, free personal care for elderly and disabled people, and maintaining local taxes.", "Kennedy called for political parties to be straightforward about their plans and challenged the Treasury to open its books for review by the National Audit Office.", "Conservative co-chairman Liam Fox and Chancellor Gordon Brown also commented on the issue."], "chatgpt-4o-latest": ["Lib Dem leader Charles Kennedy warned that public trust in taxation is eroding due to a lack of transparency from Labour and the Conservatives.", "He argued that economic credibility requires honesty about taxation and spending.", "The Lib Dems support maintaining current tax levels but propose a new 50% tax on top earners to fund scrapping university tuition fees, free personal care for the elderly and disabled, and lower local taxes.", "They also advocate replacing council tax with a local income tax and adjusting environmental taxes to ensure polluters pay.", "Kennedy criticized Labour for hidden tax increases and the Conservatives for making uncosted tax cut promises.", "He called for the Treasury to open its books for independent review.", "In response, the Conservatives and Chancellor Gordon Brown accused the Lib Dems of making unrealistic spending commitments without clear funding plans."], "stablelm2:1.6b": ["Lib Dem leader Charles Kennedy says the public's trust in taxes is declining due to Labour and Tories hiding their tax increases, while the Lib Dems promise a new 1% tax band for top earners to fund various initiatives such..", "The party claims honesty by previously calling for a 1p rise on income tax.", "They say that the current level of taxation is appropriate and will cut low-priority spending including ID cards scheme and Child Trust Fund.", "Other parties argue they are facing up to \"painful economic realities\" in terms of budget cuts."], "granite3.1-dense:2b": ["Lib Dem leader Charles Kennedy emphasized the importance of economic credibility and budgets adding up during a speech ahead of the government's pre-Budget report.", "He acknowledged that current taxation levels are appropriate but proposed a new 50% tax rate for top earners to fund initiatives like university tuition fee elimination, free personal care for elderly and disabled, and council tax replacement.", "Kennedy criticized Labour's hidden tax rises and the Conservatives' stealth tax strategy as reasons for eroding public trust in taxation.", "He challenged the Treasury to let the National Audit Office scrutinize government spending.", "However, Conservative co-chairman Liam Fox dismissed Kennedy's plans as lacking in substance and accused him of avoiding cuts to waste and bureaucracy that would disproportionately affect families by £630 annually.", "Chancellor Gordon Brown also disputed the Lib Dems' budget figures, arguing they don't add up."]}