{"raw_text": "UK youth 'interested' in politics\n \n The majority of young people are interested in politics, holding \"strong opinions\" on policies and have a \"keen appetite\" for direct action.\n \n Research undertaken for voting watchdog the Electoral Commission suggests 81% of 16 to 20-year-olds feel strongly about issues like crime and education. The survey findings are being released to coincide with the launch of the Y Vote Mock Elections 2005 initiative. Mock elections are planned to take place in schools across the UK.\n \n Electoral Commission boss Sam Younger said: \"We know that young people often feel disengaged from democratic life and we believe in working creatively to encourage their interest and participation. \"Mock elections can play an extremely valuable role in helping young people understand how the democratic process works and why it matters,\" he said. The survey of a sample of 500 British 16 to 20-year-olds and 500 21 to 25-year olds \"showed Britain's young people are far from apathetic about issues that matter to most of their lives\". The Y Vote initiative is being run jointly by the Electoral Commission, the Hansard Society and the Department for Education and Skills in the run-up to local elections and the general election, possibly on 5 May. Michael Rafferty, who is mock elections project manager at the Hansard Society, said he looked forward to seeing schools and colleges across the UK participating in the mock votes.\n", "llama3.2:1b": ["UK youth are interested in politics, with 81% of 16-20 year olds feeling strongly about issues like crime and education.", "Research suggests that a majority of young people (over 50%) feel strongly about these issues.", "The Electoral Commission is launching the Y Vote Mock Elections initiative to encourage young people's interest in politics and participation."], "llama3.2:3b": ["81% of 16-20 year olds feel strongly about issues like crime and education, with a \"keen appetite\" for direct action, according to Electoral Commission research.", "Mock elections are being launched in schools to encourage young people's interest and participation in politics."], "gemma2:2b": ["81% of young people aged 16-20 feel strongly about issues like crime and education.", "A new initiative called Y Vote Mock Elections will be launched to encourage youth political engagement in the UK."], "qwen2.5:0.5b": ["UK youth are interested in politics; they hold strong opinions and are keen on direct action.", "Research has shown that 81% of young people aged 16-20 think issues like crime and education are important, leading to plans for a mock election in schools across the UK.", "The Electoral Commission is working with the Hansard Society and Department for Education to encourage their interest and participation in politics.", "Mock elections can be an effective way for young people to understand how the democratic process works and why it matters."], "qwen2.5:1.5b": ["Young people aged 16-20 are interested in politics, expressing strong opinions about crime and education, with a keen appetite for direct action.", "The Electoral Commission is releasing survey findings ahead of Y Vote Mock Elections, which will be held in schools leading up to local elections on 5 May."], "qwen2.5:3b": ["UK youth 'interested' in politics: Majority of young people (16-20) feel strongly about issues like crime and education (81%).", "Research by Electoral Commission suggests young Britons are not apathetic but rather engaged.", "Mock elections planned to educate teens on democratic process, run alongside local and general election preparations.", "Initiative is a collaboration between Electoral Commission, Hansard Society, and Department for Education and Skills."], "opencoder:1.5b": ["\"The majority of young people are interested in politics, holding \"strong opinions\" on policies and have a \"keen appetite\" for direct action.\"", "Researchers suggest 81% of 16 to 20-year-olds feel strongly about issues like crime and education.", "The survey findings are being released to coincide with the launch of the Y Vote Mock Elections 2005 initiative.", "Mock elections are planned to take place in schools across the UK.", "Sam Younger said Britain's young people are far from apathetic about issues that matter to most of their lives.", "The Hansard Society and the Department for Education and Skills in the run-up to local elections and the general election, possibly on 5 May.", "Michael Rafferty looked forward to seeing schools and colleges across the UK participating in the mock votes."], "smollm:1.7b": ["The UK youth are interested in politics, holding strong opinions on various issues and have a keen appetite for direct action.", "Research has shown that 81% of 16-20 year olds feel strongly about these issues, with crime and education being two of the most prominent concerns.", "The Electoral Commission's findings suggest that young people are more likely to vote if they feel their opinions matter and if they have a strong connection to the political process.", "The UK Vote Mock Elections initiative is designed to encourage young people to take an active role in the democratic process, with mock elections planned for schools across the country.", "The campaign aims to educate young people about how the electoral system works and why it matters, with the goal of increasing voter turnout among young people.", "The initiative is expected to be a valuable tool in helping young people understand their political rights and responsibilities, potentially leading to higher levels of participation at the polls on 5 May.", "Michael Rafferty, who is mock elections project manager at the Hansard Society, said he was excited about the potential of the Y Vote initiative to engage young people with politics.", "He added that the campaign's success would depend on its ability to reach and involve young people from diverse backgrounds."], "deepseek-r1:1.5b": ["The UK youth show significant interest in politics, holding strong opinions on policies and having a keen appetite for direct action.", "A survey by the Electoral Commission reveals that 81% of young people aged 16-20 feel strongly about issues like crime and education.", "The initiative aims to launch mock elections in schools across the UK, likely to engage young people more deeply with democratic processes.", "The campaign is planned to run on May 5th, supported by the Electoral Commission, Hansard Society, and Department for Education & Skills."], "tinyllama:1.1b": ["Nearly half of UK youth between the ages of 16 and 20 are interested in politics, expressing a \"strong opinion\" on policies and displaying \"keen interest\" for direct action.", "The survey conducted by the Electoral Commission reveals that nearly 81% of this age group feels strongly about issues like crime and education, with mock elections planned to take place in schools across the country from October through November 2005.", "Mock elections can play a valuable role in helping young people understand how the democratic process works and why it matters, as revealed by the survey results.", "The Y Voe initiative is being run jointly by the Electoral Commission, Hansard Society, and the Department for Education and Skills to prepare for local elections and the general election possibly on May 5th."], "tinydolphin:1.1b": [" The Electoral Commission has conducted a research on the interest of young people in politics.", "According to the survey findings, 81% of 16-20-year-olds have strong opinions on political issues.", "The study suggests that these individuals have a keen interest in direct action and feel strongly about their concerns.", "This initiative by the Electoral Commission is designed to encourage young people's participation in democratic life, as they often feel disengaged from the process."], "phi:2.7b": [" The majority of young people in the UK are interested in politics and hold strong opinions on issues such as crime and education.", "A survey by the Electoral Commission has revealed that 81% of 16-20-year-olds feel strongly about these matters, with a keen appetite for direct action.", "To encourage their interest and participation, mock elections will be held in schools across the UK ahead of local elections and the general election.", "The initiative is being run jointly by the Electoral Commission, the Hansard Society, and the Department for Education and Skills."], "orca-mini:3b": [" The majority of young people are interested in politics and have strong opinions on issues such as crime and education.", "The Electoral Commission is working with the Hansard Society and the Department for Education and Skills to launch a Y Vote Mock Elections 2005 initiative in the run-up to local elections and the general election, possibly on May 5th."], "hermes3:3b": ["Youth (16-20 years) interested in politics, having strong opinions on issues like crime and education.", "81% feel strongly about these topics, which is being used for Y Vote Mock Elections initiative across the UK."], "stablelm-zephyr:3b": ["UK youth interested in politics, hold strong opinions, and have a keen appetite for direct action.", "81% of 16-20 year olds feel strongly about issues like crime and education.", "The Electoral Commission aims to encourage interest and participation among young people with the Y Vote initiative, which includes mock elections in schools across the UK.", "This effort is jointly run by the Electoral Commission, the Hansard Society, and the Department for Education and Skills."], "chatgpt-4o-latest": ["The majority of UK youth are interested in politics, with 81% of 16 to 20-year-olds expressing strong opinions on issues like crime and education.", "A survey by the Electoral Commission found that young people are engaged and willing to take direct action.", "To encourage participation, the Y Vote Mock Elections 2005 initiative will hold mock elections in schools.", "Electoral Commission chief Sam Younger emphasized the importance of such initiatives in helping young people understand democracy.", "The Y Vote initiative, run by the Electoral Commission, the Hansard Society, and the Department for Education and Skills, aims to boost youth engagement ahead of upcoming elections."], "stablelm2:1.6b": ["A majority of young people in the UK are interested in politics with strong opinions on policies and a keen appetite for direct action.", "The Electoral Commission's research reveals that 10-20% of both primary and secondary school-aged children feel strongly about issues such as crime and education.", "Mock elections, planned in schools across the UK, will help young people understand how the democratic process works.", "This initiative, jointly run by the Electoral Commission, Hansard Society, and Department for Education and Skills, aims to encourage interest and participation among young people leading up to local elections and possibly the general election on 5 May."], "granite3.1-dense:2b": ["81% of British young people aged 16 to 20 hold strong opinions on issues such as crime and education, indicating a keen interest in politics.", "This finding, based on a survey of 500 participants from this age group, is being used to support the Y Vote Mock Elections 2005 initiative.", "The Electoral Commission's Sam Younger emphasizes that these mock elections aim to engage young people in understanding democracy and its significance.", "The Hansard Society's Michael Rafferty anticipates wide participation from schools and colleges in this event, planned for local elections and the general election (possibly on May 5).", "This initiative aims to foster a sense of political engagement among young people."]}