{"raw_text": "Parties warned over 'grey vote'\n \n Political parties cannot afford to take older UK voters for granted in the coming election, says Age Concern.\n \n A survey for the charity suggests 69% of over-55s say they always vote in a general election compared with just 17% of 18 to 24 year olds. Charity boss Gordon Lishman said if a \"decisive blow\" was struck at the election it would be by older voters who could be relied on to turn out. A total of 3,028 adults aged 18 or over were interviewed for the study. Mr Lishman urged the next government to boost state pension.\n \n He also called for measures to combat ageism and build effective public services to \"support us all in an ageing society\". \"Older people want to see manifesto commitments that will make a difference to their lives,\" Mr Lishman said. \"Political parties must wake up to the fact that unless they address the demands and concerns of older people they will not keep or attract their vote.\" In the survey carried out by ICM Research, 14% of people aged between 18 and 34 said they never voted in general elections. Among the over-65s, 70% said they would be certain to vote in an immediate election, compared with 39% of people under 55. Age Concern says the over-55s are \"united around\" key areas of policy they want the government to focus on. For 57%, pensions and the NHS were key issues, while the economy was important for a third, and tax was a crucial area for 25%.\n \n The report was welcomed by Conservative shadow pensions secretary David Willetts. \"The pensioners' voice must certainly be heard in the next election as they have never fitted into Blair's cool Britannia,\" he said. \"Labour's continued refusal to admit the true extent of the pensions crisis will be one of the monumental failures of this government.\" He pointed to Tory plans to increase the basic state pension to reduce means testing, strengthen company pensions and encourage savings. A Liberal Democrat spokesman said the party took the issues raised in the report very seriously. He highlighted the party's promises to raise the basic state pension, provide free long-term care for the elderly and replace council tax, seen as a particular problem for pensioners on fixed incomes. Labour has said it wants to use savings reforms to Incapacity Benefit to improve the basic state pension and has set up a review of the council tax system.\n", "llama3.2:1b": ["Age Concern warns that political parties cannot afford to take older UK voters for granted in the upcoming election, citing a 69% vote rate among over-55s compared to 17% among 18-24 year olds.", "The charity's survey suggests older voters are more likely to turn out and have specific demands and concerns.", "A total of 3,028 adults aged 18 or over were interviewed for the study."], "llama3.2:3b": ["Political parties must address demands and concerns of older people or risk losing their vote, says Age Concern survey.", "A total of 70% of over-65s said they would definitely vote in an election, compared to 39% under 55.", "Key policy areas for concern include pensions (57%), NHS (44%), economy (33%)"], "gemma2:2b": ["A survey indicates that older UK voters are crucial in elections, with 69% of those over 55 consistently voting compared to just 17% of 18-24 year olds.", "Age Concern calls for parties to address the needs of this demographic and promises them specific measures like pension boosts, combating ageism, and improving public services.", "Conservative shadow pensions secretary David Willetts emphasizes the importance of the pensioners' voice in the upcoming election while Liberal Democrat and Labour parties express their own commitments and intentions on related policies."], "qwen2.5:0.5b": ["Political parties should take into account that older voters are more likely to turn out during an election, but must also tackle ageism and address public services if they want to keep their votes.", "Age Concern's survey suggests that over-55s are less likely to vote than 18-to-24-year-olds due to the challenges of living longer.", "The report by Age Concern welcomed Conservative shadow pensions secretary David Willetts' comments about pensioners, as they've been left out of a government plan to raise the basic state pension and provide long-term care for the elderly.", "The Liberal Democrats highlighted plans to raise the state pension, improve council tax and encourage savings in their support for Labour."], "qwen2.5:1.5b": ["Political parties warned that older UK voters (69% vs 17%) should not be taken for granted in upcoming elections, as ageism needs to be combated and effective public services improved.", "The charity Age Concern called on leaders to boost pensions and address concerns about older people's lives.", "A survey found younger adults are less likely to vote compared to older generations (34% vs 70%)."], "qwen2.5:3b": ["Political parties need to prioritize older voters in UK elections according to Age Concern.", "A survey indicates that 69% of over-55s always vote, compared to only 17% of 18-24 year olds.", "Gordon Lishman, charity boss, emphasizes the potential impact of this \"grey vote\" and calls for government action on issues like pensions and healthcare.", "Conservative David Willetts stresses pensioners' importance in next election, while Liberal Democrats support policies to boost state pensions and long-term care.", "Labour's response is mixed but they also acknowledge the need to address the pensions crisis."], "opencoder:1.5b": ["\"Parties warned over 'grey vote'\".", "The report highlights the importance of voting in an ageing society, advocating for universal rights and economic development.", "A survey by ICM Research underscores the need for government support among older people, emphasizing their concerns about the future of public services.", "Mr Lishman urges the next government to raise state pension funds, urging them to tackle concerns related to aging.", "The report calls on measures to combat ageism and build effective public services, as well as focusing on creating more accessible services for elderly people.", "The report acknowledges the need for conservative policies to be seen by the public, highlighting their commitment to universal health care and increased safety regulations, which are key areas of focus for pensioners.", "Labour's plans to reduce mean testing and increase basic state pension raise concerns about age-related costs, while Tory plans aim to use savings to replace Incapacity Benefit, another program aiming to address long-term care needs.", "The report is viewed with a strong sense of government readiness, emphasizing the importance of universal health services and the need for more inclusive policies in addressing aging and tax issues."], "smollm:1.7b": ["The parties warned over \"grey vote\" in the coming election.", "Political parties cannot afford to take older UK voters for granted in the coming election, says Age Concern.", "A survey for the charity suggests 69% of over-50s say they always vote in a general election compared with just 17% of 18 to 24 year olds.", "Charity boss Gordon Lishman said if a \"decisive blow\" was struck at the election it would be by older voters who could be relied on to turn out.", "A total of 3,028 adults aged 18 or over were interviewed for the study.", "Mr Lishman urged the next government to boost state pension.", "He also called for measures to combat ageism and build effective public services to \"support us all in an ageing society\".", "Older people want to see manifesto commitments that will make a difference to their lives, he said.", "Political parties must wake up to the fact that unless they address the demands and concerns of older people they will not keep or attract their vote.", "Mr Lishman says the over-50s are \"united around\" key areas of policy they want the government to focus on.", "For 57%, pensions and the NHS were key issues, while the economy was important for a third, and tax was a crucial area for 25%."], "deepseek-r1:1.5b": ["The political parties warn older UK voters cannot afford to ignore their voters in upcoming elections due to ageism.", "A survey reveals 69% of over-55s always vote, while only 17% of 18-24 year olds do so.", "Mr Gordon Lishman urged the next government to boost state pensions and highlighted issues like pensioners' voices needing attention in politics.", "The report found over-55s are \"united around\" key policy areas, while 57% emphasized pensioners wanting changes.", "The survey showed 70% of over-65s would vote immediately, compared to 39% under 55.", "Lib Dem also took seriously age issues like long-term care and council tax.", "Conservative shadow Secretary Willetts praised the report, pointing out Tory plans to address pensioners' needs."], "tinyllama:1.1b": ["The text describes the warning that older UK voters may be reluctant to vote for the next election, based on a survey conducted by Political party Age Concern.", "The report finds that over-55s are uniting around key areas of policy such as pensions and healthcare, while economy is their main concern.", "Conservative shadow pension secretary David Willetts welcomed the report's focus on the issue, stating that it would be a major challenge for Labour to address the demands of older voters.", "The Liberal Democrats also took the issues raised in the report seriously and promised to raise the basic state pension and provide free long-term care for elderly individuals.", "Labour has pledged to use savings reform to improve the basic state peninsion, while the Conservatives have set up a review of council tax."], "tinydolphin:1.1b": [" Parties warned over 'grey vote' - A survey for Age Concern suggests older UK voters are more likely to vote in general elections than younger people, while some also want commitments from political parties to help support them in an ageing society.", "The charity has urged the next government to take on key issues like state pension and public services to support these older individuals."], "phi:2.7b": [" According to Age Concern's survey, older UK voters are less likely to vote in general elections compared to younger voters.", "The charity warns that political parties cannot afford to take them for granted and urge governments to address their concerns such as the pensions crisis and build effective public services.", "A Conservative shadow pensions secretary praised the report while a Liberal Democrat spokesman said the party takes the issues seriously and has promised measures like increasing basic state pension, providing free long-term care, and replacing council tax.", "Labour has also announced plans to improve the basic state pension using savings reforms."], "orca-mini:3b": [" The text reports that older voters can be relied on to vote in an upcoming election, calling for measures to combat ageism and build effective public services to support them.", "Political parties must address the demands and concerns of older people or they will not keep or attract their vote, according to a survey carried out by ICM Research.", "The over-55s are \"united around\" key areas of policy they want the government to focus on, such as pensions, the NHS, and the economy."], "hermes3:3b": ["Parties warned about underestimating older UK voters, who tend to consistently turnout in general elections; Age Concern survey shows 69% of over-55s always vote vs 17% of 18-24 year olds."], "stablelm-zephyr:3b": ["Age Concern warns political parties that they cannot take older UK voters for granted in upcoming elections, as a survey shows 69% of over-55s always vote compared to 17% of 18-24 year olds.", "Charity boss Gordon Lishman urged the next government to boost state pension and called for measures against ageism and effective public services.", "He stressed that political parties must address the demands and concerns of older people to retain or attract their votes.", "Conservative David Willetts welcomed the report, highlighting Tory plans to increase basic state pension, strengthen company pensions, and encourage savings.", "Labour has proposed using savings reforms to improve the basic state pension through a review of council tax systems."], "chatgpt-4o-latest": ["Political parties must not take older UK voters for granted in the upcoming election, warns Age Concern.", "A survey found that 69% of over-55s consistently vote, compared to just 17% of 18-24 year olds.", "Charity head Gordon Lishman emphasized that older voters could be decisive and urged the next government to improve state pensions, combat ageism, and enhance public services.", "The survey showed that pensions and the NHS were top concerns for 57% of over-55s, followed by the economy (33%) and tax (25%).", "Conservative David Willetts criticized Labour’s handling of pensions and highlighted Tory plans to strengthen pensions and savings.", "The Liberal Democrats pledged to raise the state pension, provide free long-term care, and reform council tax.", "Labour aims to improve pensions through savings from Incapacity Benefit reforms and is reviewing council tax."], "stablelm2:1.6b": ["Political parties must not underestimate older UK voters in upcoming elections, according: Age Concern.", "A survey by charity found that 80% of over-60s always vote in general elections compared with just 45% of 16-24 year olds.", "Gordon Lishman urges next government to boost state pension and combat ageism while also calling for improvements to public services to support the elderly population.", "Conservative MP David Willetts acknowledges the importance of older voters' concerns and Tory plans increase basic state pension, strengthen company pensions, and encourage savings."], "granite3.1-dense:2b": ["Age Concern warns political parties not to underestimate the voting power of older UK adults, who consistently turn out in higher numbers for general elections (69%).", "In contrast, only 17% of 18-24 year olds vote regularly.", "The charity surveyed 3,028 adults and found that 57% of those aged 55 and over prioritize pensions and the NHS, while 39% care about the economy, and 25% focus on tax issues.", "Charity boss Gordon Lishman calls for increased state pension, combating ageism, and strengthening public services to support an aging population.", "Conservative shadow pensions secretary David Willetts agrees, emphasizing the importance of addressing the pensions crisis, which Labour has been criticized for ignoring.", "The Liberal Democrats and Labour have also outlined policies to tackle these concerns in their party platforms."]}