{"raw_text": "Parties' plans for council tax\n \n Anger at council tax rises spilled over into mass protests in 2003, when the average English bill rose 12.9%.\n \n Pensioners' protests spread - some marched, others simply refused to pay the increase. Some, such as 83-year-old Elizabeth Winkfield, said they would rather go to jail. The Audit Commission found the whole local government finance system was \"fundamentally flawed\" and all three of the main parties have said the system has to change.\n \n Labour says it wants to retain the property-based tax but reform it to make it fairer and says there is scope for councils to become more efficient. They say they are already helping pensioners with council tax bills, with a £100 lump sum for the over-70s and last year the government capped some local councils' budgets to keep demands down. Deputy Prime Minister John Prescott has said the current system is not sustainable in the long term and said there would be \"radical reform\". The party says this year's increases will be the lowest in a decade. A report last year looked at increasing the number of council tax bands and other forms of local taxation, such as reformed business rates, although no decisions have been made. An independent inquiry into its findings, the Lyons review, is due to report back at the end of 2005.\n \n The Tories have promised a reduction on bills for pensioners, who they say have been hardest hit by year-on-year increases in council tax. They say they can save £4bn on \"government waste\", of which £1.3bn could be used to cut pensioners' bills by an average of £340. It would not be means tested, say the Tories, because that would create more bureaucracy and could discourage people from saving for their retirement. Instead households where council tax payers are over 65 would get a rebate covering half their bill, up to a maximum of £500. The Tories also say they are suspicious about any proposals to revalue homes - currently graded according to their value in 1991 - because they believe seven million of homes could move up a band.\n \n The Liberal Democrats want to do away with the council tax altogether and switch to a local income tax of the kind seen in the USA, Norway and Switzerland. The rate would be set locally, but administered by the Inland Revenue which they say would save at least £300m. They say the council tax is the most unpopular and most unfair tax in Britain, because it puts a \"ceiling\" on what the richest pay. The party says it would aim for a £5,000 tax-free personal allowance, or a £7,000 allowance for the over-65s. After that income would be taxed up to £100,000. The Lib Dems say their plan is fairer, more efficient, has already been tested abroad and offers more accountability.\n", "llama3.2:1b": ["The text discusses parties' plans for council tax reform, including:\n\n* Labour's proposal to retain the property-based tax but reform it to make it fairer\n* The Conservatives' promise to reduce pensioners' council tax bills by £340, with a rebate of up to £500 for households over 65\n* The Liberal Democrats' plan to abolish council tax altogether and switch to a local income tax, which they claim would be more efficient and fair"], "llama3.2:3b": ["Protesters in 2003 protested council tax rises of 12.9% for pensioners who refused to pay the increase.", "The Audit Commission called the system \"fundamentally flawed\".", "Labour proposes reforming the property-based tax while Tories promise a rebate for pensioners and Lib Dems want to replace it with a local income tax."], "gemma2:2b": ["Council tax rises led to protests in 2003, with demands for reform from all three main parties.", "Labour wants to reform the system while retaining property-based taxation; they propose efficiency improvements and targeted assistance for pensioners.", "The Tories advocate reducing bills for pensioners by means of rebates; they propose significant cuts to government spending to fund this.", "The Liberal Democrats favor a local income tax model, with potential savings and increased fairness."], "qwen2.5:0.5b": ["Parties' plans for council tax:\n\n  * Labour wants to retain the property-based tax but reform it to make it fairer.", "* The Tories want a reduction on pensions, who they say have been hardest hit by year-on-year increases in council tax.", "* The Lib Dems want to do away with the council tax altogether and switch to a local income tax of the kind seen in the USA, Norway, and Switzerland."], "qwen2.5:1.5b": ["Council tax protests led to increased bills of 12.9% in 2003, with pensions hardest hit, reforms needed to make the system fairer, Labour proposes efficiency improvements while cutting pensioners' bills, Tories promise relief for those over 65, and Liberal Democrats advocate a local income tax for fairness."], "qwen2.5:3b": ["In 2003, council tax rises led to protests, with pensioners refusing or marching against increases.", "The Audit Commission found the system flawed, prompting all major parties to consider changes.", "Labour wants reform but retains a property-based tax; they aim for lower year-over-year increases and help pensioners.", "Tories promise £340 reduction on bills for pensioners by cutting government waste, with no means testing.", "They propose a rebate for over-65s paying council tax.", "Liberal Democrats advocate abolishing council tax in favor of a local income tax (akin to USA, Norway, Switzerland).", "Their plan aims for a £7,000 allowance for the over-65s and fairness compared to current unpopular system."], "opencoder:1.5b": ["Parties' plans for Council Tax\n\nAnger at the rise of council tax spilled over into mass protests in 2003.", "Pensioners’ protests spread.", "Some marched, others simply refused to pay the increase.", "Some, such as 83-year-old Elizabeth Winkfield, said they would rather go to jail.", "Labour agrees it wants to retain the property-based tax but says it can reform it to make it fairer and says there is scope for councils to become more efficient.", "They are already helping pensioners with their tax bills, with a £100 lump sum for the over-70s.", "The current system is not sustainable in the long term.", "The Tories promise a reduction on bills for pensioners who they say have been hardest hit by year-on-year increases in the tax.", "They hope that the Tories could save up to £4bn on \"government waste\" and use it up at the end of the decade.", "Liberal Democrats are set to do away with the council tax altogether and go ahead with a local income tax.", "The party aims for a tax-free personal allowance for the over-65s, up to a maximum of £5,000.", "After that income would be taxed up to £100,000.", "The Lib Dems believe their plan is fairer, more efficient, has already been tested abroad and offers more accountability."], "smollm:1.7b": ["The parties' plans for council tax are summarized as follows:\n\n* Anger at council tax rises spilled over into mass protests in 2003, when the average English bill rose 12.9%.", "* Pensioners' protests spread - some marched, others simply refused to pay the increase.", "Some, such as 83-year-old Elizabeth Winkfield, said they would rather go to jail.", "The Audit Commission found the whole local government finance system was \"fundamentally flawed\" and all three of the main parties have said the system has to change.", "* Labour says it wants to retain the property-based tax but reform it to make it fairer and says there is scope for councils to become more efficient.", "They say they are already helping pensioners with council tax bills, with a £100 lump sum for the over-70s and last year the government capped some local councils' budgets to keep demands down.", "* The Tories have promised a reduction on council tax bills for pensioners, who they say have been hardest hit by year-on-year increases in council tax.", "They say they can save £4bn on \"government waste\", of which £1.3bn could be used to cut council tax bills by an average of £340.", "It would not be means tested, say the Tories, because that would create more bureaucracy and discourage people from saving for their retirement.", "Instead households where council tax payers are over 65 would get a rebate covering half their bill, up to a maximum of £500.", "* The Liberal Democrats want to do away with the council tax altogether and switch to a local income tax of the kind seen in the USA, Norway and Switzerland.", "The rate would be set locally, but administered by the Inland Revenue which they say would save at least £300m.", "They say the council tax is the most unpopular and most unfair tax in Britain, because it puts a \"ceiling\" on what the richest pay.", "* The Liberal Democrats want to do away with the council tax altogether and switch to a local income tax of the kind seen in the USA, Norway and Switzerland.", "After that income would be taxed up to £100,000.", "The Lib Dems say their plan is fairer, more efficient, has already been tested abroad and offers more accountability."], "deepseek-r1:1.5b": ["The UK council tax system has seen significant reforms, primarily in Labour, which aim to reduce the average bill by 12.9% due to protests.", "They seek to make taxes fairer, promote efficiency, and help pensioners by offering £100 lump sum.", "The Tories, however, prefer a more radical approach with potential rebates and a higher personal allowance for over-65s, while the Lib Dems aim for a simpler system without property taxes."], "tinyllama:1.1b": ["Summary: The rally against council tax rise has spread across the country with angry residents taking to the streets and mass protests, with some refusing to pay.", "The main parties agree that changes are needed in the local government financing system, but disagree on how to fix it.", "Labour says they want to help pensioners with their council tax bills by providing a £100 lumpsum to over-70s and caping some local councils' budgets, while the Liberal Democrats advocate switching to a local income tax system at the same level as seen in the US, Norway, Switzerland.", "While no decision has been made, an independent inquiry is due to report back by the end of 2005.", "The Lib Dems argue for higher allowances and a ceiling on council tax."], "tinydolphin:1.1b": [" The UK council tax (or council house rent) has seen considerable increases over the years, causing widespread dissatisfaction among pensioners.", "This year's increases have been the lowest in a decade, but they remain one of the reasons why local councils are under pressure to reform their systems and become more efficient.", "Labour has promised to retain the property-based tax (or business rates) while making reforms to make it fairer for pensioners.", "They say that some councils have become too large and overworked, with many failing to keep up with inflation.", "This year's increases are their lowest in a decade, but they acknowledge that there is still room for reform.", "The Conservatives are more cautious about increasing the number of council tax bands or other forms of local taxation, such as business rates reform.", "They argue that this would be unwise given that £1.3 billion could be saved on \"government waste\" and that households where council tax payers are over 65 should get a rebate of £340 per year.", "The Tories do not believe it is necessary to cut pensioner's bills by an average of £340 each year, as they argue that this would create more bureaucracy and could discourage people from saving for their retirement.", "The Liberal Democrats want to abolish the council tax altogether and switch to a local income tax (also known as the UK's version of the US tax system) where the highest earners would pay no tax at all.", "This would be administered locally, with the Inland Revenue taking a portion of the income of those in higher tax brackets.", "The Liberal Democrats believe that this would save at least £300 million per year.", "They also propose to create a personal allowance worth up to £5,000 for the most affluent pensioners and increase the tax-free personal allowance or £7,000 for those aged over 65.", "This would make it fairer, more efficient, and cost-effective for local councils to manage their finances."], "phi:2.7b": [" In 2003, mass protests erupted in England following a 12.9% increase in council tax.", "Pensioners' protests were widespread, with some refusing to pay the increase or even go to jail.", "The current local government finance system is \"fundamentally flawed,\" say all three main political parties, and changes need to be made.", "Labour wants to keep property-based taxation but reform it for greater fairness, while the Conservatives want to reduce pensioners' bills by cutting waste.", "The Lib Dems propose a switch to a local income tax that would save money and be fairer."], "orca-mini:3b": [" Summary: \n\nAnger at council tax rises led to mass protests in 2003, with the average English bill rising 12.9%.", "Pensioners' protests spread, with some marching or simply refusing to pay the increase.", "Labour says it wants to retain the property-based tax but reform it to make it fairer and says there is scope for councils to become more efficient.", "The party says this year's increases will be the lowest in a decade.", "The Tories have promised a reduction on bills for pensioners, who they say have been hardest hit by year-on-year increases in council tax.", "The Liberal Democrats want to do away with the council tax altogether and switch to a local income tax, which would be set locally but administered by the Inland Revenue, saving at least £300m.", "Their plan is fairer, more efficient, has already been tested abroad and offers more accountability."], "hermes3:3b": ["Council tax protests; Labour aims to reform property-based tax for fairness, efficiency; Tories propose rebate for pensioners; Liberal Democrats advocate local income tax replacement."], "stablelm-zephyr:3b": ["In 2003, there were mass protests due to an average 12.9% increase in council tax bills, causing anger among pensioners who refused to pay the increase.", "The Audit Commission found that the local government finance system was \"fundamentally flawed.\"", "All three main parties acknowledged that the system needed reform.", "Labour proposed retaining the property-based tax while making it fairer and increasing council tax bands or introducing other forms of local taxation, such as reformed business rates.", "The Conservatives pledged a reduction in pensioner bills by cutting government waste, with a maximum rebate of £500 per household for those over 65.", "The Liberal Democrats advocated eliminating the council tax altogether and switching to a local income tax similar to those implemented in other countries, claiming it would be fairer, more efficient, and offer more accountability."], "chatgpt-4o-latest": ["Council tax rises in 2003 led to mass protests, particularly among pensioners, prompting calls for reform from all major parties.", "Labour aims to retain but reform the property-based tax, improve council efficiency, and provide financial support to pensioners, with a review due in 2005.", "The Conservatives propose cutting pensioners' bills by £340 on average, funded by reducing government waste, and oppose property revaluation.", "The Liberal Democrats advocate replacing council tax with a local income tax, arguing it is fairer and more efficient, with tax-free allowances and progressive rates."], "stablelm2:1.6b": ["Angry pensioners protested against council tax increases in England after an average rise of 9%.", "Three main parties agreed that the current system needs reform, with Labour proposing property-based taxation and councils becoming more efficient.", "The Tories promised reductions for pensioners, citing £4bn savings from \"government waste\".", "The Liberal Democrats proposed a local income tax, aiming for a fairer and more efficient system without putting a ceiling on wealth.", "A report into the property-valuation issue is due by the end of 2005."], "granite3.1-dense:2b": ["In 2003, council tax rises led to protests, with pensioners refusing to pay the increases or facing jail.", "The Audit Commission found the local government finance system flawed; all major parties agree reform is necessary.", "Labour aims to retain property-based council tax but make it fairer through increased council efficiency and a £100 lump sum for over-70s, with capped budgets for some local councils.", "The Conservatives promise pensioner bill reductions of up to £340 per household by using £1.3 billion from government waste, without means testing.", "They are skeptical about revaluing homes, fearing seven million homes might move up a band.", "The Liberal Democrats advocate scrapping council tax in favor of a local income tax, with a £5,000 or £7,000 tax-free personal allowance for over-65s, and argue their plan is fairer, more efficient, and has been successfully implemented abroad."]}