{"raw_text": "Labour in constituency race row\n \n Labour's choice of a white candidate for one of the UK's most multi-racial seats proves the need for all-black short lists, says a race group.\n \n Local councillor Lyn Brown was selected for West Ham, east London, in a contest between two white and five ethnic minority women. An Operation Black Vote spokesman said they now wanted to meet Labour party chairman Ian McCartney for discussions. Mr McCartney recently announced party consultation on all-black shortlists. However, Labour has so far unable been unable to comment on the implications of the West Ham result.\n \n Ashok Vishwanathan of Operation Black Vote, which aims to increase ethnic minorities' participation in the political process and their representation, said the result again showed all-women shortlists were not effective in getting minority women selected. \"I think all-black shortlists are the only way to cut to the chase and address the lack of minority candidates,\" Mr Vishwanathan said.\n \n Last month the chairman of the Commission for Racial Equality (CRE) also called for ethnic minority shortlists in certain circumstances. A CRE spokesman said the organisation had nothing to add on the shortlist issue specifically but would be working with all the political parties to address the under-representation of ethnic minorities in Parliament. \"We will be raising it with each of the party leaders on a formal basis and helping them find the most appropriate way forward,\" the spokesman said. Ethnic minorities make up 8% of the United Kingdom population but only 2% of MPs - 13 out of 659 - are from a visible minority group. Twelve of them represent Labour, and one is a Liberal Democrat. If ethnic minorities were represented in the House of Commons in proportion to their numbers in the population, there would be 42 ethnic minority MPs.\n", "llama3.2:1b": ["Labour's selection of a white candidate for a West Ham seat despite an all-ethnic minority shortlist has sparked a controversy.", "Operation Black Vote, which advocates for increased representation of minorities in politics, says the result highlights the need for all-black lists.", "The group claims that all-women lists were ineffective in selecting minority candidates and that all-black lists are necessary to address underrepresentation."], "llama3.2:3b": ["Labour's choice of Lyn Brown as West Ham's candidate was seen by a race group as proof that all-black shortlists are needed to address the lack of minority candidates.", "An Operation Black Vote spokesman said this followed recent calls from CRE chairman for ethnic minority shortlists in certain circumstances, highlighting the disparity between UK population numbers and MP representation, with 13 out of 659 MPs being from a visible minority group."], "gemma2:2b": ["Labour's selection of a white candidate for the multi-racial West Ham seat has prompted calls from a race group for all-black shortlists as a solution to lack of representation for minority women.", "This follows the recent decision by Labour chairman Ian McCartney to consult on implementing all-black shortlists, while his party remains silent on the implications of the West Ham result.", "The need for these shortlists is being emphasized by groups like Operation Black Vote, with calls from the Commission for Racial Equality (CRE) to address underrepresentation of minorities in Parliament as well.", "Despite making up 8% of the UK population, ethnic minorities only hold 2% of MP seats."], "qwen2.5:0.5b": ["The UK's West Ham constituency, which elects local councillors, has seen its shortlist for an all-white candidate change hands multiple times over the past few months.", "Operation Black Vote, a race group aimed at increasing the participation of ethnic minorities in politics, claims that Labour's choice of White women as candidates is not effective.", "According to Operation Black Vote, \"All-black shortlists are the only way to cut to the chase and address the lack of minority candidates.\""], "qwen2.5:1.5b": ["Operation Black Vote calls for all-black shortlists; Labour party consultation on this issue but has yet to comment; CRE recommends increasing ethnic minority representation in Parliament and will work with parties to address underrepresentation."], "qwen2.5:3b": ["Labour's choice of a white candidate for West Ham, London, constituency during a contest between two white and five ethnic minority women has sparked a row.", "Operation Black Vote demands all-black shortlists citing lack of minority candidates despite Labour announcing consultations on the matter.", "Ashok Vishwanathan from Operation Black Vote argues all-black shortlists are necessary to address minority under-representation.", "The Commission for Racial Equality also advocates for their use in certain circumstances, highlighting that only 2% of UK MPs represent ethnic minorities though they make up 8%."], "opencoder:1.5b": ["The essence of this text lies in highlighting the differing views on race equality across different sectors of politics, with a focus on the specific election issue facing the UK's highest interest.", "It also outlines how the introduction of Operation Black Vote, which aims to expand the representation of minority groups, has shaped various public views and initiatives."], "smollm:1.7b": ["The summary above should preserve key ideas and details:\n\n1.", "The Labour party has chosen a white candidate for one of its seats in the UK's most multi-racial constituency.", "2.", "The Labour party is seeking to increase the representation of ethnic minorities in Parliament, which currently holds only 4% of MPs from ethnic minority backgrounds.", "3.", "A race group has called on Labour to consider all-black shortlists for certain constituencies, where there are no other candidates from ethnic minority groups.", "4.", "The CRE (Commission for Racial Equality) has not specifically addressed the issue of ethnic minority shortlists in this context, but will be working with all political parties to address underrepresentation.", "5.", "Ethnic minorities make up 8% of the UK population, but only 2% of MPs - 13 out of 659 - are from a visible minority group.", "6.", "If ethnic minorities were represented in Parliament in proportion to their numbers in the population, there would be 42 ethnic minority MPs."], "deepseek-r1:1.5b": ["Labour has chosen a white candidate in a multi-racial UK seat, demanding an all-black shortlist.", "Local councillor Lyn Brown from West Ham won against two whites and five minority women.", "Labour's chairman, Ian McCartney, announced consultation on all-black shortlists but has not commented on the result.", "Operations Black Vote's Ashok Vishwanathan noted that all-women shortlists are insufficient for minority representation and suggested an all-black approach.", "The Commission for Racial Equality (CRE) emphasized shortlists need addressing in specific circumstances but will collaborate with leaders to increase ethnic representation in Parliament, even if limited by population proportions.", "Ethnic minorities make up 8% of the UK, yet only 2% of MPs are visible minority groups, including 12 Labour and one Liberal Democrat."], "tinyllama:1.1b": ["In response to Labour's decision to nominate a white candidate for one of the UK's most multi-racial seats, race group Operation Black Vote (OBV) has called for all-black shortlists in certain circumstances.", "OBV spokeman Ashok Viswanathan highlighted that previous attempts to increase ethnic minority representation through all-black shortlists have not been successful, and suggested that the party should explore alternative methods to address this issue.", "The group will be raising the topic with each of the political parties and helping them find the most appropriate way forward.", "This comes at a time when the UK population's underrepresentation of ethnic minorities is causing concern for many minority groups, including black and minority ethnic (BME) people."], "tinydolphin:1.1b": [" The statement above discusses a West Ham constituency race where a local councillor was selected between two white candidates from different political parties.", "An Operation Black Vote group criticized this outcome for being dominated by all-white shortlists.", "The spokesman of the local council, Lyn Brown, has been chosen to represent West Ham and will face five minority women in a contest.", "Operation Black Vote is advocating for more representation of ethnic minorities in politics and urging the Labour party chairman, Ian McCartney, to consult with them before implementing all-black shortlists."], "phi:2.7b": [" The selection of Lyn Brown as Labour candidate for West Ham raises the issue of representation for ethnic minorities in British politics.", "The need for all-black shortlists has been highlighted by Operation Black Vote and a local councillor from an ethnic minority group is urging Labour to consider such measures.", "The issue was also discussed at length by the Commission for Racial Equality, which called for such measures in certain circumstances.", "Despite the under-representation of ethnic minorities in British politics, there are only 13 members of visible minority groups in Parliament."], "orca-mini:3b": [" The text discusses the Labour Party's decision to select a white candidate for an all-black short list for the constituency race row in West Ham, east London.", "The lack of minority candidates is still an issue, and Operation Black Vote wants to meet with Labour party chairman Ian McCartney to discuss the implications of the West Ham result.", "Ashok Vishwanathan of Operation Black Vote suggests that all-black shortlists are necessary to address the lack of minority candidates being selected for political positions."], "hermes3:3b": ["Labour select white candidate in multi-racial constituency, promoting call for all-black shortlists for minority candidates."], "stablelm-zephyr:3b": ["Labour selected a white candidate for West Ham, East London, prompting calls from Operation Black Vote for all-black shortlists to address underrepresentation of ethnic minorities in politics.", "Lyn Brown, a local councillor, was chosen in a race contest involving two white candidates and five minority women.", "Last month's Chairman of the Commission for Racial Equality (CRE) also urged for consideration of ethnic minority shortlists when appropriate.", "While Labour has been hesitant to comment on the implications of the West Ham result, Operation Black Vote argues that all-women shortlists are ineffective in choosing minority candidates.", "If representation reflected the UK population's proportion, there would be 42 ethnic minority MPs in the House of Commons."], "chatgpt-4o-latest": ["Labour's selection of a white candidate, Lyn Brown, for the diverse West Ham constituency has sparked calls for all-black shortlists from Operation Black Vote, which argues that all-women shortlists fail to ensure minority representation.", "The group seeks discussions with Labour chairman Ian McCartney, who recently announced consultations on the issue.", "The Commission for Racial Equality has also supported ethnic minority shortlists in some cases and plans to work with political parties to address under-representation.", "Ethnic minorities make up 8% of the UK population but only 2% of MPs, highlighting the disparity in political representation."], "stablelm2:1.6b": ["A race group urges all-black shortlists for UK Parliament due to Labour's selection of white candidate for West Ham, east London.", "The result shows that all-women shortlists are ineffective in selecting minority women.", "Last month, a CRE spokesman called for ethnic minority shortlists in certain circumstances and said they would work with political parties to address under-representation.", "Currently, 2% of MPs representing visible minority groups (ethnic minorities) in the UK Parliament."], "granite3.1-dense:2b": ["A race advocacy group, Operation Black Vote, criticizes Labour's selection of white candidate Lyn Brown for the predominantly multi-racial West Ham constituency in East London, arguing it highlights the necessity of all-black shortlists.", "This decision comes after Labour announced a consultation on implementing such lists to address the under-representation of ethnic minorities in Parliament (8% population, 2% MPs).", "Operation Black Vote's spokesman plans to meet with Labour chair Ian McCartney regarding this issue.", "The Commission for Racial Equality also endorses ethnic minority shortlists but will collaborate with political parties, including Labour, to develop strategies for enhancing representation.", "Currently, 12 out of 659 MPs are from visible minority groups, far below the proportion in the UK population (42 would be required)."]}