{"raw_text": "Kennedy predicts bigger turnout\n \n Voters' \"pent up passion\" could confound predictions of a low turnout in the coming general election, Charles Kennedy has said.\n \n The Liberal Democrat leader predicted concerns over Iraq and other international and domestic issue would express themselves during the campaign. His comments come as an inquiry looks at how best to boost voter turnouts. Ex-foreign secretary Robin Cook said people were not apathetic but fed up of \"pager politics\" and not being heard. He, like Mr Kennedy, pointed to the hundreds of thousands of people who demonstrated against plans for the Iraq war.\n \n Mr Cook, who is giving evidence to the Power inquiry into voter turnout rates, told BBC Radio 4's Today Programme it was not fair to blame the public who were \"more interested in politics than ever before\". \"They are turned off by the way we do politics in Britain. There's a message there for politicians.\" He urged politicians to avoid negative campaigning and to \"speak more from the heart\". \"We should be not so afraid to say what we stand for.\" He also criticised the cult of personality politics: \"There's far too much interest in celebrities. \"Politics are in danger of becoming another branch of the celebrity industry.\" The government has tried a number of things in an attempt to boost voter turnout, which fell to 59% in the last general election in 2001. This has included bringing in directly elected mayors to head local authorities and trialling postal voting.\n", "llama3.2:1b": ["Charles Kennedy predicts bigger turnout due to concerns over issues.", "The Liberal Democrat leader believes many voters will express themselves during the campaign, despite previous predictions of low turnout.", "Ex-foreign secretary Robin Cook agrees, saying people are fed up with \"pager politics\" and need to be heard.", "Cook urges politicians to avoid negative campaigning and speak more from their hearts."], "llama3.2:3b": ["Charles Kennedy predicts bigger turnout in the coming general election due to voters' \"pent up passion\" over international and domestic issues, such as Iraq, which he believes would express itself during the campaign, citing hundreds of thousands who demonstrated against the war.", "Ex-foreign secretary Robin Cook attributes low voter turnout not to apathy but to frustration with \"pager politics\" and politicians avoiding negative campaigning."], "gemma2:2b": ["Charles Kennedy predicts high voter turnout fueled by political issues and protests like the Iraq war opposition.", "Ex-foreign secretary Robin Cook argues that people are not apathetic but frustrated with politics, calling for more open communication and a shift away from celebrity-based campaigning.", "The Power inquiry is investigating methods to boost voter participation after turnout fell in the 2001 general election."], "qwen2.5:0.5b": ["In the upcoming general election, voters' \"pent up passion\" could lead to a higher turnout, according to Charles Kennedy, who predicts concerns over Iraq and other issues will be expressed during the campaign.", "Robin Cook, ex-foreign secretary of Prime Minister Tony Blair's government, criticizes this as a sign that people are not interested in politics as usual, suggesting they prefer not hearing their voices being heard.", "He urges politicians to avoid negative campaigning and \"speak more from the heart\" by acknowledging what they stand for and avoiding celebrity politics."], "qwen2.5:1.5b": ["Charles Kennedy predicts higher turnout due to voters' \"pent up passion\" influenced by concerns over Iraq and other issues, while Robin Cook criticizes apathy as a facade, suggesting politicians should engage more emotionally and avoid celebrity politics to boost voter participation in the upcoming election."], "qwen2.5:3b": ["Kennedy predicts higher turnout due to voters' pent-up passion regarding international and domestic issues like Iraq.", "Liberal Democrat leader Charles Kennedy believes concerns over these topics will manifest during the campaign, contrary to predictions of low turnout.", "Former Foreign Secretary Robin Cook emphasizes that people are not apathetic but frustrated by current \"pager politics\" and lack of voice, citing demonstrations against the Iraq war.", "He advises politicians to avoid negative campaigning and emphasize their stances instead of focusing on celebrity culture.", "The government has implemented measures like directly elected mayors and postal voting to boost voter turnout, which was at 59% in 2001 general election."], "opencoder:1.5b": ["The summary of the given text is: \n\nVoters' \"pent up passion\" could confound predictions of a low turnout in the coming general election, Charles Kennedy has said.", "The Liberal Democrat leader predicted concerns over Iraq and other international and domestic issue would express themselves during the campaign.", "His comments come as an inquiry looks at how best to boost voter turnouts.", "The government has tried a number of things in an attempt to boost voter turnout."], "smollm:1.7b": ["Kennedy predicts bigger turnout due to pent up passion among voters.", "He also expresses concerns over Iraq war, which could confound predictions of low turnout in the coming general election.", "Ex-foreign secretary Robin Cook said people were not apathetic but fed up with \"pager politics\" and not being heard.", "He, like Mr Kennedy, pointed to the hundreds of thousands of people who demonstrated against plans for the Iraq war."], "deepseek-r1:1.5b": ["Charles Kennedy predicts higher voter turnout as voters show pent-up passion in the coming election.", "Robin Cook critiques \"pager politics,\" pointing out people are turned off by it, and suggests politicians focus on core values to boost turnouts.", "Compared to the 2001 election where turnout was lower at 59%, strategies like elected mayors and postal voting were tried without much success."], "tinyllama:1.1b": ["Kennedy predicts bigger turnout due to pent-up passion\n\nVeteran Liberal Democrat politician Charles Kennedy stated that the upcoming general election would likely see a higher vote turnout compared to previous elections.", "He cited concerns over Iraq and other international issues as contributing factors, along with an increased appetite for change among voters.", "The party leader also called for more positive campaigning and less negative rhetoric from politicians.", "Kennedy argued that too much emphasis had been placed on personality politics, which he believed could be a liability in the election's run-up."], "tinydolphin:1.1b": [" A more concise summary: Kennedy suggests that people's pent-up passion could affect turnout during the upcoming election, predicting a higher voter turnout than current numbers suggest.", "He attributes this to the concern over Iraq and other global issues.", "Cook, a former foreign secretary who took part in demonstrations against the Iraq war, called for more communication, as people are not \"apathetic but fed-up of pager politics.\""], "phi:2.7b": [" Charles Kennedy predicts higher-than-expected voter turnout for upcoming elections, attributing it to people's pent-up passion about international and domestic issues.", "Robin Cook agrees that voter apathy is not the cause but instead blames politicians' negative campaigns and the lack of a clear message from them.", "Cook urges politicians to avoid negative campaigning and speak more from the heart, while also criticizing the cult of personality politics and the government's efforts to boost turnout, which have been less successful than they hoped."], "orca-mini:3b": [" Charles Kennedy predicts that voters' pent up passion could confound predictions of a low turnout in the coming general election, due to concerns over Iraq and other international and domestic issues.", "Robin Cook, ex-foreign secretary, agrees that people are not apathetic but fed up of \"pager politics\" and not being heard, pointing to the hundreds of thousands of people who demonstrated against plans for the Iraq war.", "Mr Cook urged politicians to avoid negative campaigning and speak more from the heart and not be afraid to say what they stand for.", "The government has tried a number of things to boost voter turnout, which fell to 59% in the last general election."], "hermes3:3b": ["Kennedy expects higher voter turnout due to pent-up passion over Iraq and other issues, potentially defying low turnout predictions.", "Liberals Cook also advocates for positive campaigning and against negative blame of apathetic public, suggesting politics should be more heart-based and less focused on celebrity culture."], "stablelm-zephyr:3b": ["Charles Kennedy predicts higher voter turnout due to people's pent-up passion for politics.", "Robin Cook, ex-foreign secretary, emphasizes that voters are not apathetic but fed up with \"pager politics\" and want to be heard.", "Both leaders urge politicians to avoid negative campaigning and speak from the heart, while also criticizing the cult of personality politics.", "Voter turnout has fallen to 59% in recent elections, prompting efforts such as directly elected mayors and trialling postal voting to boost participation."], "chatgpt-4o-latest": ["Charles Kennedy predicts higher voter turnout in the upcoming general election due to public concerns over Iraq and other issues.", "He and Robin Cook argue that people are not apathetic but frustrated with political processes.", "Cook, speaking to the Power inquiry, emphasized that voters are engaged but disillusioned with negative campaigning and personality-driven politics.", "He urged politicians to be more genuine and clear about their beliefs.", "The government has attempted to increase voter participation through measures like directly elected mayors and postal voting, following a decline in turnout to 59% in 2001."], "stablelm2:1.6b": ["Charles Kennedy predicts higher-than-normal voter turnout during the upcoming general election due to public concerns over issues such as Iraq.", "Both Liberal Democrat leader Charles Kennedy and ex-foreign secretary Robin Cook attribute demonstrations against the Iraq war to increased activism in politics.", "Despite these efforts, only 67% voter turnout was recorded in the previous general election in 2019.", "Addressing the concern of low voter turnouts, Robin Cook urges politicians to avoid negative campaigning and speak from their heart, stressing the importance of politicians standing for what they believe in.", "The government has tried several strategies, such..\n...to introduce directly elected mayors and trial postal voting, but it remains to be seen whether these efforts will be successful in increasing voter participation."], "granite3.1-dense:2b": ["Charles Kennedy, Liberal Democrat leader, anticipates increased voter turnout for the upcoming general election due to citizens' \"pent-up passion\" driven by concerns about Iraq and other global/domestic issues.", "This prediction aligns with an inquiry aimed at enhancing voter participation.", "Ex-foreign secretary Robin Cook, testifying before the Power inquiry into low turnout rates, asserted that people are not apathetic but frustrated by \"pager politics\" and feeling unheard.", "He emphasized that citizens' growing interest in politics is evident from protests against the Iraq war.", "Cook criticized negative campaigning and urged politicians to express their beliefs more authentically, avoiding celebrity-driven politics.", "The government has implemented measures such as elected mayors for local authorities and postal voting trials to boost declining turnout (59% in 2001)."]}