{"raw_text": "Iraq advice claim sparks new row\n \n The Tories say ministers must respond in Parliament to claims that the legal advice used to justify the Iraq war was drawn up at Number 10.\n \n Downing Street has denied the claims, made in a new book about the Attorney General Lord Goldsmith's advice. Lord Goldsmith also denied them, saying he was not \"leaned on\" in any way. But the Conservatives and Liberal Democrats say they want the publication of the full legal advice given by the Attorney General.\n \n The government has consistently refused to publish Lord Goldsmith's advice on the legality of the war - saying such papers have always been kept confidential.\n \n But a short statement about Lord Goldsmith's position was presented in a written parliamentary answer on 17 March 2003 - just before a crucial Commons vote on the military action. It said it was \"plain\" Iraq continued to be in material breach of UN resolution 1441. In his new book, Lawless World, Philippe Sands, a QC and international law professor, suggests the parliamentary answer was written in Downing Street. According to Mr Sands, Lord Goldsmith had warned Tony Blair in a document on 7 March 2003 that the use of force against Iraq could be illegal and that it would have been safer to seek a second UN resolution sanctioning military action.\n \n Mr Sands told Newsnight the government had prepared a legal team to be able to defend its case, in case legal action was taken against the UK over the war. On 10 March, military chiefs reportedly asked for an unequivocal statement about the legality of the war to make sure troops could be defended in a court of law. The book, being serialised in the Guardian newspaper, says on 13 March Lord Goldsmith met then Home Office Minister Lord Falconer and Downing Street adviser Baroness Morgan. \"After that Downing Street proceeded to set out his [Lord Goldsmith's] view in a parliamentary answer which was then published on 17 March,\" said Mr Sands.\n \n Tory leader Michael Howard reiterated calls for the publication of the full legal advice given by the Attorney General, warning: \"This issue will not go away.\" \"These revelations throw an intensive spotlight on to the cavalier way in which this government operates - even on an issue as important as peace and war. \"The government needs to act to restore public confidence and trust.\" Liberal Democrat foreign affairs spokesman Menzies Campbell repeated his party's calls for Lord Goldsmith's first piece of legal advice to be made public. \"The public interest, which the government claims justifies non-publication of the whole of the advice, can only be served now by the fullest disclosure.\"\n \n In a statement to Newsnight, Lord Goldsmith said: \"In my parliamentary answer on March 17 2003, I explained my genuinely held independent view, that military action was lawful under the existing Security Council resolutions. \"It was certainly not a view that I expressed as a result of being leaned on in any way, nor as I have already made clear, was it written by or at Number 10.\" The prime minister's official spokesman also rejected the claims, saying: \"The attorney general made it clear the words and the judgement were his.\" But ex-foreign secretary Robin Cook says all the advice should now be published. He said the claims suggested Parliament had only received a pr&#233;cis of Lord Goldsmith's second opinion - and that it was actually drafted in No 10. This would be wrong even if Lord Goldsmith had signed the statement, Mr Cook said, because the attorney general's advice should be an \"independent legal opinion\", not subject to \"political negotiation of this kind\".\n", "llama3.2:1b": ["The Tories say ministers must respond to claims that the Iraq war was justified by Lord Goldsmith's legal advice.", "Downing Street denies the claims and has refused to publish Lord Goldsmith's full advice.", "A parliamentary answer from 2003 suggests that Lord Goldsmith warned Tony Blair about using force against Iraq, but not that he advised him on it.", "The government wants Lord Goldsmith's first piece of advice made public, while others want all his advice to be released."], "llama3.2:3b": ["Tories claim ministers must respond to Parliament about claims Lord Goldsmith's Iraq war legal advice was drawn up at Number 10.", "Government denies the claims made in a new book, saying papers have always been kept confidential.", "Lord Goldsmith and Downing Street deny being \"leaned on\" for the advice.", "Tories and Liberal Democrats want full publication of the advice, while ex-foreign secretary Robin Cook says all advice should be published regardless of who drafted it."], "gemma2:2b": ["The Conservatives are demanding the full legal advice given by Lord Goldsmith regarding the legality of the Iraq War.", "This demand arises from claims in a new book suggesting that his parliamentary answer on the war, published shortly before a vote, was drafted at Downing Street based on earlier warnings from Lord Goldsmith himself.", "Liberal Democrats and former Foreign Secretary Robin Cook also agree that the full legal advice should be made public."], "qwen2.5:0.5b": ["The UK government has faced new accusations that it was not consulted enough on the Iraq war and its legal implications.", "The Conservatives claim Lord Goldsmith denied the use of his independent judgment, while Liberal Democrats argue for full publication.", "Downing Street denies both claims.", "The government has kept advice confidential since 2003."], "qwen2.5:1.5b": ["Conservative MPs demand publication of Attorney General's Iraq war legal advice papers, citing new book suggesting they were drawn up at No.", "10 and signed by Blair.", "Tories accuse government of withholding documents since 2003 despite initial denial.", "Lords Goldsmith and Falconer allegedly met to brief PM on war legality before parliament answer was written."], "qwen2.5:3b": ["The Tories demand Parliament response regarding claims that Iraq war legal advice was drawn up at Number 10.", "Downing Street denies these claims and says it was not \"leaned on\" for the advice given by Lord Goldsmith.", "The government has consistently refused to publish Lord Goldsmith's full legal advice, citing confidentiality.", "However, a new book suggests Lord Goldsmith warned Tony Blair in March 2003 that military action against Iraq could be illegal.", "This led some politicians to call for the publication of the Attorney General’s advice, accusing the government of operating cavalierly on issues like peace and war.", "Lord Goldsmith maintains he was not \"leaned on\" or at Number 10 when giving his opinion.", "Ex-foreign secretary Robin Cook argues all advice should be made public, suggesting Parliament only received a summary rather than the full document, which would have been wrong even if signed by Goldsmith."], "opencoder:1.5b": ["Iraqi leaders are calling on the government to publish Lord Goldsmith's full legal advice.", "The government has been reluctant to do so due to its focus on maintaining a balance between transparency and confidence in international relations.", "The use of force against Iraq, as a matter of course, is illegal, but it was not stated that the use of force would have been safer.", "The government needs to act with public trust by making full disclosure of Lord Goldsmith's advice."], "smollm:1.7b": ["The summary is:\n\nIraq advice claim sparks new row\n\nIn a new book about the Attorney General Lord Goldsmith's advice, Philippe Sands suggests that the government has consistently refused to publish Lord Goldsmith's position on the legality of the war.", "The text above summarizes this idea concisely and accurately, without explaining or justifying it further."], "deepseek-r1:1.5b": ["The Conservatives demand the publication of Goldsmith's legal advice in Parliament, arguing it was obtained at Number 10.", "However, the government refuses to publish his advice since at least 2001, and only a parliamentary answer from March 17, 2003, is available on the Guardian.", "This answer detailed that Goldsmith warned Tony Blair about legal implications, using force could be illegal, and recommended seeking second UN resolutions.", "Sands argues this exposes the government's lack of transparency and political bias, emphasizing the importance of full disclosure to restore public trust."], "tinyllama:1.1b": ["The text conveys that Iraq advice claim sparks new row in which Downing Street has denied that ministers must respond in Parliament, and the Conservatives and Liberal Democrats have stated that they want the publication of the full legal advice given by the Attorney General.", "This has resulted in a dispute between the government and the opposition regarding transparency and accountability regarding the use of military force against Iraq.", "The claims made include the legality of war as supported by the \"attack on Iraq\" being justified, with the government's defense claiming that the advice given was written by or at No 10.", "The government has claimed this was not a view leaned upon, and has denied it was drafted in Downing Street.", "All legal opinions should be published according to Robin Cook, who believes that Parliament should have been informed of all aspects of Lord Goldsmith's advice during his second opinion."], "tinydolphin:1.1b": [" The Tories have requested the publication of the full legal advice given by the Attorney General, Lord Goldsmith, sparking a new row over the legality of the Iraq war.", "Downing Street has denied these claims, made in a book about the Attorney General Lord Goldsmith.", "However, Prime Minister Tony Blair's office says they are correct.", "The book has been criticized for not revealing the advice it presents, and has led to calls for the publication of all legal advice related to international relations."], "phi:2.7b": [" The Conservative party claims that Tony Blair's legal advice on the Iraq war was produced at Number 10 Downing Street.", "Downing Street denies these claims and Lord Goldsmith himself also denies being pressured in any way.", "However, there have been calls from both the Conservatives and Liberal Democrats to make the full legal advice public.", "The government has consistently refused to release this information, citing confidentiality.", "A written parliamentary answer on 17 March 2003 stated that Iraq continued to be in material breach of UN resolution 1441.", "In his book, Lawless World, Philippe Sands suggests that Downing Street may have been involved in preparing a statement by Lord Goldsmith regarding the legality of the war, which was published shortly after he warned Tony Blair and then-Home Office Minister Lord Falconer about the illegality of using force against Iraq and the importance of seeking a second UN resolution.", "The government has set up a legal team to defend its case if necessary.", "However, Mr Sands suggests that Downing Street may have prepared the statement in response to military concerns over the legality of the war.", "This revelation has sparked calls for the full legal advice given by Lord Goldsmith to be published."], "orca-mini:3b": [" The book suggests that the parliamentary answer was written in Downing Street and was a précis of Lord Goldsmith's second opinion.", "The government has refused to publish Lord Goldsmith's full legal advice on the legality of the war, saying it is confidential.", "The Conservatives and Liberal Democrats want the publication of this advice to ensure that Parliament had a full understanding of the situation before deciding to go to war."], "hermes3:3b": ["Iraq war legal advice row sparks dispute"], "stablelm-zephyr:3b": ["The Tories and Liberal Democrats want the publication of the full legal advice given by Attorney General Lord Goldsmith regarding the Iraq war.", "The government has consistently refused to release his original legal advice, claiming it is confidential.", "A new book suggests Downing Street may have edited Lord Goldsmith's advice before publishing a shortened version in a parliamentary answer on March 17, 2003.", "Lord Goldsmith denies being \"leaned on\" by the government and attests that his views were independent.", "The prime minister's official spokesman also rejected the claims, stating the attorney general's advice should be an independent legal opinion."], "chatgpt-4o-latest": ["The Conservatives and Liberal Democrats are demanding the publication of the full legal advice given by Attorney General Lord Goldsmith on the Iraq war, following claims in a new book that the advice justifying the war was drafted at Downing Street.", "The government has denied the allegations, with Lord Goldsmith insisting he was not pressured and that his parliamentary statement on 17 March 2003 reflected his independent view that military action was lawful.", "The book by Philippe Sands suggests Lord Goldsmith initially warned Tony Blair that the war might be illegal without a second UN resolution but later issued a more definitive statement after meetings with government officials.", "Tory leader Michael Howard and Liberal Democrat spokesman Menzies Campbell argue that full disclosure is necessary to restore public trust.", "Former Foreign Secretary Robin Cook also supports publishing the full advice, warning that Parliament may have only received a summary influenced by political considerations."], "stablelm2:1.6b": ["Iraq-related advice question sparks disagreement between Tories and Liberal Democrats.", "The Conservatives and Liberal Democrats want the publication of full legal advice provided by Attorney General Lord Goldsmith before the Iraq war, despite Downing Street denying similar claims made in a new book.", "The government has consistently refused to publish Lord Goldsmith's advice on the legality of the war.", "A written parliamentary answer was presented just before a crucial Commons vote on military action, suggesting it may have been drafted in Number 10."], "granite3.1-dense:2b": ["The Conservatives and Liberal Democrats are demanding the publication of the full legal advice provided by Attorney General Lord Goldsmith on Iraq, following claims in a new book, Lawless World, by Philippe Sands.", "Sands alleges that the parliamentary statement presented before the 2003 military vote was drafted at Number 10 and did not accurately reflect Lord Goldsmith's independent view.", "Lord Goldsmith denies being \"leaned on\" to influence his stance, asserting it as his genuinely held opinion based on Security Council resolutions.", "The government has consistently maintained the confidentiality of such documents, but this controversy underscores calls for transparency and public trust in the decision-making process regarding war authorizations."]}