{"raw_text": "Manchester wins Labour conference\n \n The Labour Party will hold its 2006 autumn conference in Manchester and not Blackpool, it has been confirmed.\n \n The much trailed decision was ratified by Labour's ruling National Executive Committee in a break with the traditional choice of a seaside venue. It will be the first time since 1917 that the party has chosen Manchester to host the annual event. Blackpool will get the much smaller February spring conference instead in what will be seen as a placatory move.\n \n For years the main political parties have rotated between Blackpool, Bournemouth and Brighton. And the news the much larger annual conference is not to gather in Blackpool will be seen as a blow in the coastal resort. In 1998 the party said it would not return to Blackpool but did so in 2002. The following year Bournemouth hosted the event before the party signed a two year deal for Brighton to host the autumn conference.\n \n Colin Asplin, Blackpool Hotel Association said: \"We have tried very hard to make sure they come back to Blackpool. \"Obviously we have failed in that. I just hope Manchester can handle the crowds. \"It amazes me that the Labour Party, which is a working class party, doesn't want to come to the main working class resort in the country.\" The exact cost to Blackpool in terms of lost revenue for hotel accommodation is not yet known but it is thought that block bookings will be taken at the major Manchester hotels after the official announcement.\n", "llama3.2:1b": ["The Labour Party has chosen Manchester as its 2006 autumn conference venue instead of Blackpool, marking a break from the traditional seaside choice.", "The decision follows years of rotation between Blackpool and Bournemouth/Brighton.", "Blackpool will host the February spring conference instead.", "Colin Asplin of the Blackpool Hotel Association expressed disappointment at the news but acknowledged that Manchester can handle crowds."], "llama3.2:3b": ["The Labour Party's 2006 autumn conference has been moved from Blackpool to Manchester, a decision made by the National Executive Committee.", "This marks the first time since 1917 that Manchester will host the event.", "The smaller February spring conference in Blackpool has been confirmed as an alternative."], "gemma2:2b": ["The Labour Party has chosen Manchester to host its 2006 autumn conference, breaking with tradition and reversing a prior decision to hold the event in Blackpool.", "This change comes after years of coastal conferences held in Blackpool, Bournemouth, and Brighton.", "Blackpool will instead host a smaller spring conference.", "The move may be seen as a blow to the resort's tourism industry."], "qwen2.5:0.5b": ["The Labour Party plans to host its 2006 autumn conference in Manchester, the first time since 1917 they've chosen a location outside their traditional seaside resort in Blackpool.", "They're seeking to placate Blackpool by hosting the event instead of returning to the smaller Brighton or Bournemouth locations.", "Some attendees think it will be a blow for Blackpool's tourism industry and even question whether Labour would welcome them back to their local area, which is described as \"working class\" rather than middle-class.", "The exact cost of lost revenue from hotel accommodation in Manchester is not yet known, but some estimates suggest that block bookings could take place at major Manchester hotels after the official announcement."], "qwen2.5:1.5b": ["The Labour Party has chosen Manchester over Blackpool as its autumn conference venue, making it the first time since 1917 that the event would be held in the city center.", "This decision came after a unanimous vote by the National Executive Committee and is seen as a shift away from seaside locations traditionally favored by political parties.", "While some see this as a disappointment for Blackpool's hospitality industry, others argue it demonstrates that Manchester can accommodate large crowds more effectively than coastal resorts."], "qwen2.5:3b": ["Manchester wins Labour conference; first time since 1917.", "Conference will be held there instead of traditional seaside resort Blackpool, leading to financial losses for Blackpool in terms of lost hotel revenue.", "Conference rotation has traditionally involved venues like Blackpool, Bournemouth, and Brighton, but this decision marks a break with tradition as it's the first Labor conference since 1917 not hosted by a seaside location."], "opencoder:1.5b": ["Manchester wins Labour conference.", "The Labour Party has held its 2006 autumn conference in Manchester and not Blackpool, it has been confirmed.", "The decision was ratified by the National Executive Committee in a break with the traditional choice of a seaside venue.", "It is the first time since 1917 that the party has chosen Manchester to host the annual event.", "Blackpool received a smaller February spring conference instead due to a placatory move.", "The main political parties have rotated between Blackpool, Bournemouth and Brighton.", "The news of an annual conference not going to Blackpool is seen as a blow in the coastal resort.", "Colin Asplin, Blackpool Hotel Association said, \"We have tried very hard to make sure they come back to Blackpool.\"", "The exact cost to Blackpool was not yet known but it is thought that block bookings will be taken at major Manchester hotels after the official announcement."], "smollm:1.7b": ["The Labour Party will hold its 2006 autumn conference in Manchester and not Blackpool, it has been confirmed.", "The much-trailed decision was ratified by the National Executive Committee in a break with the traditional choice of a seaside venue.", "It will be the first time since 1917 that the party has chosen Manchester to host the annual event.", "Blackpool will get the much smaller February spring conference instead in what will be seen as a placatory move.", "The Labour Party will hold its 2006 autumn conference in Manchester and not Blackpool, it has been confirmed.", "The much-trailed decision was ratified by the National Executive Committee in a break with the traditional choice of a seaside venue.", "It will be the first time since 1917 that the party has chosen Manchester to host the annual event.", "Blackpool will get the much smaller February spring conference instead in what will be seen as a placatory move.", "The Labour Party will hold its 2006 autumn conference in Manchester and not Blackpool, it has been confirmed.", "The much-trailed decision was ratified by the National Executive Committee in a break with the traditional choice of a seaside venue.", "It will be the first time since 1917 that the party has chosen Manchester to host the annual event.", "Blackpool will get the much smaller February spring conference instead in what will be seen as a placatory move.", "The Labour Party will hold its 2006 autumn conference in Manchester and not Blackpool, it has been confirmed.", "The much-trailed decision was ratified by the National Executive Committee in a break with the traditional choice of a seaside venue.", "It will be the first time since 1917 that the party has chosen Manchester to host the annual event.", "Blackpool will get the much smaller February spring conference instead in what will be seen as a placatory move.", "The Labour Party will hold its 2006 autumn conference in Manchester and not Blackpool, it has been confirmed.", "The much-trailed decision was ratified by the National Executive Committee in a break with the traditional choice of a seaside venue.", "It will be the first time since 1917 that the party has chosen Manchester to host the annual event.", "Blackpool will get the much smaller February spring conference instead in what will be seen as a placatory move.", "The Labour Party will hold its 2006 autumn conference in Manchester and not Blackpool, it has been confirmed.", "The much-trailed decision was ratified by the National Executive Committee in a break with the traditional choice of a seaside venue.", "It will be the first time since 1917 that the party has chosen Manchester to host the annual event.", "Blackpool will get the much smaller February spring conference instead in what will be seen as a placatory move."], "deepseek-r1:1.5b": ["Manchester will host the Labour Party's autumn conference in Manchester, as opposed to their previous hosting of a large conference in Blackpool since 1917.", "The £250 million cost for block bookings at major Manchester hotels is expected due to the switch, with Colin Asplin hoping Manchester can handle the crowds."], "tinyllama:1.1b": ["Manchester wins Labour conference after the party opts to move away from the traditional Blackpool venue, following a break with convention since 1917.", "The main political parties have rotated between different coastal resorts over the years.", "However, in 2006 the Labour Party chose Manchester as the site for its annual autumn conference, despite the smaller choice of venues offered by Blackpool and Bournemouth.", "Despite this move to a larger, less popular location, the party hopes to attract more attendees in future conferences.", "The event's exact cost to Blackpool is not yet known but hotel accommodation has been threatened due to the potential loss of business for those who do book rooms in Manchester."], "tinydolphin:1.1b": [" Manchester won Labour conference, but not Blackpool."], "phi:2.7b": [" Labour Party's 2006 autumn conference will take place in Manchester, instead of Blackpool.", "It has been confirmed by Labour' ruling National Executive Committee and this move will be seen as a blow to Blackpool, which is usually chosen for the annual event.", "For years, the main political parties have rotated between three coastal resorts - Blackpool, Bournemouth and Brighton.", "In 1998, the party said it would not return to Blackpool but did so in 2002.", "The following year, Bournemouth hosted the event before the party signed a two-year deal for Brighton to host the autumn conference.", "Colin Asplin, a hotel association representative from Blackpool, expressed his disappointment at Labour's decision and hopes that Manchester can handle the crowds."], "orca-mini:3b": [" The Labour Party will hold its 2006 autumn conference in Manchester instead of Blackpool, breaking with tradition and a move that will be seen as a blow to the coastal resort."], "hermes3:3b": ["Manchester to host Labour conference (2006), breaking tradition with Blackpool choice."], "stablelm-zephyr:3b": ["The Labour Party will hold its 2006 autumn conference in Manchester, breaking with the traditional seaside venue of Blackpool.", "This decision marks the first time since 1917 that the party has chosen Manchester for the annual event.", "In 1998, the party stated it would not return to Blackpool; instead, Bournemouth hosted the event before the party signed a two-year deal for Brighton to host the autumn conference.", "While the exact cost to Blackpool in terms of lost revenue for hotel accommodations is not known, it is expected that major Manchester hotels will take block bookings after the official announcement."], "chatgpt-4o-latest": ["The Labour Party will hold its 2006 autumn conference in Manchester instead of Blackpool, marking the first time since 1917 that Manchester will host the event.", "This decision, confirmed by Labour's National Executive Committee, breaks with the tradition of choosing a seaside venue.", "Blackpool will instead host the smaller February spring conference, a move seen as conciliatory.", "The decision is a blow to Blackpool, which has historically hosted major political conferences.", "Local business representatives expressed disappointment, citing potential revenue losses, while questioning whether Manchester can accommodate the large crowds."], "stablelm2:1.6b": ["The Labour Party will hold its autumn conference in Manchester, a change from their traditional choice of Blackpool.", "This marks the first time since 1974 that the party hasn't chosen Blackpool as host, with Blackpool receiving a much smaller February spring conference instead.", "Colin Asplin of the Blackpool Hotel Association expresses disappointment over this decision, but hopes Manchester can handle the crowds.", "The exact cost to Blackpool in terms of lost revenue for hotel accommodations is still unknown."], "granite3.1-dense:2b": ["Manchester, not Blackpool, will host the 2006 Labour Party conference, marking the first time since 1917 and a departure from the traditional coastal venues (Blackpool, Bournemouth, Brighton).", "This shift is due to a decision by the National Executive Committee.", "Blackpool, anticipating this, had made efforts to retain the annual conference but was unsuccessful.", "The exact financial impact on Blackpool from lost revenue for hotel accommodation remains undisclosed."]}