{"raw_text": "Milburn defends poster campaign\n \n Labour's election chief Alan Milburn has defended his party's campaign posters amid Tory claims the ads were nothing short of \"sly anti-Semitism\".\n \n Mr Milburn said he appreciated people's concerns, but insisted that \"what they were was anti-Tory\" and \"not in any way, shape or form anti-Semitic\". He was responding to Tory spokesman Julian Lewis who said the ads were part of a wider trend of smearing the party. Labour has withdrawn two controversial posters and launched four new designs.\n \n A row was sparked after the party published posters appearing to depict Michael Howard, who is Jewish, as Fagin, and as a flying pig, amid claims they were anti-Semitic. The posters were labelled a \"big misjudgement\" by the Conservatives who said Labour's \"first shot in the election has badly backfired\".\n \n The posters were among a series of ideas shown to Labour members, who were asked to vote on their favourite. Labour has taken them off its website, saying members preferred other posters. The party's four new designs, launched on Tuesday, steer clear of the Fagin or flying pig images, but make clear that Labour is sticking to its strategy of targeting the Tory leader personally, with reminders of his record in office.\n \n The posters were among a series of ideas shown to Labour members, who have been asked to choose which one should be used ahead of the election. In the Commons, Tory spokesman Mr Lewis suggested the posters were part of a wider trend and reminded MPs that Labour chairman Ian McCartney last year described shadow chancellor Oliver Letwin as a \"21st Century Fagin\".\n \n \"Given the outrage that that smear caused then, how could you have thought anything other than the fact that what you were doing in reviving it in your poster advertisements was nothing more and nothing less than a calculated campaign of sly anti-Semitism?\" Mr Milburn replied that they were not anti-Semitic. \"What they were was anti-Tory and I make no apologies at all for making clear to the British public exactly what the Conservative plans would mean,\" he said. \"I fully understand and indeed respect the views of those who have concerns about any poster designs that have appeared on the Labour Party website.\" The Fagin and pigs might fly posters were taken off Labour's website on Monday after supporters voted for their favourite poster featuring Mr Howard and shadow chancellor Oliver Letwin holding a blackboard reading 2+2=5. A Labour spokesman later said their removal from the party's website was not affected by the row.\n", "llama3.2:1b": ["Labour Party chief Alan Milburn defends campaign posters amid Tory claims they are anti-Semitic, saying the ads were part of a broader strategy to target the Conservative leader.", "The party has withdrawn two controversial posters and launched four new designs that avoid images deemed offensive."], "llama3.2:3b": ["Labour's election campaign posters, which included images of Michael Howard as Fagin and a flying pig, were defended by party chief Alan Milburn as \"anti-Tory\" and not anti-Semitic, sparking claims they were part of a wider trend of smearing Labour.", "The posters were taken down from the party's website after Conservative criticism, but new designs have been launched featuring Labour's target on Tory leader's record in office."], "gemma2:2b": ["Alan Milburn defends Labour campaign posters that depicted Michael Howard as Fagin, claiming they were anti-Tory and not anti-Semitic.", "Tory MP Julian Lewis accused Labour of a \"calculated campaign of sly anti-Semitism\" while referencing Ian McCartney's previous derogatory remark about Oliver Letwin.", "Labour has withdrawn two controversial posters and launched four new designs focused on targeting the Conservatives."], "qwen2.5:0.5b": ["Here is the summary in plain text:\n\nLabour leader Alan Milburn defends his election campaign posters amid claims they're anti-Semitic, responding to Tory media statements that the ads were part of a wider smear against the party.", "The campaign posters appeared to depict Michael Howard as Fagin and flying pigs, with Tory spokespeople accusing Labour of being \"anti-Tory\" and \"anti-Semitic.\"", "They have launched new designs featuring Labour's leader personally and are sticking to their strategy of targeting his record in office."], "qwen2.5:1.5b": ["Labour chief Alan Milburn defends his party's campaign posters, saying they are anti-Tory rather than anti-Semitic after Tory claims.", "The original controversial posters featuring Michael Howard and Oliver Letwin were withdrawn but replaced with four new designs emphasizing Labour's stance on its leader's record."], "qwen2.5:3b": ["Labour's election chief Alan Milburn has defended his party's controversial campaign posters, which depicted Michael Howard as Fagin and a flying pig, amid Tory claims of \"sly anti-Semitism.\"", "Milburn insisted these ads were anti-Tory rather than anti-Semitic.", "After Labour withdrew two controversial posters and launched four new designs, a row was sparked over their depictions of Howard.", "The new designs avoid the specific images but stress targeting Tory leader personally with reminders of his record in office.", "MPs noted that Labour's strategy aligns with previous comments from party members about Labour shadow chancellor Oliver Letwin being described as a \"21st Century Fagin.\"", "Milburn argued that these ads were not anti-Semitic, stating they made clear what the Conservative plans would mean to voters."], "opencoder:1.5b": ["Milburn defends the poster campaign in Britain.", "Alan Milburn has defended his party's posters, against Tories' claims that the ads were nothing more than \"sly anti-Semitic\".", "Mr Milburn appreciated his concerns but insisted on \"what they were was anti-Tory\" and not anti-Semitic.", "He responded to Tories' spokesman Julian Lewis who said the ads were part of a wider trend of smearing the party.", "Labour has withdrawn two controversial posters and launched four new designs to fight the backfires caused by smear campaigns.", "The row sparked after the party published posters illustrating a Jewish actor, Michael Howard, as Fagin or flying pig images.", "The posters had been labelled as \"big misjudgement\" by Conservatives.", "The party's designs aimed to target the Tory leader personally with reminders of his record in office.", "In the Commons, Tories'Mr Lewis suggested the posters were part of a wider trend and urged MPs that Labour is sticking to its strategy of targeting the Tory leader personally.", "The posters were among a series of ideas shown to Labour members, who have been asked to vote on their favourite.", "The party's four new designs, launched on Tuesday, steer clear of the Fagin or flying pig images but retain images of Labour as a politician who has a history of backing the First Trumpet in office.", "In the event of supporters voting for one of the posters featuring Mr Howard and shadow chancellor Oliver Letwin holding a blackboard reading 2+2=5, the party's website remained unchanged.", "The Fagin and pigs might fly posters were also taken off Labour's website on Monday after supporters voted for their favourite poster featuring Mr Howard and shadow chancellor Letwin holding a blackboard reading 2+2=5."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details:\n\n1.", "Milburn defends Labour campaign posters\n2.", "Labour's election chief Alan Milburn has defended his party's campaign posters amid Tory claims the ads were nothing short of \"sly anti-Semitism\".", "3.", "Mr Milburn said he appreciated people's concerns, but insisted that what they were was anti-Tory and not in any way, shape or form anti-Semitic.", "4.", "Labour has withdrawn two controversial posters and launched four new designs.", "5.", "A row was sparked after the party published posters appearing to depict Michael Howard as Fagin, and as a flying pig, amid claims they were anti-Semitic.", "6.", "The posters were labelled a \"big misjudgement\" by the Conservatives who said Labour's \"first shot in the election has badly backfired\".", "7.", "Labour has taken them off its website, saying members preferred other posters.", "8.", "The party's four new designs steer clear of the Fagin or flying pig images, but make clear that Labour is sticking to its strategy of targeting the Tory leader personally, with reminders of his record in office."], "deepseek-r1:1.5b": ["Milburn defends his campaign posters against Tory claims of \"sly anti-Semitism.\"", "He acknowledges concerns but insists the ads were anti-Tory and not Jewish, responding to Julian Lewis's criticism.", "Labour has withdrawn two controversial posters and introduced four new designs to avoid controversy.", "A row began after some posters depicted Michael Howard as Fagin and a flying pig, labeled by Conservatives as misjudgments.", "The party now uses their own ideas for posters to choose one before the election."], "tinyllama:1.1b": ["Milburn defends poster campaign with Torie concerns\nLabour's election chief Alan Milburn has defended his party's campaign poster designs after criticisms from Conservative Party leader Michael Howard and others who called them a \"big misjudgment.\"", "Milburn reiterated that Labour's designs were not anti-Semitic, but the Conservatives responded by pulling two controversial posters and launching four new designs.", "The party has removed the Faigen and piigs may fly ads from its website in response to Torie critics.", "Milburn insisted that the poster campaign was targeting Labour leader Tony Blair personally, with reminders of his record in office."], "tinydolphin:1.1b": [" The article discusses Milburn, the UK Labour Party's poster campaign chief, who defends his campaign posters amidst Tory claims of sly anti-Semitism.", "According to Mr. Milburn, the ads were not anti-Tory and were part of a wider trend of smearing the party.", "However, he acknowledged that the concerns were valid, so he responded by withdrawing two controversial posters and launching four new designs.", "The row has sparked concern over potential misrepresentation in the election process."], "phi:2.7b": [" Labour's election chief Alan Milburn defended his party's controversial posters, stating that they were anti-Tory and not anti-Semitic.", "The Conservatives accused Labour of smearing them with Fagin and pig images, but Labour members voted for other designs.", "Mr Milburn apologized for any concerns about the posters' content and stated that he understood people's views.", "The Figgleworth pigs poster was removed from the website after supporters voted for a new design featuring Labour leader Ed Miliband."], "orca-mini:3b": [" The text discusses Alan Milburn's defense of Labour's campaign posters, which sparked controversy for featuring Michael Howard as Fagin and a flying pig.", "Milburn acknowledges concerns about the ads but insists they were anti-Tory and not anti-Semitic.", "The Conservatives accused Labour of smearing them with the ads, and Labour took the posters off their website after members preferred another design."], "hermes3:3b": ["Alan Milburn defends Labour's anti-Tory campaign posters against claims they were anti-Semitic, after two controversial ones were removed and replaced with new designs."], "stablelm-zephyr:3b": ["Labour's election chief, Alan Milburn, defends the party's campaign posters amid Tory accusations of \"sly anti-Semitism.\"", "The posters were removed from the website after Labour members voted for a different design featuring Michael Howard and shadow chancellor Oliver Letwin.", "Two previous posters, depicting Michael Howard as Fagin and a flying pig, have been labelled as anti-Semitic by Conservatives who claim they were part of a wider trend of smearing the party."], "chatgpt-4o-latest": ["Labour's election chief Alan Milburn defended the party's campaign posters against Tory accusations of \"sly anti-Semitism,\" insisting they were anti-Tory, not anti-Semitic.", "The controversy arose after Labour published posters depicting Michael Howard, who is Jewish, as Fagin and a flying pig.", "The Conservatives called the posters a \"big misjudgement\" and part of a wider smear campaign.", "Labour withdrew the controversial posters and replaced them with four new designs that continued to target Howard but avoided the disputed imagery.", "Tory spokesman Julian Lewis linked the posters to past remarks by Labour chairman Ian McCartney, who had compared shadow chancellor Oliver Letwin to Fagin.", "Milburn rejected the accusations, stating the posters aimed to highlight Conservative policies.", "Labour removed the contentious posters from its website after party members voted for a different design, but a spokesman said the decision was unrelated to the controversy."], "stablelm2:1.6b": ["Labour election chief Alan Milburn defends campaign posters, denying accusations of anti-Semitic content despite backlash.", "Milburn says the ads depict \"anti-Tory\" and not anti-Semite sentiments.", "Party withdraws two posters, launches four new designs that avoid images like Fagin or flying pig.", "The controversy started when Labour published posters depicting Howard as a Jew, with other claims of smearing the party."], "granite3.1-dense:2b": ["Labour's election chief, Alan Milburn, defended his party's controversial campaign posters against accusations of anti-Semitism.", "The posters, featuring Michael Howard and shadow chancellor Oliver Letwin as Fagin and a flying pig, respectively, were removed from the Labour website following backlash.", "Milburn asserted that these designs were merely anti-Tory, not anti-Semitic, and emphasized Labour's intention to highlight Conservative policies negatively.", "The party launched four new posters as replacements, focusing on personalizing Howard's record in office without resorting to the controversial images.", "Tory spokesman Julian Lewis criticized the initial poster series as part of a broader trend of sly anti-Semitism, referencing Labour chairman Ian McCartney's past \"21st Century Fagin\" comment about Letwin.", "Milburn maintained that Labour was merely targeting Conservative plans and had no intention of promoting anti-Semitic sentiments."]}