{"raw_text": "Campaign 'cold calls' questioned\n \n Labour and the Conservatives are still telephoning the millions of people who have signed up to make sure they do not get marketing \"cold calls\".\n \n The parties say they can stick to the rules by ensuring that their calls are not marketing - for instance by asking about people's voting intentions. The Lib Dems are asking the watchdog overseeing the rules to stop the calls. The information commissioner's office says surveys are allowed but people had to be told if personal data was kept. Telephone call centres are expected to be used as never before by all the three major parties in the run-up to the general election.\n \n But seven million telephone numbers are on the Telephone Preference Service (TPS) lists, which ban unsolicited sales and marketing calls. Both schemes are run by the Direct Marketing Association and backed by EU directives on privacy and electronic communications.\n \n The rules on marketing calls apply as much to politicians as to private sector companies. But that does not mean Labour and the Tories are not calling people signed up to the TPS. A Labour Party spokesman told the BBC News website the party avoided those on TPS lists when telephoning people about membership or fundraising. But that did not happen for \"voter identification\" calls. \"When we ask which party they will vote for, that is not marketing and we have very clear legal advice that it is not,\" he said. \"So it is not covered by the Telephone Preference Service.\"\n \n He said the party always asked people if they would be happy to be contacted again and if they said no, they were not rung again. A Conservative spokeswoman said the party stuck to the rules when it rang TPS subscribers. She said: \"We do apply TPS but in line with the law. We would not do things that are not allowed in the law.\" Assistant information commissioner Phil Jones said it was classed as marketing if political parties telephoned people to encourage them to vote for them. But \"classic market research\", such as a poll of voter intentions, did not constitute direct marketing, he said. \"If a party is calling someone who is registered on TPS and records their voting intention with a view to using this information in the future, this should be clear to the voter concerned,\" said Mr Jones. \"If a party rings a person who is registered on TPS to ask about their voting intention and goes on to encourage that voter to support them, the party may well be in breach of the regulations. \"In summary, whether a party calling TPS registered voters to check their voting intentions will breach regulations will depend on the script used and whether the script is followed.\" Mr Jones said the watchdog received \"very few complaints\" on the issue.\n \n Earlier, Lib Dem chairman Matthew Taylor wrote to the watchdog saying: \"The advice we have received on several previous occasions is that such phone calls are illegal.\" He says evidence from local Lib Dem parties around the country suggests there are \"significant\" numbers of such calls. \"I hope you can therefore take swift and efficient action to ensure that this ceases,\" he tells the commissioner. Mr Taylor argues there should be new guidelines so all parties can act in the same way if the watchdog believes the rules allow parties to ring TPS numbers about voting intentions and later urge those people to vote for them.\n", "llama3.2:1b": ["Labour and Conservative parties are still receiving millions of calls from volunteers on behalf of other parties, despite a ban on unsolicited sales and marketing calls.", "The Telephone Preference Service lists prohibit such calls.", "Labour is arguing that calling voters who have signed up on TPS can be considered \"voter identification\" and therefore not covered by the rules.", "However, the Information Commissioner's Office says this would require explicit consent from each caller.", "The parties are expected to stick to the rules when making these calls, but there has been criticism of their approach.", "The Lib Dem chairman Matthew Taylor is urging the watchdog to update guidelines on who can make such calls and to take swift action against those that breach the regulations."], "llama3.2:3b": ["Labour, Conservatives and Lib Dems make cold calls despite marketing \"cold call\" rules, with seven million phone numbers on do-not-call lists; parties say their calls are not marketing as they ask about voting intentions; watchdog warns that some calls may breach regulations if script is used to encourage voter support."], "gemma2:2b": ["Political parties are using the Telephone Preference Service (TPS) to contact voters, even though some of these calls fall under the regulations related to marketing.", "The parties argue that asking about voter preferences is not considered direct marketing by their legal team and is therefore allowed.", "However, the Information Commissioner's Office (ICO) says otherwise if a party uses TPS numbers to encourage someone to vote for them after they are asked about their intentions.", "The Liberal Democrats believe these calls should be stopped and are calling for new guidelines to ensure all parties follow similar protocols."], "qwen2.5:0.5b": ["Labour and the Conservatives are still questioning the legality of marketing calls against registered voters, particularly on the Labour Party's TPS list.", "The party avoids such calls when calling registered voters about their voting intentions and votes.", "The watchdog is investigating whether these phone calls violate advertising regulations."], "qwen2.5:1.5b": ["Labour and Conservatives still call millions of TPS-listed voters who have signed up to avoid marketing calls, despite legal advice that such practices are not covered by the Telephone Preference Service (TPS) rules.", "The Lib Dems are requesting that the watchdog stop these calls."], "qwen2.5:3b": ["Labour and Conservatives are both making \"cold calls\" on millions of voters who have signed up to avoid marketing, with Labour denying it is marketing by asking about voting intentions while Tories say they stick to the rules.", "The TPS lists seven million numbers banned from unsolicited sales or marketing, but parties argue such calls should be allowed for voter identification purposes.", "Calls to TPS subscribers are deemed marketing if used to encourage people to vote for them, though classic market research does not constitute direct marketing.", "While information commissioner Phil Jones said there were few complaints on the issue, Lib Dem chairman Matthew Taylor urged swift action after receiving evidence of illegal calls."], "opencoder:1.5b": ["The text provided is a summary of an initial campaign questioning the UK's telephony policies, with the aim of preventing future abuses related to marketing \"cold calls\".", "It details key points including but not limited to the parties' stance on rules, the use of telephone preference service (TPS) and information Commissioner's Office's guidelines.", "The summary attempts to preserve key ideas and details while excluding reasoning processes and explanations."], "smollm:1.7b": ["The campaign 'cold calls' questioned Labour and the Conservatives' ability to stick to the rules by ensuring that their calls are not marketing, as they were asked about people's voting intentions.", "The parties said they can stop calling people who have signed up to be contacted if they do not want them to get cold calls.", "The Telephone Preference Service (TPS) is a law that bans unsolicited sales and marketing calls.", "Both the Labour Party and the TPS are expected to follow the rules by ensuring that their calls are not marketing, but seven million telephone numbers on the TPS lists are banned from telephoning people about membership or fundraising.", "The parties said they always asked if people would be happy to be called again and if they said no, they were not running a \"marketing\" call.", "A Conservative spokeswoman told the BBC News website that the party did not do this when it rang TPS subscribers.", "She said: \"We do apply TPS but in line with the law.", "We would not do things that are not allowed in the law.\"", "The assistant information commissioner Phil Jones said it was classed as marketing if political parties telephoned people to encourage them to vote for them.", "But \"classic market research\", such as a poll of voter intentions, did not constitute direct marketing, he said.", "If a party called TPS subscribers to ask about their voting intention and went on to encourage those voters to support them, the party may well be in breach of the regulations.", "In summary, whether a party calling TPS registered voters to check their voting intentions will breach regulations will depend on the script used and whether the script is followed.", "Mr Taylor wrote to the watchdog earlier this week saying that evidence from local Lib Dem parties around the country suggests there are \"significant\" numbers of such calls.", "He argues there should be new guidelines so all parties can act in the same way if the watchdog believes the rules allow parties to ring TPS numbers about voting intentions and later urge those people to vote for them."], "deepseek-r1:1.5b": ["Labour and the Conservatives continue to call millions of people with \"cold calls\" designed to ensure they do not receive marketing attempts.", "The Lib Dems oppose this as it may infringe on their privacy rights.", "Both Labour and the Conservatives rely on the Direct Marketing Association for their marketing rules, supported by EU directives on privacy.", "These rules apply to both politicians and private companies but don't prevent parties from calling TPS registered voters about voting intentions or voter identification.", "Private companies must ensure their calls aren't marketing, and parties often stick strictly to legal guidelines without further exemptions.", "The watchdog has few complaints regarding such calls, though a new framework might be needed for consistency across all parties."], "tinyllama:1.1b": ["The Labour and Conservative parties are still making cold calls, but this time they are not making marketing calls as required by European directives.", "The party speakers insist that they do not call TPS subscribers for \"vote identification\" calls and only contact people who have given explicit consent.", "However, the information commissioner has stated that classified research cannot be considered direct marketing, even if a poll is in the works.", "Under the EU's Directive on Privacy and Electronic Communications, parties are allowed to call TPS subscribers for marketing purposes but must ensure that personal data is kept until the next election.", "However, party speakers insist this does not apply when asking about vote intention or using data for political purposes in future campaigns."], "tinydolphin:1.1b": [" The information commissioner's office (ICO) is reviewing whether political parties should be allowed to call voters on Telephone Preference Service (TPS) lists without their explicit consent, according to a report from the BBC News website.", "According to the ICO, telephone calls to people who have signed up to vote in the run-up to the general election are allowed under certain circumstances.", "However, seven million TPS numbers are on the list and both the Labour and Conservative parties have been using them for campaigning purposes."], "phi:2.7b": [" The Labour and Conservative parties are still making marketing calls to registered voters, including asking about their voting intention, which is considered direct marketing by the information commissioner's office.", "The Lib Dems are calling for new guidelines to ensure all political parties follow the rules and avoid violating privacy laws.", "Surveys on phone are allowed under EU directives but must be clearly informed that personal data will be kept."], "orca-mini:3b": [" The text questions whether it is legal for Labour and the Conservatives to make cold calls to people signed up to the Telephone Preference Service (TPS) list to ask about their voting intentions, as the parties are supposed to stick to the rules by ensuring that their calls are not marketing.", "However, the information commissioner's office says surveys are allowed but people had to be told if personal data was kept, and the parties argue they are following the law.", "The Labour Party spokesman says they avoid those on TPS lists when telephoning people about membership or fundraising, but this does not happen for \"voter identification\" calls.", "The Conservative spokeswoman says they stick to the rules when it rings TPS subscribers."], "hermes3:3b": ["Labour and Conservatives questioning calling people on TPS lists for 'voter identification' calls, despite them being allowed according to information commissioner's office.", "Parties argue they're not marketing as long as asking voters about their political preferences."], "stablelm-zephyr:3b": ["Labour and Conservatives continue making \"cold calls\" to people who have signed up to avoid marketing \"cold calls\", claiming their calls are not marketing since they ask about voting intentions.", "The Lib Dems want the information commissioner's office watchdog to stop these calls, as personal data usage must be clearly disclosed.", "Seven million phone numbers are on the Telephone Preference Service list banning unsolicited sales and marketing calls, applied by all three major parties before the general election.", "However, a Labour Party spokesman says they do not cover \"voter identification\" calls asking about voting intentions.", "The watchdog is receiving few complaints on this issue."], "chatgpt-4o-latest": ["Labour and the Conservatives continue to call people registered with the Telephone Preference Service (TPS), which is meant to block unsolicited marketing calls, by classifying their calls as voter identification rather than marketing.", "The Liberal Democrats have asked the information watchdog to stop these calls.", "The information commissioner's office states that surveys are allowed but must disclose if personal data is retained.", "Labour and the Conservatives claim they follow the law, with Labour avoiding TPS numbers for fundraising but not for voter identification.", "The Conservatives assert they comply with regulations.", "The watchdog clarifies that polling voter intentions is not marketing, but encouraging votes during such calls may breach rules.", "Lib Dem chairman Matthew Taylor argues these calls are illegal and urges the watchdog to enforce stricter guidelines to ensure all parties follow the same rules."], "stablelm2:1.6b": ["Labour and Conservatives are making \"cold calls\" to millions of sign-up recipients, but they assert that these calls are not marketing by using information on voter preferences.", "The Lib Dems ask the watchdog overseeing the rules to halt the calls, while the Telephone Preference Service bans unsolicited sales and marketing calls.", "Both schemes, run by the Direct Marketing Association backed by EU directives on privacy and electronic communications, apply to politicians as well.", "A ruling says that political parties must obtain explicit consent before contacting TPS subscribers.", "However, there is some ambiguity regarding whether or not these rules cover \"voter identification\" calls.", "Nonetheless, it's implied that a party might breach the regulations if they record someone's voting intention without explicit permission, and if they later use this information for future activities.", "As of now, the watchdog has received few complaints about these issues, but there are indications of significant numbers of such calls from local Lib Dem parties around the country."], "granite3.1-dense:2b": ["Major political parties, including Labour, Conservatives, and Liberal Democrats, are engaging in telephone calls to registered voters on the Telephone Preference Service (TPS) lists, despite the rules prohibiting unsolicited sales and marketing calls.", "These calls aim to gather voting intentions, which parties claim is not considered marketing under EU privacy directives.", "However, the information commissioner's office disagrees, stating that such calls are indeed marketing if they encourage voters to support a specific party.", "The Lib Dems argue that these calls likely violate regulations and request new guidelines to prevent them.", "The watchdog has received minimal complaints on this issue but is expected to take action based on the evidence from local parties."]}