{"raw_text": "Teenagers to be allowed to be MPs\n \n Teenagers will be able to become MPs under plans unveiled by ministers.\n \n In a written statement, Constitutional Affairs Minister Christopher Leslie said the current minimum age of 21 for an MP would be reduced to 18. The proposals follow a recommendation last year by elections watchdog the Electoral Commission. \"The government intends to legislate, when parliamentary time allows, to lower the age,\" said Mr Leslie, who was elected in 1997 at the age of 24. Even if the move does go ahead it is unlikely it will be in place before the next general election, widely predicted for May.\n \n The announcement from Mr Leslie - who was elected in 1997 in a formerly safe Tory seat - prompted calls for a lowering of the voting age to 16. The Votes at 16 alliance said it was a good thing to \"engage people\" by lowering the candidacy age but argued lowering the voting age would be much more effective. \"Candidacy affects only politicians. The voting age affects millions of younger people,\" said spokesman Alex Folkes. \"We would hope that the government will table a bill that is broad enough to allow for amendments to be brought to test support for a reduction in the voting age.\"\n \n Currently candidates in both local and national votes must be 21 while the voting age is 18. That is because the age of majority was reduced to 18 in 1969 but laws dating from 1695 which determine the current voting age stayed in place. Irish republican Bernadette Devlin was one of just a handful of 21-year-olds elected to Parliament in the 20th century winning a seat in 1969. But the youngest is understood to have been Tory Edward Turnour, who won the 1904 Horsham by-election aged 21 and 144 days and served in Parliament for 47 continuous years. Last April's report by the Electoral Commission said there was no strong argument for leaving the age for standing for election at 21. The commission found the most common approach around the world is for the voting age to be the same as the candidacy age.\n", "llama3.2:1b": ["Teenagers will be allowed to become MPs under plans unveiled by ministers, reducing their minimum age from 21 to 18 following a recommendation by elections watchdog the Electoral Commission last year.", "The move is expected to be introduced when parliamentary time allows, and may not happen before the next general election in May."], "llama3.2:3b": ["Teenagers will be allowed to become MPs under plans that reduce the current minimum age of 21 to 18, following a recommendation by the Electoral Commission last year."], "gemma2:2b": ["Teenagers will be allowed to run for office and become MPs under new legislation.", "The minimum age requirement will be lowered from 21 to 18.", "This proposal follows a recommendation by the Electoral Commission.", "While it may not take effect before the next general election, lowering the candidate age is seen as a positive step for engagement in politics.", "However, some groups advocate for a reduction in the voting age as well, arguing that changes affecting voters should be broader than just candidacy."], "qwen2.5:0.5b": ["Teenagers will be allowed to become MPs under new plans from the Constitutional Affairs Minister.", "The proposal states that the minimum age of an MP would be reduced to 18, following a recommendation made by the Electoral Commission last year.", "While it's unlikely that this change will occur before the next general election, calls for lowering the voting age have been made in various political organizations."], "qwen2.5:1.5b": ["The UK government has unveiled plans to lower the minimum age requirement for becoming an MP from 21 to 18, citing concerns about engaging younger people in politics.", "This change would likely not come into effect before the next general election scheduled for May.", "Calls have been made for further lowering of the voting age to 16."], "qwen2.5:3b": ["Teenagers will be allowed to become MPs under plans announced by ministers, reducing the current minimum age of 21.", "This follows a recommendation from the Electoral Commission last year.", "If implemented, it would likely not take effect before the next general election.", "Calls have been made for lowering both candidacy and voting ages.", "Currently, candidates must be 21 while voters are 18.", "The move is supported by some groups but opponents argue that reducing the voting age would be more effective.", "Currently, Irish republican Bernadette Devlin was one of only a few 21-year-olds elected to Parliament in the 20th century, and the most recent example of someone under 21 being elected occurred in 1904.", "The Electoral Commission found that the majority of countries set the same candidacy and voting age."], "opencoder:1.5b": ["The text provides a brief overview of a debate between different ideas on whether it would be possible to allow teenagers to become Members of a public policy board, while also introducing the concept of a \"Voting Age\" which has been debated extensively in the field of politics.", "The key points in this summary are:\n\n1.", "Teenagers will be able to become Members of a policy board.", "2.", "The current minimum age for an MP is 18, but it could be lowered to 21 under the proposed plans unveiled by the Minister of Constitutional Affairs, Mr Christopher Leslie.", "3.", "The proposed changes, announced through a written statement, have been approved by the Electoral Commission's watchdogs.", "4.", "The government intends to amend legislation that can increase the voting age to 16 while maintaining the same candidacy age for candidates in both local and national votes.", "5.", "The youngest individual elected to the public policy board was a Tories candidate, Edward Turnour, aged 21 with 144 days of service and serving in the public interest from 47 continuous years.", "6.", "The current voting age is set at 18, but it could be lowered to 16 if implemented correctly."], "smollm:1.7b": ["To summarize this text concisely, we need to identify the key ideas and details that are relevant to the topic of teenagers being allowed to become MPs.", "Here's a possible summary:\n\n\"Teenagers will be able to become MPs under plans unveiled by ministers.", "In a written statement, Constitutional Affairs Minister Christopher Leslie said the current minimum age of 21 for an MP would be reduced to 18.", "The proposals follow a recommendation last year by elections watchdog the Electoral Commission.", "'The government intends to legislate, when parliamentary time allows, to lower the age,' said Mr Leslie, who was elected in 1997 at the age of 24.\""], "deepseek-r1:1.5b": ["Teenagers are permitted to become MPs following plans introduced by ministers, which propose lowering the minimum age from 21 to 18.", "A minister, Christopher Leslie, argued that parliamentary time would allow for such changes, noting they wouldn't take effect before the next general election in May.", "He cited a previous recommendation and emphasized the impact of reducing the voting age on engaging younger people by matching it with their candidacy ages, while advocating for broader benefits over targeted improvements.", "The report highlights that Edward Turnour, a 21-year-old in Ireland, won a seat by-election aged 21, and Bernadette Devlin was another 21-year-old elected earlier."], "tinyllama:1.1b": ["The government has announced plans to lower the minimum age of becoming an MP from 21 to 18 in a bid to appeal to younger voters, following a recommendation made by the Electoral Commission last year.", "While the change will not come into effect before the next general election, it follows calls for a lowering of the voting age to 16 from the Voices at 16 all-party coalition and many others who believe that lowering the voting age would be much more effective than a lowering of the candidacy age.", "However, critics of the move have argued that there is no strong argument for leaving the age for standing for election at 21 and that the most common approach around the world is to set it at the same age as the candidacy age."], "tinydolphin:1.1b": [" In a major change, Teenagers will be allowed to become MPs under plans unveiled by ministers.", "The new policy comes after recommendations from the Electoral Commission, which suggests lowering the minimum age of 21 for MPs to 18.", "This reform would mark a significant shift in British politics and could pave the way for more young political leaders to take up important positions in the future."], "phi:2.7b": [" Teenagers will soon be allowed to become Members of Parliament (MPs) in Britain, with a proposed change to the minimum age from 21 to 18.", "The announcement comes after the Electoral Commission recommended lowering the age last year.", "However, it is unclear if this proposal will go into effect before the next general election in May 2021.", "Some advocates have called for an even lower voting age of 16, which they believe would be more effective than a change in candidacy age.", "Despite calls for change, the current legislation requires candidates to be 21 and voters to be 18 due to laws dating back to 169"], "orca-mini:3b": [" Teenagers will be allowed to become MPs under plans announced by ministers.", "The current minimum age of 21 for an MP will be reduced to 18, following a recommendation last year by the Electoral Commission.", "The government intends to legislate to lower the age, but it is unlikely to be in place before the next general election, which is widely predicted for May.", "Calls have emerged for a lowering of the voting age to 16, but the government has not yet tabled a bill that would allow for amendments to test support for a reduction in the voting age.", "The first person under 21 years old to be elected to Parliament was Irish republican Bernadette Devlin, who won a seat in 1969 aged 21 and 144 days."], "hermes3:3b": ["Teenagers allowed to become MPs; current minimum age of 21 for MPs to be reduced to 18."], "stablelm-zephyr:3b": ["Ministers have unveiled plans that would allow teenagers to become Members of Parliament (MPs) at the age of 18.", "Currently, the minimum age to be an MP is 21, but this will reduce to 18.", "This proposal follows a recommendation from the Electoral Commission last year.", "Although it's uncertain if the move will be implemented before the next general election predicted for May, there are calls to also lower the voting age to 16.", "The Votes at 16 alliance argues that lowering the candidacy age is good for \"engaging people,\" but believes lowering the voting age would have a greater impact as it affects millions of younger people."], "chatgpt-4o-latest": ["Ministers plan to lower the minimum age for MPs from 21 to 18, following a recommendation by the Electoral Commission.", "Constitutional Affairs Minister Christopher Leslie announced the proposal, though it is unlikely to take effect before the next general election.", "The move has sparked calls to reduce the voting age to 16, with campaigners arguing that voting rights impact more people than candidacy rules.", "Currently, candidates must be 21, while the voting age is 18, a discrepancy rooted in historical laws.", "The Electoral Commission found no strong reason to keep the candidacy age at 21, noting that many countries align voting and candidacy ages."], "stablelm2:1.6b": ["Ministers have announced plans to allow teenagers to become MPs, with the current minimum age of 18 reduced to 16.", "This proposal follows a recommendation by the Electoral Commission.", "However, it's unlikely the change will be implemented before the next general election in May.", "The Voting Alliance argues that lowering both candidacy and voting ages would have more significant impacts on society.", "Currently, candidates in local and national elections must be 18, while the voting age is 16."], "granite3.1-dense:2b": ["Under proposals by Constitutional Affairs Minister Christopher Leslie, the minimum age for UK MPs would be lowered from 21 to 18, following a recommendation by the Electoral Commission.", "This change is expected to be legislated once parliamentary time permits but is unlikely to take effect before the next general election in May.", "The decision has sparked calls for a similar reduction in the voting age, currently 18, from groups like Votes at 16 Alliance, who argue that lowering candidacy age engages younger individuals more effectively than altering the voting age, which affects millions of people.", "Historically, only a few have been elected to Parliament as teenagers; Irish republican Bernadette Devlin and Tory Edward Turnour were among them.", "The Electoral Commission's 2021 report found no compelling reason to maintain the age at 21 for standing for election, noting that most countries align their voting and candidacy ages."]}