{"raw_text": "Cabinet anger at Brown cash raid\n \n Ministers are unhappy about plans to use Whitehall cash to keep council tax bills down, local government minister Nick Raynsford has acknowledged.\n \n Gordon Brown reallocated £512m from central to local government budgets in his pre-Budget report on Thursday. Mr Raynsford said he had held some \"pretty frank discussions\" with fellow ministers over the plans. But he said local governments had to deliver good services without big council tax rises.\n \n The central government cash is part of a £1bn package to help local authorities in England keep next year's council tax rises below 5%, in what is likely to be a general election year.\n \n Mr Raynsford said nearly all central government departments had an interest in well run local authorities. And he confirmed rows over the issue with ministerial colleagues. \"Obviously we had some pretty frank discussions about this,\" he told BBC Radio 4's The World at One. But he said there was a recognition that \"a good settlement for local government\" was important to health, education and \"other government departments\". Ministers had to be sure local government could deliver without \"unreasonable council tax increases\", he added. Mr Raynsford dismissed a suggestion the move was designed to keep council taxes down ahead of an expected general election.\n \n \"This is a response to the concerns that have been voiced by local government about the pressures they face.\" Mr Raynsford also plans to make savings of £100m by making changes to local government pensions schemes. These would raise the age from which retiring workers could claim their pensions and limit how much they received if they retired early. He insisted the changes were \"very modest\" and designed to tackle the problem of workers retiring \"very early\". But general secretary of the public services union Unison Dave Prentis criticised the plans. \"If you want world class public services you don't get that by hitting people as they approach retirement.\"\n", "llama3.2:1b": ["Ministers are unhappy about a plan to use Whitehall cash to keep council tax bills down, with local government minister Nick Raynsford acknowledging the issue.", "The central government has allocated £512m from its budget to help local authorities reduce their council tax rises to below 5%.", "Ministers had discussions with other ministers over the plans but still need to ensure local governments can deliver without unreasonable increases."], "llama3.2:3b": ["Ministers are unhappy with plans to use central government cash to keep council tax bills down, with local governments needing to deliver good services without big council tax rises.", "A £512m package was allocated to help local authorities keep next year's council tax rises below 5%."], "gemma2:2b": ["Ministers are unhappy about Gordon Brown reallocating £512 million from central government to local government budgets to help keep council tax bills down.", "Nick Raynsford, the local government minister, acknowledged discussions with colleagues over the plans but emphasized the need for good service delivery without large council tax increases.", "The move is part of a £1 billion package to limit next year's council tax rises below 5%.", "While Mr Raynsford denied any connection between the allocation and an election, he did say it addresses local government pressures.", "The government also plans to save £100 million through changes to local government pensions schemes.", "However, Unison general secretary Dave Prentis criticized these changes, arguing they will negatively impact public sector workers."], "qwen2.5:0.5b": ["Key points from the text:\n- Cabinet members are upset about Whitehall cash being used to lower council tax bills.", "- Gordon Brown has reallocated £512m from central government budgets, but ministers haven't addressed local government services yet.", "- The central government budget is part of a £1bn package for local authorities.", "- Local governments must deliver good services without big council tax rises.", "- Ministers have raised concerns about the pressures on local government compared to central government departments.", "- Plans to save money by making changes to local government pensions schemes are being discussed.", "- Dave Prentis criticized the plans as \"very modest\" and aimed at tackling early retirement problems."], "qwen2.5:1.5b": ["Ministers are unhappy about using central government cash to keep council tax bills down, despite local governments needing good services without big increases.", "The £1bn package includes a £512m move from central to local budgets aimed at preventing next year's 5% council tax rise in anticipation of an upcoming general election.", "Ministers acknowledge the interest central departments have in well-managed local authorities but recognize that delivering quality service is essential for various government functions, including health and education."], "qwen2.5:3b": ["Cabinet members are discontent with Gordon Brown's plan to use central government funds for lower council tax bills, despite a £1bn package from the Whitehall budget.", "Local government minister Nick Raynsford has acknowledged discussions on the matter and stressed the need for local authorities to provide good services without significant tax hikes.", "While most departments support well-run local authorities, disagreements persist among ministers.", "Additionally, Raynsford plans pension scheme changes aimed at delaying retirement by workers approaching it, but this measure is criticized as insufficient by Unison's Dave Prentis."], "opencoder:1.5b": ["Ministers are unhappy about plans to use Whitehall cash to keep council tax bills down, local government minister Nick Raynsford has acknowledged.", "Gordon Brown reallocated £512m from central to local government budgets in his pre-Budget report on Thursday.", "Mr Raynsford held some \"pretty frank discussions\" with fellow ministers over the plans.", "But he said local governments had to deliver good services without big council tax rises.", "The central government cash is part of a £1bn package to help local authorities in England keep next year's council tax rises below 5%, in what is likely to be a general election year.", "Mr Raynsford said nearly all central government departments had an interest in well run local authorities and rows over the issue with ministerial colleagues.", "\"Obviously we had some pretty frank discussions about this,\" he told BBC Radio 4's The World at One.", "But he said there was a recognition that a good settlement for local government was important to health, education and other government departments.", "Ministers had to be sure local government could deliver without unreasonable council tax increases.", "Mr Raynsford dismissed a suggestion the move was designed to keep council taxes down ahead of an expected general election."], "smollm:1.7b": ["The summary is concise, preserving key ideas and details from the original text.", "It captures the main points about cabinet anger at Brown cash raids, local government minister Nick Raynsford's response to the issue, and the plans for council tax savings.", "The summary does not include any explanations or reasoning processes."], "deepseek-r1:1.5b": ["The text discusses Cabinet anger over Brown's cash raid and local government minister Nick Raynsford acknowledging the unhappy state due to council tax plans.", "Key points include Brown reallocating £512 million, the package aimed at keeping council taxes under 5%, Raynsford's discussions on balancing savings with public services without unreasonable council taxes, Bloomfield's pension proposal for early retirees, and Unison's critique of retirement-focused plans."], "tinyllama:1.1b": ["Ministers have reallocated £512m from central to local government budgets in their pre-election budget proposals, with the aim of keeping council tax bills down for local residents.", "Local government minister Nick Raynsford has acknowledged that he had held some \"pretty frank discussions\" with his fellow ministers regarding the plans.", "The central government cash is part of a £1bn package to help local authorities in England keep next year's council tax rise below 5% as part of an election-year general election year.", "While ministerial colleagues are supportive, local government unions have been critical of the changes proposed."], "tinydolphin:1.1b": [" Cabinet members, including local government minister Nick Raynsford, are discussing a £1bn package to help them keep next year's council tax rises below the expected 5% increase.", "However, the plan has caused controversy with some ministers arguing that the move is to keep up government control over local authorities and others claiming it could save money for other departments.", "The package includes £512m from central government cash for local authorities to reduce their council tax bills without an increase."], "phi:2.7b": [" Local government minister Nick Raynsford acknowledged ministers' unhappiness about using Whitehall cash to keep council tax bills down and held discussions with them.", "However, he stated that local governments have to deliver good services without big council tax rises.", "The central government allocated £512m from its budgets to help local authorities in England keep next year's council tax below 5%.", "Mr Raynsford confirmed having conversations with his ministerial colleagues regarding the plans, but said it was important for local governments to be well-run and support by other government departments.", "He dismissed the notion that this move was a strategy to lower council taxes ahead of an election and stated it was due to local government concerns about financial pressures.", "Mr Raynsford also plans to make savings of £100m by implementing changes to local government pensions schemes, such as raising the retirement age and limiting early retirements.", "He claimed these changes were \"very modest\" and aimed at tackling early retirements' problem.", "Nevertheless, Dave Prentis, general secretary of Unison, criticized this move, stating that it would not improve world-class public services."], "orca-mini:3b": [" Ministers are unhappy about plans to use central government cash to keep council tax bills down, with nearly all central government departments having an interest in well-run local authorities.", "The issue has been discussed with ministerial colleagues, and there is recognition that a good settlement for local government is important to other government departments.", "The move is a response to local government concerns about the pressures they face, and plans to save £100m by making changes to local government pensions schemes.", "However, general secretary of the public services union Unison Dave Prentis criticised the plans, saying if you want world class public services, you don't get that by hitting people as they approach retirement."], "hermes3:3b": ["Cabinet ministers discontent over using Whitehall funds to lower council taxes, using £512m from central budgets for local authorities to avoid high council tax rises."], "stablelm-zephyr:3b": ["Ministers are upset over £512m reallocation from central to local government budgets for next year's council tax rises below 5%.", "Local government minister Nick Raynsford acknowledged having frank discussions with colleagues about the plans.", "He emphasized the importance of good services without big council tax increases and dismissed suggestions it was designed to influence an upcoming general election.", "Additionally, Raynsford plans to save £100m by altering local government pensions schemes.", "Unison's general secretary, Dave Prentis, criticizes the plans."], "chatgpt-4o-latest": ["Ministers are unhappy with Gordon Brown's decision to reallocate £512m from central to local government to help keep council tax rises below 5% ahead of a likely general election.", "Local government minister Nick Raynsford acknowledged \"frank discussions\" with colleagues but defended the move as necessary for delivering good services without excessive tax increases.", "He denied it was an election tactic, saying it responded to local government concerns.", "Raynsford also proposed £100m in savings by raising the pension age and limiting early retirement benefits, which was criticized by Unison's Dave Prentis as unfair to public service workers."], "stablelm2:1.6b": ["Ministers are unhappy about plans for central government to use Whitehall funds to keep council tax bills down; this was acknowledged by local government minister Nick Raynsford in discussions with colleagues.", "Gordon Brown's move is part of a £1bn package aiming for local authorities to reduce council tax rises below 5% during an election year.", "Most departments have interest in well-run local authorities, but some disagreements have arisen with fellow ministers over the plans.", "A good settlement for local government is crucial to health, education, and other government departments, as ministers must ensure that local governments can deliver services without big council tax increases.", "Plans to make savings by altering local government pension schemes aim to tackle early retirements while being described as \"very modest.\""], "granite3.1-dense:2b": ["Ministers, including local government minister Nick Raynsford, are expressing discontent over Gordon Brown's plan to redistribute £512m from central to local government budgets for council tax control.", "This move is part of a £1bn package aimed at helping local authorities maintain next year's council tax increases under 5%, potentially in preparation for an election.", "Raynsford acknowledged \"frank discussions\" with fellow ministers, emphasizing the importance of well-run local governments for health, education, and other departments.", "He dismissed election speculation, stating it addresses local government concerns about pressures.", "Additionally, Raynsford plans to save £100m by modifying pension schemes, increasing retirement age and limiting early retirement benefits.", "However, Unison's general secretary criticized these changes as counterproductive for delivering high-quality public services."]}