{"raw_text": "Kennedy criticises 'unfair' taxes\n \n Gordon Brown has failed to tackle the \"fundamental unfairness\" in the tax system in his ninth Budget, Charles Kennedy has said.\n \n How was it right that the poorest 20% of society were still paying more as a proportion of their income than the richest 20%, the Lib Dem leader asked. The new £200 council tax rebate for pensioners did nothing to fix the \"unfair tax\", he added. The government could not go on \"patching up\" the system, he added. Speaking in the Commons after Mr Brown had delivered what is widely thought to be the last Budget before the general election, Mr Kennedy acknowledged that the UK was one of the most successful economies in the world.\n \n But he criticised both the chancellor and the Tories for failing to address the \"ticking bomb\" of council tax revaluation. He said the recent experience of Wales indicated seven million households in England would pay significantly more after revaluation. The chancellor's announcement that he was to offer a £200 council tax rebate paid by pensioner households was merely a \"sticking plaster\" to a much bigger problem. The Lib Dem plan for a local income tax would benefit the typical household by more than £450 a year, with half of all pensioners paying no local tax and about three million being better off.\n \n On pensions, Mr Kennedy said it was a \"scandal\" that the system discriminated against women who had missed making National Insurance payments when they were having children. He said a residency criteria would end \"at a stroke this fundamental iniquity\". Mr Kennedy added his party's priorities of free long-term care for the elderly, abolishing top-up fees and replacing the council tax would be funded by charging 50% income tax to those earning more than £100,000 per annum. He contrasted his approach with Mr Brown's pledge in 2001 not to increase income tax. The chancellor went on to put up National Insurance contributions after the election. \"For most individuals, most families, most households, it adds up to exactly the same thing,\" said Mr Kennedy. \"And they wonder why people get cynical about their politicians when they give one impression before an election and do exactly the opposite after that election.\"\n", "llama3.2:1b": ["Kennedy criticises Gordon Brown's budget for its failure to address unfair tax system, saying the poorest 20% paid more than richer households in council tax.", "He suggests that a £200 rebate would be insufficient, while proposing a local income tax to benefit typical households by over £450 per year."], "llama3.2:3b": ["Charles Kennedy criticizes Gordon Brown's Budget for failing to address unfair taxes, particularly council tax revaluation which would significantly increase costs for seven million households in England.", "He proposes a local income tax that would benefit typical households by over £450 per year.", "On pensions, Kennedy criticizes the system for discriminating against women who missed National Insurance payments while having children and suggests abolishing top-up fees and replacing council tax with funding from higher-income earners paying 50% of income above £100,000."], "gemma2:2b": ["Charles Kennedy criticizes Gordon Brown's tax system as unfair.", "He argues that the poorest 20% of society pays a disproportionate share of income taxes while the richest 20% pay less.", "He believes the £200 council tax rebate is inadequate and highlights the need for long-term reforms like local income tax to achieve true fairness.", "Kennedy points out discrepancies in pension policies that disproportionately affect women, advocating for removing residency criteria.", "He proposes funding his agenda through a 50% income tax rate for those earning over £100,000.", "He accuses Brown of hypocrisy by increasing National Insurance after promising not to do so during the election."], "qwen2.5:0.5b": ["Gordon Brown's third Budget was supposed to reduce unfair taxes for the poorest, but the government failed to do so.", "Charles Kennedy, a Labour leader, criticized both the chancellor and the Tories' failure to address \"ticking bomb\" problems with council tax revaluation.", "He suggested a local income tax that would benefit pensioners by about £450 a year.", "The Lib Dems plan for free long-term care and abolishing top-up fees would be funded by charging 50% income tax on those earning more than £100,000 per annum."], "qwen2.5:1.5b": ["Charles Kennedy criticizes government tax system for unfairness, particularly in pensioner council tax rebates and failing to address revaluation issues of Wales' seven million households.", "He proposes a local income tax plan benefiting typical households by over £450 annually, including half paying no local tax and about three million being better off.", "Also suggests abolishing top-up fees for free long-term care and replacing the council tax with 50% income tax on those earning more than £100,000 per annum."], "qwen2.5:3b": ["Charles Kennedy criticized Gordon Brown's ninth Budget for failing to address the \"fundamental unfairness\" in the UK tax system, particularly regarding how the poorest 20% still pay a higher proportion of income than the richest 20%.", "He highlighted the inadequacy of the £200 council tax rebate for pensioners and argued that it was not enough to fix the problem.", "Kennedy also criticized the government's handling of council tax revaluation, suggesting that most households in England would face increased costs after revaluation.", "He proposed replacing the council tax with a local income tax, which he said would benefit over half of all pensioners and improve the financial situation for about three million people.", "On pensions, Kennedy called for free long-term care for the elderly, abolishing top-up fees, and replacing the council tax, stating these measures would be funded by taxing high-income earners at 50%.", "He contrasted his approach with Brown's pledge not to increase income tax, noting that increases in National Insurance contributions after the election have a similar impact."], "opencoder:1.5b": ["The output would be a summary focusing on key ideas and details from the given text, preserving its main points without additional explanation or details."], "smollm:1.7b": ["The summary above is concise and conveys the main ideas of the text:\n\n1.", "The chancellor's speech in the Commons, where he criticized the government for its handling of the tax system.", "2.", "Gordon Brown's criticism of unfair taxes, highlighting the poor state of the tax system as a whole.", "3.", "Charles Kennedy's criticism of the chancellor's handling of council tax and the lack of progress on local income tax reform.", "4.", "The LibDem leader's proposal for a local income tax to benefit pensioners, which would help alleviate poverty among this demographic.", "5.", "Gordon Brown's response to Mr Kennedy's criticism, emphasizing that his party's priorities include free long-term care for the elderly and abolishing top-up fees.", "6.", "The chancellor's pledge not to increase income tax after the election, contrasting it with Gordon Brown's promise in 2001 not to do so."], "deepseek-r1:1.5b": ["Kennedy criticized \"fundamental unfairness\" in taxes, particularly the £200 council tax rebate for pensions, claiming it didn't fix the issue.", "He questioned the gap between poorest and richest 20% of society, calling for better governance.", "The government could not patch up the system, and Mr. Brown was frustrated with these reforms, acknowledging the UK's successful economic practices before an election.", "On pensions, he criticized women who missed National Insurance payments for being discriminated against.", "He proposed a residency criteria to end this issue.", "The British National Party (BNP) wanted long-term care funding via 50% income tax on high earners, while Mr. Brown had opposed income tax increases, claiming it would undermine fairness.", "Kennedy concluded that reforms succeeded but didn't achieve individual and national fairness, leading to skepticism among voters."], "tinyllama:1.1b": ["Kennedy criticizes \"unfaithful\" taxes, highlighting in particular the \"unfairness\" of council tax reforms as well as a lack of action from the UK government regarding penSIONs.", "He also raises concerns about the UK's economic success and the potential for income tax to be used to fund his party's proposals for long-term care, removing top-up fees, and abolishing councillor salaries.", "Kennedy argues that a more progressive income tax system could address these issues, and calls on the government to put forward their own plan instead of relying on changing the existing system through council tax rebates."], "tinydolphin:1.1b": [" Charles Kennedy criticized government policies that he called \"unfair\" and failed to tackle \"fundamental unfairness\" in the tax system.", "He argued that pensioners should not have to pay more than richer families under national insurance, while those earning over £100,000 per year should face a 50% income tax on top.", "Instead of increasing income tax, the chancellor should have implemented a residency rule that allows women who missed National Insurance payments to keep their benefits.", "Kennedy proposed his party's priorities for care and long-term care for the elderly, reducing top-up fees, and replacing the council tax."], "phi:2.7b": [" In his speech, Charles Kennedy criticizes the unfairness in the tax system, particularly for the poorest 20% of society who still pay more as a proportion of their income than the richest 20%.", "He also highlights the issue of council tax revaluation, which he believes will result in many households paying significantly more.", "The £200 council tax rebate offered by the government is not enough to fix the problem, according to Kennedy.", "He suggests that his party's plan for a local income tax would benefit pensioners and typical households more than the current system.", "Finally, Kennedy criticizes the lack of action on pensions discrimination against women who missed making National Insurance payments while having children, calling it a \"scandal.\"", "He proposes that charging 50% income tax to those earning over £100,000 per annum would fund his party's priorities.", "He contrasts his approach with the promise made by Gordon Brown in 2001 not to increase income tax and notes the difference between rhetoric and action after an election."], "orca-mini:3b": [" Kennedy criticizes 'unfair' taxes in Budget ninth by Gordon Brown, charging 50% income tax to those earning more than £100,000 per annum."], "hermes3:3b": ["Kennedy criticizes unfair taxes, arguing poorer % pay more than richer%, calls government's council tax rebates a 'sticking plaster'.", "Suggests Lib Dem plan for local income tax to benefit households by over £450/a year.", "Proposes free long-term care, abolishing top-up fees & replacing council tax funded by 50% income tax on >£100k earners."], "stablelm-zephyr:3b": ["Charles Kennedy criticized Gordon Brown's ninth Budget for not addressing \"fundamental unfairness\" in the tax system, particularly as the poorest 20% of society paid more as a proportion of their income than the richest 20%.", "He mentioned the recent council tax revaluation issue and said that a £200 council tax rebate was just a \"sticking plaster.\"", "Kennedy outlined his party's priorities for funding free long-term care for the elderly, abolishing top-up fees, and replacing the council tax with an income tax of 50% for those earning over £100,000 per year.", "He contrasted this approach with Brown's previous pledge not to increase income tax after a 2001 election."], "chatgpt-4o-latest": ["Charles Kennedy criticized Gordon Brown's Budget for failing to address the \"fundamental unfairness\" in the tax system, highlighting that the poorest 20% still paid a higher proportion of their income than the richest 20%.", "He dismissed the £200 council tax rebate for pensioners as a temporary fix and warned that council tax revaluation could lead to higher payments for millions.", "Kennedy advocated for a local income tax, which he claimed would save typical households over £450 annually and benefit pensioners.", "He also condemned the pension system for discriminating against women who missed National Insurance payments while raising children, proposing a residency-based solution.", "To fund policies like free long-term elderly care and abolishing top-up fees, he suggested a 50% income tax on earnings over £100,000.", "He criticized Brown for breaking a 2001 pledge not to raise income tax, arguing that increasing National Insurance contributions had the same effect, fueling public cynicism toward politicians."], "stablelm2:1.6b": ["Charles Kennedy criticized Gordon Brown's ninth Budget for not addressing the \"fundamental unfairness\" in the tax system, as the poorest % of society pay more than the richest %.", "Despite acknowledging the UK's success as a successful economy worldwide, Kennedy argued the government should address the council tax revaluation issue and proposed a local income tax instead.", "He also addressed gender discrimination in pensions and called for ending top-up fees and replacing the council tax through an income tax increase.", "Brown pledged not to raise income tax during the election, despite increasing National Insurance contributions afterward."], "granite3.1-dense:2b": ["Charles Kennedy criticized Gordon Brown's ninth Budget for perpetuating unfair taxation, arguing that the poorest 20% of society still pay a larger proportion of their income in taxes than the richest 20%.", "He dismissed the £200 council tax rebate for pensioners as inadequate and called for a local income tax to benefit typical households by over £450 annually, with many pensioners paying no local tax.", "Kennedy also condemned the discriminatory treatment of women who missed National Insurance payments during childbearing years and proposed charging 50% income tax for those earning over £100,000 to fund his party's priorities, including free long-term care for the elderly and replacing council tax.", "He contrasted this with Brown's 2001 pledge not to raise income tax, stating that his approach would ensure transparency and trust in politicians' promises."]}