{"raw_text": "Act on detention ruling, UK urged\n \n The government must act quickly on the Law Lords' ruling that detention of foreign terror suspects without trial is unlawful, Mary Robinson has said.\n \n The former UN commissioner for human rights and Irish president told Radio 4's Today the government's response would be scrutinised internationally. \"It would be very troubling if the government did not accept the judgement and then work within it,\" she said. Home Secretary Charles Clarke has said detainees will not be freed at present. Speaking to Parliament on his first day in office as home secretary following David Blunkett's resignation, Mr Clarke said: \"I will be asking Parliament to renew this legislation in the New Year. \"In the meantime, we will be studying the judgement carefully to see whether it is possible to modify our legislation to address the concerns raised by the House of Lords.\"\n \n Mrs Robinson said the Law Lords' ruling was \"in line with international legal opinion\" and praised their \"very decisive\" eight to one majority. \"What the Law Lords did was acknowledge the role of the government, but say that there had been a disproportionate use, that it amounted to executive detention and it was discriminatory because it didn't apply to British citizens,\" she said.\n \n Mrs Robinson warned that a lack of action by the British government could lead to further action in legal arenas such as the European Court of Human Rights in Strasbourg. \"If the government were not to accept this ruling then there is further redress, including possible damages for the individuals who could claim that the government either was tardy or was resisting the implications of the judgement of the Law Lords.\" She said a meeting of the Club of Madrid - a group of former world leaders - to be held in the Spanish capital on the March anniversary of the train bombings there would probably discuss the ruling and its implications. \"I have no doubt that this judgement will be looked at, both as a very positive step in clarifying the law and restating the fundamental principles, but also the response of the British government will be under quite a clear international scrutiny there.\"\n \n The detainees took their case to the House of Lords after the Court of Appeal backed the Home Office's powers to hold them without limit or charge. The government opted out of part of the European Convention on Human Rights concerning the right to a fair trial in order to bring in anti-terrorism legislation in response to the 11 September attacks in the US. Any foreign national suspected of links with terrorism can be detained or can opt to be deported. The Law Lords said the rules were incompatible with the European Convention on Human Rights as they allowed detentions \"in a way that discriminates on the ground of nationality or immigration status\". The case was heard by a panel of nine law lords rather than the usual five because of the constitutional importance of the case.\n", "llama3.2:1b": ["The UK government must act quickly to address the Law Lords' ruling that detention without trial for foreign terror suspects is unlawful.", "The government's response will be scrutinized internationally, and Home Secretary Charles Clarke has said detainees will not be freed at present.", "The ruling acknowledges the role of the government but also criticizes its disproportionate use and discrimination against non-British citizens.", "A meeting of former world leaders, including former UN commissioner Mary Robinson, is likely to discuss the implications of the ruling in Strasbourg."], "llama3.2:3b": ["The UK government must act quickly on the Law Lords' ruling that detention of foreign terror suspects without trial is unlawful, Mary Robinson warned, as Home Secretary Charles Clarke plans to renew anti-terrorism legislation in the New Year.", "The ruling's eight-to-one majority aligns with international legal opinion and criticizes executive detention and discriminatory treatment of non-British citizens.", "Robinson warns the UK government faces international scrutiny for its response, and further action may be taken through the European Court of Human Rights or potential damages claims."], "gemma2:2b": ["The UK government must act on the Law Lords' ruling that detention of foreign terror suspects without trial is unlawful.", "Mary Robinson, former UN commissioner for human rights, agrees with the ruling and warns of potential international action if the government does not comply.", "The Home Secretary plans to renew legislation and review it for possible modifications.", "A meeting of the Club of Madrid will likely address the ruling and its implications, while other legal avenues like the European Court of Human Rights remain a possibility."], "qwen2.5:0.5b": ["Mary Robinson, former UN commissioner for human rights and Irish president, urged UK to act quickly on the Law Lords' ruling that detention without trial is unlawful.", "She emphasized that if the government doesn't accept the judgement, it will not be possible to modify its legislation accordingly.", "Mrs Robinson warned that a lack of action by the British government could lead to further legal actions such as those in Strasbourg.", "She discussed potential damages and future discussions with former world leaders, including an upcoming meeting in Madrid."], "qwen2.5:1.5b": ["Mary Robinson, former UN commissioner and Irish president, called for the British government to accept the Law Lords' ruling that detention without trial is unlawful, threatening international scrutiny if the government fails to do so.", "Home Secretary Charles Clarke stated detainees will not be released immediately but will review the judgment carefully in advance of renewed legislation renewal.", "The meeting of Madrid's Club to discuss the ruling will likely examine both its legal implications and response from British officials."], "qwen2.5:3b": ["The UK government is urged to act quickly after Law Lords ruled detention of foreign terror suspects without trial is unlawful, potentially leading to further legal challenges including at the European Court of Human Rights in Strasbourg.", "Former UN Commissioner Mary Robinson praised the judges' ruling and warned against non-compliance by the British government, citing its international implications.", "The Home Office has stated detainees will not be released immediately, but they intend to study the judgement to modify legislation to address concerns raised."], "opencoder:1.5b": ["The government must act quickly on the Law Lords' ruling that detention of foreign terror suspects without trial is unlawful, while serving the purpose of ensuring a fair and lawful process for international relations."], "smollm:1.7b": ["The summary should be:\nAct on detention ruling, UK urged"], "deepseek-r1:1.5b": ["The UK government is reacting to the Law Lords' ruling, which says detention of foreign terror suspects without trial is unlawful.", "The former UN commissioner and Irish president has criticized the government's response, stating that if they reject the ruling, further action in international law will be taken, including legal reviews.", "The House of Lords deemed this a significant international opinion aligning with UK law, while the government chose not to free the detainees but will focus on legal reviews to address concerns raised by the House of Lords.", "They aim to adapt their anti-terror legislation to align with the European Convention on Human Rights in the context of the 11 September attacks in the US and hold a meeting in Strasbourg to discuss this ruling, drawing international scrutiny from countries like Spain."], "tinyllama:1.1b": ["The UK government is urged to act quickly in response to a ruling that detained foreign terror suspects without trial are unlawful, according to Mary Robinson.", "The former UN commissioner for human rights and Irish president has called on the government to study the judge's comments regarding the UK's legislation.", "\"The Law Lord's ruiling was in line with international legal opinion and praised by the House of Lords,\" she said.", "Robinson added that a meeting of the Club of Madrid, which includes former world leaders, could discuss the ruling and its implications.", "The detainees took their case to the House of Lord's after the UK opted out of parts of the European Convention on Human Rights concerning fair trials, in order to bring in anti-terrorism legislation in response to the 11 September attacks in the US.", "The ruling allowed for detained suspects to be held without charge or trial, and opted to deport those deemed at risk of being deported due to terrorism links.", "Robinson praised international legal opinion and called on the government to study the judge's comments regarding the UK's legislation."], "tinydolphin:1.1b": [" The UK government is urged to take immediate action after the Court of Appeal's ruling, in which the government opted out of part of the European Convention on Human Rights, allowing foreign terror suspects detained without trial to be deported or to opt to be deported.", "The Home Office has taken a defensive stance, stating that detainees will not be released at present.", "Speaking to Parliament during his first day in office as home secretary following David Blunkett's resignation, Mr Clarke expressed concerns about the government's response and noted that he would be studying the ruling carefully.", "In the meantime, he called for renewed legislation to modify the current detention statutes."], "phi:2.7b": [" The Law Lords' ruling that detention of foreign terror suspects without trial is unlawful has been met with criticism from former UN commissioner Mary Robinson.", "She urges the government to act quickly on the decision and for international scrutiny of their response.", "Home Secretary Charles Clarke plans to renew the legislation in the New Year, but will study the judgement to modify it if necessary.", "Mrs Robinson believes that a lack of action could lead to further legal actions such as possible damages for the individuals affected by the ruling.", "The ruling is seen as positive and clarifying the law, but the government's response will be under international scrutiny."], "orca-mini:3b": [" The UK government must act swiftly on the Law Lords' ruling that detention of foreign terror suspects without trial is unlawful, Mary Robinson has urged.", "The former UN commissioner for human rights and Irish president told Radio 4's Today that the government's response would be scrutinised internationally.", "\"It would be very concerning if the government did not accept the judgement and then worked within it,\" she said.", "Home Secretary Charles Clarke has said detainees will not be freed at present.", "Speaking to Parliament on his first day in office as home secretary following David Blunkett's resignation, Mr Clarke said: \"I will be asking Parliament to renew this legislation in the New Year.", "In the meantime, we will be studying the judgement carefully to see whether it is possible to modify our legislation to address the concerns raised by the House of Lords.\""], "hermes3:3b": ["UK gov must act on detention ruling without delay, said Mary Robinson - Law Lords ruled detentions of foreign terror suspects as unlawful, and discriminatory against nationality.", "Government plans to modify legislation according to judgement."], "stablelm-zephyr:3b": ["Mary Robinson, former UN commissioner for human rights and Irish president, has called on the UK government to act quickly on the Law Lords' ruling that detention of foreign terror suspects without trial is unlawful.", "She warned that a lack of action could lead to further legal actions, such as the European Court of Human Rights in Strasbourg.", "The Law Lords' ruling was praised by Robinson as being \"in line with international legal opinion\" and said to be \"very decisive\"."], "chatgpt-4o-latest": ["Mary Robinson has urged the UK government to act swiftly on the Law Lords' ruling that detaining foreign terror suspects without trial is unlawful.", "She warned that failure to comply could lead to international scrutiny and legal action, including at the European Court of Human Rights.", "Home Secretary Charles Clarke stated that detainees would not be released immediately and that the government would review the ruling to consider legislative modifications.", "The Law Lords ruled by an eight-to-one majority that the detention policy was discriminatory and incompatible with the European Convention on Human Rights.", "The government had previously opted out of parts of the convention to implement anti-terrorism laws after the 9/11 attacks.", "The ruling, seen as a significant legal precedent, will likely be discussed internationally, including at an upcoming meeting of former world leaders."], "stablelm2:1.6b": ["Mary Robinson, former UN commissioner for human rights and Irish president, urges the UK government to act swiftly on the Law Lords' ruling that foreign terror suspects cannot be held without trial.", "Home Secretary Charles Clarke says detainees won"], "granite3.1-dense:2b": ["The UK government must act swiftly on the Law Lords' ruling that detaining foreign terror suspects without trial is unlawful, according to Mary Robinson, former UN commissioner for human rights and Irish president.", "The eight-to-one majority decision aligns with international legal opinion and acknowledges the government's role but criticizes its disproportionate use and discrimination against non-British nationals.", "Home Secretary Charles Clarke plans to renew anti-terrorism legislation in Parliament, while studying the ruling to potentially modify it.", "Mrs. Robinson warns that non-compliance could lead to further legal actions at the European Court of Human Rights and discussions by the Club of Madrid, a group of former world leaders, which will likely scrutinize the UK's response.", "The case involves foreign nationals suspected of terror links, who can be detained or deported, and the Law Lords found their detention rules incompatible with the European Convention on Human Rights due to discriminatory practices based on nationality and immigration status."]}