{"raw_text": "BAA support ahead of court battle\n \n UK airport operator BAA has reiterated its support for the government's aviation expansion plans to airports throughout the country.\n \n The comments come a day ahead of a High Court challenge by residents' groups and local councils to the government's White Paper. The judicial review will centre on government plans for expansion at Heathrow, Stansted and Luton airports. BAA, which operates all three, said it was consulting with local communities. \"We are...consulting on voluntary compensation schemes which go beyond our statutory obligations,\" a BAA spokesman said.\n \n Groups challenging the plans include Stop Stansted Expansion, Heathrow anti-noise campaigners HACAN Clearskies and the London boroughs of Hillingdon and Wandsworth. At Heathrow, Gatwick, Edinburgh and Glasgow airports, BAA launched a series of consultations on blight to properties from the proposed expansion in September 2004, which will close next week. The company is also offering to buy noise-hit properties for an index-linked, unblighted price. Among other measures, BAA has set up a homeowner support scheme for people living near Stansted, and has launched a special scheme for those close to the airport but far enough away not to be covered by the homeowner scheme. At Heathrow, BAA said it was working closely with all interested parties to see how the strict environmental, air quality and noise targets for a third runway can be met.\n \n At Gatwick, the company has written to homes and business likely to be affected by any extra runway. Stop Stansted Expansion said the White Paper, published in December 2003, was \"fundamentally flawed\" and did not follow the proper consultation process. \"We do not underestimate the scale of the challenge before us because the courts have never before overturned a government White Paper,\" said Stop Stansted Expansion chairman Peter Sanders said. HACAN chairman John Stewart said: \"Almost exactly a year ago the government published its 30-year aviation White Paper with much fanfare. \"It hoped that would be the end of the debate and it could proceed with its plans for a massive expansion of aviation. \"Yet, a year later the protesters are still here, and stronger than ever. \" A judgement from Mr Justice Sullivan is expected early in February.\n", "llama3.2:1b": ["BAA supports government's aviation expansion plans ahead of court challenge by residents' groups and local councils to these plans at Heathrow, Stansted, and Luton airports."], "llama3.2:3b": ["BAA supports government's aviation expansion plans, despite residents' groups challenging the White Paper's implementation.", "The company is consulting with local communities and offering voluntary compensation schemes for affected properties.", "Residents claim the process was flawed and that courts have never overturned a White Paper before."], "gemma2:2b": ["BAA supports government aviation expansion plans and is consulting local communities on compensation schemes.", "Residents' groups and councils are challenging these plans through a High Court review of the White Paper, which outlines expansion at Heathrow, Stansted, and Luton airports.", "BAA has implemented various measures to address potential impacts on affected property owners, including noise-hit property purchase programs and homeowner support schemes.", "The legal challenge is expected to result in a judgement from Mr Justice Sullivan early next month."], "qwen2.5:0.5b": ["BAA supports government's airport expansions despite challenges to White Paper by local residents' groups.", "BAA has launched consultation on blight, offering unsullied homes for those affected at Stansted and Heathrow airports."], "qwen2.5:1.5b": ["BAA supports government's aviation expansion plans but faces court challenge over Heathrow, Stansted, and Luton airport expansions, aiming to minimize noise and environmental impacts."], "qwen2.5:3b": ["UK airport operator BAA has reiterated support for government's aviation expansion plans.", "However, this comes as residents' groups challenge the White Paper through a High Court judicial review focusing on Heathrow, Stansted, and Luton airports.", "BAA is consulting with local communities to offer voluntary compensation schemes beyond statutory obligations.", "The challenges include Stop Stansted Expansion, HACAN, and London boroughs of Hillingdon and Wandsworth.", "BAA has launched consultations since 2004 regarding blight to properties near Heathrow, Gatwick, Edinburgh, and Glasgow airports.", "At Heathrow, the company is working on meeting environmental targets for a third runway.", "The White Paper's validity remains in question by protesters like Stop Stansted Expansion and HACAN.", "A court judgment from Mr Justice Sullivan is expected early in February."], "opencoder:1.5b": ["The government's support for aviation expansion at airports in the UK has been announced by several UK airport operators including BAA.", "The company has reiterated its endorsement of the government's plans to expand air transportation.", "However, during a High Court challenge by residents' groups and local governments, the company is consulting with various stakeholders from local communities.", "\"We are seeking advice on voluntary compensation schemes which aim to reach beyond our existing obligations,\" the BAA, a spokesman said, highlighting its role in consultation on legislation aimed at expanding air transportation.", "Groups including Stop Stansted Expansion, Heathrow anti-noise campaigners HACAN Clearskies, and the London boroughs of Hillingdon and Wandsworth are among those invited to the review.", "At Heathrow, Gatwick, Edinburgh and Glasgow airports, BAA launched several consultations on environmental issues related to air transportation in September 2004.", "The company is offering to buy properties that may be exempt from air pollution for an unblighted index-linked price, furthering its support for aviation expansion.", "At Heathrow, BAA has also set up a homeowner support scheme for people living near Stansted and has launched a special scheme for those close to the airport but far enough away not to be covered by the homeowner scheme.", "As for its consultation process during the hearing at Gatwick, Stop Stansted Expansion noted that the White Paper, published in December 2003, was \"fundamentally flawed\" and did not follow the proper consultation process.", "Despite this, he also emphasized the scale of the challenge and the need to bring up the potential impact on the wider air transportation industry."], "smollm:1.7b": ["The summary should contain:\n1.", "The main idea or thesis statement (e.g., BAA has reiterated its support for the government's aviation expansion plans)\n2.", "Key supporting details (e.g., BAA has consulted with local communities, offered compensation schemes to homeowners and is offering special support to those close to the airport but far enough away not to be covered by the homeowner scheme)\n3.", "The main argument or conclusion (e.g., BAA's expansion plans are flawed because they do not follow proper consultation process and the government has not upheld its promises)"], "deepseek-r1:1.5b": ["The UK airport operator BAA reiterates its support for the government's aviation expansion plans.", "The judicial review focuses on Heathrow, Stansted, and Luton airports.", "BAA is consulting with local communities regarding voluntary compensation schemes beyond statutory obligations.", "Groups opposing the plans include Stop Stansted Expansion, HACAN Clearskies, Hillingdon and Wandsworth boroughs, Peter Sanders, John Stewart, and others.", "BAA has conducted consultations at Heathrow involving blight-to-properties, noise impacts, a home support scheme, and a special scheme for those near properties but not covered by the homeowner plan.", "Gatwick also addressed affected homes, calling the White Paper flawed and asking it to proceed as planned, with a potential ruling in February."], "tinyllama:1.1b": ["UK airport operator BAA has expressed support for government plans to expand Heathrow, Stansted, and Luxton airports, despite groups challenging the expansion plans through a High Court challenge.", "The consultations launched by BAA include offering compensation schemes to affected residents in unblighted properties at Heathrow and Glasgow airports.", "BAA has also set up homeowner support schemes for people living near Stansted Airport but far enough away from it not to be covered by the scheme.", "In Gawood, a series of consultations were launched last year, including an offer of special schemes for those within five miles of Heathrow but far enough away not to be covered by the schemes.", "BAA has also written letters to homes and businesses affected by any extra runway, emphasizing that they would follow proper consultation procedures before implementing the White Paper's plans for a third runway at Heathrow.", "The High Court challenge to the expansion plans is expected to begin in February 2022."], "tinydolphin:1.1b": [" The text states that BAA (British Airports Authority) supports the government's aviation expansion plans but is consulting with local communities to find voluntary compensation for affected residents.", "This comes ahead of a High Court challenge by residents' groups and local councils, which focuses on the potential impact of new airports on local areas.", "BAA has offered various measures, such as buying or blighting properties and supporting people affected by noise issues at Heathrow, Stansted, and Gatwick airports.", "The company also set up a support scheme for those who may be affected by a third runway at Gatwick, but the outcome of this remains uncertain."], "phi:2.7b": [" UK airport operator BAA supports government's aviation expansion plans to Heathrow, Stansted and Luton airports, despite facing challenges from local communities and residents' groups through legal action.", "The company has launched consultations on compensation schemes for affected homeowners and is working with interested parties at all four of its major airports.", "Stop Stansted Expansion criticized the White Paper as \"fundamentally flawed\" and HACAN called on the government to follow proper consultation processes."], "orca-mini:3b": [" UK airport operator BAA supports the government's aviation expansion plans to airports throughout the country, but is consulting with local communities on voluntary compensation schemes for property blighted by the proposed expansion at Heathrow, Gatwick, Edinburgh and Glasgow airports.", "The company is also offering to buy noise-hit properties for an index-linked, unblighted price.", "BAA consulted on the scheme for Stansted Airport in September 2004, and launched a homeowner support scheme for properties near Stansted, and has set up a special scheme for those close to the airport but far enough away not to be covered by the homeowner scheme.", "The judicial review will centre on government plans for expansion at Heathrow, Gatwick, Edinburgh and Glasgow airports."], "hermes3:3b": ["BAA supports UK gov's airport expansion, preparing for High Court challenge by local groups over White Paper."], "stablelm-zephyr:3b": ["UK airport operator BAA supports the government's aviation expansion plans but is consulting with local communities ahead of a High Court challenge by residents' groups and local councils regarding expansion at Heathrow, Stansted, and Luton airports.", "BAA is offering voluntary compensation schemes and purchasing noise-hit properties for an index-linked, unblighted price.", "At Gatwick, BAA has written to homes and businesses potentially affected by a third runway.", "The Stop Stansted Expansion group claims the White Paper is \"fundamentally flawed\" and not following proper consultation process.", "A judgement from Mr Justice Sullivan is expected in early February."], "chatgpt-4o-latest": ["BAA has reaffirmed its support for the UK government's aviation expansion plans ahead of a High Court challenge by residents' groups and local councils against the White Paper.", "The judicial review will focus on expansion plans for Heathrow, Stansted, and Luton airports.", "BAA, which operates these airports, stated it is consulting with local communities and offering voluntary compensation schemes beyond legal requirements.", "Protest groups, including Stop Stansted Expansion and HACAN Clearskies, argue the White Paper is flawed and lacked proper consultation.", "BAA has launched consultations on property blight and is offering to buy noise-affected properties.", "It is also working on environmental and noise targets for Heathrow’s proposed third runway.", "A court ruling is expected in early February."], "stablelm2:1.6b": ["UK airport operator BAA supports the government's aviation expansion plans across airports in the country, despite facing challenges from residents' groups and local councils.", "The High Court challenge will focus on government plans for Heathrow, Stansted, and Luton airports.", "BAA is consulting with local communities on voluntary compensation schemes and has established homeowner support schemes for those near Stansted and airport property affected by expansion plans.", "A judgement from Mr Justice Sullivan is expected early in February."], "granite3.1-dense:2b": ["UK airport operator BAA has expressed continued support for the government's aviation expansion plans at Heathrow, Stansted, and Luton airports, despite a High Court challenge by residents' groups and local councils, including Stop Stansted Expansion, HACAN Clearskies, and the London boroughs of Hillingdon and Wandsworth.", "BAA is conducting voluntary consultations on compensation schemes exceeding statutory obligations for properties likely to suffer from expansion-related blight.", "For Stansted, BAA has initiated homeowner support and a separate scheme for distant residents.", "At Heathrow, Gatwick, Edinburgh, and Glasgow, similar consultations are underway.", "The groups challenging the plans argue that the White Paper lacks proper consultation and is fundamentally flawed, emphasizing their strong opposition to the expansion due to its potential impact on property values and environmental concerns.", "A key court decision from Mr. Justice Sullivan is expected in early February."]}