{"raw_text": "MPs demand 'Budget leak' answers\n \n Ministers have been asked to explain how Budget details were printed in a London newspaper half an hour before Gordon Brown made his speech.\n \n The Tories said a large chunk of the Budget appeared to have been leaked in what they describe as a \"serious breach of Treasury confidentiality\". The Lib Dems called for Commons leader Peter Hain to make a statement and said chancellors had resigned over leaks. They were told it would be brought to Speaker Michael Martin's attention. In the Commons, Tory frontbencher Andrew Tyrie MP demanded an immediate ministerial statement about how measures had been \"clearly, or at least apparently, leaked to the Evening Standard\".\n \n Raising a point of order, he said it was \"the latest in a long line of discourtesies to this House\", as well as a breach of confidentiality. He said: \"I can only hope it is unintentional. If it were planned it would be a very grave matter indeed. A previous Labour chancellor resigned after he leaked the Budget.\" Hugh Dalton resigned after leaking details of his 1947 budget to journalist John Carvel, who published them in a London newspaper, just minutes before they were announced to the House of Commons. Liberal Democrat David Laws said it was a \"very serious matter\" and said Mr Hain should make a statement on Thursday. Deputy Speaker Sylvia Heal agreed it was \"of concern\" but said nothing could be done immediately but the issue would be brought to Mr Martin's attention.\n", "llama3.2:1b": ["MPs demand answers about 'Budget leak' after print appears in London newspaper half an hour before Gordon Brown's speech, and some parties call for immediate ministerial statements on the matter."], "llama3.2:3b": ["MPs demand answers from ministers about how Budget details were leaked in a London newspaper before Gordon Brown's speech, with the Tories calling it a serious breach of Treasury confidentiality and the Lib Dems urging Commons leader Peter Hain to make a statement, citing a previous Labour chancellor who resigned after leaking similar details."], "gemma2:2b": ["Ministers are being asked to explain how budget details were leaked in an Evening Standard article shortly before Gordon Brown's speech.", "Tory MPs demanded a ministerial statement, saying this is \"a serious breach of Treasury confidentiality\".", "Lib Dems called for a statement from Commons leader Peter Hain and have expressed concern about the leak as it happened previously."], "qwen2.5:0.5b": ["MPs demand 'Budget leak' answers: The Tories claim large chunk of Budget leaked, while Lib Dems suggest Commons leader Peter Hain should make a statement and that chancellors resigned after leaks.", "Tory MP Andrew Tyrie demanded an immediate ministerial statement about how measures were \"clearly, or at least apparently, leaked to the Evening Standard\"."], "qwen2.5:1.5b": ["Ministers must explain how leaked details of the Budget were printed in a newspaper half an hour before Gordon Brown's speech, leading MPs to demand answers and calls for resignations from previous chancellors over similar incidents."], "qwen2.5:3b": ["MPs demand answers for how Budget details were leaked in London newspaper half an hour before Chancellor Gordon Brown’s speech.", "Tories and Lib Dems call for ministerial statement, with Peter Hain facing criticism.", "Previous leaks led to resignations of Labour chancellors Hugh Dalton and John Carvel.", "Hugh Dalton resigned after leaking budget details to journalist minutes before announcement.", "Speaker Michael Martin will be informed about the issue."], "opencoder:1.5b": ["Ministers have been asked to explain how Budget details were printed in a London newspaper half an hour before Gordon Brown made his speech.", "The Tories called for Commons leader Peter Hain to make a statement and said chancellors had resigned over leaks, the Lib Dems called it a \"latest in a long line of discourtesies\".", "Andrew Tyrie MP demanded an immediate ministerial statement about how measures were \"clearly, or at least apparently\", then Hugh Dalton resigned after leaking details, and Liberal Democrat David Laws said it was \"a serious matter\".", "The Tories raised a point of order but also called for Commons leader to make a statement on Thursday.", "Sybil Heal agreed it was \"of concern\" but said nothing could be done immediately but the issue would be brought to Mr Martin's attention."], "smollm:1.7b": ["The MPs demanded answers from the Tories about how Budget details were leaked in a London newspaper half an hour before Gordon Brown made his speech.", "The Lib Dems called for Commons leader Peter Hain to make a statement and said chancellors had resigned over leaks.", "They were told it would be brought to Speaker Michael Martin's attention.", "In the Commons, Tory frontbencher Andrew Tyrie MP demanded an immediate ministerial statement about how measures had been \"clearly, or at least apparently, leaked to the Evening Standard\"."], "deepseek-r1:1.5b": ["Budget leak issues are being pressed for answers by MPs.", "A London newspaper printed budget details half an hour before Gordon Brown spoke.", "The Tories accused a serious breach of Treasury confidentiality, while Lib Dems and Democrats resolved leaks.", "Commons leader Peter Hain needs to speak but some say they'll be told to Speaker Michael Martin's attention.", "Tory MP Andrew Tyrie demanded immediate statements on leaked measures.", "He mentioned the leak was unintentional or planned if intended."], "tinyllama:1.1b": ["MPs have demanded clarification from Treasury ministers on how Budget details were leaked into London newspapers half an hour before Gordon Brown made his speech, as well as chaoscs in the House of Commons after raising a point of order over this issue.", "Torie frontbencher Andrew Tyrie demanded an immediate ministerial statement regarding leakages to the Evening Standard and a clarification on how measures had been \"clearly\" or \"at least apparently\" leaked into the House of Commons.", "The controversy is linked to previous Labour chancelloors who resigned after leaking details of their Budgets, including raises on taxes and spending cuts.", "Liberal Democrats are calling for Mr Haine to make a statement in the Commons and have suggested that Mr Martin's attendance could be broughtered."], "tinydolphin:1.1b": [" The summary of this text is that MPs have demanded answers about how budget details were leaked to the Evening Standard half an hour before the chancellor made his speech, in what appears to be a serious breach of Treasury confidentiality.", "Tory MPs want to know who was responsible for leaking the information, while Lib Dem MPs believe it was done by Tories and the Liberal Democrats have called for Commons leader Peter Hain to make a statement about it.", "Andrew Tyrie, a Tory frontbencher, demanded a ministerial statement from Michael Martin regarding how measures were \"clearly or at least apparently leaked to the Evening Standard.\""], "phi:2.7b": [" The text discusses the demand for an explanation from Ministers regarding how Budget details were printed in a London newspaper before Gordon Brown's speech, which has raised concerns about leaks and breaches of Treasury confidentiality.", "Tory MP Andrew Tyrie called it a \"serious breach\" while the Lib Dems urged Commons leader Peter Hain to make a statement.", "The Speaker Michael Martin agreed that the issue was concerning but no immediate action could be taken."], "orca-mini:3b": [" MPs demand Budget leak answers after leaks were reported in a London newspaper before Gordon Brown's speech.", "The Tories and Lib Dems criticized the breach of Treasury confidentiality and demanded an immediate ministerial statement."], "hermes3:3b": ["MPs demand answers over leaked budget details before speech."], "stablelm-zephyr:3b": ["MPs are demanding explanations from ministers about how Budget details were leaked to a London newspaper half an hour before Gordon Brown's speech.", "The Tories and Lib Dems criticize this as a serious breach of Treasury confidentiality.", "Tory frontbencher Andrew Tyrie MP calls for an immediate ministerial statement on the matter, raising concerns over previous Labour chancellor Hugh Dalton who resigned after leaking the Budget.", "Liberal Democrat David Laws considers it a \"very serious matter\" and calls for Commons leader Peter Hain to make a statement on Thursday."], "chatgpt-4o-latest": ["MPs have demanded answers after details of the Budget appeared in a London newspaper before Chancellor Gordon Brown's speech.", "The Tories called it a \"serious breach of Treasury confidentiality,\" while the Lib Dems urged Commons leader Peter Hain to address the issue, noting past resignations over leaks.", "Tory MP Andrew Tyrie called for an immediate ministerial statement, citing it as a breach of confidentiality and parliamentary decorum.", "He referenced a 1947 case where Labour Chancellor Hugh Dalton resigned after a similar leak.", "Deputy Speaker Sylvia Heal acknowledged the concern but said the matter would be referred to Speaker Michael Martin."], "stablelm2:1.6b": ["MPs demand explanations for leaked budget details in London newspaper before Gordon Brown's speech.", "Tories criticize this as a serious breach of Treasury confidentiality, while Lib Dems call for Commons leader Peter Hain to make a statement and demand immediate ministerial answers.", "Tory frontbencher Andrew Tyrie raises concerns about leaked measures and hopes it was unintentional.", "Previous Labour chancellor Hugh Dalton resigned due to leaking details of his budget to journalist just before announcement in House of Commons."], "granite3.1-dense:2b": ["Members of Parliament, including Tory MP Andrew Tyrie, have requested an urgent ministerial explanation for a Budget leak that occurred when details appeared in the London newspaper Evening Standard, half an hour before Chancellor Gordon Brown was set to deliver his speech.", "This incident is described as a \"serious breach of Treasury confidentiality\" and recalls previous cases where chancellors resigned following similar leaks.", "Tyrie emphasized the gravity of the situation, suggesting it might be unintentional but warning of severe consequences if planned.", "The issue will be formally brought to Speaker Michael Martin's attention by Deputy Speaker Sylvia Heal."]}