{"raw_text": "US casino 'tricks' face ban in UK\n \n Controversial new UK casinos will be banned from using American tricks of the trade to ensure they are \"socially responsible\", it has been suggested.\n \n Culture Secretary Tessa Jowell said proposed super-casinos will be different from their US counterparts. In America, pheromones have reportedly been released from machines to encourage aggressive gambling and clocks are often removed from walls. Eight super-casinos are proposed from 2010 if the Gambling Bill becomes law. Ms Jowell said the legislation would ban psychological trickery.\n \n She told The Times: \"British casinos will be quite different to those overseas.\n \n \"They will have to act in a socially responsible way and will be tightly regulated. \"They will be run according to British rules and we'll simply not allow any tricks which people are subjected to unawares and which increase the risk of problem gambling.\" One tactic used in the US is simulating daylight during night-time to lull players into remaining at the tables and slot machines. Casinos also frequently offer free food, drink and hotel accommodation to keep punters betting. A spokesman for the British Casino Association, which represents the UK industry, said the government was trying to allay fears over a \"UK Las Vegas\". He said the way the licences were being awarded meant UK firms were at a massive disadvantage and foreign companies would be certain to win the contracts. \"The UK industry is one of the world's most respected,\" he said. \"We have the lowest level of problem gambling in the world. \"We certainly don't use pheremones. \"The UK gambling industry is being totally frozen in time, and the foreign companies will take over.\"\n", "llama3.2:1b": ["Controversial new US-style casinos proposed for the UK face a potential ban due to concerns about their use of American tricks, such as releasing pheromones from machines or removing clocks from walls.", "Proposed super-casinos would be \"socially responsible\" and subject to stricter regulations, including being run according to British rules and not using problem-gambling tactics."], "llama3.2:3b": ["UK culture secretary Tessa Jowell proposes to ban US-style tricks from proposed super-casinos in Britain, citing concerns over socially irresponsible practices such as releasing pheromones or removing clocks to encourage aggressive gambling.", "British casinos would be tightly regulated and run according to British rules, with a focus on preventing problem gambling."], "gemma2:2b": ["UK casinos will be banned from using US tactics like pheromone release, clock removal, and freebies to encourage gambling and potentially exacerbate problem gambling.", "Super-casinos are proposed but regulations will ensure \"socially responsible\" practices and prevent psychological trickery.", "The British Casino Association argues the government's approach favors foreign companies while underestimating UK industry's expertise and track record in maintaining low problem gambling rates."], "qwen2.5:0.5b": ["US casinos face a ban from using American tricks to prevent them from being perceived as socially responsible.", "The Culture Secretary Tessa Jowell suggested a ban on super-casinos with pheromones and clocks removed.", "She stated that British casinos would be different due to the regulations of UK law, run according to British rules without any psychological tricks.", "Some US companies are offering free food, drink, and accommodation for players; however, foreign companies would take over the British gambling industry."], "qwen2.5:1.5b": ["US casinos face a ban from using psychological tricks like aggressive gamblers' releases or deceptive lighting to promote gambling, as proposed new laws aim to make UK casinos socially responsible, with free food and hotel accommodations also banned."], "qwen2.5:3b": ["US casino 'tricks' face ban in UK: Proposed super-casinos will be regulated to avoid using American psychological tricks such as simulating daylight and offering free amenities to reduce problem gambling risk.", "Culture Secretary Tessa Jowell suggests British casinos will act responsibly, while the British Casino Association fears foreign companies could dominate under new regulations favoring them."], "opencoder:1.5b": ["US casino 'tricks' face ban in UK\n\nControversial new UK casinos will be banned from using American tricks of the trade to ensure they are socially responsible.", "Culture Secretary Tessa Jowell proposed super-casinos will be different from their US counterparts.", "In America, pheromones have reportedly been released from machines to encourage aggressive gambling and clocks are often removed from walls.", "Eight super-casinos are proposed from 20 ten if the Gambling Bill becomes law.", "British casinos will be quite different to those overseas.", "They will have to act in a socially responsible way and will be tightly regulated.", "They will be run according to British rules and we'll simply not allow any tricks which people are subjected to unawares and which increase the risk of problem gambling.", "One tactic used in the US is simulating daylight during night-time to lull players into remaining at the tables and slot machines.", "Casinos also frequently offer free food, drink and hotel accommodation to keep punters betting.", "The British Casino Association (BCA) said the government was trying to allay fears over a \"UK Las Vegas\".", "He said the way the licences were being awarded meant UK firms were at a massive disadvantage and foreign companies would be certain to win the contracts.", "\"British gambling industry is one of the world's most respected,\" he said.", "\"We have the lowest level of problem gambling in the world.\"", "The government has also been trying to reverse trends seen with gambling companies such as casino and slots, which are gaining traction."], "smollm:1.7b": ["The US casino face ban in the UK is a controversial measure that aims to ensure socially responsible gambling practices.", "The proposed super-casinos will be different from those overseas due to stricter regulations and social responsibility requirements.", "One tactic used in the US is simulating daylight during night-time to lull players into remaining at the tables and slot machines, while British casinos will not use this method.", "A spokesperson for the British Casino Association said the way the licences are being awarded meant UK firms were at a massive disadvantage compared to foreign companies."], "deepseek-r1:1.5b": ["British casinos Will Be Socially Responsible  \n\nControversial new UK casinos are banned from using American gambling tricks, including pheromones being released into machines and removing clocks from walls, as part of efforts to replace their current approach with more socially responsible methods.", "The Culture Secretary, Tessa Jowell, proposed eight super-casinos starting in 2010 if the Gambling Bill becomes law.", "They will act responsibly and be tightly regulated.", "While offering free food, drink, and hotel accommodations is a common practice in many casinos, this article suggests it is being used against UK firms.", "The British Casino Association argues that they aim for \"UK Las Vegas,\" which claims to have the lowest level of problem gambling in the world, using no pheromones.", "They argue foreign companies will secure contracts, while UK firms face competitive disadvantage."], "tinyllama:1.1b": ["Ahead of proposed super-casinos coming to the UK, the British government has announced new laws aimed at making them responsible and social.", "The proposal includes a ban on using American trick games (such as pheroones) in casinos, as well as tighter regulation of the industry and its employees.", "The UK industry is not being discouraged from operating but will have to act \"in a socially responsible way\" to avoid any risk of problem gambling.", "The new laws will be based on British rules and may limit foreign companies' access to license contracts.", "A UK spokesman for the casino association emphasized that the government is trying to take away their advantage in comparison to Vegas, while a foreign company could be guaranteed to win the licenses."], "tinydolphin:1.1b": [" In response to concerns about social responsibility at US-style casinos, UK authorities are considering outright banning any super-casino features that might encourage aggressive gambling behavior.", "This approach is seen as a way to ensure that the proposed UK Casino tricks will be socially responsible in comparison to their American counterparts.", "The British Casino Association also believes this approach could undermine the industry's reputation for being one of the world's most respected."], "phi:2.7b": [" The UK government proposed to ban the controversial American \"trick\" casino practices such as using pheromones and removing clocks from walls, which have been reported to encourage aggressive gambling.", "Eight super-casinos are planned, but they would be different from US casinos in terms of running based on British rules with tight regulation to ensure social responsibility.", "The government wants to prevent any \"trick\" that subjects people unawares and increases the risk of problem gambling.", "The UK casino industry is known for being one of the world's most respected, with low level of problem gambling."], "orca-mini:3b": [" The UK government proposes banning controversial new casinos from using American tricks to ensure they are socially responsible.", "This includes tactics such as releasing pheromones from machines to encourage aggressive gambling and removing clocks from walls.", "The British Casino Association argues that the way licences are being awarded gives foreign companies an unfair advantage, and that UK firms have a lower level of problem gambling compared to other countries."], "hermes3:3b": ["UK to ban US casino tricks in new casinos"], "stablelm-zephyr:3b": ["New UK casinos will be prohibited from using controversial American tricks to ensure they adhere to socially responsible practices.", "Culture Secretary Tessa Jowell emphasized that British casinos will differ from their US counterparts and will be tightly regulated.", "Psychological trickery, such as releasing pheromones or removing clocks, will be banned, along with other tactics aimed at encouraging aggressive gambling.", "The proposed Gambling Bill includes eight super-casinos; however, a spokesman for the British Casino Association argues that this could lead to foreign companies taking over the UK market due to insufficient licensing processes."], "chatgpt-4o-latest": ["The UK government plans to ban American-style psychological tactics in proposed super-casinos to ensure they operate in a socially responsible manner.", "Culture Secretary Tessa Jowell stated that British casinos will be tightly regulated and prohibited from using tricks like releasing pheromones, removing clocks, or simulating daylight to encourage gambling.", "The Gambling Bill, if passed, will allow eight super-casinos from 2010.", "A British Casino Association spokesman criticized the licensing process, arguing it disadvantages UK firms and favors foreign companies, despite the UK having one of the world's lowest levels of problem gambling."], "stablelm2:1.6b": ["New UK casinos face a ban on using American casino tricks due to concerns about their \"socially responsible\" approach.", "Culture Secretary Tessa Jowell suggests that British casinos will differ from US ones, regulating the activity without allowing unawares tricks or increasing risks of problem gambling.", "Psychological trickery is banned in proposed super-casinos, with tactics like simulating daylight and offering free food, drink, and hotel accommodations to be avoided."], "granite3.1-dense:2b": ["The proposed super-casinos in the UK, if the Gambling Bill passes, will be significantly different from their US counterparts due to strict regulations banning psychological trickery.", "Culture Secretary Tessa Jowell emphasized that British casinos must act responsibly and be tightly controlled to prevent gambling-related risks and problem gambling.", "These measures aim to address concerns of a \"UK Las Vegas.\"", "In contrast, US casinos employ various tactics, such as releasing pheromones, altering clocks' appearance on walls, simulating daylight during nighttime, offering free food, drink, and accommodation to prolong play.", "The British Casino Association countered that UK firms are already highly respected and have a low level of problem gambling, arguing they do not use such deceptive practices and should not face foreign competition due to these regulations."]}