{"raw_text": "Blair defends terror law changes\n \n The prime minister has defended measures to allow house arrest without trial, saying \"several hundred\" people in the UK are plotting terror attacks.\n \n The government is facing opposition from Tory and Lib Dem MPs and its own backbenchers as it prepares for the final Commons debate on the changes. But Tony Blair said there could be no concession on the \"basic principle\". Mr Blair told the BBC the \"control orders\" would only be used in the most limited circumstances. Critics in the opposition and civil rights activists are worried that the home secretary will have the power to issue the detention orders. But the government has so far resisted pressure for judges to be responsible for making the orders, instead saying judges will be able to quash them.\n \n An explanation is being sent by Home Secretary Charles Clarke to all MPs and peers ahead of the final debate in the House of Commons. On Sunday, Conservative shadow home secretary David Davis claimed judges would get the powers to issue detention orders. And Liberal Democrat leader Charles Kennedy said some concessions had already been offered by the government during last-minute negotiations. Some 32 Labour MPs voted against the legislation last week. Barbara Follett, whose first husband was killed while under house arrest in South Africa during the apartheid era, confirmed she would vote against the government.\n \n But the government is continuing to insist that \"control orders\" must be issued by the home secretary. Mr Blair told BBC Radio 4's Woman's Hour: \"We are being advised by the police and the security services... \"What they say is you have got to give us powers in between mere surveillance of these people - there are several hundred of them in this country who we believe are engaged in plotting or trying to commit terrorist acts - you have got to give us power in between just surveying them and being able, being sure enough of the proof, to prosecute them beyond reasonable doubt. \"And these will be restrictions on their liberty that we will use only in the most limited circumstances.\"\n \n A YouGov poll in the Daily Telegraph suggested 75% of respondents thought action was sometimes necessary against people who had not committed an offence but who had been found by intelligence services to be planning a terrorist attack. But Tory leader Michael Howard told BBC News that the government was again making a mistake in \"rushing\" anti-terrorism legislation. \"I very much hope it would be possible to reach a compromise on this.\" He said after meeting Tony Blair he had been left with the impression that \"he really wasn't interested in any of the various proposals we have put forward\". Mr Clarke wants house arrest and other powers to replace indefinite jail for terror suspects - something the law lords have ruled against on the basis that it breaches human rights. BBC political correspondent Vicky Young said some form of concession on the measures was likely to be needed to get the legislation through the House of Lords, where Labour does not have a majority and would require support from other parties. Shami Chakrabarti, director of civil liberties pressure group Liberty, said who was able to issue the control orders was not the main issue. She said the legislation was \"a travesty and a perversion of justice\" and would remain \"unpalatable\" even if a judge was involved early in the process.\n", "llama3.2:1b": ["The UK government has defended measures allowing house arrest without trial, with Prime Minister Tony Blair claiming there are several hundred people plotting terrorist attacks in the country.", "The government faces opposition from Conservative MPs and its own backbenchers as it prepares for the final Commons debate on the changes.", "Home Secretary Charles Clarke is expected to send an explanation to MPs ahead of the debate.", "Critics argue that the home secretary will have the power to issue detention orders, but the government has said judges will be responsible.", "The government insists that \"control orders\" must be issued by the home secretary and claims that there are only limited circumstances in which this can happen."], "llama3.2:3b": ["Blair defends terror law changes allowing house arrest without trial, saying \"several hundred\" people are plotting attacks, citing police and security services' advice.", "The government is facing opposition from MPs and civil rights activists, with critics worried about home secretary's power to issue detention orders."], "gemma2:2b": ["The UK government is defending measures allowing house arrest without trial for suspected terrorists, arguing it is necessary to prevent attacks.", "Opposition is coming from various sources including Tory and Lib Dem MPs, as well as civil rights groups.", "While Home Secretary Charles Clarke provides explanations to all MPs and peers, the government insists home secretaries should issue control orders, with judges able to challenge them later.", "A YouGov poll suggests public support for these measures exists, while Michael Howard criticizes the government's approach to anti-terrorism legislation.", "The government seeks to replace indefinite detention for terror suspects with house arrest and other powers, a move that may require concessions from the House of Lords due to opposition from Labour Party."], "qwen2.5:0.5b": ["UK Prime Minister Liz Kendall defended measures allowing house arrest without trial, saying several hundred people are plotting terrorist attacks, while MPs and peers face opposition to the government's backbenchers.", "The UK is facing pressure from both Tory and Lib Dem MPs to oppose home arrest powers but will not concede on \"control orders\" as long as judges can quash them.", "The Home Secretary, Charles Clarke, sent an explanation by BBC Radio 4's Woman's Hour ahead of the final Commons debate.", "Tory leader Michael Howard said a compromise was needed if he wanted to reach a deal with Tony Blair.", "The government wants to replace indefinite jail for terror suspects with house arrest and other powers but believes \"control orders\" are necessary.", "BBC political correspondent Vicky Young noted some 75% of respondents believed action could sometimes be necessary against people planning terrorist attacks, while Labour leader Jeremy Corbyn accused the government of making a \"travesty\"."], "qwen2.5:1.5b": ["Prime Minister Tony Blair defends new powers allowing house arrest for potential terror suspects, saying it's only used in very limited cases, despite opposition from MPs and civil rights groups who worry judges will issue detention orders.", "The government insists these can be issued by Home Secretary Charles Clarke without judicial oversight, while an explanatory memo is being sent to MPs and peers ahead of the final Commons debate.", "Blair also states that \"control orders\" are needed in between mere surveillance and prosecution for potential terrorists.", "This comes after criticism from opposition parties about judges gaining such powers.", "Some 32 Labour MPs voted against the legislation last week, with some civil rights activists opposing it."], "qwen2.5:3b": ["Blair defends terror law changes allowing house arrest without trial, claiming several hundred people are plotting attacks.", "The government faces opposition from MPs and civil rights activists who worry about power over detention orders.", "Home Secretary Charles Clarke is sending an explanation to all MPs ahead of the final debate.", "Critics argue judges should issue these orders, but the government insists they will be issued by the home secretary.", "Recent YouGov poll shows 75% support for such measures.", "Conservative leader Michael Howard suggests compromise is needed for legislation to pass in House of Lords, where Labour does not have a majority.", "Civil liberties group Liberty deems issuance method less concerning than the law itself and calls the changes \"unpalatable.\""], "opencoder:1.5b": ["The prime minister has defended measures to allow house arrest without trial, saying several hundred people are plotting attacks.", "The government is facing opposition from Tory and Lib Dem MPs as it prepares for the final Commons debate on the changes.", "But Tony Blair said there could be no concession on the \"basic principle\".", "Mr Blair told the BBC that \"control orders\" would only be used in the most limited circumstances.", "Critics are worried about the possibility of issuing the detention orders by the home secretary.", "The government has insisted it will not.", "However, as the matter continues to stir, a YouGov poll suggested 75% of respondents thought action was sometimes necessary against people who had not committed an offence but who had been found by intelligence services to be planning a terrorist attack.", "The government's insistence on this is likely to get it reversed in the House of Lords where Labour does not have a majority and would require support from other parties."], "smollm:1.7b": ["The Prime Minister has defended measures to allow house arrest without trial, saying \"several hundred\" people in the UK are plotting terror attacks.", "The government is facing opposition from Tory and Lib Dem MPs and its own backbenchers as it prepares for the final Commons debate on the changes.", "But Tony Blair said there could be no concession on the \"basic principle\".", "Mr Blair told the BBC the \"control orders\" would only be used in the most limited circumstances.", "Critics in the opposition and civil rights activists are worried that the government has so far resisted pressure for judges to be responsible for making the orders, instead saying judges will get the powers to issue them.", "But the government has so far insisted that \"control orders\" must be issued by the home secretary.", "Barbara Follett, whose first husband was killed while under house arrest in South Africa during the apartheid era, confirmed she would vote against the government.", "But the government is continuing to insist that \"control orders\" must be issued by the home secretary.", "Mr Clarke told BBC Radio 4's Woman's Hour: \"We are being advised by the police and the security services... \"What they say is you have got to give us powers in between mere surveillance of these people - there are several hundred of them in this country who we believe are planning a terrorist attack - you have got to give us power in between just surveying them and being able, being sure enough of the proof, to prosecute them beyond reasonable doubt.", "\"And these will be restrictions on their liberty that we will use only in the most limited circumstances.\"", "A YouGov poll in the Daily Telegraph suggested 75% of respondents thought action was sometimes necessary against people who had not committed an offence but who had been found by intelligence services to be planning a terrorist attack.", "But Tory leader Michael Howard told BBC News that the government was again making a mistake in \"rushing\" anti-terrorism legislation.", "Mr Clarke wants house arrest and other powers to replace indefinite jail for terror suspects - something the law lords have ruled against on the basis that it breaches human rights.", "BBC political correspondent Vicky Young said some form of concession on the measures was likely to be needed to get the legislation through the House of Lords, where Labour does not have a majority and would require support from other parties.", "Shami Chakrabarti, director of civil liberties pressure group Liberty, said who was able to issue the control orders was not the main issue.", "She said the legislation was \"a travesty and a perversion of justice\" and would remain \"unpalatable\" even if a judge was involved early in the process.", "The government has been criticized for its handling of the terror threat, with some arguing that it has given too much power to intelligence agencies and not enough to the police.", "The Prime Minister's own office has been accused of being overly cautious on this issue."], "deepseek-r1:1.5b": ["Blair defends measures allowing house arrest without trial to prevent terrorism.", "The Home Secretary sends an explanation to MPs before a final debate.", "There are strong opposition from both Tory and Lib Dem MPs, as well as backbenchers.", "Blair stated no concession on \"control orders\" being handed by the home secretary.", "Some opposition worried about government inability to issue restricted detention orders.", "A YouGov poll suggested 75% think action against non-offenders might be needed.", "The government argues this violates human rights and faces resistance from judges, despite plans to restrict liberty in limited circumstances."], "tinyllama:1.1b": ["The prime minister has defended changes to terror laws, stating that \"severa lhunded people in the UK are plotting terror attacks\", and that they have the \"control orders\" power to issue detention orders with judges responsible for quashing them.", "Critics, including civil rights activists and opposition MPs, fear these measures could be used to detain without trial, but the government is insisting on home secretary Charles Clarke's explanation ahead of a final debate in the House of Commons.", "The controversial legislation has faced resistance from Torian MPs and Lib Dem opponents, with some criticisms that it breaches human rights.", "Tony Blair defended these measures, stating that they were necessary due to \"severa lhunded suspects plotting terror attacks\".", "However, the government is still expected to face opposition in reaching a compromise on the measures, and who can issue control orders will remain unpalatable, even if judges are involved early in the process."], "tinydolphin:1.1b": [" Blair defends terror law changes, stating: \"several hundred\" people in the UK are plotting terror attacks, but he emphasizes that these measures would only be used in the most limited circumstances.", "The government faces opposition from Tory and Lib Dem MPs, but it is moving forward with its plans for house arrest without trial.", "Blair states that home secretary Charles Clarke will have the authority to issue control orders only when necessary and the rules would apply in the most limited circumstances.", "Critics argue that this could lead to a situation where judges have no oversight of these detention orders, while others suggest there is already enough room for debate on the issue."], "phi:2.7b": [" The article reports on the debate over new laws that allow house arrest for terror suspects without trial.", "Prime Minister Tony Blair defends the measures, saying they will only be used in limited circumstances.", "Conservative opposition claims judges will have power to issue detention orders, while Liberal Democrats and Labour MPs worry about potential human rights violations.", "The government insists control orders must be issued by the home secretary."], "orca-mini:3b": [" Blair defends terror law changes, saying several hundred people in UK are plotting attacks and Home Secretary Charles Clarke will issue control orders.", "Some MPs and backbenchers oppose the government, but Tony Blair says there can be no concession on the basic principle of control orders.", "Labour MPs who voted against the legislation last week will vote against it again if concessions are made.", "The government is seeking powers to issue control orders in between surveillance and prosecute people for terrorist acts without a trial.", "A compromise is expected to be reached with the House of Lords.", "Some 32 Labour MPs voted against the legislation, Barbara Follett confirms she will vote against the government, Charles Kennedy suggests some concessions have already been made, and a YouGov poll found that 75% of people believe action is sometimes necessary against those not convicted of an offence but planning a terrorist attack."], "hermes3:3b": ["Blair supports terror law changes allowing house arrest without trial, despite opposition from MPs."], "stablelm-zephyr:3b": ["The UK prime minister, Tony Blair, defends measures allowing house arrest without trial, stating that several hundred people in the country are plotting terror attacks.", "The government faces opposition from Tory and Lib Dem MPs and its own backbenchers during the final Commons debate on the changes.", "Critics argue that home secretarys will have the power to issue detention orders, while judges should be responsible for making them.", "However, the government insists \"control orders\" must be issued by the home secretary, arguing that they will only be used in limited circumstances.", "Some 32 Labour MPs voted against the legislation last week.", "A YouGov poll suggests 75% of respondents believe action is sometimes necessary against people found planning terrorist acts but not yet committed an offense."], "chatgpt-4o-latest": ["Prime Minister Tony Blair defended proposed anti-terror laws allowing house arrest without trial, citing the need to prevent attacks by \"several hundred\" suspected terrorists in the UK.", "The government faces opposition from Conservative, Liberal Democrat, and Labour MPs, who argue that detention orders should be issued by judges rather than the home secretary.", "Despite criticism from civil rights groups and political opponents, Blair insisted on the necessity of \"control orders\" based on security advice.", "While some concessions have been discussed, the government remains firm on its stance.", "A YouGov poll indicated public support for preemptive action against terror suspects, but Tory leader Michael Howard criticized the rushed legislation.", "The government seeks to replace indefinite detention, previously ruled a human rights violation, but may need to compromise to pass the bill in the House of Lords.", "Civil liberties advocates argue the law undermines justice, regardless of judicial involvement."], "stablelm2:1.6b": ["Prime Minister Tony Blair defended terror law changes, stating that several hundred people in the UK are plotting attacks.", "The government faces opposition from MPs and is preparing for the final Commons debate on the changes.", "Critics worry about home secretary Charles Clarke having power to issue detention orders during a house arrest without trial.", "An explanation will be sent by Clarke ahead of the final debate.", "Tory leader Michael Howard opposes the legislation, while Labour MP Barbara Follett plans to vote against it.", "The government insists control orders must be issued by the home secretary and not judges.", "A poll suggests 80% of respondents thought some action was necessary against people planning terrorist attacks, but a YouGov poll found that only 5% supported such action without reasonable doubt.", "Tory leader Howard hopes for compromise on the legislation."], "granite3.1-dense:2b": ["Tony Blair defends proposed terror law changes that allow house arrest without trial, citing intelligence reports indicating several hundred UK residents are planning attacks.", "The government is facing opposition from Conservative and Lib Dem MPs and some Labour members, who argue against the home secretary issuing detention orders.", "Critics fear judges could be given this power instead of the home secretary.", "Despite criticism, the government maintains that \"control orders\" will only be used in extreme circumstances and has ruled out judicial involvement in their issuance.", "A YouGov poll suggests 75% of respondents support such measures for uncharged individuals linked to terror plots.", "Opposition leaders, including Michael Howard, urge a compromise, while the government insists it's essential for national security.", "Labour lacks a majority in the House of Lords, necessitating potential concessions to pass the legislation through that chamber.", "Civil liberties groups, like Liberty, argue that who can issue control orders is less crucial and that the proposed laws are an affront to justice."]}