{"raw_text": "Hunt ban support is 'in decline'\n \n Support for a ban on hunting has fallen in the past six years, a poll suggests.\n \n Less than half the UK wants a ban compared to almost two-thirds in 1999, the Mori survey of 2,000 adults for BBC One's Countryfile programme suggests. The number opposed to a ban remains constant, but those \"neither supporting nor opposing\" has increased by 11%. Most city-dwellers support the ban but rural people were evenly split between supporters, opponents and undecided.\n \n Polling company Mori carried out both surveys. In July 1999 they asked 801 adults if they supported the ban for the Mail on Sunday. For Countryfile they asked 2,234 adults across the country the same question. The Mail on Sunday survey found that 63% supported a hunting ban compared with 24% against. In the Countryfile survey, 47% said they supported the legislation, with 26% against. But the programme makers suggest the British public are becoming \"increasingly neutral\" to the issue because around one quarter said they \"neither support nor oppose\" a ban.\n", "llama3.2:1b": ["Support for a ban on hunting in the UK has fallen over the past six years, from almost two-thirds in 1999 to less than half in a recent Mori survey of 2,000 adults.", "The number opposed remains constant, but undecided individuals have increased by 11%.", "Support is evenly split between city and rural areas, with most urban support for a ban while rural people are divided."], "llama3.2:3b": ["Support for a UK hunting ban has declined by nearly half since 1999, from almost two-thirds to less than half of adults polled, with city-dwellers more likely to support the ban and rural areas evenly split."], "gemma2:2b": ["Support for a hunting ban in the UK has declined over the past six years.", "Less than half of adults now support a ban, compared to almost two-thirds in 1999.", "The number opposing a ban remains constant, but those who are neither supporting nor opposing the ban has increased.", "City dwellers are more likely to support a ban than rural residents."], "qwen2.5:0.5b": ["The Mori poll suggests that less than half of UK people support a hunting ban, which is down from nearly two-thirds in 1999.", "Most city-dwellers opposed it but rural areas were evenly split between supporters and opponents."], "qwen2.5:1.5b": ["Support for hunting bans in the UK has declined over six years, with less than half of those polled now supporting a ban compared to nearly two-thirds in 1999, according to polling data from Mori Survey and BBC's Countryfile program.", "Poll results show that city-dwellers are overwhelmingly supportive, while rural residents remain evenly split between supporters, opponents, and undecided individuals."], "qwen2.5:3b": ["Hunt ban support has declined in the UK from almost two-thirds in 1999 to less than half, according to a Mori poll for BBC One's Countryfile programme.", "While opposition remains constant at about 24%, those who are neither supporting nor opposing have increased by 11%.", "Polling shows that urban residents are more likely to support the ban while rural areas show an even split between supporters and opponents with a growing number indicating they don't care either way, suggesting increasing public neutrality on the issue."], "opencoder:1.5b": ["The primary argument against banning hunting remains that it can harm wildlife and cause unnecessary suffering for habitats.", "While the decline in support for the ban is apparent, most voters have noted its decrease as a result of the impact on wildlife and human society.", "The majority of UK residents, however, remain \"neither supporting nor opposing\" to the ban, suggesting a shift towards more public and less-private sectors where individuals can make responsible choices."], "smollm:1.7b": ["Hunt ban support is in decline.", "Support for a ban on hunting has fallen by more than half over the past six years, according to a poll.", "The number of people who want a ban on hunting has increased from 47% in 1999 to 63% today.", "However, rural residents are less likely to support a ban compared with city dwellers."], "deepseek-r1:1.5b": ["The Hunt Ban Support trend has declined in the UK, with less than half supporting a hunting ban compared to nearly two-thirds from 1999.", "A survey for BBC One found that around one quarter of adults were 'neither supportive nor opposing' a hunt ban, up by 11% since 1999.", "Support was higher on Mail on Sunday (63%) than Countryfile (47%), with similar opposition rates (24% vs. 26%)."], "tinyllama:1.1b": ["Based on a recent poll of 2,000 adults across the UK, there has been a decline in support for a hunting ban over the past six years.", "Support for the legislation among the general public remains steady, with most city-dwellers and rural people still opposed to a ban.", "Despite the slight decrease in overall support, the poll suggests that voters are becoming increasingly \"incrasively neutral\" towards the issue due to the popularity of controversial hunting shows on TV."], "tinydolphin:1.1b": [" The current state of public opinion on hunting ban in the UK is in decline, according to a recent survey by BBC's Countryfile programme and the polling company Mori.", "The poll conducted in July 1999 found that 63% of those who supported the ban at that time opposed it now, while 24% continued in support.", "Similarly, support for the ban has decreased over the years among both rural and urban areas, where there has been an increase in opposition to a ban.", "In July 1999, 63% of urban supporters were in favor of a hunting ban compared with only 24% opposing it.", "The BBC program mentioned that this mirrors the national trend."], "phi:2.7b": [" According to recent polls conducted by Mori, there has been a decline in support for hunting bans in the past six years, with less than half of UK adults supporting it compared to almost two-thirds in 1999.", "Most city-dwellers are in favor of the ban, while rural people are evenly divided between supporters and opponents.", "The percentage of those who neither support nor oppose the ban has increased by 11%."], "orca-mini:3b": [" Support for a hunting ban has decreased in the past six years, according to a poll.", "Only 47% of people surveyed supported the legislation, while 26% opposed it.", "However, more people \"neither support nor oppose\" a ban, with 21% expressing this sentiment."], "hermes3:3b": ["Support for hunting ban declined by more than half in UK, from ~2/3 to <1/2 in past 6 years, according to 1999 and 2021 Mori polls."], "stablelm-zephyr:3b": ["Support for a hunting ban in the UK has declined, with less than half of the population wanting one compared to almost two-thirds in 2009, according to a Mori poll conducted for BBC One's Countryfile program.", "While the number of people opposed to a ban remains constant, those who neither support nor oppose the idea have increased by 11%.", "Most city-dwellers support the ban, while rural areas are split evenly between supporters, opponents, and undecided individuals.", "The poll suggests that the British public is becoming more neutral on the issue due to one quarter of respondents saying they \"neither support nor oppose\" a ban."], "chatgpt-4o-latest": ["Support for a hunting ban in the UK has declined over six years, according to a Mori poll.", "In 1999, 63% supported a ban, but by the latest survey, only 47% did, while opposition remained steady.", "The number of neutral respondents increased by 11%, suggesting growing indifference.", "City-dwellers mostly support the ban, while rural residents are evenly split.", "The survey indicates the British public is becoming more neutral on the issue."], "stablelm2:1.6b": ["Over the past six years, support for a hunting ban in the UK has decreased, according to a poll by Mori.", "Only approximately half of the population wants a ban compared to two-thirds who opposed it.", "The number opposing the ban remains constant while that of those neither supporting nor opposing has increased by 10%.", "Most city-dwellers support the ban, but rural people were evenly split between supporters and opponents.", "However, the British public appears increasingly neutral on this issue, with around one-quarter saying they neither support nor oppose a hunting ban."], "granite3.1-dense:2b": ["Support for a hunting ban in the UK has significantly decreased over the past six years, according to a Mori survey for BBC One's Countryfile programme.", "While 63% of adults opposed the ban in 1999 (as per a Mail on Sunday survey), support has dwindled to 47%, as revealed by a larger 2,234-person sample in the current Countryfile survey.", "The number opposing the ban remains constant at 26%.", "Interestingly, there's been an increase of 11% in those who neither support nor oppose the ban.", "City dwellers remain more inclined to favor a hunting ban, whereas rural residents are evenly split between supporters, opponents, and undecideds.", "The survey indicates that the British public is growing increasingly neutral on the issue, with about one-quarter expressing neither support nor opposition to the ban."]}