{"raw_text": "Labour accused of 'EU propaganda'\n \n A \"taxpayer subsidised propaganda exercise\" on the EU is being used to lull the British public into a false sense of security, say the Tories.\n \n Shadow foreign secretary Michael Ancram told MPs a new White Paper was part of trying to soften up opinion ahead of the referendum on the EU constitution. His claims were denied by Foreign Secretary Jack Straw, who accused the Tories of \"running scared\" of debate. EU cooperation would help get better UK immigration controls, he argued.\n \n Mr Straw used Thursday's Commons debate to launch the new White Paper on the prospects for the EU in 2005. Security, stability and prosperity would be the key themes when the UK took over the chairmanship of the EU in July, said Mr Straw. Africa and climate change would also feature highly. He said the UK was trying to ensure future EU budgets were limited to 1% of Europe's economic output and were spent \"where it adds most value\". Mr Straw promised to continue to ensure the UK's budget rebate, secured in 1984 by Margaret Thatcher, was \"fully justified\". \"We, like all other countries, have a veto on any changes proposed in this area,\" he said.\n \n Mr Ancram condemned the document, which the Foreign Office says has cost about £2,500 to design, print and deliver. \"Isn't the reason that the government is now involved in a taxpayer subsidised propaganda exercise to try to sell the new EU to the country in advance of the forthcoming referendum and general election?,\" he asked. The Tory spokesman also criticised the government for claiming the EU constitution would make Europe easier to understand. \"The government, last week, had to publish a commentary of 500 pages to try and explain this 'easy and simple' constitution to the British people,\" he said. \"Who are they trying to kid?\" The proposed question for the constitution referendum is: \"Should the United Kingdom approve the Treaty establishing a Constitution for the European Union?\" The Electoral Commission on Thursday said it was satisfied the question was easy to understand. The government has suggested the referendum on the constitution could take place in spring 2006, with the Tories set to campaign for a \"no\" vote.\n \n Mr Ancram said ministers were prolonging uncertainty by putting the vote off until the latest date possible. The foreign secretary hit back by saying Tory attitudes to Europe had helped keep the party out of power for more than a decade. Mr Straw argued cooperation with European partners could bring a \"level playing field\" on immigration and asylum controls. \"You are setting your face against all of these things,\" he added. For the Liberal Democrats, Sir Menzies Campbell said the UK should not ignore the need to reform the EU Common Agricultural Policy. Change was particularly important for developing countries wanting access to markets, he argued. Sir Menzies was among those worried about plans, backed by the UK, to lift the arms embargo imposed on China after the Tiananmen Square massacre. Mr Straw said no decisions had been taken - Chinese human rights had improved but not by enough.\n", "llama3.2:1b": ["Labour accused of \"EU propaganda\" as they argue that a new White Paper is being used to influence public opinion in advance of the UK's referendum on the EU constitution.", "The Tories deny this, with Foreign Secretary Jack Straw accusing Labour of trying to run away from debate, while the Liberal Democrats call for reform of the EU Common Agricultural Policy and China's arms embargo."], "llama3.2:3b": ["Tories claim new EU White Paper is a \"taxpayer subsidised propaganda exercise\" to lull public into false sense of security.", "Foreign Secretary Jack Straw denies this, saying cooperation with Europe could lead to better UK immigration controls and limit future EU budgets to 1% of economic output.", "The Tories are campaigning for a \"no\" vote on the EU constitution referendum, which is set to take place in spring 2006."], "gemma2:2b": ["Tories accuse Labour of using a taxpayer-funded \"propaganda exercise\" to influence public opinion about the EU before the upcoming referendum.", "Labour's Foreign Secretary argues that cooperation with other European countries can lead to better immigration controls and a fairer approach on trade and asylum policies.", "The government released a White Paper outlining their vision for the EU in 2005, highlighting security, stability, prosperity, climate change, and Africa as key themes for the UK's presidency of the EU.", "The Electoral Commission confirmed that the referendum question is straightforward, with the Tories aiming to campaign against the constitution.", "Opposition parties argue that delaying the vote until late 2006 will cause further uncertainty.", "The Liberal Democrats called for reform within the EU Common Agricultural Policy and urged caution on lifting the arms embargo on China."], "qwen2.5:0.5b": ["A \"EU propaganda exercise\" is being used to lull the British public into a false sense of security about EU cooperation, leading to concerns over immigration and climate change.", "Michael Ancram claims that a new White Paper will be presented on these topics for consideration in advance of the upcoming European Union referendum.", "The government has suggested the referendum could take place in 2006 with Tory MPs set to campaign for a \"no\" vote."], "qwen2.5:1.5b": ["The Tories accuse the government of using a new White Paper to sell the EU before the referendum, arguing it's a \"taxpayer subsidised propaganda exercise.\"", "They claim the document has cost £2,500 and that the British public will be misled about the EU constitution.", "The Foreign Office says the paper aims to ensure future EU budgets are spent in the UK's best interest, while MP Michael Ancram questions whether taxpayers will be lured into a false sense of security.", "The government is accused of claiming an easy-to-understand EU constitution will make Europe easier to understand, but it has required 500 pages of commentary for the British public to grasp its meaning.", "The Conservatives argue ministers are prolonging uncertainty by delaying the constitutional referendum until late 2006 and suggest reforming the Common Agricultural Policy is necessary for developing countries wanting access to markets."], "qwen2.5:3b": ["Labour accuses the Tories of using taxpayer-funded propaganda to sell EU ideas ahead of referendum and general election.", "The Foreign Secretary claims cooperation with EU would improve immigration controls, while Shadow foreign secretary criticizes the document as trying to soften public opinion.", "The proposed UK constitution referendum question is: \"Should the United Kingdom approve the Treaty establishing a Constitution for the European Union?\"", "MPs from different parties have differing views on EU reforms and China's human rights situation."], "opencoder:1.5b": ["\"EU Propaganda\"\nA \"taxpayer subsidised propaganda exercise\" on the EU is being used to lull the British public into a false sense of security, the Tories argued.", "Shadow foreign secretary Michael Ancram told MPs a new White Paper was part of trying to soften up opinion ahead of the referendum on the EU constitution.", "His claims were denied by Foreign Secretary Jack Straw, who accused the Tories of \"running scared\" of debate.", "EU cooperation would help get better UK immigration controls, he argued.", "Mr Straw used Thursday's Commons debate to launch the new White Paper on the prospects for the EU in 2005.", "Security, stability and prosperity would be the key themes when the UK took over the chairmanship of the EU in July, said Mr Straw.", "Africa and climate change would also feature highly.", "Mr Straw promised to continue to ensure the UK's budget rebate, secured in 1984 by Margaret Thatcher, was \"fully justified\".", "\"We, like all other countries, have a veto on any changes proposed in this area,\" he said.", "Mr Straw asked the government for a \"reasonable\" return to EU tax breaks.", "Mr Ancram condemned the document, which the Foreign Office says has cost about £2,500 to design, print and deliver.", "The government was hit with criticism at trying to sell the new EU to the country in advance of the forthcoming referendum and general election.", "The Tory spokesman also criticised the government for claiming the EU constitution would make Europe easier to understand.", "The government had to publish a commentary of 500 pages to try and explain this 'easy and simple' constitution to the British people, he said.", "\"Who are they trying to kid?\"", "The proposed question for the constitution referendum is: \"Should the United Kingdom approve the Treaty establishing a Constitution for the European Union?\"", "The government has suggested the referendum on the constitution could take place in spring 2006, with the Tories set to campaign for a \"no\" vote.", "Mr Ancram said ministers were prolonging uncertainty by putting the vote off until the latest date possible.", "The foreign secretary hit back by saying Tory attitudes to Europe had helped keep the party out of power for more than a decade.", "Mr Straw argued cooperation with European partners could bring a \"level playing field\" on immigration and asylum controls, he argued.", "For the Liberal Democrats, Sir Menzies Campbell said the UK should not ignore the need to reform the EU Common Agricultural Policy.", "Change was particularly important for developing countries wanting access to markets, he argued.", "Sir Menzies was among those worried about plans, backed by the UK, to lift the arms embargo imposed on China after the Tiananmen Square massacre.", "Meanwhile, Mr Straw said no decisions had been taken - Chinese human rights had improved but not by enough.\""], "smollm:1.7b": ["The Labour accused of 'EU propaganda' is trying to use taxpayer-subsidized propaganda exercise to lull the British public into a false sense of security before the referendum on the EU constitution.", "The Shadow Foreign Secretary said this was part of trying to soften up opinion ahead of the referendum, but the Tories denied it.", "The key themes in Labour's statement are:\n1.", "Security and stability: Labour is trying to ensure that the UK takes over the chairmanship of the EU in July 2005 with security and stability as its top priority.", "2.", "EU cooperation: Labour wants to make sure that the UK gets better UK immigration controls, but it also wants to ensure that the UK remains a key player in EU affairs.", "3.", "EU budget: The Labour is trying to secure the UK's budget rebate for 1984, which was secured by Margaret Thatcher.", "4.", "EU constitution: The Labour is running scared of debate on the EU constitution and wants to make sure that it is limited to 1% of Europe's economic output.", "5.", "EU membership: The Labour is trying to ensure that the UK gets a level playing field with other member states on immigration and asylum controls, but it also wants to make sure that the UK remains a key player in EU affairs."], "deepseek-r1:1.5b": ["The Conservative Party accused Labour of \"EU propaganda,\" suggesting they used political tactics to make the British public feel safer about the UK before its referendum on the EU constitution in 2005.", "Mr.", "Shadow Foreign Secretary Michael Ancram criticized a White Paper claiming it was made by taxpayers for political gain, while Mr. Foreign Secretary Jack Straw called Labour \"scared.\"", "The paper focused on themes like security, stability, prosperity, climate change, and budget limits.", "Mr.", "Straw argued cooperation with European partners could improve immigration controls but warned the UK would set a 2006 referendum on EU constitution.", "He criticized the government for ignoring human rights in China's arms embargo."], "tinyllama:1.1b": ["The Labour party accused of \"EU propaganda\" for its proposed new White Paper on EU affairs, which they claim is part of a \"taxpaying propaganda exercise.\"", "The shadow foreign secretary Michael Ancraim claimed the document was just an excuse to soften public opinion ahead of the referendum on the EU constitution.", "He also called out the government's claim that the EU constitution would be easy to understand and criticized their campaign for the upcoming referendum, stating it would be \"easy\" only if they were elected in 2006.", "Foreign secretary Jack Straw responded by launching a new White Paper on the European Union, emphasizing its security, stability, and prosperity while highlighting future budget constraints and Africa's and climate change's importance.", "The Liberals criticized the government for ignoring reform of the EU Common Agricultural Policy and called for change in policies that benefit developing countries, citing China as an example."], "tinydolphin:1.1b": [" \"The UK government has put forward a new White Paper on its plans for the European Union, arguing that better cooperation can help get better immigration controls in place.\"", "The paper suggests a 'level playing field' with other member states and offers examples like the EU budget rebate, which is allocated to countries based on how much they contribute to the common good.", "The UK government wants to keep its rebate for as long as possible, even if this increases costs for the country.", "The proposed constitution referendum, however, has raised questions about whether it's easy enough to understand for everyone to vote \"yes\" or \"no\".", "The Electoral Commission believes the question can be answered by simple language.", "Due in spring 2006, the referendum could provide the people of the UK with a say on whether they approve of the new constitution for the EU, which would change many aspects of how the union operates.", "The government has been procrastinating on this issue due to fears that a 'no' vote might result in the UK being left out or having to negotiate changes.", "For the Conservatives, Michael Ancram argued that EU membership is essential for better cooperation with other countries, but others like Sir Menzies Campbell worried about the lack of reform in the Common Agricultural Policy and argued that changes should be made for developing countries seeking access to markets."], "phi:2.7b": [" The Tories accuse Labour of using taxpayer money for a propaganda campaign in support of the EU constitution.", "They argue that the Conservative party should be more open to discussing the issue and that the new White Paper on the future of the EU is being used as a way to sway public opinion.", "Foreign Secretary Jack Straw disagrees, stating that security, stability, prosperity, and issues such as Africa and climate change will be key themes in the UK's chairmanship of the EU.", "He also defends the UK's budget rebate, which he says should continue to be justified.", "Shadow foreign secretary Michael Ancram questions why the government is investing money in a document that aims to sell the EU constitution before a referendum, and criticizes their claim that it will make Europe easier to understand.", "The Foreign Office confirms that the question for the referendum on the constitutional treaty has been deemed easy to comprehend by the Electoral Commission.", "Foreign Secretary Jack Straw argues that cooperation with European partners can lead to improved immigration and asylum controls, while the Liberal Democrats express concern about the UK ignoring the need to reform the EU Common Agricultural Policy.", "Sir Menzies Campbell raises issues surrounding China's access to markets and questions the UK's decision to lift an arms embargo on the country after the Tiananmen Square massacre.", "Foreign Secretary Jack Straw argues that human rights progress in China has not been enough, while the Labour party continues to support a referendum on the EU constitution."], "orca-mini:3b": [" The text is about a propaganda exercise by the government to soften public opinion ahead of the referendum on the EU constitution.", "It was claimed that the document, which cost about £2,500 to design, print and deliver, was taxpayer-funded propaganda.", "Michael Ancram accused the government of prolonging uncertainty by putting the vote off until the latest date possible.", "The foreign secretary argued cooperation with European partners could bring a \"level playing field\" on immigration and asylum controls.", "Sir Menzies Campbell said the UK should not ignore the need to reform the EU Common Agricultural Policy.", "Change was particularly important for developing countries wanting access to markets.", "However, Jack Straw denied the claims by Michael Ancram and argued that the government's White Paper was justified.", "The foreign secretary promised to continue to ensure the UK's budget rebate, secured in 1984 by Margaret Thatcher, was fully justified."], "hermes3:3b": ["Labour accused of using EU propaganda exercise to soften public opinion before referendum, claiming it as 'taxpayer subsidised'.", "Tories criticize cost and government's claims about constitution's simplicity."], "stablelm-zephyr:3b": ["Labour accusations Tories of using taxpayer-funded EU propaganda ahead of a referendum on the EU constitution.", "Shadow foreign secretary Michael Ancram condemned the White Paper, while Foreign Secretary Jack Straw argued that EU cooperation would improve UK immigration controls and promote security, stability, and prosperity within the European Union (EU).", "Straw also promised to safeguard the UK's budget rebate.", "The proposed EU constitution referendum question is \"Should the United Kingdom approve the Treaty establishing a Constitution for the European Union?\"", "with a potential date of spring 2006."], "chatgpt-4o-latest": ["The Conservatives accused the Labour government of using taxpayer money for pro-EU propaganda ahead of the referendum on the EU constitution.", "Shadow foreign secretary Michael Ancram criticized a new White Paper as an attempt to sway public opinion, while Foreign Secretary Jack Straw defended it, arguing EU cooperation would benefit the UK, particularly on immigration controls.", "Straw outlined key priorities for the UK's EU chairmanship, including security, climate change, and budget constraints.", "Ancram dismissed claims that the EU constitution was easy to understand, pointing to a lengthy government commentary.", "The referendum was expected in spring 2006, with the Tories campaigning for a \"no\" vote.", "Straw countered that Conservative opposition to Europe had kept them out of power.", "Liberal Democrat Sir Menzies Campbell emphasized the need for EU agricultural reform and raised concerns over lifting the arms embargo on China, which Straw said was still under review."], "stablelm2:1.6b": ["The Conservatives accuse the government of using a taxpayer-funded propaganda document to sway public opinion ahead of the EU referendum.", "Shadow foreign secretary Michael Ancram claims that a new White Paper is part of softening opinions for the upcoming vote, while Foreign Secretary Jack Straw denies these claims and says the UK intends to limit future EU budgets.", "Tory MP Ann Leslie accuses the government of prolonging uncertainty by delaying the vote until the latest possible date.", "Sir Menzies Campbell suggests reforming the EU Common Agricultural Policy for the benefit of developing countries seeking market access."], "granite3.1-dense:2b": ["The Conservative Party accuses the Labour government of using a £2,500-cost White Paper as \"taxpayer-subsidized propaganda\" to influence public opinion before the EU constitution referendum in 2006.", "Shadow Foreign Secretary Michael Ancram claims this document aims to soften opposition to EU membership, arguing it is misleading and unnecessary.", "He criticizes the government for publishing a 500-page explanation of the complex constitution, which he believes confirms their intent to manipulate public perception.", "Foreign Secretary Jack Straw counters these allegations, asserting that EU cooperation would improve UK immigration and asylum controls, bring economic stability, and address issues like Africa and climate change.", "He emphasizes the UK's commitment to limiting future EU budgets to 1% of Europe's GDP and maintaining the post-1984 budget rebate.", "Sir Menzies Campbell from the Liberal Democrats calls for reforming the EU Common Agricultural Policy, particularly beneficial for developing countries seeking market access.", "The planned referendum question is to determine the UK's approval of the Treaty establishing a Constitution for the European Union, with a potential spring 2006 date."]}