{"raw_text": "'EU referendum could cost £80m'\n \n It could cost £80m to run a UK referendum on the European constitution, ministers have revealed.\n \n In a written parliamentary answer, Constitutional Affairs Minister Chris Leslie said the poll was likely to cost the same as a general election. Mr Leslie said the cost could not be compared with the only previous British referendum, held 30 years ago. Ministers say the constitution would make the European Union work better but critics fear creating a \"super state\". Labour MP John Cryer, whose question revealed the price estimate, said the cost surprised him but was not a central factor as it was important people had their say. But he said it would have been better to have rejected the constitution so avoiding the need for a referendum. The 2001 election cost £80m. No date for the vote has been set but Foreign Secretary Jack Straw has suggested it is unlikely to be held until early 2006 - after the predicted date for the next election. Most voters said the UK should stay in the Common Market in the 1975 referendum.\n", "llama3.2:1b": ["The European constitution could cost £80m to run a UK referendum, with the cost not being comparable to a general election.", "The cost would be similar to a 2001 British general election.", "Ministers have suggested that the poll is unlikely to be held before 2006 due to the predicted date of the next general election."], "llama3.2:3b": ["The cost of a potential EU referendum on the European constitution may be £80m, similar to the cost of a general election."], "gemma2:2b": ["A UK referendum on the European constitution could cost £80 million, according to ministers.", "This figure is similar to the cost of a general election and is unlikely until early 2006.", "Some argue the cost is high, but others prioritize allowing public participation in the process.", "The outcome of this referendum has not been determined."], "qwen2.5:0.5b": ["The 2001 UK referendum on the European constitution cost £80m, but critics fear creating a \"super state\"."], "qwen2.5:1.5b": ["UK could cost £80m on EU referendum; estimate based on previous elections, ministers say, with Labour MP criticizing its timing and prioritizing decision rather than opposition's view of it as creating a \"super state.\""], "qwen2.5:3b": ["EU referendum could cost £80m, same as a general election.", "Ministers believe it will make EU work better but critics fear creating \"super state\".", "Cost surprised Labour MP John Cryer who suggested rejection would have been preferable.", "Previous British referendum in 1975 cost £80m.", "No date set for vote, though Foreign Secretary Jack Straw suggests unlikely before early 2006, after next election predicted to be held.", "In 1975, most voters supported UK staying in Common Market."], "opencoder:1.5b": ["'The EU referendum could cost £80m' \n\nIn a written parliamentary answer, 'Constitutive Affairs Minister Chris Leslie' mentioned that the poll was likely to cost the same as a general election.", "Mr Leslie said the cost of running the UK referendum could not be compared with other previous British referenda held 30 years ago.", "Ministers supported the creation of an European Union but expressed concerns about \"super state\".", "The Labour MP John Cryer said the cost surprised him, but he was not a central factor as it is important people have their say.", "However, he suggested avoiding a UK referendum, which would avoid needing to hold another similar election in the future."], "smollm:1.7b": ["The EU referendum could cost £80m to run a UK referendum on the European constitution, ministers have revealed.", "In a written parliamentary answer, Constitutional Affairs Minister Chris Leslie said the poll was likely to cost the same as a general election.", "Mr Leslie said the cost could not be compared with the only previous British referendum, held 30 years ago.", "Ministers say the constitution would make the European Union work better but critics fear creating a \"super state\".", "Labour MP John Cryer, whose question revealed the price estimate, said the cost surprised him but was not a central factor as it was important people had their say.", "But he said it would have been better to have rejected the constitution so avoiding the need for a referendum.", "The 2001 election cost £80m.", "No date for the vote has been set but Foreign Secretary Jack Straw has suggested it is unlikely to be held until early 2006 - after the predicted date for the next election.", "Most voters said the UK should stay in the Common Market in the 1975 referendum."], "deepseek-r1:1.5b": ["The EU referendum could cost up to £80m to run on the European constitution.", "Chris Leslie said the poll would likely cost similarly to a general election but not as expensive as the 1975 UK referendum.", "Critics fear creating a \"super state.\"", "Labour MP John Cryer suggested the cost surprised him, but he thought avoiding a referendum by voting against the constitution might have been better.", "The expected election was in 2006, following the next general election.", "The UK planned to remain in the Common Market from the 1975 referendum."], "tinyllama:1.1b": ["EU referendum could cost £80m, according to Ministers who revealed it will likely cost the same as a general election in 30 years.", "The cost was not compared with the only previous British referendum, held 30 years ago, which cost £80m.", "However, critics fear that the constitution would create a \"super state\" and increase taxes.", "Labour MP John Cryer said he was surprised by the figure but added it was an important factor to avoiding a need for a vote.", "The estimated poll price is likely to surprise some, but no date has been set for the vote, with Foreign Secretary Jack Strachey suggesting it will be held early in 2006 after the predicted date for the next election.", "Most voters said the UK should stay in the Common Market in the 1975 referendum."], "tinydolphin:1.1b": [" The statement provided describes that the UK is likely to cost £80m to conduct a constitutional referendum on the European Union (EU) in order to make EU work better.", "It was revealed in a written parliamentary answer by Chris Leslie, Construction Affairs Minister, to the UK Parliament."], "phi:2.7b": [" The UK government estimates that a referendum on the European constitution could cost around £80m, the same as a general election.", "Ministers say the poll is necessary to make the EU work better, but some fear it may create a \"super state\".", "A previous UK referendum, held 30 years ago, cost less than the 2001 general election, which was £80m.", "Labour MP John Cryer is surprised by the cost but believes it's important for people to have their say.", "No date has been set yet, but Foreign Secretary Jack Straw suggests it may be too soon after the next election, which is unlikely before early"], "orca-mini:3b": [" The cost of a UK referendum on the European constitution could be £80m, according to ministers' estimates.", "This would make it similar in cost to a general election, and unlike the previous British referendum held 30 years ago.", "Some critics fear creating a \"super state,\" but others believe people should have their say.", "The last UK referendum on joining the European Union was 40 years ago, with most voters choosing to stay in the Common Market."], "hermes3:3b": ["$80m cost for UK EU reference\n\n(Only the above text is the summary, not additional context.)"], "stablelm-zephyr:3b": ["Running a UK referendum on the European constitution could cost £80 million, according to ministers.", "The cost estimate, revealed by Constitutional Affairs Minister Chris Leslie, is similar to the £80 million spent during the 1991 general election.", "Critics argue that this could lead to the creation of a \"super state.\"", "Although Labour MP John Cryer said the cost was not central to the issue, he expressed that it would have been preferable to reject the constitution and avoid the need for a referendum.", "The specific date for the vote has yet to be announced, but Foreign Secretary Jack Straw suggests it is unlikely to take place before early 2006.", "In the 1975 referendum, most voters supported the UK's continued membership in the Common Market."], "chatgpt-4o-latest": ["A UK referendum on the European constitution could cost £80m, similar to a general election, according to Constitutional Affairs Minister Chris Leslie.", "The cost cannot be compared to the 1975 referendum.", "Ministers argue the constitution would improve EU functionality, while critics fear it could lead to a \"super state.\"", "Labour MP John Cryer found the cost surprising but emphasized the importance of public input.", "He preferred rejecting the constitution to avoid a referendum.", "The 2001 election also cost £80m.", "No date is set, but Foreign Secretary Jack Straw suggested it may not occur until early 2006, after the next election.", "In 1975, most voters supported staying in the Common Market."], "stablelm2:1.6b": ["The cost of a UK referendum on the European constitution could be similar to a general election, according to Constitutional Affairs Minister Chris Leslie.", "This follows previous estimates that a constitutional vote would cost the same as a general election.", "Critics fear creating a \"super state,\" while Labour MP John Cryer noted the surprise at the high cost but emphasized it was not a central factor in determining the outcome of the referendum.", "The 1997 UK referendum held by previous Prime Minister Tony Blair's government is considered the only comparison point due to its historical significance.", "No date for the EU referendum has been set, and Foreign Secretary Jack Straw has suggested it might not be held until early 2065 following the predicted date for the next election.", "Most voters in a hypothetical referendum wanted the UK to remain in the European Union's Common Market."], "granite3.1-dense:2b": ["The estimated cost of a UK referendum on the European constitution is £80 million, matching the expense of a general election.", "This figure surprised Labour MP John Cryer but is considered less critical than the public's right to vote.", "The 2001 general election also cost £80 million.", "No specific date for the referendum has been announced, with Foreign Secretary Jack Straw suggesting it might occur in early 2006, after the anticipated next election.", "In 1975, a similar referendum on EU membership resulted in a majority favoring continued participation in the Common Market."]}