{"raw_text": "Parliament's record of scandal\n \n In a locked room at the heart of Parliament there is a hive of scandal.\n \n Sex, betrayal and custody of children are all there in this affair but this time it has nothing to do with the recent troubles of David Blunkett or Boris Johnson.\n \n Few realise that Westminster in effect has its own divorce den. For sprinkled among 12 floors of archives are blow-by-blow accounts of marital break-ups - and now you can search what's there online. Until 1857, the only way in England to get a full divorce which allowed re-marriage was to obtain an Act of Parliament by proving adultery or life-threatening cruelty. The legacy is pages of testimonies used in the hearings, dating back to 1670, all recorded among the 325,000 items which fill the 12 floors of the parliamentary archives in Parliament's Victoria Tower. Most people researching their family history want to discover some tale of illicit love. This gives them the chance.\n \n Divorce by Parliament was an expensive process open really only to the rich but the records also include the testimony of maids, butlers and coachmen about their masters and mistresses. Among the records is the story of Jane Campbell, the first woman ever to divorce her husband. That happened in 1801 after she had discovered her husband, Edward Addison, had committed adultery with her sister Jessy.\n \n A transcript of evidence from Jessy's maid, Amelia Laugher, shows her telling how Addison frequently passed by her on the way to the room where she had just put her mistress naked to bed. It must have been a killer blow to Addison's case - he had already fled abroad rather than pay the £5,000 damages ordered by a civil court. As well as making divorce history, Jane Campbell won custody of her children - unusual for a woman at the time. But divorces are by no means the only documents in the archives which hold personal details of people often far removed from politics and Parliament.\n \n There are the protestation returns from 1642 - lists of the Protestants who pledged to \"maintain the true reformed Protestant religion\". There are details of foreign nationals made British citizens by act of Parliament, including composer George Frideric Handel in 1727. And the mass of private bills which, for example authorise the building of railways and roads, contain both the names and addresses of those involved and testimonies giving people a unique perspective on how their ancestors opposed them.\n \n Tax bills may be an extra source for pedigree hunters - the longest stretches for about 300m and is longer than the Palace of Westminster itself, listing the names of appointed tax collectors. This wealth of material has long been open to the public at the House of Lords Record Office, with visitors able to phone ahead when they want to view particular items in the search room. But now five years of work has produced an online catalogue. David Prior, assistant clerk of the archives, says the catalogue opens up new possibilities for research. \"Before, you just could not do it, you faced trawling through pages and pages of printed material,\" he says. Mr Prior sees the changes as part of a wider revolution in archives generally. \"The archive profession may look fairly staid but is in an enormous period of change, mainly motivated by the potential of IT, which is opening up all sorts of vistas for us,\" he says.\n \n The archives do, of course, hold records of high (and low) politics too for both Houses of Parliament, including copies of all acts passed since 1497 - the oldest dealing with the employment of workers in the woollen industry in Norfolk. Records for the Commons only date back to 1834 - anything earlier was wiped out by the fire which destroyed most of the Parliament buildings in 1834.\n \n But that still leaves some of the most important documents of UK political history - parts of the Bill of Rights from 1689, the death warrant for Charles I, the private papers and diaries of major politicians such as David Lloyd George and Andrew Bonar Law. There is also the 1606 act establishing 5 November as a thanksgiving day - the year after the Gunpowder Plot. That document is likely to feature in the exhibition the archives will put on next year as part of a series of events across London to mark the 400th anniversary of Guy Fawkes' conspiracy. As Mr Prior remarks as we walk by shelf after shelf of vellum (parchment made from goat's skin): \"All human life is here.\"\n", "llama3.2:1b": ["Here is a summary of the text in plain text:\n\nWestminster has records of marital break-ups and scandals including sex, betrayal, and custody of children.", "The parliamentary archives contain accounts of these events since 1670.", "A woman named Jane Campbell divorced her husband in 1801 after discovering adultery with his mistress.", "The archives also hold records of foreign nationals made British citizens by Parliament acts.", "The records are searchable online at the House of Lords Record Office, and a new online catalogue has been produced for five years of work.", "The archive profession is undergoing a \"revolution\" due to advances in IT technology, making it easier for researchers to access these records."], "llama3.2:3b": ["Parliament's archives contain records of scandal, divorce, and personal details, including testimonies from servants and maids, protestant declarations, foreign nationals' naturalization, private bills, tax bills, and records of high and low politics.", "The archives were recently digitized, allowing for online search, and include documents such as the first recorded divorce in England and the death warrant for Charles I."], "gemma2:2b": ["The archives of the UK Parliament hold records of personal details and historical events, including divorce proceedings, protestation returns, foreign national citizenship documents, private bills, tax bills, and political acts.", "An online catalog has been created for public access, allowing users to search through these records digitally.", "The archives contain a vast collection of materials dating back centuries, providing insights into the lives of individuals and the development of UK society."], "qwen2.5:0.5b": ["Parliament records a long history of scandals and controversies.", "This includes personal details like divorce proceedings, testimony about mistresses and masters, and protestation returns from the 1640s.", "It also contains records detailing foreign nationals and private bills with names and addresses.", "The archives are open to visitors for online research through their catalogue."], "qwen2.5:1.5b": ["Parliament has its own divorce den, with extensive archives documenting marital break-ups dating back to the 17th century, including testimonies on maids, butlers, and coaches.", "Divorces by Parliament were expensive but allowed for re-marriage; Jane Campbell became the first woman to divorce her husband in 1801 after discovering his adultery with her sister.", "The archives also hold lists of Protestants who pledged to maintain Protestant religion, details of foreign nationals made British citizens, tax bills listing names and addresses, and records of major politicians' private papers and diaries.", "The online catalogue opens up new possibilities for research into personal family histories and political history beyond high politics."], "qwen2.5:3b": ["Parliament houses an extensive archive containing personal and political records, including divorce cases dating back to 1670.", "These archives now have an online catalogue accessible for public research, offering a rich source of historical details about family history, religion, citizenship, politics, and significant moments in British history such as the Gunpowder Plot."], "opencoder:1.5b": ["The text provided summarizes the following:\n\"Parliament's record of scandal, in a locked room at the heart of Parliament there is a hive of scandal.", "Sex, betrayal and custody of children are all there in this affair but this time it has nothing to do with the recent troubles of David Blunkett or Boris Johnson.", "Few realise that Westminster in effect has its own divorce den.", "Until 1857, the only way in England to get a full divorce which allowed re-marriage was to obtain an Act of Parliament by proving adultery or life-threatening cruelty.", "The legacy is pages of testimonies used in the hearings, dating back to 1670, all recorded among the 325,000 items which fill the 12 floors of the parliamentary archives in Parliament's Victoria Tower.", "Most people researching their family history want to discover some tale of illicit love.", "This gives them the chance.", "Divorce by Parliament was an expensive process open really only to the rich but the records also include the testimony of maids, butlers and coachmen about their masters and mistresses.", "Among the records is the story of Jane Campbell, the first woman ever to divorce her husband.", "That happened in 1801 after she had discovered her husband, Edward Addison, had committed adultery with her sister Jessy.", "A transcript of evidence from Jessy's maid, Amelia Laugher, shows her telling how Addison frequently passed by her on the way to the room where she had just put her mistress naked to bed.", "It must have been a killer blow to Addison's case - he had already fled abroad rather than pay the £5,000 damages ordered by a civil court.", "As well as making divorce history, Jane Campbell won custody of her children - unusual for a woman at the time.", "But divorces are by no means the only documents in the archives which hold personal details of people often far removed from politics and Parliament.", "There are the protestation returns from 1642 - lists of the Protestants who pledged to \"maintain the true reformed Protestant religion\".", "There are details of foreign nationals made British citizens by act of Parliament, including composer George Frideric Handel in 1727.", "And the mass of private bills which, for example authorise the building of railways and roads, contain both the names and addresses of those involved and testimonies giving people a unique perspective on how their ancestors opposed them.", "Tax bills may be an extra source for pedigree hunters - the longest stretches for about 300m and is longer than the Palace of Westminster itself, listing the names of appointed tax collectors.", "This wealth of material has long been open to the public at the House of Lords Record Office, with visitors able to phone ahead when they want to view particular items in the search room.", "But now five years of work has produced an online catalogue.", "David Prior, assistant clerk of the archives, says the catalogue opens up new possibilities for research.", "\"Before, you just could not do it, you faced trawling through pages and pages of printed material,\" he says.", "Mr Prior sees the changes as part of a wider revolution in archives generally.", "\"The archive profession may look fairly staid but is in an enormous period of change, mainly motivated by the potential of IT, which is opening up all sorts of vistas for us,\" he says.\""], "smollm:1.7b": ["The archives hold records of high and low politics too for both Houses of Parliament, including copies of all acts passed since 1497 - the oldest dealing with the employment of workers in the woollen industry in Norfolk."], "deepseek-r1:1.5b": ["Parliament's archive contains a wealth of documents detailing marital issues, court testimony, and historical precedents.", "It includes records of Jane Campbell's divorce, witness accounts of maids about their masters, and the legacy of legal trials, particularly the discovery of her husband Edward Addison's adultery.", "The archive also features original documents from 1642 to modern times, such as tax bills, protestation returns, and private bills, offering unique insights into family preferences and political history."], "tinyllama:1.1b": ["The Parliamentary archive records a wealth of personal details and documents, including divorce proceedings and court cases, protestation returns, tax bills, and records of important political figures such as Lord Charles Haynes, the private diaries of David Lloyd George, and Andrew Bonar Law's death warrant.", "The online catalogue allows visitors to view specific items in the archive, while the archive itself has a search room for those seeking specific records.", "High politics also holds records dating back to 1497, including copies of acts passed since 1834 and parts of the Bill of Rights from 1689.", "The exhibition planned for next year will feature the Gunpowder Plot's Thanksgivings Day document and a series of events across London to mark the 400th anniversary of Guy Fawnes' conspiracy."], "tinydolphin:1.1b": [" Parliament has a vast array of records available to the public, ranging from divorce proceedings to tax bills.", "As part of their ongoing digitization efforts, the House of Lords Record Office has recently introduced a searchable online catalogue for these records.", "This catalogue allows researchers to easily locate and access specific documents within the archives.", "One such record that can be accessed through this catalogue is the 1606 act establishing 5 November as a thanksgiving day.", "This act was passed in response to the Gunpowder Plot, which occurred on that date in 1605.", "By honoring 5 November as a day of thanks, the legislature aimed to demonstrate their support for those who had taken part in the plot and to provide some sense of closure after such a devastating event.", "In addition to these records, visitors can also explore the House of Lords Record Office's extensive collection of tax bills, which date back to 1642.", "These bills list the names of appointed tax collectors and their respective areas of responsibility.", "This information is useful for researchers who are interested in understanding how landowners and other nobles had their taxes collected and how the wealth of the country was distributed.", "In conclusion, the House of Lords Record Office has made great strides in digitizing and making these records accessible to the public.", "With the introduction of a searchable online catalogue, researchers can easily access and use the information found within the archives, enabling them to uncover new insights into the history of Parliament and the UK's political landscape as a whole."], "phi:2.7b": [" The text is about the Parliament's divorce den, where people can search and learn about their ancestors' marital break-ups, which were not allowed until 1857.", "It also mentions other types of documents in the archives, such as protestation returns, foreign nationals' records, tax bills, etc., that provide information on religion, citizenship, and tax collectors.", "The text concludes by mentioning some of the most important political documents from 1609 to 2017, such as the Bill of Rights, the death warrant for Charles I, and the"], "orca-mini:3b": [" Parliament has its own divorce den in the form of its archives, which hold testimonies of marital break-ups and custody cases dating back to 1670.", "This legacy includes pages of testimonies used in the hearings, including the story of Jane Campbell, the first woman to divorce her husband.", "Divorce by Parliament was an expensive process open only to the rich, but the records also include the testimony of maids, butlers and coachmen about their masters and mistresses.", "Private bills may contain the names and addresses of those involved and testimonies opposing them.", "The archives hold a transcript of evidence from Jane Campbell's maid, Amelia Laugher, showing her telling how her mistress had been discovered by her sister.", "The tax bills are also an extra source for pedigree hunters, with the longest stretch being over 300m long.", "The records are open to the public at the House of Lords Record Office, with visitors able to phone ahead when they want to view particular items in the search room.", "The revolution in archives is changing the way researchers approach their work, and the archive profession may look fairly staid, but is in an enormous period of change, mainly motivated by the potential of IT, which is opening up all sorts of vistas for us."], "hermes3:3b": ["Summary of \"Parliament's record of scandal\":\n\n- Westminster has its own divorce den, with testimonies dating back to 1670.", "- Divorce records include tales of illicit love and custody battles for women.", "- Archives also hold personal details such as protestation returns (1642), foreign nationals becoming British citizens, and private bills authorizing construction projects.", "- Online catalogue allows public access to the archives' contents."], "stablelm-zephyr:3b": ["Parliament's archives contain a wealth of personal documents, including divorce records dating back to 1701 and testimonies from maids, butlers, and coaches about their employers' affairs.", "These records also hold protestation returns from 1642, details of foreign nationals naturalized by act of Parliament, and private bills that authorize building projects, giving insight into how ancestors opposed these decisions.", "The archives now have an online catalogue, making it easier to research the documents previously accessible only in person at the House of Lords Record Office."], "chatgpt-4o-latest": ["Parliament's archives contain a wealth of historical records, including detailed accounts of divorce cases from before 1857, when divorce required an Act of Parliament.", "These records, now searchable online, include testimonies from servants and notable cases like Jane Campbell's 1801 divorce, the first granted to a woman.", "Beyond divorces, the archives hold personal and political documents, such as 1642 protestation returns, records of foreign nationals granted British citizenship, and private bills related to infrastructure projects.", "Tax records also provide genealogical insights.", "The archives, housed in Parliament's Victoria Tower, contain acts dating back to 1497, including significant political documents like the Bill of Rights (1689) and Charles I’s death warrant.", "A recent digitization effort has made research more accessible, reflecting broader changes in archival practices driven by technology.", "The archives will feature in upcoming exhibitions, including one marking the 400th anniversary of the Gunpowder Plot."], "stablelm2:1.6b": ["Parliament has its own divorce den with archived records dating back to the 1700s, detailing marital break-ups and testimonies about illicit love among servants.", "Jane Campbell was the first woman to divorce her husband for committing adultery with her sister.", "Divorce by Parliament was expensive but allowed access to private details of people from various walks of life, including maids, butlers, and coachmen.", "Besides personal documents, Westminster also holds protestation returns, foreign nationals made British citizens, and private bills authorizing the building of roads.", "A recent online catalogue has opened up new possibilities for research into UK political history."], "granite3.1-dense:2b": ["Parliament's archives, located in Victoria Tower, contain a vast trove of historical records dating back to 1670.", "These records, once only accessible through physical visits to the House of Lords Record Office, have been digitized into an online catalogue, offering new research opportunities.", "The archives include marital break-ups and divorce cases, with notable examples like Jane Campbell's 1801 divorce after discovering her husband's adultery.", "They also hold records of religious protestations from 1642, citizenship changes, private bills for infrastructure projects, and tax collectors' names.", "Beyond political documents, the archives feature personal details of ordinary individuals, such as foreigners made British citizens and tax bill holders with extended lengths.", "The collection extends to crucial historical events, including parts of the Bill of Rights from 1689 and the death warrant for Charles I.", "This rich archive serves as a testament to human history, with \"all human life\" preserved within its walls."]}