{"raw_text": "Labour faces 'cold calls' inquiry\n \n Labour is to be investigated by a watchdog over claims its election campaign has broken the rules on \"cold calling\" householders.\n \n The information commissioner is to look into a complaint from the Lib Dems about how Labour uses its call centres. The Lib Dems say Labour is telephoning people who have signed up to make sure they do not get marketing calls. Labour denies breaking rules. It says calls are not marketing if they just ask about people's voting intentions. The party says it would expect the watchdog to take complaints seriously but it has clear legal advice on the issue.\n \n Telephone call centres are expected to be used as never before by all the three major parties in the run-up to the general election. But seven million telephone numbers are on the Telephone Preference Service (TPS) lists, which ban unsolicited sales and marketing calls. Lib Dem chairman Matthew Taylor has written to the watchdog accusing Labour of a \"flagrant and systematic breach\" of the laws governing the TPS.\n \n He says the initial call may not be marketing but it identifies voters to whom the party can send promotional material in the future. His letter to the commissioner quotes from a Labour Party handbook about \"identifying target voters\". And it quotes a Stevenage Labour Party members' newsletter explaining how voters will be telephoned about their voting intentions.\n \n The voters are put in 24 categories according to their last known voting intention, ranging from \"Labour (firm)\" to \"target (Conservative)\" - those who supported the party in the past but this time will be voting Tory. The newsletter says: \"Using the information we know about people, we can send them direct mailings. \"For example, we could send the target (Conservative) people a letter from someone who had defected from the Tories to Labour explaining the reasons why voting Tory is a bad idea or we could send Labour (weak) people a letter encouraging them to sign up for a postal vote.\"\n \n Mr Taylor tells the commissioner: \"It is clear beyond peradventure from the above that the Labour Party is engaging in a large-scale voter ID project for subsequent promotional purposes through targeted and segmented mailings. \"Insofar as this project is directed at TPS subscribers, it is equally clear that it is unlawful.\" The Lib Dems raised worries about Labour and Conservative calls in February and 680 people have signed up to the website they set up to help people to complain. A party official said there was only scattered evidence of the Tories breaking the rules but people had complained every day about Labour.\n \n A spokeswoman for the Information Commissioner's Office said it was examining one complaint about political calls - understood to be Mr Taylor's. \"We are investigating one of the complaints where some evidence has been given to us,\" she said. \"Obviously evidence is needed for us to start investigations.\" The commissioner's office will now examine the Lib Dem evidence. \"The guidance is that cold calling can be made as long as no marketing is going on,\" said the spokeswoman. If Labour is judged to have broken the rules, it will be asked stop immediately. If it fails to do so after two or three warning letters, the commissioner can issue an enforcement notice spelling out what the party needs to do or stop doing.\n \n The party could appeal against the decision to an Information Tribunal. If the appeal fails and it continues breaking the rules, it could be fined up to £5,000. Labour says it avoids those on TPS lists when telephoning people about membership or fundraising but not when making \"voter identification\" calls. Asked about the commissioner's inquiry, a Labour spokesman told BBC News: \"We expect the information commissioner to take any complaint seriously. However, we are absolutely clear that we haven't broken any rules. \"As the information commissioner himself has said, if people are not marketing something, if they are asking them which way they are going to vote, they are not in breach of the law. \"We always ask everyone we phone up whether they would be happy to be contacted by the Labour Party again.\"\n", "llama3.2:1b": ["Labour is to face an inquiry from a watchdog over claims its election campaign broke rules on using telephone call centres with unsolicited marketing calls.", "The Information Commissioner's Office is investigating complaints from the Liberal Democrats about how Labour uses call centres to identify potential voters for promotional material and fundraising.", "The Lib Dems claim that Labour is using call centres to target specific groups of people, such as those who previously voted Conservative but will now vote Labour in November's general election.", "Labour denies any wrongdoing, saying it only contacts people with the intention of sending them voting information or campaigning materials.", "Seven million telephone numbers are on the Telephone Preference Service (TPS) lists, which ban unsolicited sales and marketing calls.", "The Lib Dems claim that 680 people signed up to a website to complain about the practice.", "The Information Commissioner's Office will examine complaints from both parties.", "If Labour is found to have broken rules, it could be fined up to £5,000 or required to stop making \"voter identification\" calls.", "Labour denies any wrongdoing and says its call centres are only used for legitimate purposes of sending voting information or campaigning materials."], "llama3.2:3b": ["Labour faces investigation from Information Commissioner's Office over claims it has broken rules on cold calling householders using telephone call centres, with Lib Dem accusation that party is telephoning people who signed up to avoid marketing calls."], "gemma2:2b": ["Labour party is being investigated for potential violations of rules on unsolicited calls, particularly targeting voters with political messages.", "The Information Commissioner's Office (ICO) will examine evidence provided by the Liberal Democrats who allege Labour is using call centres for voter identification and future campaign material distribution in violation of the Telephone Preference Service (TPS).", "The ICO will investigate and decide if Labour has broken any rules.", "Labour maintains that their calls are not marketing and only aimed at identifying voters' voting intentions."], "qwen2.5:0.5b": ["The Labour party is being investigated for allegedly using call centres to solicit voters' support.", "The Information Commissioner has said Labour should stop using the telephone and instead use mailings, as it breaks current rules on \"cold calling\"."], "qwen2.5:1.5b": ["Labour faces investigation into alleged cold calling violations over TPS list use for voter identification purposes.", "The Information Commissioner's Office will examine complaints and potentially fine the party if found in breach of rules."], "qwen2.5:3b": ["Labour is facing an investigation by the Information Commissioner over claims its election campaign has broken the rules on \"cold calling\" householders.", "The Lib Dems have complained that Labour uses call centres to identify voters, allowing future marketing calls, despite Labour denying breaking any rules.", "Seven million numbers are blocked from unsolicited sales and marketing under the Telephone Preference Service (TPS).", "Matthew Taylor of the Lib Dems accuses Labour of engaging in a large-scale voter ID project for future promotional purposes, which is unlawful as it targets TPS subscribers.", "The Information Commissioner's Office is examining one complaint, with Labour denying any rule-breaking but maintaining that calls are not marketed when asking about voting intentions.", "If found to have broken rules, Labour could face warnings and fines up to £5,000 or an appeal process."], "opencoder:1.5b": ["Labour faces 'cold calls' inquiry\n\nThe information commissioner is to investigate a complaint about how Labour uses its call centres.", "The Lib Dems say Labour is telephoning people who have signed up to make sure they do not get marketing calls.", "It denies breaking rules.", "However, it says calls are not marketing if they just ask about people's voting intentions.", "The party says it would expect the watchdog to take complaints seriously but it has clear legal advice on the issue.", "Telephone call centres are expected to be used as never before by all the three major parties in the run-up to the general election.", "However, seven million telephone numbers are on the TPS lists, which ban unsolicited sales and marketing calls.", "The Lib Dem chairman Matthew Taylor has written to the watchdog accusing Labour of a \"flagrant and systematic breach\" of the laws governing the TPS.", "The initial call may not be markingeting but it identifies voters to whom the party can send promotional material in the future.", "His letter to the commissioner quotes from a Labour Party handbook about \"identifying target voters\".", "And it quotes Stevenage Labour Party members' newsletter explaining how voters will be telephoned about their voting intentions.", "The voters are put in 24 categories according to their last known voting intention, ranging from \"Labour (firm)\" to \"target (Conservative)\" - those who supported the party in the past but this time will be voting Tory.", "The newsletter says: \"Using the information we know about people, we can send them direct mailings.", "For example, we could send the target (Conservative) people a letter from someone who had defected from the Tories to Labour explaining the reasons why voting Tory is a bad idea or we could send Labour (weak) people a letter encouraging them to sign up for a postal vote.\"", "Mr Taylor tells the commissioner: \"It is clear beyond peradventure from the above that the Labour Party is engaging in a large-scale voter ID project for subsequent promotional purposes through targeted and segmented mailings.", "Insofar as this project is directed at TPS subscribers, it is equally clear that it is unlawful.\"", "The Lib Dems raised concerns about Labour and Conservative calls in February and 680 people have signed up to the website they set up to help people to complain.", "A party official said there was only scattered evidence of the Tories breaking the rules but people had complained every day about Labour."], "smollm:1.7b": ["The summary is:\n\nLabour faces 'cold calls' inquiry\n\nIn a move seen as a major break with the rules, Labour has been investigated by an Information Commissioner's Office (ICO) over allegations that it breaks the law when calling on householders about its election campaign.", "The ICO says it will examine one complaint from the Lib Dems and look into whether they have broken any other laws related to political calls.", "The information commissioner told BBC News: \"We expect the Labour Party to take any complaint seriously.", "However, we are absolutely clear that we haven't broken any rules.\"", "As the Information Commissioner himself has said, if people are not marketing something, if they are asking them which way they are going to vote, they are not in breach of the law.", "The Lib Dems raised worries about Labour and Conservative calls in February and 680 people have signed up to a website set up by Labour to help people complain about political calls.", "A spokeswoman for the Information Commissioner's Office said it was examining one complaint from the Lib Dems.", "\"We are investigating one of the complaints where some evidence has been given to us,\" she said.", "\"Obviously evidence is needed for us to start or stop an investigation.\"", "The commissioner's office will now examine the Lib Dem evidence and if it continues breaking the rules, it could be fined up to £5,000.", "Labour says it avoids those on TPS lists when telephoning people about membership or fundraising but not when making \"voter identification\" calls.", "Asked about the ICO's inquiry, a Labour spokesman told BBC News: \"We expect the Information Commissioner to take any complaint seriously.", "However, we are absolutely clear that we haven't broken any rules.\"", "The Labour Party could appeal against the decision to an Information Tribunal.", "If the appeal fails and it continues breaking the rules, it could be fined up to £5,000.", "Labour says it expects the ICO to take any complaint seriously.", "However, it is absolutely clear that it has not broken any laws related to political calls.", "The summary is:\n\nLabour faces 'cold calls' inquiry\n\nIn a move seen as a major break with the rules, Labour has been investigated by an Information Commissioner's Office over allegations that it breaks the law when calling on householders about its election campaign.", "The ICO says it will examine one complaint from the Lib Dems and look into whether they have broken any other laws related to political calls.", "The information commissioner told BBC News: \"We expect the Labour Party to take any complaint seriously.", "However, we are absolutely clear that we haven't broken any rules.\"", "As the Information Commissioner himself has said, if people are not marketing something, if they are asking them which way they are going to vote, they are not in breach of the law.", "The Lib Dems raised worries about Labour and Conservative calls in February and 680 people have signed up to a website set up by Labour to help people complain about political calls.", "A spokeswoman for the Information Commissioner's Office said it is examining one complaint from the Lib Dems.", "\"We are investigating one of the complaints where some evidence has been given to us,\" she said.", "\"Obviously evidence is needed for us to start or stop an investigation.\"", "The commissioner's office will now examine the Lib Dem evidence and if it continues breaking the rules, it could be fined up to £5,000.", "Labour says it expects the ICO to take any complaint seriously.", "However, it is absolutely clear that it has not broken any laws related to political calls."], "deepseek-r1:1.5b": ["Labour is being investigated for claims that their election campaign has broken rules on \"cold calling\" householders.", "The Information Commissioner's Office is handling a complaint from the Labour Party's Lib Dems, which accused Labour of using its call centers to make marketing calls but denying violations under TPS regulations.", "The Lib Dem chairman Taylor wrote a letter, and evidence from the Lib Dems showed that Tories have violated rules, while Labour's campaign didn't use cold calls for membership or fundraising but did when targeting voters.", "Labour claims it avoids TPS subscribers in their promotional efforts.", "If Labour violates laws, they could face fines up to £5k and an enforcement notice."], "tinyllama:1.1b": ["Labour is facing an investigation from a watchdog over claims it uses cold calls for marketing purposes.", "The information commissioner will look into complaints about how Labour uses its call centres and expects them not to make marketing calls on \"colder\" numbers.", "The party denies violating the law by using call centres for marketing, but admits the watchdog should take any complaints seriously.", "As for the watchdog's inquiry, Labour says they expect it to uphold their policy of not making cold calls when they only ask about people's voting intentions.", "They also say there's no indication that the party is in violation of the law and believe the watchdog will find they are in compliance with the rules governing TPS listings."], "tinydolphin:1.1b": [" The information commissioner is investigating a complaint about political calls made by the Liberal Democrats to see if they broke the rules on cold calling.", "According to the information commissioner's office, the Liberal Democrats use their call centres to phone people who have signed up to their campaign.", "This follows on from claims by the Labour party that they used this technology in a way not allowed by TPS.", "The information commissioner has received complaints about these calls and is investigating whether any breaches of the rules were committed.", "The Lib Dems have claimed that no marketing was taking place, which the information commissioner acknowledges is correct.", "They are reviewing their practices to see if they should be stopping or starting calling people at all times.", "Should the Labour party breach the law by continuing to call people even after warnings from the information commissioner, they could face fines of up to £5,000 per offence.", "The Lib Dems have said they do not believe they are in violation of any rules and would continue to call people unless they were told to stop."], "phi:2.7b": [" The Labour party is being investigated for breaking rules on \"cold calling\" householders after a complaint from the Liberal Democrats.", "The Information Commissioner is looking into how the Labour party uses its call centres.", "The Lib Dems claim Labour is telephoning people who have signed up to make sure they do not get marketing calls, but Labour denies this and says all calls are not marketing if they ask about voting intentions.", "The seven million telephone numbers on the TPS list are affected by these rules.", "The Lib Dems say Labour's call centres use information about voters to send them promotional material in the future.", "Labour claims it would expect the Information Commissioner to take complaints seriously, but has legal advice that says it is allowed to do this."], "orca-mini:3b": [" The text reports on an inquiry being conducted by the Information Commissioner's Office into a complaint against the Labour Party over \"cold calling\" allegations.", "The party denies breaking rules and says it only makes calls about voter identification and fundraising, not marketing.", "The Lib Dems have raised concerns about both parties and a website has been set up to help people report illegal calls.", "The ICO is examining one complaint, with Labour facing enforcement action if found guilty of breaking the rules."], "hermes3:3b": ["Labour investigated over cold calls inquiry"], "stablelm-zephyr:3b": ["Labour is under investigation by a watchdog for allegedly breaking rules on \"cold calling\" during its election campaign.", "The Information Commissioner will look into a complaint from the Liberal Democrats, who claim that Labour is phoning people who have signed up to ensure they do not receive marketing calls.", "Labour denies any wrongdoing; it argues that calls asking about voting intentions are not marketing.", "During the general election, telephone call centres are expected to be used heavily by all three major parties, but seven million UK phone numbers are on the Telephone Preference Service (TPS) lists, which prohibit unsolicited sales and marketing calls."], "chatgpt-4o-latest": ["Labour is being investigated by the Information Commissioner's Office over claims it has violated rules on cold calling during its election campaign.", "The complaint, filed by the Liberal Democrats, alleges Labour is calling individuals registered with the Telephone Preference Service (TPS), which bans unsolicited marketing calls.", "Labour denies wrongdoing, arguing that calls asking about voting intentions do not constitute marketing.", "The Lib Dems claim Labour is conducting a large-scale voter identification project for future targeted mailings, citing internal Labour documents.", "The watchdog is reviewing evidence and, if Labour is found in violation, it could face enforcement actions and fines.", "Labour insists it follows legal guidance and avoids TPS-listed numbers for membership or fundraising calls but not for voter identification."], "stablelm2:1.6b": ["Labour will face an inquiry from a watchdog over claims that their election campaign has broken rules on \"cold calling\".", "The Information Commissioner is investigating a complaint from the Liberal Democrats about how Labour uses call centres.", "The party says calls are not marketing if they just ask about people's voting intentions, but Labour denies breaking rules and expects the regulator to take complaints seriously.", "Seven million telephone numbers are banned under the Telephone Preference Service (TPS), which bans unsolicited sales and marketing calls."], "granite3.1-dense:2b": ["The Information Commissioner is investigating Labour over allegations that its election campaign has violated rules regarding \"cold calling\" householders.", "The Liberal Democrats (Lib Dems) have filed a complaint, accusing Labour of using call centres to identify voters for future marketing purposes, despite these numbers being on the Telephone Preference Service (TPS) lists, which prohibit unsolicited sales and marketing calls.", "The Lib Dems argue that Labour's calls identify voters for targeted promotional mailings, in violation of TPS regulations.", "They have evidence from a Labour Party handbook and a Stevenage newsletter detailing 24 voting intentions categories for targeted communications.", "Labyrinth's officials maintain their actions are legal since they're not marketing products but merely asking about voting preferences.", "The Information Commissioner's Office is examining the Lib Dems' complaint and will assess whether Labour's calls constitute cold calling, as long as no marketing occurs.", "If found to have breached rules, Labour could face immediate cessation of the practice or, after warnings, potential fines up to £5,000 per infraction.", "The party anticipates that any decision will be challenged at an Information Tribunal if necessary."]}