{"raw_text": "Tories reject rethink on axed MP\n \n Sacked MP Howard Flight's local Conservative association has insisted he will not be its candidate at the general election.\n \n Russell Tanguay, agent for Arundel and South Downs Tories, said Mr Flight was ineligible to be a candidate and the association was seeking a substitute. The news comes despite Mr Flight's allies saying they had enough support to hold a meeting to discuss his fate. Mr Flight landed in trouble over remarks on Tory tax and spending plans. He quit as Tory deputy chairman after apparently suggesting the Tories planned extra spending cuts - but he wants to continue as an MP.\n \n Tory headquarters says he cannot stand as a Conservative candidate because he is no longer an approved candidate. Mr Tanguay backed that view on Tuesday, saying: \"Howard Flight is ineligible to stand as a Conservative Party candidate. \"The association is in the process of selecting a new candidate.\"\n \n But the local Tory chairman made similar comments on Friday and dissent continues. Two local councillors who back Mr Flight met Mr Tanguay and the local association's chairman in Arundel on Tuesday afternoon but did not comment as they left the meeting. Mr Flight says he will not stand down as a candidate unless his local party instructs him to do so at an extraordinary general meeting (EGM). The MP, who is consulting his lawyers, told BBC News: \"They selected me and they, if you like, dispose of me or keep me.\" Mr Flight's supporters also say they have the 50 signatures needed to trigger the EGM.\n \n At a news conference, Mr Howard insisted he had played by the party's rules. The Tory leader, who argues he is ensuring honesty, said: \"We do not say one thing in private and another thing in public.\"\n \n Labour election campaign coordinator Alan Milburn said the Tories were in \"turmoil\" because Mr Flight had exposed their hidden plans. The comments were not a \"one-off\", he said, claiming Mr Howard and other senior Tories were obsessively committed to cutting public spending. Liberal Democrat chairman Matthew Taylor said: \"Whilst I disagree with Howard Flight's views, it seems extraordinary to sack somebody for telling the truth.\"\n \n It has also emerged Mr Howard has suspended Slough's constituency Conservative association for refusing to deselect its candidate. Adrian Hilton was abandoned after suggesting the signing of the Maastricht Treaty, under John Major's government, was an act of treason. The Catholic Herald also highlighted articles he wrote about the role of Catholicism in the European Union. Mr Hilton was chosen to fight the seat after the previous candidate, Robert Oulds, was sacked for being pictured with a range of guns and a hunting knife. Slough Conservative Association has now been placed on \"support status\" and is being run from Conservative campaign headquarters, says a senior party spokesman.\n \n Mr Hilton on Tuesday said he was considering taking legal action against his deposal. He said the local party had only learned of the final decision on the BBC News website on Monday evening. \"There are people at Central Office who are behaving like little dictators and seemingly people who are ordinary members are being treated with contempt,\" he said. The party says it did try to contact the local Conservative chairman.\n", "llama3.2:1b": ["Tories reject Howard Flight's candidacy for general election, saying he is ineligible due to remarks on Tory tax and spending plans.", "Flight has quit as Tory deputy chairman but wants to remain an MP.", "His local association has chosen not to select a replacement candidate.", "Labour claims the Tories are in \"turmoil\" over Flight's comments.", "A senior party spokesman says Slough Conservative Association, which was previously placed under support status after Flight suggested signing the Maastricht Treaty as treasonous, is now being run from Conservative headquarters."], "llama3.2:3b": ["Tories reject Howard Flight's bid to run as candidate after remarks on tax and spending plans led to his dismissal as deputy chairman, citing party rules over ineligibility.", "Flight claims party is trying to silence him, with supporters seeking extraordinary general meeting to force his reinstatement.", "Local association chair says Flight is not being considered for nomination."], "gemma2:2b": ["Howard Flight is ineligible to be a candidate for the Conservative Party due to controversial remarks about spending plans, and his local association has announced they will select a new candidate.", "Despite this, Flight insists he won't step down unless instructed by his local party at an extraordinary general meeting (EGM).", "Flight maintains he followed party rules while expressing his views, while Labour and the Liberal Democrats disagree with the decision and criticize the handling of the situation.", "The Conservative party also suspended Slough's constituency association for refusing to deselect its candidate, Adrian Hilton, who had been accused of treasonous actions and was subsequently dropped after raising concerns about the Maastricht Treaty.", "Hilton plans to take legal action against his removal from candidacy."], "qwen2.5:0.5b": ["The Tories have rejected a proposal for Mr Flight not to be their candidate in the 2017 general election.", "A new candidate will be selected, but the ruling is that he cannot stand as a Conservative Party candidate because he has been disqualified.", "The TCU has taken steps to select a new candidate by contacting local Conservative association leaders and some of its members."], "qwen2.5:1.5b": ["Tories reject rethink of sacking of MP Howard Flight, insisting he is ineligible to run as a candidate despite local association seeking a substitute.", "Flight faces potential loss of his parliamentary seat due to controversial remarks about Tory tax and spending plans.", "MPs consider whether to resign from the party or seek an extraordinary general meeting for support before deciding on their standing.", "Party leaders claim honest communication and transparency, while Labour criticizes the decision as politically motivated and potentially unlawful."], "qwen2.5:3b": ["Tories have rejected Howard Flight as a candidate for their general election list despite his supporters claiming they had enough support to consider holding an extraordinary general meeting (EGM).", "Flight was dropped by Tory headquarters due to his ineligibility as an approved candidate after making controversial remarks about spending cuts.", "His local Conservative association insists he is ineligible and is seeking a substitute, while two councillors supporting him met with the association’s chairman on Tuesday without commenting.", "Flight's supporters say they have 50 signatures needed for an EGM but are facing suspension from their constituency association over another candidate's removal for unrelated reasons.", "Liberal Democrats believe Flight has integrity despite disagreeing with his views, and Labour criticises Tories for exposing hidden plans through Flight’s exposure of party secrets."], "opencoder:1.5b": ["The Tories have taken a position of control over the election, rejecting any move they deem unfit for their campaign.", "It is important to note that while the MP has been given the right to contest his own views on the future of the election, it is not guaranteed.", "The MP also seems to be reluctant to hold a meeting because he believes it would create disruptions and confusion for the Tories.", "The news comes despite Mr Flight's allies saying they had enough support to hold a discussion.", "Despite being told that their spending plans were already too tight, Mr Flight remained in a stuporiloaded situation due to accusations of tax evasion.", "He has quit as a Conservative candidate after appearing to suggest the Tories planned extra spending cuts - but he wants to continue as an MP.", "The party's rules and leader's views do not match up, with Labour election campaign coordinator Alan Milburn commenting on Mr Howard's actions.", "The party is in \"turmoil\" because of how they decided to cut public spending, while the conservative leader insists on honesty and fairness.", "Local members have also been grappled over Mr Howard's comment about the Maastricht Treaty signing, under John Major's government, which was an act of treason.", "The Catholic Herald has highlighted articles by various sources arguing that it was a lie.", "The situation at Central Office appears to be unsettling for Mr Holland, who has been left with two jobs in the past couple of days, including serving as a police officer and a detective.", "This suggests a potential scandal or scandalous event, which seems to have spread from the local party to the BBC and to the wider public."], "smollm:1.7b": ["The summary is:\n\n* Tories reject rethink on axed MP\n* Sacked MP Howard Flight's local Conservative association has insisted he will not be its candidate at the general election\n* Russell Tanguay, agent for Arundel and South Downs Tories, said Mr Flight was ineligible to be a Conservative candidate because he is no longer an approved candidate.", "* Tory headquarters says Mr Flight cannot stand as a Conservative candidate because he is no longer an approved candidate.", "* Two local councillors who back Mr Flight met Mr Tanguay and the local association's chairman on Tuesday afternoon but did not comment as they left the meeting.", "* Mr Howard insists the Tories are in \"turmoil\" because Mr Flight had exposed their hidden plans.", "* Liberal Democrat campaign coordinator Alan Milburn said the Tories were in \"turmoil\" because Mr Howard suspended Slough's local Conservative association for refusing to deselect its candidate.", "* Alan Hilton was abandoned after suggesting the signing of the Maastricht Treaty, under John Major's government, was an act of treason.", "* Mr Hilton on Tuesday said he was considering taking legal action against his deposal.", "* The party says it did try to contact the local Conservative chairman but they were not received."], "deepseek-r1:1.5b": ["Howard Flight's EGP campaign is marked by political turmoil, with the Tories rejecting reconsideration of his seat and the local Conservative association insisting he will not be selected.", "Russell Tanguay from Arundel & South Downs suggested he was ineligible and sought a substitute, though Howard has previously stated he won't stand down unless instructed at an extraordinary general meeting (EGM).", "Howard faced some controversies, including being excluded by his allies over extra spending cuts, but he plans to continue as an MP.", "The local association is in the process of selecting a new candidate.", "The Tory headquarters denied his eligibility and highlighted that he has 50 signatures from supporters signaling potential election changes.", "Mr. Milburn emphasized his public record, stating the party's rules require him to be truthful.", "Howard's public statements have drawn attention, with Hilton refusing to pick a candidate for Slough's association due to refusing to select him, which has sparked concern about their treatment of conservative candidates."], "tinyllama:1.1b": ["The AI assistant has summarized the text as follows:\n\n1.", "Tories rejects rethink on axed MP\n2.", "Sacked MP Howard Flight's local Conservative association has insisted he will not be its candidate at the general election.", "3.", "Russell Tanguay, agent for Arundeal and South Downs Tories, said Mr Flight was ineligible to be a candidate and the association was seeking a substitute.", "The news comes despite Mr Flight's allies saying they had enough support to hold a meeting to discuss his fate.", "Mr Flight landed in trouble over remarks on Torys tax and spendings plans.", "He quit as Torious deputy chairman after apparently suggesting the Tories planned extra spending cuts - but he wants to continue as an MP.", "The headquarter of the association said they are in the process of selecting a new candidate despite the local councillor's who back Mr Flight meeting Mr Tanguay and the local association's chairman at Arundeal on Friday and dissected continues.", "Local party leader Howard insisted he has played by party's rules, saying he had exposed their hidden plans.", "Labour election campaign coordinator Alan Milburn claimed the Torious association is in \"tuurmil\" because Mr Flight had exposed their hidden plans.", "It has also emerged that Mr Howard had suspended Slough's constituency Conservative association for refusing to deselect its candidate, Adrian Hilton.", "Slough Conservative Association was placed on support status by the local party, but it's been running from campaign headquarter after being accused of treasonous comments made by Robert Oulds in the past.", "The local party has learned of the decision and is being run from Central Office, according to a senior party speaker."], "tinydolphin:1.1b": [" To convey this information in a concise, clear manner, I will create a summary statement that includes the main points:\n\n1.", "Tories reject rethink on axed MP, Howard Flight's local Conservative association insists he will not be their candidate at the general election.", "2.", "Russell Tanguay, agent for Arundel and South Downs Tories, calls for a substitute candidate, arguing that Mr Flight should not stand as an MP under his old status.", "3.", "Tory leaders question Flight's eligibility to be a candidate, citing remarks on Tory tax and spending plans.", "4.", "Flight quit the party, landed in trouble over comments on tax and spending plans, and wants to continue as an MP.", "5.", "Local Tory chairman makes similar comments during a press conference; dissent continues, with two councillors meeting Mr. Tanguay, local association chairman in Arundel, and one meeting his regional Tory chairman; no decision has been made for the extra-legal meeting."], "phi:2.7b": [" A local association for a Tory MP has rejected his request to stand as their candidate in the general election, claiming that he is no longer an approved candidate.", "His supporters say they still have enough support and will hold a meeting to discuss his fate, but Mr Flight says he will not stand down unless instructed to do so at an extraordinary general meeting."], "orca-mini:3b": [" The local Conservative association has refused to deselect Howard Flight's candidate and has suspended the Slough constituency association for refusing to deselect their candidate.", "Mr Flight's allies say they have enough support to hold an EGM to discuss his fate, while the Tory leader argues that he is ensuring honesty.", "Labour and Liberal Democrat campaigns are being boosted by the controversy surrounding Mr Flight's comments on tax and spending plans."], "hermes3:3b": ["Tory MP Howard Flight's local party rejects reelecting him as candidate after dismissal over comments on Tory spending plans; association seeks substitute candidate."], "stablelm-zephyr:3b": ["Howard Flight, a sacked MP, will not be the candidate for his local Conservative association in the general election.", "Despite having support from allies to hold a meeting discussing his fate, Tory headquarters and the association's agent have confirmed that he is ineligible to stand as a Conservative candidate due to being removed from approval.", "Flight claims that he can still be an MP unless instructed otherwise by his local party at an extraordinary general meeting.", "The suspension of Slough'Conservative Association's candidate Adrian Hilton has also occurred after his resignation, with the association now placed on \"support status.\""], "chatgpt-4o-latest": ["The Conservative Party has confirmed that sacked MP Howard Flight will not be reinstated as a candidate for the general election.", "Despite support from local allies, the Arundel and South Downs Conservative Association is seeking a replacement, as Flight is no longer an approved candidate.", "Flight, who resigned as Tory deputy chairman after controversial remarks on spending cuts, insists he will not step down unless instructed by his local party at an extraordinary general meeting (EGM), which his supporters claim they can trigger.", "Tory leader Michael Howard maintains the decision upholds party integrity, while Labour and Liberal Democrat figures criticize the handling of the situation.", "Meanwhile, the party has also suspended Slough's Conservative Association for refusing to deselect candidate Adrian Hilton, who was dropped over controversial remarks about the Maastricht Treaty and Catholicism.", "Hilton is considering legal action, accusing party officials of acting undemocratically."], "stablelm2:1.6b": ["Tories refuse reconsider Howard Flight's sacking as MP candidate, despite allies' support for an EGM.", "Ineligible according to Tory headquarters, Flight claims to have enough signatures for EGM unless instructed by local party; MPs Howard and Hilton suspended over criticism of public spending and Flight's comments about Tory tax and spending plans."], "granite3.1-dense:2b": ["Tories refuse to reconsider axed MP Howard Flight as their candidate for the general election, citing ineligibility due to his past remarks on tax and spending plans.", "Despite supporters claiming they have enough signatures to hold a meeting about Flight's fate, the local Conservative association insists they are selecting a new candidate.", "Flight, who resigned as Tory deputy chairman over controversial statements, maintains he was chosen fairly and will not step down unless instructed by his party at an extraordinary general meeting (EGM).", "The party also suspended Slough's Conservative association for refusing to deselect its candidate, Adrian Hilton, who was dismissed for discussing the Maastricht Treaty as treason.", "Hilton now considers legal action against his removal and criticizes what he perceives as central office interference in local party affairs."]}