{"raw_text": "Abortion not a poll issue - Blair\n \n Tony Blair does not believe abortion should be an election issue, arguing it is a matter for individual conscience.\n \n The prime minister's spokesman set out Mr Blair's view after the top Catholic in England and Wales backed Michael Howard's stance on abortions. The Tory leader supports a reduction in the legal limit from 24 weeks to 20 and has said current rules are \"tantamount to abortion on demand\". The prime minister has made it clear he has no plans to the change the law.\n \n Mr Blair's spokesman said: \"The Catholic church has a well-known position on this issue and it was one of many issues the Cardinal mentioned and therefore it should be seen in that context.\" His words came as Cardinal Cormac Murphy O'Connor, the Archbishop of Westminster, backed Mr Howard's stance and distanced himself from Labour. In a statement, he said abortion was a \"very key issue\", saying: \"The policy supported by Mr Howard is one that we would commend, on the way to a full abandonment of abortion.\"\n \n Cardinal O'Connor claimed Labour had \"developed\" the notion that it was the natural party of Catholics, but he said: \"We are not going to suggest people support one particular party.\" The Family Planning Association says a reduction would particularly affect young women who often seek help later. More than 180,000 women in England and Wales had terminations last year, of which fewer than 1% were carried out between 22 and 24 weeks.\n \n In the Cosmopolitan interview Mr Howard said: \"I believe abortion should be available to everyone, but the law should be changed. \"In the past I voted for a restriction to 22 weeks and I would be prepared to go down to 20.\" All three main parties say the issue is one for each MP's conscience, rather than one where there is a party-wide policy. Mr Howard stressed his views were his personal views. Shadow home secretary David Davis said he understood Mr Howard had been signalling that a Conservative government would allow a Commons vote on the issue. Mr Blair and Liberal Democrat leader Charles Kennedy also gave their views during interviews, conducted as part of the magazine's \"High Heeled Vote\" campaign.\n \n Mr Blair, who last year denied he planned to join his wife and four children in the Catholic faith despite regularly taking communion, said abortion was a \"difficult issue\". \"However much I dislike the idea of abortion, you should not criminalise a woman who, in very difficult circumstances, makes that choice. \"Obviously there is a time beyond which you can't have an abortion, and we have no plans to change that although the debate will continue.\" Mr Kennedy said he had previously voted for a 22-week limit but medical advances mean \"I don't know what I would do now\". The Roman Catholic Archbishop of Cardiff, the Most Reverend Peter Smith, told BBC Radio 4's Today programme that the church merely wanted people to \"reflect on issues in light of the gospel\" before voting. Anne Weyman, chief executive of the Family Planning Association, asked: \"What is the benefit to women, or to the potential child, of forcing a woman to have a baby?\" Anti-abortion group the Pro-Life Alliance \"congratulated\" Mr Howard on his new stance, but said it did not go far enough.\n", "llama3.2:1b": ["Tony Blair's spokesman stated that abortion should only be an election issue and not a matter for individual conscience.", "Tony Blair also mentioned Cardinal Cormac Murphy O'Connor's support for reducing the legal limit from 24 weeks to 20, as well as Charles Kennedy's previous stance on this issue.", "However, all three main parties, including the Labour Party, Liberal Democrats, and Conservative Party, say that individual conscience is the primary consideration.", "The pro-choice group Family Planning Association argues that a reduction in the legal limit would particularly affect young women seeking help later."], "llama3.2:3b": ["Tony Blair does not believe abortion should be an election issue and has no plans to change the law, which he describes as a matter of individual conscience.", "Cardinal Cormac Murphy O'Connor has distanced himself from Labour after supporting Michael Howard's stance on reducing the legal limit on abortions from 24 weeks to 20."], "gemma2:2b": ["Tony Blair does not believe abortion should be an election issue and sees it as a matter for individual conscience.", "Cardinal Cormac Murphy O'Connor, in support of Michael Howard's stance on abortion limits, stated that Labour has a problematic history with this issue.", "While the issue is considered by most politicians to be one for each MP's conscience, rather than a party-wide policy, the Prime Minister expressed his personal disapproval and no plans for legislative change are forthcoming.", "Mr. Howard's views on this issue align with a reduced legal limit on abortion, which he says should make abortion more accessible.", "Shadow home secretary David Davis also stated that these are personal views of Michael Howard in order to signal support for changing the abortion laws in a future government."], "qwen2.5:0.5b": ["Tony Blair argues abortion should be an individual issue, suggesting that politicians need to consider individual consciences before making changes, rather than forcing them.", "The Family Planning Association agrees with this idea and states a reduction in the legal limit from 24 weeks to 20 is \"tantamount to abortion on demand.\"", "The Conservative Party has stated they will not change their position on abortion, while Labour says it should be an individual choice."], "qwen2.5:1.5b": ["Tony Blair opposes abortion being an election issue, arguing it is a personal matter for individual conscience.", "Cardinal Cormac Murphy O'Connor backs Michael Howard's stance on reducing the legal limit to 20 weeks and claims Labour has developed this notion of party affiliation.", "The Family Planning Association notes that many young women seeking abortions in late trimesters typically have complications."], "qwen2.5:3b": ["Tony Blair does not believe abortion should be an election issue, arguing it is a matter for individual conscience.", "The Catholic Church's backing of Michael Howard's stance opposing abortions after 24 weeks has led to discussions, with Cardinal Cormac Murphy O'Connor distancing himself from Labour and supporting Mr Howard’s position.", "Family Planning Association states that reducing the legal limit would mainly affect young women seeking terminations later in pregnancy.", "All three main parties view abortion as an issue for individual conscience rather than party policy.", "Blair views abortion as a difficult issue but believes it should not be criminalized, while Kennedy is uncertain about his stance post-medical advancements.", "Anti-abortion group Pro-Life Alliance congratulated Mr Howard on his stance, though they criticized its limitations."], "opencoder:1.5b": ["Tony Blair does not believe abortion should be an election issue.", "The Catholic church has a well-known position on this issue and it was one of many issues the Cardinal mentioned and therefore it should be seen in that context.", "Abortion is \"very key\" issue, saying: The policy supported by Mr Howard is one that we would commend, on the way to a full abandonment of abortion.", "The Cosmopolitan interview Mr Howard said: \"I believe abortion should be available to everyone, but the law should be changed.\"", "Mr Howard stressed his views were his personal views.", "They were not an issue for Labour nor Liberal Democrats.", "The Family Planning Association says a reduction would particularly affect young women who often seek help later.", "Several years ago, I voted for a 22-week limit but as medical advances allow, it's hard to imagine that people today could force their abortion.", "My role is to reflect on issues in light of the gospel and to provide evidence before voting."], "smollm:1.7b": ["Abortion not a poll issue - Blair"], "deepseek-r1:1.5b": ["Tony Blair, MP, argues that abortion should be a personal decision rather than an election issue.", "He advocates for reducing the legal limit from 24 weeks to 20 weeks and believes current laws are \"tantamount to abortion on demand.\"", "Cardinal Cormac Murphy O'Connor supports his stance and emphasizes abortion as a key issue.", "The Home Secretary, David Davis, clarified that he understood Mr. Howard's views, while Labour leader Charles Kennedy also shared his views during interviews.", "Blair, who denies joining the Catholic faith due to his frequent communion, believes abortion is difficult but not inherently moral.", "He maintains that women can choose any choice, regardless of difficulty.", "Cardinal Murphy suggested the church would reflect on issues lighted by the gospel before voting.", "Pro-Life Alliance praised Mr. Howard's new stance but noted it may not achieve full abandonment.", "The text highlights Blair's personal views, his call for policy changes, Cardinal O'Connor's support, and campaign efforts from both parties."], "tinyllama:1.1b": ["The Prime Minister Tony Blair believes abortion should be an election issue, stating that as individuals' consciences are taken into account, a reduction in the legal limit from 24 weeks to 20 would not constitute \"a party-wide policy\".", "The Prime Minister has not yet stated his personal views on the matter but is aware of the Catholic church's stance.", "Cardinal Cormac Murphy O'Connor backed Conservative leader Michael Howard's position that abortion should be a matter for individual conscience, stating that it would make the issue \"a very key issue\" and suggesting that young women seeking help later on would face more \"difficult circumstances\".", "The Family Planning Association supported Mr Howard's stance and urged the government to change the law, while Anti-Aborion group the Pro-Life Alliance criticized him for not going further than a 22-week limit."], "tinydolphin:1.1b": [" Abortion is a complex issue in many countries around the world due to differing views about when and whether it's permissible for women to end their pregnancies.", "Despite these differences, Prime Minister Tony Blair has made it clear that he does not believe abortions should be an election issue.", "According to a top Catholic in England and Wales, the prime minister's spokesperson, Michael Howard, is leading on this issue with a more conservative stance.", "The Tory leader supports a reduction in the legal limit from 24 weeks to 20 and has said current rules are \"tantamount to abortion on demand\".", "This means that women can have an abortion without their partner's consent, unless it is believed to be life-threatening.", "In response to this policy change, the Archbishop of Westminster, Cardinal Cormac Murphy, has spoken out in support of Mr Howard and distanced himself from Labour, stating that abortion should not be considered a \"very key issue\".", "This statement suggests that his views on this matter are more aligned with those of the Conservatives.", "Cardinal O'Connor, the Archbishop of Westminster, has made an important clarification about the position of Catholics in relation to the issue of abortion.", "He has said that while the Catholic church has a well-known position on this issue, it should be seen in the context of individual conscience.", "This suggests that there may be some exceptions for specific situations where religious beliefs do not align with other viewpoints.", "The Family Planning Association, which supports Mr Howard's stance, also expressed its support, but urged people to consider factors like whether the pregnancy poses a risk to the woman's life or wellbeing.", "It emphasized that reducing the legal limit is not the only issue for women facing abortions.", "The Pro-Life Alliance \"congratulated\" Mr Howard on his new stance, but expressed its concern about the potential impact on other people in society, such as potential children and the woman's partner.", "In conclusion, despite differences among parties on this issue, Prime Minister Tony Blair has made it clear that he does not believe abortions should be an election issue.", "The Conservatives have a more conservative stance on this topic than other parties in the current Parliament.", "This suggests that the issue of abortion is likely to remain an important matter for many people, regardless of party affiliation."], "phi:2.7b": [" Tony Blair does not believe abortion should be an election issue and has made it clear he has no plans to change the law.", "The top Catholic in England and Wales supports a reduction in legal limits from 24 weeks to 20, with Michael Howard backing this stance and Cardinal Cormac Murphy O'Connor supporting Mr Howard's position.", "Mr Blair's spokesman argues that the cardinal's statement should be seen in the context of his well-known position on the issue.", "The Family Planning Association says a reduction would particularly affect young women who often seek help later.", "All three main parties say abortion is an individual conscience issue, rather than one where there is a party-wide policy."], "orca-mini:3b": [" Tony Blair does not believe abortion should be an election issue, arguing it is a matter for individual conscience.", "He supports a reduction in the legal limit from 24 weeks to 20 and has said current rules are \"tantamount to abortion on demand\".", "The prime minister has made it clear he has no plans to change the law.", "The Catholic church has a well-known position on this issue and it was one of many issues the Cardinal mentioned and therefore it should be seen in that context.", "The top Catholic in England and Wales backed Michael Howard's stance on abortions, and distanced himself from Labour.", "More than 180,000 women in England and Wales had terminations last year, of which fewer than 1% were carried out between 22 and 24 weeks.", "In the Cosmopolitan interview Mr Howard said abortion should be available to everyone, but the law should be changed.", "All three main parties say the issue is one for each MP's conscience, rather than one where there is a party-wide policy.", "Shadow home secretary David Davis said he understood Mr Howard had been signalling that a Conservative government would allow a Commons vote on the issue.", "Mr Blair and Liberal Democrat leader Charles Kennedy also gave their views during interviews, conducted as part of the magazine's \"High Heeled Vote\" campaign."], "hermes3:3b": ["Tony Blair opposes abortion as election issue; believes it should not be changed from current law."], "stablelm-zephyr:3b": ["Tony Blair doesn't want abortion to be an election issue, arguing it's a matter of individual conscience.", "The top Catholic in England and Wales backed Michael Howard's stance on reducing the legal limit from 24 weeks to 20 weeks, with current rules being \"tantamount to abortion on demand.\"", "Cardinal Cormac Murphy O'Connor supported Mr. Howard's views but said that supporting one party over another on this issue isn't right.", "All three main parties agree that the issue is for each MP's conscience.", "Mr. Blair stated his position that abortion should not be criminalized, though the debate will continue."], "chatgpt-4o-latest": ["Tony Blair believes abortion should not be an election issue, emphasizing it is a matter of individual conscience.", "His spokesman reiterated that the prime minister has no plans to change the law, despite Conservative leader Michael Howard advocating for reducing the legal abortion limit from 24 to 20 weeks.", "Cardinal Cormac Murphy O'Connor, the top Catholic leader in England and Wales, supported Howard’s stance, calling abortion a \"key issue\" but refrained from endorsing a specific party.", "The Family Planning Association warned that a reduction would particularly impact young women.", "Howard stated he personally supports abortion access but favors a stricter limit, and all three main parties treat the issue as a matter of individual MPs' conscience.", "Blair acknowledged the complexity of abortion, opposing criminalization while maintaining the current legal framework.", "Liberal Democrat leader Charles Kennedy expressed uncertainty about his stance due to medical advancements.", "Religious leaders urged voters to consider moral perspectives, while pro-life and family planning groups debated the implications of changing the law."], "stablelm2:1.6b": ["Prime Minister Tony Blair believes that abortion should not be an election issue and is against any change in current laws regarding abortions.", "Cardinal Cormac Murphy O'Connor, the Archbishop of Westminster, supports Michael Howard's position on abortions and has distanced himself from Labour.", "All three main parties agree that abortion issues are for each MP's conscience rather than having a party-wide policy.", "Tory leader Howard believes that abortion should be available to everyone but with a change in law.", "The Family Planning Association argues that reducing the legal limit from 24 weeks to 16 weeks would particularly affect young women who often seek help later."], "granite3.1-dense:2b": ["Tony Blair maintains that abortion should remain a personal conscience issue and opposes making it an election topic.", "The prime minister's spokesman referenced the Catholic Church's stance as part of a broader context.", "Cardinal Cormac Murphy O'Connor, the Archbishop of Westminster, backed Michael Howard's pro-life views, emphasizing abortion as a \"very key issue\" and advocating for its eventual abolition.", "Howard supports reducing the legal limit from 24 to 20 weeks, while the Family Planning Association warns this change would disproportionately affect young women seeking later terminations.", "Conservative leader Michael Howard has previously voted for a 22-week restriction and now considers a reduction down to 20 weeks, although he emphasizes his stance is personal.", "Blair, in a recent interview, acknowledged the difficulty of abortion but stated no plans to alter the existing law.", "Liberal Democrat leader Charles Kennedy also expressed previous support for a 22-week limit and now ponders where he would position himself at 20 weeks due to medical advancements.", "Anne Weyman, from the Family Planning Association, questions whether forcing women to carry pregnancies benefits either the mother or potential child.", "The Pro-Life Alliance praised Howard's new stance but believes it does not go far enough."]}