{"raw_text": "Howard hits back at mongrel jibe\n \n Michael Howard has said a claim by Peter Hain that the Tory leader is acting like an \"attack mongrel\" shows Labour is \"rattled\" by the opposition.\n \n In an upbeat speech to his party's spring conference in Brighton, he said Labour's campaigning tactics proved the Tories were hitting home. Mr Hain made the claim about Tory tactics in the anti-terror bill debate. \"Something tells me that someone, somewhere out there is just a little bit rattled,\" Mr Howard said. Mr Hain, Leader of the Commons, told BBC Radio Four's Today programme that Mr Howard's stance on the government's anti-terrorism legislation was putting the country at risk. He then accused the Tory Leader of behaving like an \"attack mongrel\" and \"playing opposition for opposition sake\".\n \n Mr Howard told his party that Labour would \"do anything, say anything, claim anything to cling on to office at all costs\". \"So far this year they have compared me to Fagin, to Shylock and to a flying pig. This morning Peter Hain even called me a mongrel. \"I don't know about you, but something tells me that someone, somewhere out there is just a little bit rattled.\" Environment Secretary Margaret Beckett rejected Mr Howard's comment, telling Radio 4's PM programme that Labour was not \"rattled\". \"We have a very real duty to try to get people to focus on Michael Howard's record, what the proposals are that he is trying to put forward to the country and also the many examples we are seeing now of what we believe is really poor judgement on his behalf.\"\n \n Mr Howard said Tory policies on schools, taxes, immigration and crime were striking a chord with voters.\n \n \"Since the beginning of this year - election year - we've been making the political weather,\" he told the party conference. Mr Howard denied he had been \"playing politics\" by raising the case of Margaret Dixon, whose operation had been cancelled seven times, which grabbed headlines for the party two weeks ago. And he hit back at Labour claims he had used Mrs Dixon as a \"human shield\". \"She's not a human shield Mr Blair, she's a human being.\" Mr Howard said his party plans for immigration quotas, which have also been the focus of much media coverage, were not \"racist\" - just \"common sense\".\n \n He pledged cleaner hospitals and better school discipline, with a promise to get rid of \"political correctness\" in the national curriculum and give everyone to the same chance of a \"decent\" state education as he had. \"I come from an ordinary family. If the teenage Michael Howard were applying to Cambridge today, Gordon Brown would love me.\"\n \n And he stressed his party's commitment to cut taxes and red tape and increase the basic state pension in line with earnings. He finished with a personal appeal to party activists to go out and win the next election. \"One day you will be able to tell your children and grandchildren as I will tell mine, 'I was there. I did my bit. I played my part. I helped to win that famous election - the election that transformed our country for the better'.\" Labour election co-ordinator Alan Milburn said: \"Michael Howard's speech today confirms what we have always said - that his only strategy is opportunism but he has no forward vision for the country. In reference to the appearance of Mr Howard's family on the conference stage with him, Mr Milburn said: \"Michael Howard is perfectly entitled to pose with his family today. \"But it is the hard working families across Britain that will be damaged by his plan to cut £35bn from public spending.\"\n", "llama3.2:1b": ["Here is a concise summary of the text:\n\nHoward responds to criticism that he has become an \"attack mongrel\" and calls Labour's tactics \"rattled\".", "He says he will do anything for office, including making comparisons with historical figures.", "Howard defends his record on key issues such as schools, taxes, immigration, and crime.", "He promises to improve healthcare and education if elected, and to cut taxes and red tape."], "llama3.2:3b": ["Michael Howard says Labour is \"rattled\" after being called an \"attack mongrel\", and accuses them of trying to cling on to office at all costs with any tactic.", "He denies playing politics with the case of Margaret Dixon, and defends his party's immigration quotas as \"common sense\".", "He also pledges cleaner hospitals, better school discipline, and increased basic state pension."], "gemma2:2b": ["Michael Howard criticized Peter Hain's claims that he was acting like an \"attack mongrel,\" and stated that Labour tactics were showing their desperation for re-election.", "Howard emphasized the popularity of Tory policies, citing school improvement, immigration reform, and his party's stance on taxes and pensions.", "He dismissed Labour's claims about using Margaret Dixon as a \"human shield\" and defended his plan for immigration quotas as common sense.", "Howard rallied his party to win the next election and pledged cleaner hospitals and better schools."], "qwen2.5:0.5b": ["Howard attacked Hain's claim about Labour's anti-terrorism measures and criticized them for being too aggressive, calling them \"rattled\" by opposition parties.", "He also accused Labour of playing politics rather than working towards a more moderate stance on immigration.", "In contrast to his own party's stance, Howard supported the UK's approach to education in general, while also promising to cut taxes and improve living standards in the future.", "He also pledged that he will stand for election next year and that his political opponents (including Labour) are not playing politics."], "qwen2.5:1.5b": ["Tory leader Michael Howard accuses Labour of being rattled over anti-terror tactics, while Environment Secretary Margaret Beckett denies Labour's reaction.", "Howard criticizes Hain for comparing him to Fagin and Shylock and calls on party activists to win the next election.", "He promises cleaner hospitals, better discipline in schools, and a promise for lower taxes without cutting services."], "qwen2.5:3b": ["Howard counters Labour's criticism of his party as acting like an \"attack mongrel\" at Tory spring conference in Brighton.", "He accuses Labour of trying to cling onto power at all costs, comparing them to Fagin and Shylock.", "Howard claims Tory policies on schools, taxes, immigration and crime are resonating with voters.", "He praises Margaret Dixon's case for media attention and denies using her as a \"human shield\".", "Regarding immigration quotas, he describes his party’s stance as \"common sense\" rather than racist.", "Howard pledges improved healthcare, better school discipline, removal of political correctness from curriculum, and increased state pension to cut taxes and reduce red tape.", "He appeals to activists to support winning the next election.", "Alan Milburn criticizes Howard's opportunistic strategy without a forward vision for the country."], "opencoder:1.5b": ["This summary maintains key points in the text: Howard's approach to mongrel jibe,Michael Howard's assertion against a radical attack mongrel, Labour's camaraderie towards Peter Hain's criticism of anti-terror legislation, and his support for climate change initiatives.", "It also highlights how he compared Tories with Fagin, Shylock and a flying pig, environmental Secretary Margaret Beckett's opposition to Mr Howard's comment, and how Mr Howard made himself heard from various angles on a national level."], "smollm:1.7b": ["The summary of this text should follow the same structure as the original text, preserving key ideas and details while omitting unnecessary information.", "The goal is to provide a concise and accurate summary of the main points in the original text."], "deepseek-r1:1.5b": ["Labour’s Michael Howard’s speech at the Brighton conference was marked by his bold campaign tactics, comparisons to other political figures, and a strong opposition from opponents like Peter Hain.", "Howard accused the Tory leader of behaving like an “attack mongrel” and claimed he’d compared them to Fagin, Shylock, and a flying pig, highlighting party division.", "Despite this, Labour’s policies on schools, taxes, immigration, and crime were seen as effective in winning voters.", "Howard also pledged to improve public services, reduce bureaucratic red tape, and increase the basic state pension.", "He criticized the national curriculum for “racism” and emphasized the importance of clean healthcare.", "His message was a mix of firmness and opportunism, but his plan had sparked party divisions, particularly with former Labour members like Alan Milburn, who dismissed his family’s role as offensive."], "tinyllama:1.1b": ["The text mentions how Howard hits back at mongrel JiBe's claims about Peter Hain acting like an \"attack mongrel\" and rating Labour's campaign tactics as \"rattled,\" saying that these accusations show the opposition party is being \"ratlled.\"", "The author also notes that Howard denies playing politics, playing a shield for Margaret DiXon, calling immigration quotas common sense, having plans to cut taxes and increase school discipline and red-tape, and vowing to increase the basic state pension in line with earnings.", "He finishes his speech by appealing to party activists to win the next election, promising to \"play my part\" and help transform the country for better."], "tinydolphin:1.1b": [" Summarized text: Michael Howard has criticised Labour for behaving like an \"attack mongrel\" and compared his party to Shylock.", "He also compared himself to a flying pig and said that people are feeling rattled due to the government's plans on schools, taxes, immigration, and crime.", "He mentioned some negative experiences with his mother as a part of his motivation for these comments."], "phi:2.7b": [" The text describes Howard's response to Hain's claim about Tory tactics being \"rattled,\" as well as his speech at the party conference.", "It also includes quotes from Beckett and Milburn, with their own opinions on the matter."], "orca-mini:3b": [" Michael Howard has hit back at claims by Labour's Peter Hain that he is acting like an \"attack mongrel\" by playing opposition for opposition sake and denying he has been using Margaret Dixon as a \"human shield\".", "In an upbeat speech to his party's spring conference in Brighton, Howard said Labour was rattled by the opposition's plans on education, taxes, immigration and crime.", "He pledged to clean hospitals and give every student the same chance of a decent state education as he had."], "hermes3:3b": ["Michael Howard reacts to Labour accusing him of acting like an 'attack mongrel' and denouncing their tactics, while stating Tory policies on schools, taxes, immigration and crime are resonating with voters."], "stablelm-zephyr:3b": ["Michael Howard criticized Peter Hain's remark that he was acting like an \"attack mongrel,\" showing that Labour is \"rattled\" by the opposition.", "Howard mentioned that Tory policies on schools, taxes, immigration, and crime were resonating with voters.", "He denied playing politics and outlined his party's plans for immigration quotas, cleaner hospitals, better school discipline, and cutting taxes and red tape.", "Labour election coordinator Alan Milburn commented that Howard had no forward vision for the country and criticized his plan to cut £35bn from public spending."], "chatgpt-4o-latest": ["Michael Howard dismissed Peter Hain's claim that he was acting like an \"attack mongrel,\" arguing that Labour was \"rattled\" by the Conservatives' growing influence.", "Speaking at the Tory spring conference, Howard criticized Labour's tactics and defended his party's stance on key issues like immigration, taxes, education, and crime.", "He denied playing politics with the case of Margaret Dixon and rejected claims that his immigration policies were racist.", "Howard pledged cleaner hospitals, better school discipline, and tax cuts, urging party activists to help win the next election.", "Labour's Alan Milburn dismissed Howard's speech as opportunistic and lacking vision, warning that Conservative spending cuts would harm working families."], "stablelm2:1.6b": ["Tory leader Michael Howard responds to Peter Hain's claim that Labour is \"rattled\" due to opposition tactics, stating that their campaigning tactics have proven the Tories are hitting home.", "Environment Secretary Margaret Beckett denies accusations of Labour being rattled, emphasizing a focus on Howard's record and avoiding political correctness in education.", "Howard claims Tory policies resonate with voters on issues such.."], "granite3.1-dense:2b": ["During his party's spring conference in Brighton, Michael Howard criticized Labour for their tactics and called them \"rattled\" following Labour's Leader of the Commons, Peter Hain's claim that Howard is acting as an \"attack mongrel\" during the anti-terror bill debate.", "Howard highlighted Tory policies on schools, taxes, immigration, and crime resonating with voters.", "He denied using Margaret Dixon as a \"human shield,\" emphasized his commitment to cutting taxes and increasing pensions, and promised better hospitals and school discipline.", "Howard's speech was met with Labour's Environment Secretary, Margaret Beckett, who denied rattledness, stating they focus on Howard's record and proposals.", "Labour election co-ordinator Alan Milburn criticized Howard's opportunistic strategy and the proposed £35bn public spending cuts' impact on hardworking families."]}